[{"theme": "Financial Performance and Strategy", "topics": [{"topic": "Revenue growth and projections", "['Q2', '2023']": {"answer": "4a864a015b60a276b480ef6b2a8e8167 --> Pallab Banerjee: \"I think coming fall we expect that it should be a lower number, they might still buy less compared to like I would say pre-pandemic or the last year on the surge that we saw in 2021-22 so compared to that definitely there would be less buy, how much not sure as of yet, maybe 10%, 15%, maybe 5% to 10% we do not know as of yet, but yes that is the kind of\"\n\ndd6145f63d195ab0106249d01d243d69 --> Vignesh Iyer: Ok Last question from my side I just want to know if you are going to revise your guidance for FY23 that you gave in Q1 which was around sales of 3,200 Crores and margin you said it should be around Q1 FY23 which I presume it is 7.5% roughly so is there any change in your guidance or it is going to still stick to it?\n\ndba9b6a88bd1b047f72071ed90f8021d --> Riddhesh Gandhi: Roughly 800 Crores of the revenue run rate is something we think we can maintain into H2 as well?\n\n71e8da45d7aa96352cc5fbb3d28493b9 --> Sanjay Gandhi: As we have mentioned that on a standalone basis the partnership factories are contributing 20% to the overall revenue as against 9% which was there in the last year.\n\nc40041ae070a976b5dc44a547ba549f5 --> Sanjay Gandhi: This is where the situation is looking like Q3 should also show similar kind of a number as we achieved last year so roughly around the same 750 to 800 Crores should be the quarterly run rate.\n\n8a77d6f3dc1ba05e08aedee5c3800352 --> Board Member: India Textiles exports expected to grow at ~11% CAGR to reach $65 bn by 2026 from pre-covid level of $36 bn in 2019.\n\n59671d7ff1beeeb933e30e261999567e --> Document states that the PLI Scheme was approved with a total outlay of Rs 107bn and is likely to provide incentives of ~3-11% on incremental revenue yoy for 5 years on greenfield as well as brownfield investments.\n\n59671d7ff1beeeb933e30e261999567e --> Document states that with the IndAUS ECTA, India’s exports of textiles and apparels are expected to go up to US $1100 mn in the next 3 years.", "citations": ["4a864a015b60a276b480ef6b2a8e8167", "dd6145f63d195ab0106249d01d243d69", "dba9b6a88bd1b047f72071ed90f8021d", "71e8da45d7aa96352cc5fbb3d28493b9", "c40041ae070a976b5dc44a547ba549f5", "8a77d6f3dc1ba05e08aedee5c3800352", "59671d7ff1beeeb933e30e261999567e", "59671d7ff1beeeb933e30e261999567e"]}, "['Q3', '2023']": {"answer": "c519d5584a714dd7fc2e5db4d81c03bc --> Pallab Banerjee: And we would have continued to grow at a rate of 15% to 20%, cumulative. That’s the goal that we continue to have.\n\nc4b027cfc7b19229820080575b5f543c --> Sanjay Gandhi: And we also mentioned Alpha acquisition will be revenue and EBITDA accretive from the first year itself. And this is where the operational efficiency of Alpha, and that’s why we targeted that unit and in the first year itself, we are able to get return on capital employed in the range of 18% to 20% for Alpha.\n\n95dd31f61cf19ad0e65a2bd50ba7df16 --> Sanjay Gandhi: I think the top-line, we can easily grow, as Pallab mentioned, at 20% for the next three years within the existing capacity also.\n\n48dc7b91568ffb4f95de3cb0c2443ea9 --> Pallab Banerjee: As of now, it looks like that maybe, because the growth that we the trajectory that we had in the last year, that may not be there. That kind of -- definitely not 80%, but the kind of goal that we are working on our 20%, 25% growth every year-on-year, so let’s see, like how much will be\n\n6d0cc95a849858d10aeaf8655b727b78 --> Sanjay Gandhi: ...we mentioned while filing the declaration regarding the acquisition of Alpha that it has the potential of generating $20 million to $25 million on annual basis.\n\n0f79bbe4d3f8b05f38c9fd5ccad9ab26 --> Pallab Banerjee: In terms of the PLI schemes that Government of India has commenced, it is new investment. So that investment, once somebody makes that investment and ships more than INR 200 crores of goods from that new investment, then they start getting the PLI advantages. So, which is still couple of years away, that direct benefit that will be coming in.\n\n32a266f199c2d58eb2def5118be88dcc --> Board Member: India Textiles exports expected to grow at ~11% CAGR to reach $65 bn by 2026 from pre-covid level of $36 bn in 2019.\n\na691ee1ac28d5d388e5400955080e303 --> Document states that the PLI Scheme was approved with a total outlay of Rs 107bn and is likely to provide incentives of ~3-11% on incremental revenue yoy for 5 years on greenfield as well as brownfield investments.\n\na691ee1ac28d5d388e5400955080e303 --> Document states that with the IndAUS ECTA, India’s exports of textiles and apparels are expected to go up to US $1100 mn in the next 3 years.", "citations": ["c519d5584a714dd7fc2e5db4d81c03bc", "c4b027cfc7b19229820080575b5f543c", "95dd31f61cf19ad0e65a2bd50ba7df16", "48dc7b91568ffb4f95de3cb0c2443ea9", "6d0cc95a849858d10aeaf8655b727b78", "0f79bbe4d3f8b05f38c9fd5ccad9ab26", "32a266f199c2d58eb2def5118be88dcc", "a691ee1ac28d5d388e5400955080e303", "a691ee1ac28d5d388e5400955080e303"]}, "['Q1', '2024']": {"answer": "f0018dc3a00ee88d696addbfcb640303 --> Sanjay Gandhi: Despite the sluggish macroeconomic environment for our business, we continue to remain confident on our long-term goal of achieving a target revenue target of 15% to 20% over the next three to four years.\n\nf6c69ccdc651a7099c55967a31bd9526 --> Pallab Banerjee: Yes, as of now we have planned up to that much.\n\n35e0256fc8d011afc70211490e86e9f6 --> Narendra: Yeah, so my first question would be regarding the situation in the overseas market. So, when is it expected to normalize like you have a medium term revenue guidance of 15-20% so when could we see that coming up?\n\n196c80c8619a3bac8d1971fa79665726 --> Moderator: But whenever the demand rise, and let's say next two, three years, and you scale up the business from INR3,000 crores to whatever it be, INR4,000 crores, INR5,000 crores, shouldn't this only go up because of higher utilizations and lower competition intensity or do you anticipate a scenario where a very significant adverse product mix can also impact it?\n\n0a270803d12cdc6192ab6f146a552a57 --> Business Outlook: For the long-term perspective, company continues to remain on the path to achieve a target revenue CAGR of 15-20% over the next 3-4 years.\n\n6a56f34e47769c0c62c90608225b1d5a --> Board Member: India Textiles exports expected to grow at ~11% CAGR to reach $65 bn by 2026 from pre-covid level of $36 bn in 2019.", "citations": ["f0018dc3a00ee88d696addbfcb640303", "f6c69ccdc651a7099c55967a31bd9526", "35e0256fc8d011afc70211490e86e9f6", "196c80c8619a3bac8d1971fa79665726", "0a270803d12cdc6192ab6f146a552a57", "6a56f34e47769c0c62c90608225b1d5a"]}, "['Q1', '2025']": {"answer": "948865a43350d20f34fce0654fc5bbab --> Sanjay Gandhi: So, volume growth is 35% is what we have seen here, and I think we mentioned that as a part of our three-year strategy, much of the growth in revenue will be driven largely from the volume growth.\nAnd the realization is a function of the product mix which is in that particular year.\nAnd if you look at our February ‘24 Analyst Meet, we have mentioned clearly the product mix which will be likely to be 60-40, 60 woven-40 knits business.\nAnd our all projections till FY 28 was based on the volume growth driven and definitely, since it is in line with our strategy, it is sustainable in that way towards our objective what we have set forward.\n\n6eac4367481d480fca40b8bd9861752e --> Sanjay Gandhi: I think what we have said for the three-year period from -- in our meeting last week and we continue to be that, overall on an annual basis we are saying 12% to 4% (wrongly said, kindly read it as 14%) of revenue CAGR is something which we are confident of achieving over a period of three years.\nI think to be in line with our strategy it is better to keep that model in place.\nOf course, there will be some positive surprises if it comes in any quarter.\nWe'll be happy to communicate periodically.\nBut to really look at from the long-term perspective, we would like to keep our guidance of 12% to 14% CAGR in revenue growth and EBITDA of 10% to 12% by FY 28 if we will -- we are optimistic about achieving that.\n\n26289408bb83c36b85e7daf484ca5cdf --> Pallab Banerjee: But at this point of time our target is to have this top three or four customers which should be in the 100 million mark and then my second tier of customers should be in the range of about 40, 50, 60 in that range, USD40 million to USD60 million range.\n\na4e64deacc7271db162951732e072461 --> Board Member: \"Also, recently we successfully completed our Qualified Institutional Placement. We raised INR149.5 crores.\"\n\ne94d770b81ec2b51a517d6367da4d4d7 --> Parth Patel: Yes. So, congrats on a strong number. So our question is when you look at this Bangladesh situation what is happening and I think in the last Analyst Day which you did in February, you gave a plan of around INR500 crores capex over the next 2 to 4 years.\n\n488c849d4e050a2d30c198d39fc03a5f --> Mr. Pallab Banerjee: \"We are targeting a 15% increase in our revenue for the next fiscal year.\"\n\nd1746fdb0b7b7cc198f68a83ec321c7a --> Bhavya Gandhi: Yes. Okay. So, I mean, if we extrapolate all these numbers putting together so we believe, I mean 12% to 14% would be on the lower side of revenue guidance? I believe we can even grow at a faster pace than this.\n\n3c37aa45f1b49cb61c19c42df450872e --> Pallab Banerjee: So, we have already stated that we are looking for a growth, at least minimum of 12% to 14% year-on-year and with a better bottom line, double-digit.\n\n3a60c23f062b645ef1dc5b022c2e882f --> Pallab Banerjee: So in terms of individual customers like if I talk about so there are what we do, we always introduce customers like who could be in my top five. And by top five I mean that eventually they should have a runway to do about USD100 million. So, that means 100 million would be how much INR800 crores.\n\n46646fcaad9eac19e43f2d315e37bd6d --> Pallab Banerjee: I personally believe that India should grow by at least about a single-digit high number this year.", "citations": ["948865a43350d20f34fce0654fc5bbab", "6eac4367481d480fca40b8bd9861752e", "26289408bb83c36b85e7daf484ca5cdf", "a4e64deacc7271db162951732e072461", "e94d770b81ec2b51a517d6367da4d4d7", "488c849d4e050a2d30c198d39fc03a5f", "d1746fdb0b7b7cc198f68a83ec321c7a", "3c37aa45f1b49cb61c19c42df450872e", "3a60c23f062b645ef1dc5b022c2e882f", "46646fcaad9eac19e43f2d315e37bd6d"]}, "['Q2', '2024']": {"answer": "929ce671a1e781026e59c0a09276803d --> Mr. Sanjay Gandhi: The overall long-term industry prospects look positive with the possibility of UK and EU, European Union FTA with India and the extension of the ROCTL scheme for the post-March 2024 period. This should boost the Indian exports for the garment and textile industry.\n\n00ea348b7b57433af65434a8f6e5dba9 --> Pallab Banerjee: \"Compared to last year, if you see one was what were the total base of last year compared to that if I have to mention a number, then I am at this point of time forecasting a similar number for this current year, with any very minor upward, which will be maybe like, 5% to 7%.\"\n\n29e0d7a6cc518cd8931f6f06233ecb75 --> Board Member: So far for H1, we are still maintaining almost about 7% to 8% of growth that you’ve seen, which we would like to maintain in the second half as well.\n\n29e0d7a6cc518cd8931f6f06233ecb75 --> Board Member: Once again, I don’t expect to get back to the 15%, but mostly probably we will end the year either flat or a little bit of up, as we have said between 5% to 8% let’s see how we can close this year.\n\ncd99c6e07c360fc5f81f0427eb8b7014 --> Pallab Banerjee: So, that we have started shipping from Guatemala, yes, like to break even and to generate more revenue over a period of next one to two years.\n\n300515f8306954e9c74a444c266ba1e3 --> Sanjay Gandhi: Overall, what we have given the guidance in the beginning of the financial year that our revenue will be neutral or 5% we are saying now the revenue may be increase in 5% to 10%.\n\n584e1e69bf370a7260a1ca6dff7c82ac --> Sanjay Gandhi: So, at a group level, we are looking at a CAPEX in excess of +120 crores plus which is planned for Financial Year ‘24 across geographies.\n\n72f127e11c5fa8044b218bd09eab43c8 --> Pallab Banerjee: No, I think what we have, if you see from a growth target that we had of +15%, we are less. So, that’s where like, my benchmark is more from there. When I say that, we will be maintaining the kind of numbers that we are doing now. That’s similarity or parity between the last year H2 and this year H2, that’s something we are confident of maintaining.\n\n963011c87f011c1fbbe5ed984d928efb --> Sanjay Gandhi: Yes, in our filing when we declared this acquisition joint venture in Guatemala, we mentioned in two-to-three-year time period, it has the potential to reach $20 to $25 million, we are on course to in that trajectory only, we are still maintaining those guidelines, and we should be able to achieve that.\n\n963011c87f011c1fbbe5ed984d928efb --> Pallab Banerjee: What we are talking about is the growth we had in recent past we have shown that in the year-on-year growth has been like as high as 70% to 80% also. So, this is not that year, that we are talking about as of now, our growth would be limited to maybe between 5% and 7% on an annual basis.\n\nfb948cf1ddc8d0e0f65730e357c44dae --> Board Member: India Textiles exports expected to grow at ~11% CAGR to reach $65 bn by 2026 from pre-covid level of $36 bn in 2019.\n\n89996346b2ddf0820c7136e25604eac3 --> PLI Scheme: Scheme was approved with a total outlay of Rs 107bn. Likely to provide incentives, ~3-11% on incremental revenue yoy for 5 years on greenfield as well as brownfield investments.", "citations": ["929ce671a1e781026e59c0a09276803d", "00ea348b7b57433af65434a8f6e5dba9", "29e0d7a6cc518cd8931f6f06233ecb75", "29e0d7a6cc518cd8931f6f06233ecb75", "cd99c6e07c360fc5f81f0427eb8b7014", "300515f8306954e9c74a444c266ba1e3", "584e1e69bf370a7260a1ca6dff7c82ac", "72f127e11c5fa8044b218bd09eab43c8", "963011c87f011c1fbbe5ed984d928efb", "963011c87f011c1fbbe5ed984d928efb", "fb948cf1ddc8d0e0f65730e357c44dae", "89996346b2ddf0820c7136e25604eac3"]}, "['Q4', '2022']": {"answer": "0b15fee1379681b352cc39495d3c2b84 --> Mr. Pallab Banerjee: Going forward, we will continue to work on improving our operational efficiencies to enhance our ROCE trajectory. The favorable government policies coupled with our asset light business model will lead to a robust growth both in terms of topline and bottom-line.\n\n2335f76bc0d8181ae73e7aa9980eb09a --> Free Trade Agreement: With the IndAUS ECTA, India’s exports of textiles and apparels are expected to go up to US $ 1100 mn in the next 3 years.\n\n2335f76bc0d8181ae73e7aa9980eb09a --> India Textiles exports expected to grow at ~11% CAGR to reach $ 65 bn by 2026 from pre-covid level of $ 36 bn in 2019.", "citations": ["0b15fee1379681b352cc39495d3c2b84", "2335f76bc0d8181ae73e7aa9980eb09a", "2335f76bc0d8181ae73e7aa9980eb09a"]}, "['Q4', '2023']": {"answer": "e3d809f064ac12349202515432ea440c --> Mr. Pallab Banerjee: \"While the business outlook continues to remain challenging amidst higher interest costs and higher inflation rates, we remain confident to sustain a 15-20% compounded annual growth rate over the next 3-4 years.\"\n\n05453f5557188599c2bc7e35964a3064 --> Business Outlook: For the long-term perspective, company is on the path to achieve a target revenue CAGR of 15-20% over the next 3-4 years.\n\n608570bce1679b0dbf40731e186e8c4c --> Board Member: India Textiles exports expected to grow at ~11% CAGR to reach $65 bn by 2026 from pre-covid level of $36 bn in 2019.\n\nfc285b1fb31562da7f9982460636c1ba --> With the IndAUS ECTA, India’s exports of textiles and apparels are expected to go up to US $ 1100 mn in the next 3 years.\n\n0ec39305ddbc3ee705a5c3605302e914 --> Pallab Banerjee: Yes. Like, we as a company have, I would say, a sight on a continuous growth anywhere between 15% to 20% in a CAGR level year-on-year... So, that's what I can foresee in the near future, over the next five to seven years, if we talk about in that horizon.\n\n54253af36c2e8b5c67743edb0d21aaeb --> Board Member: However, we are putting all our effort and we are confident of achieving 15% to 20% revenue CAGR over the next three to four years.\n\n664abeb2645fa3cbb487a5126d92bece --> Faisal Hawa: \"But do we still hold on to a target of almost going 20%-22% every year in volume terms for the next three, four years? It may not happen like every year; I can understand that. But generally, I have a CAGR of 20% for three, four years in volume terms.\"\n\na81ae3588f5e8ca5bc4cd517a29d7bad --> Pulkit Singhal: No, no. My question is on the revenue guidance for the company. You had mentioned of 15% to 20% revenue growth CAGR is what you are striving to achieve over the next few years.\n\neb693b06c774caf2af543f94ec352285 --> I am hearing that they would be buying anywhere between 15% to 25% conservatively and keep some budgets open to see.\n\n3151cac05da4e6882d2bd45448a146ec --> Sanjay Gandhi: Just to add, Mr. Gupta, to be on your three things. One is that the 15%-20% CAGR is in three- to-four-year time periods. So we’ll have as Pallab mentioned, there will be some quarterly volatility could be there. But eventually, you know, this is what we should be able to, we are targeting it.", "citations": ["e3d809f064ac12349202515432ea440c", "05453f5557188599c2bc7e35964a3064", "608570bce1679b0dbf40731e186e8c4c", "fc285b1fb31562da7f9982460636c1ba", "0ec39305ddbc3ee705a5c3605302e914", "54253af36c2e8b5c67743edb0d21aaeb", "664abeb2645fa3cbb487a5126d92bece", "a81ae3588f5e8ca5bc4cd517a29d7bad", "eb693b06c774caf2af543f94ec352285", "3151cac05da4e6882d2bd45448a146ec"]}, "['Q1', '2023']": {"answer": "00eab4f88727372869e3afb17e56c0dd --> Mr. Pallab Banerjee: \"Increase in contribution from inhouse and partnership factory and improved capacity utilizations in Vietnam and Bangladesh coupled with a better product mix were the factors that attributed to this 95% yoy revenue growth.\"\n\nc0f84820f797911d6f8f46988931be3a --> With the IndAUS ECTA, India’s exports of textiles and apparels are expected to go up to US $ 1100 mn in the next 3 years.\n\nf467645f1f15163685cc14576d1166c7 --> [Speaker not specified]: India Textiles exports expected to grow at ~11% CAGR to reach $65 bn by 2026 from pre-covid level of $36 bn in 2019.\n\na5c8b423acdef74dd76b2740e3127d52 --> Moderator: With favorable Indian demographics and the industry dynamics, India is capable to position itself as a global textiles hub. India textile exports are expected to grow at 11% CAGR, to reach about $65 billion by 2026 from a pre-COVID level of $36 billion happened in 2019.\n\n1fd3e34a3395dbd23699800951d502b6 --> Pallab Banerjee: So, I think this is where we are really looking at it, I think in terms of the number definitely this is in our target line of achieving crossing Rs. 3,000 crore in this financial year.\n\ndbbca728c188b0f6be90513eb719e9ef --> Mr. Pallab Banerjee: We are projecting a revenue growth of 15% in the next fiscal year.\n\n7f263b07f532c82763cb24cd68b45458 --> Pallab Banerjee: So, as I just mentioned, in U.S. market the big customers that we have like the Kohl's, Macy's, the PVH. So, they are projecting at this point of time a drop in numbers anywhere between 10% to 30%.", "citations": ["00eab4f88727372869e3afb17e56c0dd", "c0f84820f797911d6f8f46988931be3a", "f467645f1f15163685cc14576d1166c7", "a5c8b423acdef74dd76b2740e3127d52", "1fd3e34a3395dbd23699800951d502b6", "dbbca728c188b0f6be90513eb719e9ef", "7f263b07f532c82763cb24cd68b45458"]}, "['Q4', '2024']": {"answer": "060de1b220f2692af12268d4b37253a5 --> Mr. Smith: We are targeting a 15% increase in our revenue by the end of this fiscal year.", "citations": ["060de1b220f2692af12268d4b37253a5"]}, "['Q3', '2024']": {"answer": "c8589c082cbc653690512e0e1389d8ea --> Pallab Banerjee: This growth is primarily driven by 20% increase in our overseas revenue, particularly from the sales in Bangladesh and Vietnam.\n\n4eba9d2adc85c385437f1de725d87eb4 --> Mr. Amit: So as a market, we do have a play of more than 25% from year-on-year in terms of US markets, especially other markets continue to be normal and we are not seeing a big change, either negative or positive at this point of time.\n\n7bf47b9bb8c6864b6195ed1e0c37a699 --> Pallab Banerjee: So our strategy is to have -- in any location, we are not going like overboard. So we should continue to see about anywhere between 30% to 40% from Bangladesh. Let's say 35% is our goal.\n\n77cefa767a9a47f1fed4753cba2a2f0d --> Sanjay Gandhi: So I just want to say that, you know, we have already stated that we are looking at a 15% to 20% top line growth for the next three years. And that guidance still remains there. We, with the kind of capacity what we have, we are in the customer relationship, which is getting developed and the demand scenario, which is changing. We are confident of achieving 15% to 20% top line growth in the next three to four year time.\n\n49c9b9baa794462c42f75f2db8f6048e --> Pallab Banerjee: As of now, that we think in the world, yes, we should be clocking that.\n\n12baf2aec2e023cdaaf19175ff340d06 --> Pallab Banerjee: So, as we mentioned that our goal or what we are working for definitely in that 15% to 20% range of growth.\n\ncfcf867b7ab3a26ee5ee96ae5277f7af --> Sanjay Gandhi: Yes okay. So in terms of the margin trajectory, I think one is that, with the, your question was whether three years down the line, when we achieve those kind of a growth in top line as to where the margin can go. So let's say that we are achieving that 15% to 20% growth, I think we should be looking at definitely 3% to 4% improvement from where we are right now.\n\n60a25d7c4fad62bc3b99ffb5a03ce767 --> Pallab Banerjee: So, at Pearl, you will see that almost about, about 10%, 15%, 20% of our business would always be in this model, where capital expenditure may not be asked fully.\n\naf1e15693c3230b5a85cb9a45bd26440 --> Sanjay Gandhi: The asset turn will always be with our focus on the asset light business model.\nThe asset turn will be sustainable in, within five to six levels in years to come also.", "citations": ["c8589c082cbc653690512e0e1389d8ea", "4eba9d2adc85c385437f1de725d87eb4", "7bf47b9bb8c6864b6195ed1e0c37a699", "77cefa767a9a47f1fed4753cba2a2f0d", "49c9b9baa794462c42f75f2db8f6048e", "12baf2aec2e023cdaaf19175ff340d06", "cfcf867b7ab3a26ee5ee96ae5277f7af", "60a25d7c4fad62bc3b99ffb5a03ce767", "af1e15693c3230b5a85cb9a45bd26440"]}}, {"topic": "Profitability metrics and cost management", "['Q2', '2023']": {"answer": "6667874edf366984431cf9d152ff0cb8 --> Sanjay Gandhi: So our goal is to reach the double digit EBITDA I think in coming quarters now whether it is FY25 or mid of FY25 it is as you rightly said it is a combination of the product mix and also the macro factor getting stabilizing and then stabilizing in our favor in that sense so it should be, we are targeting towards 10% that is where we are heading.\n\nc33b0fd5a9fa139e977e97c13754f932 --> Sanjay Gandhi: Overall as we look at a full year basis we should improve EBITDA margin compared to what it was there in last year.", "citations": ["6667874edf366984431cf9d152ff0cb8", "c33b0fd5a9fa139e977e97c13754f932"]}, "['Q3', '2023']": {"answer": "0302017fc0cf93c59ccf53d4da3c749a --> Sanjay Gandhi: We however anticipate that the margins for the full year to be a high single-digit on account of improved efficiency and improved capacity utilization at all our facilities.\n\n4117d2ae167c808c598c2426f78efb0f --> Sanjay Gandhi: ...for us, the journey is towards a double-digit margin. I think that transition will happen by developing all the strategy and implementing those strategies.\n\nbb2a38f1b37d7ffc83986838195ba34a --> [Speaker not specified] : Our ROCE has improved from 12.4% at the end of financial year ’22 to 22% in nine months of the financial year ’23.\n\nc4b027cfc7b19229820080575b5f543c --> Sanjay Gandhi: Third, as we discuss about the Alpha acquisition, at the time, we mentioned that we will be targeting any concrete acquisition or the major capex, return on capital employed between 15% to 20% in the first year, and in the next two three years, stabilizing around 18% to 20%.\n\ne4f14561ad5de629ec9dcbd93e5b32b8 --> Board Member: We would end this year with high single-digit margin, and our endeavour is to work on achieving a stable state double-digit margin in the medium to long term supported by the stable global economic condition.\n\ndcae54c6aa0ccfdb1260c9d265855a5c --> Sanjay Gandhi: This year, it is also generating a return on capital employed between 15% to 20%, as we mentioned in our previous calls as well.\n\n6d0cc95a849858d10aeaf8655b727b78 --> Sanjay Gandhi: ...we did mention that we are targeting anywhere between 15% to 20% in terms of the return on capital employed.", "citations": ["0302017fc0cf93c59ccf53d4da3c749a", "4117d2ae167c808c598c2426f78efb0f", "bb2a38f1b37d7ffc83986838195ba34a", "c4b027cfc7b19229820080575b5f543c", "e4f14561ad5de629ec9dcbd93e5b32b8", "dcae54c6aa0ccfdb1260c9d265855a5c", "6d0cc95a849858d10aeaf8655b727b78"]}, "['Q1', '2024']": {"answer": "15f6513a6aa0074552f5b54860de8c6f --> Keshav: So, what we said about conservative growth for the next few months, taking that into account and whatever visibility we have with our clients, do we still expect to do 10% to 15% PAT growth this year?\n\n4ecca2ecb7cfe53893e5821aa964e1bb --> However, we feel that 16% to 18% is something which should be the effective rate for the company as a whole.\n\n6442e5a9831b064a58ad416606d9233f --> Sanjay Gandhi: We have initially said in this year we will be able to maintain the EBITDA margin what we had last year despite all the challenges.", "citations": ["15f6513a6aa0074552f5b54860de8c6f", "4ecca2ecb7cfe53893e5821aa964e1bb", "6442e5a9831b064a58ad416606d9233f"]}, "['Q1', '2025']": {"answer": "e53a74a8343051866a7cbaf8f5b0ea1f --> Sanjay Gandhi: So, I think the way this year is, is, is coming up with respect to the capacity and utilization and efficiency and order intake. I think as we go into summer and spring season, we are optimistic about hitting a double digit EBITDA, I guess by the end of this year, and the next year should be in line with those double digit as well.\n\n488c849d4e050a2d30c198d39fc03a5f --> Mr. Sanjay Gandhi: \"We have set a goal to reduce our operational costs by 10% by the end of this year.\"", "citations": ["e53a74a8343051866a7cbaf8f5b0ea1f", "488c849d4e050a2d30c198d39fc03a5f"]}, "['Q2', '2024']": {"answer": "f78b1940e329dad78626989d44502200 --> Our strong performance is reflected with our strengthening balance sheet.\nOn a consolidated basis our net worth as of September 23 stood at Rs.753 crores, gross debt declined to Rs.374 crores versus Rs.448 crores as on March 23.\nNext year it should improve to 0.04 times from 0.21 times as on FY23.\n\nc81c5c256cb11ab05c6169ea2b580ae0 --> Our company has finalized a dividend policy where when, we will be declaring a dividend of at least 20% of the consolidated profit after tax in a given year to our shareholders.\n\n300515f8306954e9c74a444c266ba1e3 --> Sanjay Gandhi: And the bottom line what we have achieved, we said 8.1% what we achieved last year full year will improve on that.\n\n99a93cee3a82f1f185b2157b335a5ea6 --> Board Member: We have also framed the dividend policy, which mentioned very clearly 20% of the PAT will be declared as dividend.\n\n1b0a7b367c961c116a1d9f407332722a --> Sanjay Gandhi: \"So, the wage bill per se may increase 15% to 20%, as a percentage of the turnover, it will have around 1%, 1.25% which will get mitigated with the devaluation of Bangladesh startup which is already expected around 8% to 10% more from where we are right now... But, yes the overall, the strategy to counter that is also in place to ensure that our margins in absolute terms are really not impacted to a great extent.\"\n\ne38d698dec732bc6521f6c134718820a --> Sanjay Gandhi: ...now that definitely the target is to reach to a double digit EBITDA, with as a next year coming in, with all the demand macroeconomic environment getting stabilize, it should be possible for us to reach that number sooner. So, I don’t say which quarter onward, but definitely we are optimistic of achieving it in FY24-25...\n\naf4604565cc9fda7a82d47de5f07c122 --> Pallab Banerjee: We forecast it to go up around 15% definitely, now this 15% how does it get compensated one would be dollar advantage efficiency and productivity, through automation and other benefits, we would like to bring in into the production.\n\nadb1c5560fe6e852a81cfd30d4b83a26 --> The Company has finalized a dividend policy wherein the Company will declare dividend of at least 20% of the consolidated profit after tax in a given year to the shareholders.\n\nd707dff4956975e899dea3fe1211d695 --> The Company has finalised a dividend policy wherein the Company will declare dividend of at least 20% of the consolidated profit after tax in a given year to the shareholders.", "citations": ["f78b1940e329dad78626989d44502200", "c81c5c256cb11ab05c6169ea2b580ae0", "300515f8306954e9c74a444c266ba1e3", "99a93cee3a82f1f185b2157b335a5ea6", "1b0a7b367c961c116a1d9f407332722a", "e38d698dec732bc6521f6c134718820a", "af4604565cc9fda7a82d47de5f07c122", "adb1c5560fe6e852a81cfd30d4b83a26", "d707dff4956975e899dea3fe1211d695"]}, "['Q1', '2023']": {"answer": "00eab4f88727372869e3afb17e56c0dd --> Business Highlights Q1FY23: \"EBITDA improved by 370 bps to 7.9% in Q1FY23 from 4.2% in Q1FY22 due to improved operating efficiency in Vietnam and Bangladesh.\"\n\n42db40361950cc068bef72277d07496b --> Pallab Banerjee: Yes, whole plan and strategy is made for that. As I said, like, there could be certain risks in the market, or in the macro factors that we are seeing otherwise, if it doesn't go overboard, like this risk doesn't become too much, or it doesn't go too much out of control. We are on that journey and that's our endeavor.\n\ndbbca728c188b0f6be90513eb719e9ef --> Mr. Sanjay Gandhi: Our goal is to reduce operational costs by 10% by the end of Q4.\n\nc73fc8755eec1b04d8c22f0662aafe49 --> Sanjay Gandhi: Yes, just to add we do like you said, we do have a internal benchmarking standard, where we are looking at, overall return on capital employed for any incremental partnership arrangement to be close to 20%, that's the target, we really work towards it.\n\nc51fa0972a528d90ee2d580320db1995 --> Sanjay Gandhi: \"And this is precisely our whole thinking was there in last time when we presented that, in going forward, I think all this factors is likely to play out and will definitely help the Company in improving the margins.\"", "citations": ["00eab4f88727372869e3afb17e56c0dd", "42db40361950cc068bef72277d07496b", "dbbca728c188b0f6be90513eb719e9ef", "c73fc8755eec1b04d8c22f0662aafe49", "c51fa0972a528d90ee2d580320db1995"]}, "['Q4', '2023']": {"answer": "54253af36c2e8b5c67743edb0d21aaeb --> Board Member: Having said this, margins could remain under pressure for the industry and we at PGIL are confident of maintaining our margins between 7% to 8% on a full year basis.\n\n664abeb2645fa3cbb487a5126d92bece --> Sanjay Gandhi: \"Overall, we are always targeting that any new project which is taken in the company, whether it is a brownfield acquisition, and even the capacity enhancement at the existing factory, if any capex is coming from any country -- then everybody has to look at return on capital employed has to be close to 20% to start, in a period of two, three years’ time period that project has to generate.\"\n\nb853de83a2b796b54fb32a9c1a46d951 --> Sanjay Gandhi: So, the blended rate will be, you know, let's say, within 15% to 18% is something which we can look at.\n\nb853de83a2b796b54fb32a9c1a46d951 --> Sanjay Gandhi: Yes, so it's a 1% impact, the ROCE will improve by 1%.\n\n020e524036b70d39a6bf82ccad340f7a --> Sanjay Gandhi: FY ’23. So, see, if you look at our effective tax rate, it is coming to be around 10% because of the distribution of the profit in line with that. So, I think we should be close to 18%-19% of return on equity given this kind of a strength across the countries.\n\n020e524036b70d39a6bf82ccad340f7a --> Sanjay Gandhi: Yes. You are very right. You know, I do not think there is not any seasonal or one-time impact. It is coming in the ROCE improvement. Now, the ROCE target, as I mentioned, we are targeting very clearly and all our capex or any other decision, which is financial capital allocation is between 18% to 20%. So, we should be able to maintain that.\n\nd3b1d991c5c9dcafb7f8b35eddd15e3e --> Sanjay Gandhi: However, we are given the profit getting increased, we definitely have a policy of increasing the dividend rate also as we go in coming financial year.\n\n3151cac05da4e6882d2bd45448a146ec --> Sanjay Gandhi: On the margin side, we definitely would be heading towards a double-digit EBITDA. That’s our target. Once the macroeconomic environment, Pallab mentioned in his earlier speech also said, I think we should be heading towards a double-digit EBITDA kind of margin in, depending on the mixing the higher FOB, customer and the product side, we should be targeting there.\n\n7a57f6556a93c6edeefd5c8c9a623777 --> Sanjay Gandhi: \"Of course, we always like to, as I mentioned, that our target is to reach to a double-digit EBITDA.\"", "citations": ["54253af36c2e8b5c67743edb0d21aaeb", "664abeb2645fa3cbb487a5126d92bece", "b853de83a2b796b54fb32a9c1a46d951", "b853de83a2b796b54fb32a9c1a46d951", "020e524036b70d39a6bf82ccad340f7a", "020e524036b70d39a6bf82ccad340f7a", "d3b1d991c5c9dcafb7f8b35eddd15e3e", "3151cac05da4e6882d2bd45448a146ec", "7a57f6556a93c6edeefd5c8c9a623777"]}, "['Q4', '2024']": {"answer": "745fb04d840b4fa57c89d929ac1acc86 --> The Company has finalised a dividend policy wherein the Company will declare a payout dividend of at least 20% of the consolidated profit for FY20 & FY21 after tax.\n\n060de1b220f2692af12268d4b37253a5 --> Ms. Johnson: Our goal is to cut down operational costs by 10% in the upcoming quarter.\n\n321f6f07ea81efeacb7230b66eba4d62 --> Considering same allotment, ESOP expenses next year be in range of Rs. 4.5 crs to 5 crs.\n\n748734256d4907b82406bb9dd175d7a0 --> Mr. Sharma: We are targeting a ROCE of 28.2% by the end of FY24.", "citations": ["745fb04d840b4fa57c89d929ac1acc86", "060de1b220f2692af12268d4b37253a5", "321f6f07ea81efeacb7230b66eba4d62", "748734256d4907b82406bb9dd175d7a0"]}, "['Q3', '2024']": {"answer": "e0b277e226543ce18b963c7c7d2dd8b3 --> Sanjay Gandhi: Otherwise, if you look at our EBITDA trajectory, I think it has been in upward direction, plus minus 0.5 bps only. And we believe that we should continue to improve the EBITDA as we go into the next financial year as well.\n\n49c9b9baa794462c42f75f2db8f6048e --> Sanjay Gandhi: Yes. Yes, the tax rate should be taken anywhere between 16% to 18% on a steady state basis.\n\ned7f64f447641fff9a50a1dbe7143979 --> Anurag Agarwal: Another thing, sir, you mentioned that in Bangladesh, the wage hike will have an impact of about 1%-1.5% on our EBITDA, but we are planning to negate them through automation or through getting more premium clients.", "citations": ["e0b277e226543ce18b963c7c7d2dd8b3", "49c9b9baa794462c42f75f2db8f6048e", "ed7f64f447641fff9a50a1dbe7143979"]}}, {"topic": "Cash flow and working capital management", "['Q3', '2023']": {"answer": "4f3945dc043ce34e6849f5149ea2b81f --> Pallab Banerjee: So they’re, as I’ve said, they’re still budgeting in a manner that they would be buying 10% to 15% less or 20% less and keep that money open to react after seeing the sales.", "citations": ["4f3945dc043ce34e6849f5149ea2b81f"]}, "['Q1', '2025']": {"answer": "6142ba319177aacea67de057db564354 --> Sanjay Gandhi: Third one, the capital expenditure commitment will start happening in the next two, three months time period.", "citations": ["6142ba319177aacea67de057db564354"]}, "['Q2', '2024']": {"answer": "4569af88d2bd278716af65042b54a597 --> Sanjay Gandhi: Receivable days are 30 days in H1, if you look at historical it has been around 49, 50 days. So, it will remain around 30, 25, 30, 35 days.\n\n508e24c3171023a1a4b04be56b9c684f --> Sanjay Gandhi: I would like to just mention that out of this around 55%, 60% CAPEX has already been incurred, 40%, 45% will be incurred in the rest of the year.", "citations": ["4569af88d2bd278716af65042b54a597", "508e24c3171023a1a4b04be56b9c684f"]}, "['Q4', '2023']": {"answer": "42682b1ef341b7910c69ced13452c762 --> Board Member: We incurred a total capex of INR48 crores in financial year ’23 and we intend to incur a capex of anywhere between INR50 crores to INR60 crores again in the financial year ’24.", "citations": ["42682b1ef341b7910c69ced13452c762"]}, "['Q3', '2024']": {"answer": "ef6db5566a89767d386521924ebe2e21 --> We are compiling the capacity requirement. I think we should be in the similar range of INRS8O crores to INR100 crores capex across geography.", "citations": ["ef6db5566a89767d386521924ebe2e21"]}}]}, {"theme": "Operational Efficiency and Expansion", "topics": [{"topic": "Capacity utilization and process optimization", "['Q3', '2023']": {"answer": "7693ff253b9acfed6dc6d515d2ab9b80 --> Pallab Banerjee: So that’s something like we have to gain over with the efficiencies that we’re trying to achieve both in terms of utilization and efficiency of manufacturing.", "citations": ["7693ff253b9acfed6dc6d515d2ab9b80"]}, "['Q1', '2024']": {"answer": "57732035150accf5f40333003ad0b904 --> Pearl Global has acquired a 55% equity stake in Pearl Guatemala Holdco Limited.\nThe existing factory, earlier owned by a Guatemalan resident and a U.S. resident, was generating an annual revenue of $3.8 million, operating three production lines.\nPost this acquisition, Pearl GT Holdco Ltd. will incur a capex of up to US$2 million in the subsidiary to expand the capacity up to 12 lines and which shall generate an annual revenue of US$20 million by manufacturing for our prestigious customers.\n\n4ecca2ecb7cfe53893e5821aa964e1bb --> So, this will see that growth, both in terms of the capacity and that's how the capex has been planned over this one year.\n\nea7a5d26a2e43a50b3e3cdabe537fb0c --> Sanjay Gandhi: Yeah, sure, sure. So, this year when we are talking in August 23, I think by the end of March 24, we would have incurred at least 25% of the capex on this facility.\n\nea7a5d26a2e43a50b3e3cdabe537fb0c --> Sanjay Gandhi: ...going into next year, FY24-25, we expect within 6 months of next financial year, this quarter 1 and quarter 2, as the facility scale up, we will be starting incurring and I think completion should happen around quarter 2 or quarter 3 of next financial year.", "citations": ["57732035150accf5f40333003ad0b904", "4ecca2ecb7cfe53893e5821aa964e1bb", "ea7a5d26a2e43a50b3e3cdabe537fb0c", "ea7a5d26a2e43a50b3e3cdabe537fb0c"]}, "['Q1', '2025']": {"answer": "d63c9c3b67e0aedff33ab54566120415 --> Pallab Banerjee: But I think over the next few weeks with additional overtime and working on a holiday kind of thing situation that we do normally in such extreme situations, we are confident of making up this production loss.\n\nb5b3ea576e9bd718f935d35b1ccb54d9 --> Pallab Banerjee: So Bihar, Odisha and Madhya Pradesh, we are going ahead and building up our capacities out there. So part of it would be ready and operational this year and part will be operational next year.\n\n96abf3ee9cbbe32add61a0d6c0981a49 --> Pallab Banerjee: But yes, India, like to grow by about 10%-15% would need a sizable amount of capacity.\n\nc62ab769f630dea31eeb524958a6f1b6 --> Sanjay Gandhi: So, already, if you look at our plans to go to 130 million, 140 million and let's talk about 10,000 machine additions, I think there will be machine added in a calibrated manner.\n\nbc0cb5d5e6d6c5ae287fda3d0b5ac15e --> Sanjay Gandhi: Yes. So, our blended utilization last year was 68%, 69%. With this growth, we see that, you know, overall, we should be looking at blended utilization in excess of 80%. That's where we seem to be really heading with the revenue.", "citations": ["d63c9c3b67e0aedff33ab54566120415", "b5b3ea576e9bd718f935d35b1ccb54d9", "96abf3ee9cbbe32add61a0d6c0981a49", "c62ab769f630dea31eeb524958a6f1b6", "bc0cb5d5e6d6c5ae287fda3d0b5ac15e"]}, "['Q2', '2024']": {"answer": "508e24c3171023a1a4b04be56b9c684f --> Sanjay Gandhi: So, automation and maintenance is already incurred, on the capacity expansion is what I mentioned about 20% is what we have already incurred, 80% will be incurred in the rest of the year.", "citations": ["508e24c3171023a1a4b04be56b9c684f"]}, "['Q1', '2023']": {"answer": "00eab4f88727372869e3afb17e56c0dd --> Business Highlights Q1FY23: \"Inhouse manufacturing increased by 30%.\"\n\n499578b117848bcb92ecd20947d1c824 --> Pallab Banerjee: So, definitely we are going towards from 65% to 75%, that's the kind of growth plan that we had for this year.\n\nd46daa480f31838352fb75e60993ae58 --> Sanjay Gandhi: So, whatever the inventory is there, it is likely to be shipped in the coming 90 to 120 days time period.", "citations": ["00eab4f88727372869e3afb17e56c0dd", "499578b117848bcb92ecd20947d1c824", "d46daa480f31838352fb75e60993ae58"]}, "['Q4', '2023']": {"answer": "d712b047f068f3da058f63ef4228148b --> Pallab Banerjee: So that's with that kind of thing, we can definitely do a capacity growth from 54 million pieces to almost 74 million pieces.\n\n3151cac05da4e6882d2bd45448a146ec --> Sanjay Gandhi: On the debt side, there will be some debt taken for the, but even more of a capacity augmentation, it’s a deep bottlenecking of existing, like, say, in one of the factory, we have a land which is available, and there is already a factory already established. So if you have to extend it, and to make it, add 35%-40% of more capacity by making an extension there, we will be looking at those opportunities, which Pallab mentioned about those things.\n\n8e0b5fbca9e7e2e09bd5cb2de90c56cd --> Board Member: Once the mill, the raw material, fabric, and how the garment has to be manufactured and all the approvals are in place, then they look for a quicker turnaround, which is maybe like five weeks in place of 12 weeks.", "citations": ["d712b047f068f3da058f63ef4228148b", "3151cac05da4e6882d2bd45448a146ec", "8e0b5fbca9e7e2e09bd5cb2de90c56cd"]}}, {"topic": "Product mix and manufacturing specialization"}, {"topic": "Market expansion and strategic partnerships", "['Q2', '2023']": {"answer": "829412629727c48c3c59c58fa63de671 --> Pallab Banerjee: Yes, we would be I had mentioned that in some of our earlier calls that we want to bring in a complete supply chain solutions to our customers so currently we are present in two of the major supply chains of apparels. So we would continue to explore the other geographies and as refined as we gain feet like we will definitely expand to the third and the fourth supply chain at some point of time.\n\n59671d7ff1beeeb933e30e261999567e --> Document states that under the MITRA Scheme, 7 mega parks will be set up in the country over the upcoming three years with plug and play facilities in a bid to create global champions in exports.", "citations": ["829412629727c48c3c59c58fa63de671", "59671d7ff1beeeb933e30e261999567e"]}, "['Q3', '2023']": {"answer": "aeaac283e4ffa3a388ccf4543097d259 --> Sanjay Gandhi: So, currently in India, we may be doing $120 million turnover, but the potential to grow is much higher. So we are looking at a strategy of setting up expansion under PLI scheme or expansion under existing unit in India as well.\n\na691ee1ac28d5d388e5400955080e303 --> Document states that under the MITRA Scheme, 7 mega parks will be set up in the country over the upcoming three years with plug and play facilities in a bid to create global champions in exports.", "citations": ["aeaac283e4ffa3a388ccf4543097d259", "a691ee1ac28d5d388e5400955080e303"]}, "['Q1', '2025']": {"answer": "a4e64deacc7271db162951732e072461 --> Board Member: \"And going forward, you will see us investing and starting production in other states like Bihar, Orissa and Madhya Pradesh, where there is an availability of labour force and is relatively less expensive than our existing production locations.\"", "citations": ["a4e64deacc7271db162951732e072461"]}, "['Q2', '2024']": {"answer": "89996346b2ddf0820c7136e25604eac3 --> Government Initiatives: PM MITRA Scheme: Under the scheme, 7 mega parks will be set up in the country over the upcoming three years with plug and play facilities in a bid to create global champions in exports.", "citations": ["89996346b2ddf0820c7136e25604eac3"]}, "['Q1', '2024']": {"answer": "6a56f34e47769c0c62c90608225b1d5a --> Board Member: Under the scheme, 7 mega parks will be set up in the country over the upcoming three years with plug and play facilities in a bid to create global champions in exports.", "citations": ["6a56f34e47769c0c62c90608225b1d5a"]}, "['Q4', '2023']": {"answer": "fab80c3818f9ccef4848c130946f98d1 --> In Indonesia, the company has successfully expanded its operations by constructing a new facility on the land acquired in 2021.\nWith the capital expenditure of INR29 crores, new facility replaces the old one and also it offers 35% increase in our total capacity in Indonesia.\nThis higher capacity is expected to drive increased revenues for Indonesia in the next fiscal year of 2024-25.", "citations": ["fab80c3818f9ccef4848c130946f98d1"]}}]}, {"theme": "Sustainability and Innovation", "topics": [{"topic": "Eco-friendly practices and renewable energy adoption"}, {"topic": "Product development and technological advancements"}, {"topic": "Social responsibility and ethical compliance"}]}, {"theme": "Customer Relationships and Market Presence", "topics": [{"topic": "Client retention and engagement strategies"}, {"topic": "Geographical diversification and global operations", "['Q1', '2024']": {"answer": "d59f00c9abaa74203331312de12bd5f4 --> Pallab Banerjee: \"So for them to come back to normalcy, we expected that from spring to summer season, they should be coming back into normalcy.\"\n\nf1e90be5e920620998bc9cb3b201af8e --> Moderator: The extension is likely to benefit exporters of Apparel/Garment and Home Textiles products since the extension till 31st March 2024 ensures a stable and predictable policy regime for three years.", "citations": ["d59f00c9abaa74203331312de12bd5f4", "f1e90be5e920620998bc9cb3b201af8e"]}, "['Q1', '2023']": {"answer": "8d9bee07e5adae0389c25eae623411a8 --> Pallab Banerjee: \"So, to give you numbers, like at this point of time, I think in this last four or five quarters, if I look at, our presence in U.S. would be maximum, would be more than 80% or more towards 90%, I think it is 80% to 85% plus. So, that should change a little bit, as we go forward.\"", "citations": ["8d9bee07e5adae0389c25eae623411a8"]}}, {"topic": "Brand identity and competitive positioning"}]}, {"theme": "Risk Management and Compliance", "topics": [{"topic": "Financial risk and currency hedging"}, {"topic": "Regulatory changes and compliance monitoring", "['Q3', '2023']": {"answer": "a691ee1ac28d5d388e5400955080e303 --> Document states that the extension of the RoSCTL scheme is likely to benefit exporters of Apparel/Garment and Home Textiles products since the extension till 31st March 2024 ensures a stable and predictable policy regime for three years.", "citations": ["a691ee1ac28d5d388e5400955080e303"]}, "['Q2', '2024']": {"answer": "89996346b2ddf0820c7136e25604eac3 --> Extension of RoSCTL scheme: The extension is likely to benefit exporters of Apparel/Garment and Home Textiles products since the extension till 31st March 2024 ensures a stable and predictable policy regime for three years.", "citations": ["89996346b2ddf0820c7136e25604eac3"]}, "['Q2', '2023']": {"answer": "59671d7ff1beeeb933e30e261999567e --> Document states that the extension of the RoSCTL scheme is likely to benefit exporters of Apparel/Garment and Home Textiles products since the extension till 31st March 2024 ensures a stable and predictable policy regime for three years.", "citations": ["59671d7ff1beeeb933e30e261999567e"]}}, {"topic": "Governance and corporate responsibility"}]}]