[{"theme": "Revenue Growth and Financials", "topics": [{"topic": "Revenue diversification", "data": {"['Q1', '2023']": {"answer": "eda72c5e86d09d8b0fda0b52876047dc --> Total income for Quarter 1 FY'23 increased by 95% year-on-year to Rs. 851 crore.\n\na5c8b423acdef74dd76b2740e3127d52 --> India textile exports are expected to grow at 11% CAGR, to reach about $65 billion by 2026 from a pre-COVID level of $36 billion happened in 2019.", "citations": ["eda72c5e86d09d8b0fda0b52876047dc", "a5c8b423acdef74dd76b2740e3127d52"]}, "['Q1', '2024']": {"answer": "c92b2fef8ac4f4dd8754e7f3846c6c8c --> The management maintains their focus for the year to achieve flat or slight growth in revenue.\n\nf0018dc3a00ee88d696addbfcb640303 --> Sanjay Gandhi mentioned a long-term goal of achieving a target revenue growth of 15% to 20% over the next three to four years.\n\n57732035150accf5f40333003ad0b904 --> The management announced that Pearl GT Holdco Ltd. will incur a capex of up to US$2 million to expand the capacity up to 12 lines, which shall generate an annual revenue of US$20 million.\n\nf2ca4fa221285784157b2b244f8ff2d3 --> Pallab Banerjee stated that they will definitely show some growth for the full year, but he is cautious and not expecting double-digit growth due to the current market scenario.\n\neb9521df8551d43cc2db5fa3f4ed1fbf --> Pallab Banerjee indicated that they are projecting the overall revenue number to be similar to last year or maybe experience a minor growth.\n\n9a08802e49df321601fb65788dd7843d --> The head of sales projected a 25% increase in sales volume by the end of Q4.\n\nf6c69ccdc651a7099c55967a31bd9526 --> The revenue potential of the Guatemala facility is planned up to $20 million.\n\n35e0256fc8d011afc70211490e86e9f6 --> Narendra mentioned a medium-term revenue guidance of 15-20%.", "citations": ["c92b2fef8ac4f4dd8754e7f3846c6c8c", "f0018dc3a00ee88d696addbfcb640303", "57732035150accf5f40333003ad0b904", "f2ca4fa221285784157b2b244f8ff2d3", "eb9521df8551d43cc2db5fa3f4ed1fbf", "9a08802e49df321601fb65788dd7843d", "f6c69ccdc651a7099c55967a31bd9526", "35e0256fc8d011afc70211490e86e9f6"]}, "['Q1', '2025']": {"answer": "3a60c23f062b645ef1dc5b022c2e882f --> Pallab Banerjee mentioned that individual customers should eventually have a runway to do about USD 100 million, which is approximately INR 800 crores.\n\nd1746fdb0b7b7cc198f68a83ec321c7a --> Pallab Banerjee mentioned the expected revenue growth range of 12% to 14%, with the possibility of exceeding this by a few percentage points.\n\n26289408bb83c36b85e7daf484ca5cdf --> The management team has a target to classify their top three or four customers to reach the USD100 million mark, with a second tier of customers to be in the USD40-60 million range, and tactical customers to be below USD20 million, over a period of 4 to 5 years.", "citations": ["3a60c23f062b645ef1dc5b022c2e882f", "d1746fdb0b7b7cc198f68a83ec321c7a", "26289408bb83c36b85e7daf484ca5cdf"]}, "['Q2', '2023']": {"answer": "97aca4f6b5ca577a86a799744099374f --> Pallab Banerjee, Managing Director, stated the company's growth momentum continued during the first half year of Financial Year 2023, achieving the highest ever H1 revenue.", "citations": ["97aca4f6b5ca577a86a799744099374f"]}, "['Q2', '2024']": {"answer": "e0add8a6759503f8d08045982206ab39 --> The CFO projected a 20% increase in capital expenditures for the upcoming fiscal year.\n\n00ea348b7b57433af65434a8f6e5dba9 --> Pallab Banerjee is forecasting a similar number for the current year with a minor increase of 5% to 7%.\n\n300515f8306954e9c74a444c266ba1e3 --> Sanjay Gandhi stated that revenue is expected to increase by 5% to 10% for the financial year.\n\n72f127e11c5fa8044b218bd09eab43c8 --> Pallab Banerjee indicated confidence in maintaining the revenue numbers achieved in the first half of the year during the second half.\n\ncd2d6b434c7bbd8bcc5520b3cdfa094a --> The CFO provided guidance that the company expects a revenue growth of 12% for the fiscal year 2024.\n\ncd99c6e07c360fc5f81f0427eb8b7014 --> The company plans to break even and generate more revenue from the Guatemala plant over the next one to two years.\n\n963011c87f011c1fbbe5ed984d928efb --> Pallab Banerjee stated that the annual growth would be limited to between 5% and 7% from each region.\n\n584e1e69bf370a7260a1ca6dff7c82ac --> Sanjay Gandhi mentioned that 50%-55% of the CAPEX is for capacity expansion, which should start generating revenue from the next financial year and reach a good capacity utilization level by the end of that year.", "citations": ["e0add8a6759503f8d08045982206ab39", "00ea348b7b57433af65434a8f6e5dba9", "300515f8306954e9c74a444c266ba1e3", "72f127e11c5fa8044b218bd09eab43c8", "cd2d6b434c7bbd8bcc5520b3cdfa094a", "cd99c6e07c360fc5f81f0427eb8b7014", "963011c87f011c1fbbe5ed984d928efb", "584e1e69bf370a7260a1ca6dff7c82ac"]}, "['Q3', '2023']": {"answer": "03d05531ce981cf813ef2d93ae9967dd --> The CFO stated that the company expects a 12% growth in net sales for the next fiscal year.\n\nc519d5584a714dd7fc2e5db4d81c03bc --> The goal is to continue growing at a cumulative rate of 15% to 20%.\n\n8740431b66afa67483f1929f7bed9bf6 --> The CFO stated that the company expects to achieve a revenue growth of 12% for the upcoming fiscal year.\n\n95dd31f61cf19ad0e65a2bd50ba7df16 --> Sanjay Gandhi stated that the top-line is expected to grow at 20% for the next three years within the existing capacity.", "citations": ["03d05531ce981cf813ef2d93ae9967dd", "c519d5584a714dd7fc2e5db4d81c03bc", "8740431b66afa67483f1929f7bed9bf6", "95dd31f61cf19ad0e65a2bd50ba7df16"]}, "['Q3', '2024']": {"answer": "c8589c082cbc653690512e0e1389d8ea --> The Managing Director stated that the growth is primarily driven by a 20% increase in overseas revenue.\n\n553e7d94138c37f596c47a73d5e0987e --> The CFO provided guidance on the company's revenue growth for the upcoming fiscal year.\n\nd914fe9a42e878aed32a91a4c7d25d75 --> The company aims to surpass previous revenue growth records by introducing new product categories and expanding existing customer relationships.\n\n7bf47b9bb8c6864b6195ed1e0c37a699 --> Pallab Banerjee stated that Bangladesh is expected to contribute approximately 35% to the top line in three years.\n\n9b1f2084ffe891f5726709edffea34a5 --> The CEO announced a target of achieving $500 million in annual revenue within the next two years.\n\n77cefa767a9a47f1fed4753cba2a2f0d --> Sanjay Gandhi stated that the company is looking at a 15% to 20% top line growth for the next three years.\n\n12baf2aec2e023cdaaf19175ff340d06 --> Pallab Banerjee stated that the company is targeting a growth range of 15% to 20%.\n\n0f33bc2d22ce058e23d2347e2ff45a4d --> The CFO stated that revenue is expected to grow by 12% in the next fiscal year.\n\n60a25d7c4fad62bc3b99ffb5a03ce767 --> Pallab Banerjee stated that 10% to 20% of the company's business will always be in the model where capital expenditure may not be asked fully.", "citations": ["c8589c082cbc653690512e0e1389d8ea", "553e7d94138c37f596c47a73d5e0987e", "d914fe9a42e878aed32a91a4c7d25d75", "7bf47b9bb8c6864b6195ed1e0c37a699", "9b1f2084ffe891f5726709edffea34a5", "77cefa767a9a47f1fed4753cba2a2f0d", "12baf2aec2e023cdaaf19175ff340d06", "0f33bc2d22ce058e23d2347e2ff45a4d", "60a25d7c4fad62bc3b99ffb5a03ce767"]}, "['Q4', '2023']": {"answer": "54253af36c2e8b5c67743edb0d21aaeb --> The management team is confident of achieving a 15% to 20% revenue CAGR over the next three to four years.\n\nfab80c3818f9ccef4848c130946f98d1 --> The management stated that the new facility in Indonesia is expected to drive increased revenues in the next fiscal year of 2024-25.\n\n0ec39305ddbc3ee705a5c3605302e914 --> Pallab Banerjee indicated a continuous growth projection of 15% to 20% CAGR year-on-year over the next five to seven years.\n\n664abeb2645fa3cbb487a5126d92bece --> Faisal Hawa inquired about a target to achieve 20%-22% growth in volume terms annually over the next three to four years, resulting in a compound annual growth rate (CAGR) of 20% for the period.\n\na81ae3588f5e8ca5bc4cd517a29d7bad --> The company is striving to achieve a 15% to 20% revenue growth CAGR over the next few years.\n\n3151cac05da4e6882d2bd45448a146ec --> Sanjay Gandhi stated a target of achieving a 15%-20% CAGR over a three-to-four-year period.", "citations": ["54253af36c2e8b5c67743edb0d21aaeb", "fab80c3818f9ccef4848c130946f98d1", "0ec39305ddbc3ee705a5c3605302e914", "664abeb2645fa3cbb487a5126d92bece", "a81ae3588f5e8ca5bc4cd517a29d7bad", "3151cac05da4e6882d2bd45448a146ec"]}, "['Q4', '2024']": {"answer": "5c9b7a1bc2ef72e3d24a2d393330a419 --> The management indicated they are confident about ending the year 2024 with growth, though it may not reach the previously discussed 15% or 20% CAGR.\n\n68899d19b6c3508fb50da4dea0c1602f --> The company is on track to achieve a top line of INR6,000 crores to INR6,200 crores by FY'28.\n\nf9806990cb5e7da89f84b9f069697719 --> Pallab Banerjee mentioned that by 2028, the company is expected to be almost a INR6,000 crores company.\n\n30b40eb28bec1c8c4a19ffedf0082456 --> Sanjay Gandhi indicated a target for revenue growth with a CAGR of 15% to 18%, potentially reaching as high as 20%.", "citations": ["5c9b7a1bc2ef72e3d24a2d393330a419", "68899d19b6c3508fb50da4dea0c1602f", "f9806990cb5e7da89f84b9f069697719", "30b40eb28bec1c8c4a19ffedf0082456"]}}}, {"topic": "Cost management strategies", "data": {"['Q1', '2024']": {"answer": "1e754ac0d20054e189a36fce3a5428d2 --> The Group CFO stated that they expect a reduction in debt levels by 15% over the next 12 months.\n\n9a08802e49df321601fb65788dd7843d --> The CFO mentioned a 20% increase in capital expenditure for the upcoming year.", "citations": ["1e754ac0d20054e189a36fce3a5428d2", "9a08802e49df321601fb65788dd7843d"]}, "['Q1', '2025']": {"answer": "21b562ba4565530f99fd7225337da7fd --> The CFO mentioned that the company expects to achieve a gross margin improvement of 5% by the end of the next fiscal year.\n\nffa78b390bef475cccb6ed2ecdd42935 --> Sanjay Gandhi mentioned a strategy involving maintaining a 30 to 35 equity and 65 debt ratio for future capex.\n\nffa78b390bef475cccb6ed2ecdd42935 --> Sanjay Gandhi indicated that interest costs are expected to reduce with the softening of interest rates over the next two to four quarters.", "citations": ["21b562ba4565530f99fd7225337da7fd", "ffa78b390bef475cccb6ed2ecdd42935"]}, "['Q3', '2023']": {"answer": "a2720f8f9f2d6d2486b03c23f478ebac --> The CFO mentioned that they plan to reduce debt by $50 million over the next two years.", "citations": ["a2720f8f9f2d6d2486b03c23f478ebac"]}, "['Q3', '2024']": {"answer": "7796eb15d5140faeec101e509c130f27 --> The CFO detailed a plan to reduce debt by $50 million by the end of the fiscal year.\n\ne92c2f00bb8142e86197f385e5af6ad6 --> Pallab Banerjee mentioned that the wage increase impact on earnings due to Bangladesh operations is approximately 1% to 1.5% of Bangladesh's top line in their P&L, and they do not see any adverse impact on earnings in the coming quarter.\n\n07b2ba7c4b593ef5391bcf9d0603b969 --> The CFO provided guidance on capital expenditure, forecasting a $150 million investment over the next two years.\n\n49c9b9baa794462c42f75f2db8f6048e --> Sanjay Gandhi indicated that the tax rate should be modeled between 16% to 18% on a steady state basis.", "citations": ["7796eb15d5140faeec101e509c130f27", "e92c2f00bb8142e86197f385e5af6ad6", "07b2ba7c4b593ef5391bcf9d0603b969", "49c9b9baa794462c42f75f2db8f6048e"]}, "['Q4', '2023']": {"answer": "42682b1ef341b7910c69ced13452c762 --> The company intends to incur a capex of anywhere between INR50 crores to INR60 crores in the financial year 2024.", "citations": ["42682b1ef341b7910c69ced13452c762"]}, "['Q4', '2024']": {"answer": "def43161ad126995deed48af5a7e075b --> The speaker provided guidance regarding ESOP expenses for the next year.\n\ndd81f09903dbe4a2aad884de3a1ead96 --> Sanjay Gandhi stated that the company plans to keep the interest cost under control through prepayment of long-term loans and using internal accruals to bring down costs, while being conscious of leverage.", "citations": ["def43161ad126995deed48af5a7e075b", "dd81f09903dbe4a2aad884de3a1ead96"]}}}, {"topic": "Profitability metrics", "data": {"['Q1', '2023']": {"answer": "29c107285a519304cd73f45e13e17a6e --> The CFO mentioned that the company aims to achieve a 20% increase in net profit by the end of the fiscal year.\n\nc73fc8755eec1b04d8c22f0662aafe49 --> Sanjay Gandhi indicated a target for incremental partnership arrangements to achieve an overall return on capital employed close to 20%.\n\n1fd3e34a3395dbd23699800951d502b6 --> The speaker inferred as a member of the management team, Pallab Banerjee, stated they are targeting to cross Rs. 3,000 crore in the current financial year.\n\n219fbdb047c82087aa2d06edf07a41b3 --> The speaker mentioned that Q3 is almost confirmed, and they see a slight dip in orderbook for the next two quarters.\n\nc51fa0972a528d90ee2d580320db1995 --> Sanjay Gandhi mentioned that the factors discussed are likely to help the company in improving the margins going forward.\n\n7f263b07f532c82763cb24cd68b45458 --> Pallab Banerjee indicated that major U.S. customers are projecting a drop in numbers between 10% to 30%.", "citations": ["29c107285a519304cd73f45e13e17a6e", "c73fc8755eec1b04d8c22f0662aafe49", "1fd3e34a3395dbd23699800951d502b6", "219fbdb047c82087aa2d06edf07a41b3", "c51fa0972a528d90ee2d580320db1995", "7f263b07f532c82763cb24cd68b45458"]}, "['Q1', '2024']": {"answer": "15f6513a6aa0074552f5b54860de8c6f --> The company expects to achieve 10% to 15% PAT growth this year.\n\n4ecca2ecb7cfe53893e5821aa964e1bb --> The company expects the effective tax rate to be between 16% to 18% on a consolidated basis.\n\n6442e5a9831b064a58ad416606d9233f --> Sanjay Gandhi mentioned that they are expecting to reach a certain level of profitability post the complete capex in the next two to three years.\n\n6442e5a9831b064a58ad416606d9233f --> Sanjay Gandhi stated they will maintain the EBITDA margin this year at the same level as last year despite challenges.", "citations": ["15f6513a6aa0074552f5b54860de8c6f", "4ecca2ecb7cfe53893e5821aa964e1bb", "6442e5a9831b064a58ad416606d9233f"]}, "['Q1', '2025']": {"answer": "488c849d4e050a2d30c198d39fc03a5f --> Mr. Sanjay Gandhi (Group Chief Financial Officer) mentioned that the company expects a 12% increase in EBITDA for the next quarter.\n\n52970a664043b8fa99cfe4efd0de2632 --> The CFO projected a 12% increase in operating margins by the end of the fiscal year.\n\n6eac4367481d480fca40b8bd9861752e --> The company expects to achieve a revenue CAGR of 12% to 14% and an EBITDA margin of 10% to 12% by FY 28.\n\ne53a74a8343051866a7cbaf8f5b0ea1f --> Sanjay Gandhi stated that the company is optimistic about achieving a double digit adjusted EBITDA by the end of this year and maintaining it into the next year.\n\n3c37aa45f1b49cb61c19c42df450872e --> Pallab Banerjee stated that the company is looking for a growth of at least a minimum of 12% to 14% year-on-year with a better bottom line, double-digit.\n\n08444c37ddf6be0d1be49cbc1b372856 --> The CFO mentioned that the company aims to improve its gross margin by 5% within the next two years.\n\nb5ca0f8c2d8ecc8a4635d5698f929574 --> The CFO projected a 12% increase in net profit margin by the end of the current fiscal year.", "citations": ["488c849d4e050a2d30c198d39fc03a5f", "52970a664043b8fa99cfe4efd0de2632", "6eac4367481d480fca40b8bd9861752e", "e53a74a8343051866a7cbaf8f5b0ea1f", "3c37aa45f1b49cb61c19c42df450872e", "08444c37ddf6be0d1be49cbc1b372856", "b5ca0f8c2d8ecc8a4635d5698f929574"]}, "['Q2', '2023']": {"answer": "5e92686ec3e64353b0953d603cb39c9d --> Sanjay Gandhi indicated an improvement in EBITDA margin to 6.1% in Q2 FY23 compared to 5.9% in Q2 FY22.\n\ndd6145f63d195ab0106249d01d243d69 --> The sales for FY23 are expected to be around 3,200 Crores with a margin of approximately 7.5%.\n\nc40041ae070a976b5dc44a547ba549f5 --> Sanjay Gandhi stated that the quarterly run rate for Q3 should be roughly around 750 to 800 Crores.\n\nc33b0fd5a9fa139e977e97c13754f932 --> Sanjay Gandhi indicated an improvement in EBITDA margin compared to the previous year, with a complete picture expected by the end of December.\n\n6667874edf366984431cf9d152ff0cb8 --> Sanjay Gandhi stated that the company is targeting to reach double-digit EBITDA margins, specifically around 10%, in the coming quarters, possibly by FY25 or mid-FY25.", "citations": ["5e92686ec3e64353b0953d603cb39c9d", "dd6145f63d195ab0106249d01d243d69", "c40041ae070a976b5dc44a547ba549f5", "c33b0fd5a9fa139e977e97c13754f932", "6667874edf366984431cf9d152ff0cb8"]}, "['Q2', '2024']": {"answer": "c81c5c256cb11ab05c6169ea2b580ae0 --> The company has finalized a dividend policy to declare a dividend of at least 20% of the consolidated profit after tax in a given year to shareholders.\n\n3b9b4d4f21a326c0cd2dbc4b42409620 --> The company declared a dividend of Rs.12.50 per equity share for Financial Year ‘24.\n\n29e0d7a6cc518cd8931f6f06233ecb75 --> The speaker foresees maintaining a growth rate of 7% to 8% for the second half of the year.\n\n29e0d7a6cc518cd8931f6f06233ecb75 --> The speaker anticipates ending the year with a growth rate between 5% to 8%.\n\nf78b1940e329dad78626989d44502200 --> The management indicated that the net debt to equity ratio is expected to improve to 0.04 times next year, from 0.21 times as on FY23.\n\n300515f8306954e9c74a444c266ba1e3 --> Sanjay Gandhi indicated that the bottom line, which was 8.1% last year, will improve despite macro challenges.\n\n99a93cee3a82f1f185b2157b335a5ea6 --> A dividend policy stating that 20% of the PAT will be declared as a dividend.\n\ne38d698dec732bc6521f6c134718820a --> Sanjay Gandhi indicated the target to achieve double-digit EBITDA in the fiscal year 2024-2025.", "citations": ["c81c5c256cb11ab05c6169ea2b580ae0", "3b9b4d4f21a326c0cd2dbc4b42409620", "29e0d7a6cc518cd8931f6f06233ecb75", "f78b1940e329dad78626989d44502200", "300515f8306954e9c74a444c266ba1e3", "99a93cee3a82f1f185b2157b335a5ea6", "e38d698dec732bc6521f6c134718820a"]}, "['Q3', '2023']": {"answer": "c4b027cfc7b19229820080575b5f543c --> The management targets a return on capital employed between 15% to 20% in the first year for acquisitions or major capex, stabilizing around 18% to 20% over the next two to three years.\n\ne4f14561ad5de629ec9dcbd93e5b32b8 --> The speaker indicated an objective to achieve a stable state double-digit margin in the medium to long term.\n\n0302017fc0cf93c59ccf53d4da3c749a --> Sanjay Gandhi, Group CFO, anticipates the full-year margins to be a high single-digit.\n\ndcae54c6aa0ccfdb1260c9d265855a5c --> Sanjay Gandhi mentioned that the new factory, Prudent Fashion Limited, is generating a return on capital employed between 15% to 20% this year.\n\n4f3945dc043ce34e6849f5149ea2b81f --> Sanjay Gandhi indicated that there may be a marginal decline in top-line year-on-year, but efforts are being made to ensure the bottom-line shows improvement.\n\n4117d2ae167c808c598c2426f78efb0f --> The management team anticipates achieving a double-digit margin in the long term through the development and implementation of their strategies.\n\n48dc7b91568ffb4f95de3cb0c2443ea9 --> Pallab Banerjee stated a goal of achieving 20% to 25% year-on-year growth.\n\n6d0cc95a849858d10aeaf8655b727b78 --> Sanjay Gandhi stated that the company is targeting a return on capital employed of anywhere between 15% to 20% and expects to reach this in the first year of integration.", "citations": ["c4b027cfc7b19229820080575b5f543c", "e4f14561ad5de629ec9dcbd93e5b32b8", "0302017fc0cf93c59ccf53d4da3c749a", "dcae54c6aa0ccfdb1260c9d265855a5c", "4f3945dc043ce34e6849f5149ea2b81f", "4117d2ae167c808c598c2426f78efb0f", "48dc7b91568ffb4f95de3cb0c2443ea9", "6d0cc95a849858d10aeaf8655b727b78"]}, "['Q3', '2024']": {"answer": "6927a9ea9cd0277b4d515f47df26f852 --> Mr. Sanjay Gandhi (Group Chief Financial Officer) indicated an expected EBITDA margin improvement of 200 basis points in the next two quarters.\n\n49c9b9baa794462c42f75f2db8f6048e --> Pallab Banerjee suggested that they should be clocking a 15% to 20% growth next year on the current year base.\n\ned7f64f447641fff9a50a1dbe7143979 --> Sanjay Gandhi clarified that the wage hike in Bangladesh will have an impact of about 1%-1.5% on the top line of the Bangladesh country operations, not on the group turnover.\n\ncfcf867b7ab3a26ee5ee96ae5277f7af --> Sanjay Gandhi stated that the company should be looking at a 3% to 4% improvement in margins from where they are currently, with a 15% to 20% growth in top line over the next three years.", "citations": ["6927a9ea9cd0277b4d515f47df26f852", "49c9b9baa794462c42f75f2db8f6048e", "ed7f64f447641fff9a50a1dbe7143979", "cfcf867b7ab3a26ee5ee96ae5277f7af"]}, "['Q4', '2023']": {"answer": "11af45531781a4cfd510e08f4310db80 --> The Group CFO confirmed an expected EBITDA margin expansion of 2% by the end of the fiscal year.\n\n54253af36c2e8b5c67743edb0d21aaeb --> The management team is confident of maintaining margins between 7% to 8% on a full year basis.\n\n664abeb2645fa3cbb487a5126d92bece --> Sanjay Gandhi stated that any new project taken by the company should generate a return on capital employed close to 20% within two to three years.\n\n020e524036b70d39a6bf82ccad340f7a --> The company is targeting a return on capital employed (ROCE) between 18% to 20%, and aims to maintain this level over the next three to four years.\n\nb853de83a2b796b54fb32a9c1a46d951 --> Sanjay Gandhi mentioned that the blended tax rate will be within 15% to 18%.\n\nb853de83a2b796b54fb32a9c1a46d951 --> Sanjay Gandhi stated that the ROCE will improve by 1% due to the exclusion of funds given as margin for LC from ROCE calculations.\n\n5d146e19611580a68b2da37251fe0a89 --> Sanjay Gandhi inferred the continuation of healthy margins in Bangladesh despite some short-term challenges.\n\nd3b1d991c5c9dcafb7f8b35eddd15e3e --> The company has a policy of increasing the dividend rate in the coming financial year, contingent on profit growth.\n\n3151cac05da4e6882d2bd45448a146ec --> Sanjay Gandhi mentioned targeting a double-digit EBITDA margin depending on macroeconomic conditions and other factors.", "citations": ["11af45531781a4cfd510e08f4310db80", "54253af36c2e8b5c67743edb0d21aaeb", "664abeb2645fa3cbb487a5126d92bece", "020e524036b70d39a6bf82ccad340f7a", "b853de83a2b796b54fb32a9c1a46d951", "5d146e19611580a68b2da37251fe0a89", "d3b1d991c5c9dcafb7f8b35eddd15e3e", "3151cac05da4e6882d2bd45448a146ec"]}, "['Q4', '2024']": {"answer": "8d4dca406fab7aa8551329b2a3fb0d35 --> The CFO predicts a 20% increase in net profit by the end of the fiscal year.\n\n6726ec4ea351d06dffa794c4b6aa685d --> Pallab Banerjee confirmed that sales are expected to reach almost over INR5,500 crores by FY’27 with an EBITDA in the region of 10%.\n\nc5be1f94452900721056728f1bf2a4d4 --> EBITDA is expected to stabilize at INR 300 crores in FY '25, with a 15% CAGR growth leading to INR 400 crores EBITDA.\n\n343c52683201bb91600aba6ca513343f --> The management expects to achieve an EBITDA margin between 10% to 12% by 2028.\n\nbdd8de31fecb09433b281fdab00b5362 --> The company has guided for a 300 to 400 basis points margin expansion over the next three to four years.\n\n0b8e376da83243513faa1587228b12c9 --> Sanjay Gandhi mentioned that the company aims to achieve an EBITDA margin of 10% to 12% in the next three to four years.\n\n54703a999ac2f0b57ea4ac5bb42fc3cc --> The management provided a four-year guidance on revenue growth and margins for FY25.", "citations": ["8d4dca406fab7aa8551329b2a3fb0d35", "6726ec4ea351d06dffa794c4b6aa685d", "c5be1f94452900721056728f1bf2a4d4", "343c52683201bb91600aba6ca513343f", "bdd8de31fecb09433b281fdab00b5362", "0b8e376da83243513faa1587228b12c9", "54703a999ac2f0b57ea4ac5bb42fc3cc"]}}}, {"topic": "Cash flow management", "data": {"['Q1', '2023']": {"answer": "7e59a1a52415e288f2a759cbee8eb18c --> The company does not plan to retire any debt using current cash and bank balances.", "citations": ["7e59a1a52415e288f2a759cbee8eb18c"]}, "['Q1', '2025']": {"answer": "a4e64deacc7271db162951732e072461 --> The company raised INR149.5 crores through the Qualified Institutional Placement to invest in operational improvements, enhance the governing process, digitize all factories, and improve financial ratings.", "citations": ["a4e64deacc7271db162951732e072461"]}, "['Q2', '2024']": {"answer": "ea1c30d70d6e049ada1ce18299a60cf1 --> The CFO outlined a target to reduce debt by $50 million by the end of the fiscal year.\n\n2ddb12ca5360cd2935b9d50f80425ead --> The company announced a special dividend of Rs.12.50 per share, which is 125% of the face value.\n\n4569af88d2bd278716af65042b54a597 --> Sanjay Gandhi mentioned the receivable days will remain around 30, 25, 30, 35 days.", "citations": ["ea1c30d70d6e049ada1ce18299a60cf1", "2ddb12ca5360cd2935b9d50f80425ead", "4569af88d2bd278716af65042b54a597"]}, "['Q4', '2024']": {"answer": "1180e26f0cb6c388595f4911c1c5c174 --> Sanjay Gandhi stated that the net working capital days are projected to be between 35 to 40 days by FY28, with debtor days targeted to hover around 30 days, plus or minus two to three days.", "citations": ["1180e26f0cb6c388595f4911c1c5c174"]}}}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Supply chain management", "data": {"['Q1', '2023']": {"answer": "dbbca728c188b0f6be90513eb719e9ef --> The Managing Director stated that Pearl Global Industries aims for a 20% increase in production capacity by the end of the fiscal year.\n\n6e206eb40ea922194d5bf0c7a8aaba7a --> The CFO stated that the company targets a 20% increase in production capacity by the end of the fiscal year.\n\nd46daa480f31838352fb75e60993ae58 --> Sanjay Gandhi mentioned that the inventory is likely to be shipped in the coming 90 to 120 days.", "citations": ["dbbca728c188b0f6be90513eb719e9ef", "6e206eb40ea922194d5bf0c7a8aaba7a", "d46daa480f31838352fb75e60993ae58"]}, "['Q1', '2024']": {"answer": "1e754ac0d20054e189a36fce3a5428d2 --> The Managing Director mentioned plans for a 20% increase in production capacity by the end of the fiscal year.", "citations": ["1e754ac0d20054e189a36fce3a5428d2"]}, "['Q1', '2025']": {"answer": "21b562ba4565530f99fd7225337da7fd --> The CEO stated that the company aims to increase its production capacity by 20% within the next two years.\n\n73207484528c27119b36b7bf8993fbf7 --> Sanjay Gandhi mentioned the addition of capacity in FY25.\n\n83a50f5377b10c62b6911a1f9dfa188e --> The speaker mentioned a timeline for setting up a factory, stating that it should take not more than five to six months to operate a factory if they have a building or shed, and about a year to 14 months to build a shed from scratch.\n\n96abf3ee9cbbe32add61a0d6c0981a49 --> Pallab Banerjee mentioned that the company is increasing its capacity over the next two years.\n\nc62ab769f630dea31eeb524958a6f1b6 --> Pallab Banerjee stated that once fully operational, the three locations in India would provide a significant capacity of about 5,000 to 6,000 machines per day.", "citations": ["21b562ba4565530f99fd7225337da7fd", "73207484528c27119b36b7bf8993fbf7", "83a50f5377b10c62b6911a1f9dfa188e", "96abf3ee9cbbe32add61a0d6c0981a49", "c62ab769f630dea31eeb524958a6f1b6"]}, "['Q2', '2023']": {"answer": "734d57d4c9abf462447753d147daaba5 --> Pallab Banerjee stated that there will be no increase in the partnership factory over the next five to six months to a year.\n\n12d5e887e84f47330da10662ca652200 --> The CFO projected a 20% increase in production capacity by the end of Q4 2023.", "citations": ["734d57d4c9abf462447753d147daaba5", "12d5e887e84f47330da10662ca652200"]}, "['Q2', '2024']": {"answer": "89deefb078d712a8971d8a1b4c1b4d30 --> The Managing Director stated that they aim to achieve a 20% increase in production capacity by the end of the fiscal year.\n\ncd2d6b434c7bbd8bcc5520b3cdfa094a --> The CEO announced that Pearl Global Industries aims to increase its production capacity by 20% by the end of 2024.", "citations": ["89deefb078d712a8971d8a1b4c1b4d30", "cd2d6b434c7bbd8bcc5520b3cdfa094a"]}, "['Q3', '2023']": {"answer": "1424b2347057250b31df780f224f21fc --> The inventory issue that most of the retailers have would be covered up in the current fall booking, the fall of '23.", "citations": ["1424b2347057250b31df780f224f21fc"]}, "['Q3', '2024']": {"answer": "4eba9d2adc85c385437f1de725d87eb4 --> The speaker mentioned that the company's order book is full for the next couple of quarters, indicating no short-term problems with order books.\n\n500a8532e89f21bbd7ad7d8cdbc7204b --> Pallab Banerjee confirmed plans to increase production capacity from 54 million pieces to potentially 80-84 million pieces.", "citations": ["4eba9d2adc85c385437f1de725d87eb4", "500a8532e89f21bbd7ad7d8cdbc7204b"]}, "['Q4', '2023']": {"answer": "f6b65e468db9db91b9c505e921f71b9d --> Pallab Banerjee stated that the company does not intend to take more than 30% to 50% of the capacity from partner factories, except in specific cases like the Alpha acquisition.\n\nba707a7c9281125eec6639ed3af0e182 --> The CFO stated that the company expects a 20% increase in production capacity by the end of the calendar year.\n\n8e0b5fbca9e7e2e09bd5cb2de90c56cd --> The speaker mentioned that Pearl Global Industries Limited is establishing the raw material design and everything for initial orders, giving at least about three months of time, and then planning for a quicker turnaround of five weeks instead of 12 weeks for replenishments.", "citations": ["f6b65e468db9db91b9c505e921f71b9d", "ba707a7c9281125eec6639ed3af0e182", "8e0b5fbca9e7e2e09bd5cb2de90c56cd"]}, "['Q4', '2024']": {"answer": "0ebde2e4e83987256134748079e317b2 --> The speaker indicated a plan to reach a capacity of 120 to 140 million by 2028.", "citations": ["0ebde2e4e83987256134748079e317b2"]}}}, {"topic": "Process automation", "data": {"['Q3', '2024']": {"answer": "d914fe9a42e878aed32a91a4c7d25d75 --> The management team mentioned strategies to mitigate the impact of increased Bangladesh wages by more automation and increased efficiency.\n\n07b2ba7c4b593ef5391bcf9d0603b969 --> The CEO announced that they expect to increase their production capacity by 20% by the end of the fiscal year.\n\n9b1f2084ffe891f5726709edffea34a5 --> The CFO forecasted a 20% increase in production capacity by the end of the fiscal year.\n\n1f9c4700093b8c5e8c25a22bc5b4018a --> The CFO stated that the company aims to increase its production capacity by 20% by the end of the calendar year.", "citations": ["d914fe9a42e878aed32a91a4c7d25d75", "07b2ba7c4b593ef5391bcf9d0603b969", "9b1f2084ffe891f5726709edffea34a5", "1f9c4700093b8c5e8c25a22bc5b4018a"]}, "['Q4', '2023']": {"answer": "d712b047f068f3da058f63ef4228148b --> Pallab Banerjee indicated a planned capacity growth from 54 million pieces to almost 74 million pieces.", "citations": ["d712b047f068f3da058f63ef4228148b"]}, "['Q4', '2024']": {"answer": "118f951bedabf7a95c6fb3020c887a17 --> The management plans to further automate all facilities and processes, maximize the use of existing capacities, and expand them in India.\n\n8d4dca406fab7aa8551329b2a3fb0d35 --> The COO aims for a 5% increase in production capacity by the fourth quarter.", "citations": ["118f951bedabf7a95c6fb3020c887a17", "8d4dca406fab7aa8551329b2a3fb0d35"]}}}, {"topic": "Cost reduction initiatives", "data": {"['Q1', '2023']": {"answer": "499578b117848bcb92ecd20947d1c824 --> Pallab Banerjee stated that they plan to increase capacity utilization from 65% to 75% within the year.", "citations": ["499578b117848bcb92ecd20947d1c824"]}, "['Q1', '2025']": {"answer": "d63c9c3b67e0aedff33ab54566120415 --> Pallab Banerjee stated that the company is confident of making up the six days of production loss over the next few weeks through additional overtime and working on holidays.\n\n08444c37ddf6be0d1be49cbc1b372856 --> The CEO stated that the company plans to increase its production capacity by 20% by the end of the next fiscal year.\n\nbc0cb5d5e6d6c5ae287fda3d0b5ac15e --> Sanjay Gandhi stated that the company is expecting a blended utilization in excess of 80% with the current growth.", "citations": ["d63c9c3b67e0aedff33ab54566120415", "08444c37ddf6be0d1be49cbc1b372856", "bc0cb5d5e6d6c5ae287fda3d0b5ac15e"]}, "['Q2', '2023']": {"answer": "653f58f3a0eb383be2d89e2e4b50bed0 --> The Managing Director mentioned plans to increase production capacity by 20% by the end of the next fiscal year.", "citations": ["653f58f3a0eb383be2d89e2e4b50bed0"]}, "['Q3', '2024']": {"answer": "efcbf5c8f3221e64f7433f9bc2b19a58 --> The CFO stated that capital expenditures are planned to be reduced by 20% over the next two quarters.\n\nd01aa7d3b73fedd007132102d0b72f82 --> The CFO stated that capital expenditures are expected to decrease by 20% over the next two quarters.\n\naf1e15693c3230b5a85cb9a45bd26440 --> Sanjay Gandhi stated that the asset turn will be sustainable within five to six levels in years to come, with a focus on the asset-light business model.\n\n0f33bc2d22ce058e23d2347e2ff45a4d --> The COO mentioned an increase in production capacity by 20% within the next six months.", "citations": ["efcbf5c8f3221e64f7433f9bc2b19a58", "d01aa7d3b73fedd007132102d0b72f82", "af1e15693c3230b5a85cb9a45bd26440", "0f33bc2d22ce058e23d2347e2ff45a4d"]}, "['Q4', '2023']": {"answer": "11af45531781a4cfd510e08f4310db80 --> The Managing Director stated that the company aims to increase its production capacity by 20% over the next two years.\n\nf44169c27e35437ce56fb5a98ea07254 --> The CFO stated that they plan to achieve a 10% increase in operational efficiency by the end of next fiscal year.\n\nf1011525f351f269b83e33dcce3170b9 --> The company aims for a 10% reduction in operating expenses by the second quarter of the next fiscal year.\n\n3151cac05da4e6882d2bd45448a146ec --> Sanjay Gandhi indicated plans to increase capacity by 35%-40% through factory extensions.", "citations": ["11af45531781a4cfd510e08f4310db80", "f44169c27e35437ce56fb5a98ea07254", "f1011525f351f269b83e33dcce3170b9", "3151cac05da4e6882d2bd45448a146ec"]}}}, {"topic": "Lean management practices", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Geographic diversification", "data": {"['Q1', '2023']": {"answer": "29c107285a519304cd73f45e13e17a6e --> The CEO outlined a plan to expand market presence in Southeast Asia within the next two years.\n\n8d9bee07e5adae0389c25eae623411a8 --> Pallab Banerjee indicated a change in geographic revenue mix, aiming to reduce reliance on the U.S. market, which currently constitutes more than 80% to 85% of their business.", "citations": ["29c107285a519304cd73f45e13e17a6e", "8d9bee07e5adae0389c25eae623411a8"]}, "['Q1', '2024']": {"answer": "4ecca2ecb7cfe53893e5821aa964e1bb --> The expansion of the Guatemala facility is planned over one year with the capex being spent in phases.", "citations": ["4ecca2ecb7cfe53893e5821aa964e1bb"]}, "['Q1', '2025']": {"answer": "488c849d4e050a2d30c198d39fc03a5f --> Mr. Pallab Banerjee (Managing Director) stated that they aim to open five new retail outlets by the end of the fiscal year.\n\na4e64deacc7271db162951732e072461 --> The company plans to start production in new states such as Bihar, Orissa, and Madhya Pradesh in the future.\n\nc2a9c25a332cc5d77b948201fa994b6c --> The speaker discussed that Bangladesh would have a GST benefit for European countries and the UK until 2029, assuming no changes occur.", "citations": ["488c849d4e050a2d30c198d39fc03a5f", "a4e64deacc7271db162951732e072461", "c2a9c25a332cc5d77b948201fa994b6c"]}, "['Q2', '2023']": {"answer": "ff567e475c1ea20d037dc72c1243f9de --> The CEO plans to maintain the strategy of providing seasonless products across the year to continue producing for seasons traditionally not covered by India.\n\nfc68b9b5fb45f0a303cedeca9d8b9123 --> The CEO announced an expansion plan to open 50 new stores by the end of the next fiscal year.\n\n12d5e887e84f47330da10662ca652200 --> The CEO announced a target to open 5 new retail outlets by mid-2023.", "citations": ["ff567e475c1ea20d037dc72c1243f9de", "fc68b9b5fb45f0a303cedeca9d8b9123", "12d5e887e84f47330da10662ca652200"]}, "['Q2', '2024']": {"answer": "e0add8a6759503f8d08045982206ab39 --> The COO outlined a plan to open 50 new stores by the end of the next fiscal year.\n\nea1c30d70d6e049ada1ce18299a60cf1 --> The COO announced plans to open 10 new retail outlets within the next six months.\n\n6253cf8e7ef2c4106e0b5f3f9ec40cae --> The management mentioned plans to compensate for forecasted declines by expanding into other regions with low exposure.\n\n963011c87f011c1fbbe5ed984d928efb --> Sanjay Gandhi mentioned that the acquisition joint venture in Guatemala has the potential to reach $20 to $25 million in a two-to-three-year time period.", "citations": ["e0add8a6759503f8d08045982206ab39", "ea1c30d70d6e049ada1ce18299a60cf1", "6253cf8e7ef2c4106e0b5f3f9ec40cae", "963011c87f011c1fbbe5ed984d928efb"]}, "['Q3', '2023']": {"answer": "8740431b66afa67483f1929f7bed9bf6 --> The CEO announced a plan to open 5 new retail outlets by the end of the current calendar year.\n\nbf9b574af30b07787ee3ce118eac759a --> Pallab Banerjee stated that the company will focus on a diversified customer mix globally to mitigate risk.", "citations": ["8740431b66afa67483f1929f7bed9bf6", "bf9b574af30b07787ee3ce118eac759a"]}, "['Q3', '2024']": {"answer": "553e7d94138c37f596c47a73d5e0987e --> The COO announced plans to open new retail outlets in key markets by next year.\n\n0f33bc2d22ce058e23d2347e2ff45a4d --> The CEO confirmed a target of 8 new store openings by the end of the current year.", "citations": ["553e7d94138c37f596c47a73d5e0987e", "0f33bc2d22ce058e23d2347e2ff45a4d"]}, "['Q4', '2023']": {"answer": "de4466cb6a65c51e3a4d4b796af3a43b --> Pallab Banerjee confirmed that in Central America, the company will be acquiring shareholding from the beginning itself.", "citations": ["de4466cb6a65c51e3a4d4b796af3a43b"]}, "['Q4', '2024']": {"answer": "1600e3dcc92b2346058463e9b98bdcc2 --> The Managing Director mentioned the expansion plan to increase production capacity by 20% within the next two years.\n\n7bc2d6d7f67c6394692bbfae6b1d9146 --> Pallab Banerjee outlined plans to enhance production capacity and expand facilities in various regions.", "citations": ["1600e3dcc92b2346058463e9b98bdcc2", "7bc2d6d7f67c6394692bbfae6b1d9146"]}}}, {"topic": "Strategic alliances and collaborations", "data": {"['Q4', '2023']": {"answer": "3a89ce82527c31cf2ad03690b1ac8761 --> Sanjay Gandhi mentioned potential growth within existing capacity over the next couple of years, with plans to explore opportunities for collaboration through partnerships, joint ventures, or brownfield acquisitions.", "citations": ["3a89ce82527c31cf2ad03690b1ac8761"]}, "['Q4', '2024']": {"answer": "731a807c527c0ef6c503fa11adeb86ab --> The management announced strategic plans and objectives for 2028.", "citations": ["731a807c527c0ef6c503fa11adeb86ab"]}}}, {"topic": "Market penetration strategies", "data": {"['Q1', '2023']": {"answer": "8873ae65d7c3a39390a459a6d2f9f51e --> The Managing Director stated that the company plans to expand its production capacity by 20% in the next fiscal year.", "citations": ["8873ae65d7c3a39390a459a6d2f9f51e"]}, "['Q1', '2024']": {"answer": "e37f985a968ddf590ae95c6e240e2f00 --> The CEO stated that Pearl Global Industries aims to increase its market share by 5% by the end of the next fiscal year.", "citations": ["e37f985a968ddf590ae95c6e240e2f00"]}, "['Q1', '2025']": {"answer": "6756334127e42b3827dc50e73e1fd710 --> The CEO stated that the company expects to increase its market share by 5% over the next fiscal year.\n\n948865a43350d20f34fce0654fc5bbab --> Sanjay Gandhi stated that the product mix is likely to be 60-40, with 60% woven and 40% knits business, and all projections till FY 28 are based on volume growth.", "citations": ["6756334127e42b3827dc50e73e1fd710", "948865a43350d20f34fce0654fc5bbab"]}, "['Q2', '2023']": {"answer": "dfa1f2f79b333b0dff965b910c4c0773 --> Sanjay Gandhi, Group CFO, mentioned that the company's strategy involves maintaining market share and enhancing it as the market improves.", "citations": ["dfa1f2f79b333b0dff965b910c4c0773"]}, "['Q2', '2024']": {"answer": "e0add8a6759503f8d08045982206ab39 --> The CEO announced a target to increase market share by 5% within the next 12 months.\n\nea1c30d70d6e049ada1ce18299a60cf1 --> The CEO stated that the company aims to increase its market share by 5% over the next year.", "citations": ["e0add8a6759503f8d08045982206ab39", "ea1c30d70d6e049ada1ce18299a60cf1"]}, "['Q3', '2023']": {"answer": "a2720f8f9f2d6d2486b03c23f478ebac --> The CEO stated that the company aims to achieve a 20% increase in market share by the end of the next fiscal year.", "citations": ["a2720f8f9f2d6d2486b03c23f478ebac"]}, "['Q3', '2024']": {"answer": "7796eb15d5140faeec101e509c130f27 --> The CEO mentioned a target to expand the company's retail presence by 20% in the next 12 months.\n\n6927a9ea9cd0277b4d515f47df26f852 --> Mr. Pallab Banerjee (Managing Director) stated a commitment to expanding production capacity by 20% by the end of the fiscal year.", "citations": ["7796eb15d5140faeec101e509c130f27", "6927a9ea9cd0277b4d515f47df26f852"]}, "['Q4', '2023']": {"answer": "eb693b06c774caf2af543f94ec352285 --> The speaker mentioned that US retailers are expected to buy between 15% to 25% conservatively for the spring-summer goods of 2024.", "citations": ["eb693b06c774caf2af543f94ec352285"]}, "['Q4', '2024']": {"answer": "107d04e46a56ce3b6d0eadce965c2fcc --> The CEO stated that the company expects to achieve a 20% increase in market share by the end of the year.", "citations": ["107d04e46a56ce3b6d0eadce965c2fcc"]}}}, {"topic": "Competitive positioning", "data": {"['Q2', '2023']": {"answer": "dba9b6a88bd1b047f72071ed90f8021d --> Pallab Banerjee mentioned the goal to maintain market share and a revenue run rate of approximately 800 Crores in H2.", "citations": ["dba9b6a88bd1b047f72071ed90f8021d"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New product launches", "data": {"['Q1', '2025']": {"answer": "b5ca0f8c2d8ecc8a4635d5698f929574 --> The CEO indicated a strategic goal of launching three new products by Q3 next year.", "citations": ["b5ca0f8c2d8ecc8a4635d5698f929574"]}, "['Q2', '2024']": {"answer": "cd2d6b434c7bbd8bcc5520b3cdfa094a --> The COO stated that Pearl Global Industries plans to launch three new product lines by Q3 2024.", "citations": ["cd2d6b434c7bbd8bcc5520b3cdfa094a"]}, "['Q3', '2024']": {"answer": "9b1f2084ffe891f5726709edffea34a5 --> The CTO outlined plans to launch three new product lines in the next 18 months.\n\nd01aa7d3b73fedd007132102d0b72f82 --> The CEO mentioned the launch of a new product line in Q3 of next year.", "citations": ["9b1f2084ffe891f5726709edffea34a5", "d01aa7d3b73fedd007132102d0b72f82"]}, "['Q4', '2024']": {"answer": "8d4dca406fab7aa8551329b2a3fb0d35 --> The CEO announced a goal to launch three new products by Q3 next year.", "citations": ["8d4dca406fab7aa8551329b2a3fb0d35"]}}}, {"topic": "Technology advancements", "data": {}}, {"topic": "R&D investment focus", "data": {"['Q3', '2024']": {"answer": "efcbf5c8f3221e64f7433f9bc2b19a58 --> The CEO announced an increase in R&D investment by 25% over the coming year.", "citations": ["efcbf5c8f3221e64f7433f9bc2b19a58"]}}}, {"topic": "Sustainable product lines", "data": {}}]}, {"theme": "Customer Engagement", "topics": [{"topic": "Loyalty program enhancements", "data": {}}, {"topic": "Customer feedback integration", "data": {}}, {"topic": "Service quality improvement", "data": {}}, {"topic": "Digital engagement channels", "data": {"['Q2', '2023']": {"answer": "12d5e887e84f47330da10662ca652200 --> The Head of Marketing mentioned plans to increase digital marketing spend by 30% in the next fiscal year.", "citations": ["12d5e887e84f47330da10662ca652200"]}}}]}, {"theme": "Geographic Expansion and Supply Chain Strategy", "topics": [{"topic": "Regional market dynamics", "data": {"['Q1', '2025']": {"answer": "c6d9d12a1e47b102cc08b7d5bb9f85f6 --> The management expects the improvement of apparel import numbers in the UK, European Union, and Japan in the second half of the year.\n\ne94d770b81ec2b51a517d6367da4d4d7 --> Parth Patel from Unifi Capital mentioned a plan for INR500 crores capex over the next 2 to 4 years, which was discussed during the last Analyst Day in February.\n\nb5b3ea576e9bd718f935d35b1ccb54d9 --> Pallab Banerjee mentioned that part of the new capacity in Bihar will be ready and operational this year, and part will be operational next year.", "citations": ["c6d9d12a1e47b102cc08b7d5bb9f85f6", "e94d770b81ec2b51a517d6367da4d4d7", "b5b3ea576e9bd718f935d35b1ccb54d9"]}, "['Q2', '2024']": {"answer": "584e1e69bf370a7260a1ca6dff7c82ac --> Sanjay Gandhi stated that the company is planning a CAPEX in excess of +120 crores for Financial Year ‘24 across geographies.", "citations": ["584e1e69bf370a7260a1ca6dff7c82ac"]}}}, {"topic": "Supply chain diversification", "data": {"['Q1', '2025']": {"answer": "e94d770b81ec2b51a517d6367da4d4d7 --> Pallab Banerjee stated that the capex will be spread across Bangladesh, India, Vietnam, Indonesia, and Guatemala, with an emphasis on moving or adding factories in lower-cost regions in India.", "citations": ["e94d770b81ec2b51a517d6367da4d4d7"]}, "['Q2', '2023']": {"answer": "829412629727c48c3c59c58fa63de671 --> Pallab Banerjee mentioned plans to expand into additional supply chains in the future.", "citations": ["829412629727c48c3c59c58fa63de671"]}, "['Q4', '2023']": {"answer": "dba863b436750be3d213131e67e05460 --> The management expects to finalize near shore manufacturing opportunities in the capital region of Central America in the next couple of months.", "citations": ["dba863b436750be3d213131e67e05460"]}}}, {"topic": "Expansion under PLI scheme", "data": {"['Q1', '2023']": {"answer": "4e6825dd4c3af7d9b8cc7dd622ee4159 --> The company plans to explore the PLI scheme as part of its growth engine in India.", "citations": ["4e6825dd4c3af7d9b8cc7dd622ee4159"]}, "['Q1', '2025']": {"answer": "6142ba319177aacea67de057db564354 --> Sanjay Gandhi mentioned that the capital expenditure commitment for capacity addition in India and Bangladesh will start happening in the next two to three months.", "citations": ["6142ba319177aacea67de057db564354"]}, "['Q2', '2024']": {"answer": "508e24c3171023a1a4b04be56b9c684f --> Sanjay Gandhi stated that 40%-45% of the remaining CAPEX will be incurred in the rest of the year, with specific mention of the capacity expansion in India being 80% incurred by the end of the year.", "citations": ["508e24c3171023a1a4b04be56b9c684f"]}, "['Q3', '2023']": {"answer": "0f79bbe4d3f8b05f38c9fd5ccad9ab26 --> Pallab Banerjee mentioned that the direct benefit from the PLI scheme will start once new investment ships more than INR 200 crores of goods, which is still a couple of years away.\n\naeaac283e4ffa3a388ccf4543097d259 --> Sanjay Gandhi mentioned the potential for expansion under the PLI scheme or expansion under existing units in India.", "citations": ["0f79bbe4d3f8b05f38c9fd5ccad9ab26", "aeaac283e4ffa3a388ccf4543097d259"]}}}, {"topic": "International market opportunities", "data": {}}]}, {"theme": "Risk Management", "topics": [{"topic": "Geopolitical risk mitigation", "data": {}}, {"topic": "Regulatory compliance", "data": {}}, {"topic": "Macro-factor considerations", "data": {"['Q1', '2023']": {"answer": "42db40361950cc068bef72277d07496b --> Pallab Banerjee confirmed that the company's strategy is to maintain a margin of around 7.8% or 8% for the whole year, assuming macro risks do not become too significant.", "citations": ["42db40361950cc068bef72277d07496b"]}, "['Q1', '2024']": {"answer": "c7541ce7a4d566b8936a4b6c285166ab --> Sanjay Gandhi indicated that there will be no loss expected due to currency depreciation affecting the balance sheet.\n\nc6795cd2ea0daa70c5d1a21e78fd951f --> Pallab Banerjee indicated that the company expects the fund rate achieved in Q1 to continue in the second half of the year, barring unforeseen global events.", "citations": ["c7541ce7a4d566b8936a4b6c285166ab", "c6795cd2ea0daa70c5d1a21e78fd951f"]}, "['Q3', '2023']": {"answer": "03cf4e473ca6ec8116b0c9b717f3c80a --> Pallab Banerjee mentioned the company's commitment to continue delivering on their promises despite fluctuating conditions and unfavorable macro factors.", "citations": ["03cf4e473ca6ec8116b0c9b717f3c80a"]}}}, {"topic": "Risk governance framework", "data": {}}]}, {"theme": "Sustainability and ESG Initiatives", "topics": [{"topic": "Renewable energy adoption", "data": {}}, {"topic": "Carbon footprint reduction", "data": {"['Q1', '2024']": {"answer": "9a08802e49df321601fb65788dd7843d --> The CEO outlined a target of achieving carbon neutrality by 2025.", "citations": ["9a08802e49df321601fb65788dd7843d"]}, "['Q3', '2024']": {"answer": "553e7d94138c37f596c47a73d5e0987e --> The CEO outlined a target for carbon emission reduction by the end of 2025.", "citations": ["553e7d94138c37f596c47a73d5e0987e"]}}}, {"topic": "Sustainable supply chain strategies", "data": {}}, {"topic": "Social responsibility initiatives", "data": {}}]}, {"theme": "Communication and Investor Relations", "topics": [{"topic": "Management transparency", "data": {"['Q1', '2023']": {"answer": "27802b8e8c4dc7d621dbc6cd4af5fa9b --> There is no specific guidance present in the transcript provided with clear metrics, timelines, or actionable plans.", "citations": ["27802b8e8c4dc7d621dbc6cd4af5fa9b"]}, "['Q3', '2023']": {"answer": "602b8af623cf1e5bd3ef97ab6e3e267c --> There is no specific guidance provided in the transcript regarding future metrics, goals, or plans with clear numbers, timelines, or actionable objectives.", "citations": ["602b8af623cf1e5bd3ef97ab6e3e267c"]}}}, {"topic": "Investor engagement", "data": {}}, {"topic": "Conference call protocol", "data": {}}, {"topic": "Stakeholder communication strategies", "data": {}}]}]