[{"theme": "Financial Performance", "topics": [{"topic": "Revenue Growth", "['Q1', '2023']": {"answer": "eb6d1317160d2491c4d29693ead3f57f --> Moderator: The company is on track to achieve a run-rate of INR 7.5 lac crore by the end of FY24.\n\n0ec257796349d74ab04cde2a2a44f5aa --> Vishal Mehta; Managing Director: “With these developments and a steep increase in our Total Processed Value of INR 87,218 crore, we are looking at a stretch of healthy quarters.”\n\n0e5237e10adf96f5f454ba6e919c8fb2 --> Ready to Capture the Bigger Pie\nAccelerating towards our Guidance of $100bn by the end of 2024\nTransaction Processing Value (TPV) $19 billion\nINR 1,39,400 crore\n$50 billion\nINR 3,73,424 crore\nFY21 Q1\nFY23 annualised.\n\nd641f231759b349fc9cf9f8b56c6d427 --> Document states: TPV ~INR 4.0 lac crore $53 bn\n\nd641f231759b349fc9cf9f8b56c6d427 --> Document states: Gross Revenue ~INR 1,600-1,700 crore\n\ncda80a58de352eb756634532d1c7b45a --> Board Member: GeM has achieved another milestone by crossing an annual transaction value of 1 lakh crore in FY 2021-22.\n\ncda80a58de352eb756634532d1c7b45a --> Board Member: GeM crossed INR 50,000 crore in 123 days in FY23 vs. 224 days in FY22.\n\nf640563ebcdf11ddb7161921ea19aeae --> Mr. Vishal Mehta: We are targeting a 15% growth in revenue for the next fiscal year.\n\nd9816ccae6b43ea6e6471e90b929cfbe --> Moderator: Given the first quarter statistics by RBI and extrapolating it for the full year, it is expected to cross Rs.50 trillion rupees FY23.\n\ncf865948e82daaecb57ae8a3fd022a0e --> Page 4 of 17: The value of digital payments is expected to reach three fold from 3 trillion today, to US 10 trillion by 2026.\n\ne7a18921d76102447e3b400558ab6b4a --> Vishal Mehta: We’ve been growing at about 8000 merchants per day. And with a rich blend of offerings which will allow us to boost our earnings across millions of merchants all over Fintech solutions are also fueling our expansion to our goal of achieving a transaction processing value run rate of 7.5 lakh crore by end of FY24.\n\n5400d8ef85515f202d307c77b1723394 --> Board Member : We’d also forward communicated that saying that we expect the take rates to improve quarter-over-quarter as we go forward.\n\n99b244d3356659d31a1ec89be7a6dfcb --> Vishal Mehta: We expect that maybe we will be able to cross more than a billion dollars of financing there.\n\nf88dffeda7c1cc7b01bf384328d888a2 --> Vishal Mehta: If we look at our projection by FY24, we expected to do a transaction processing volume of $100 billion.\n\n0e8a0a3479275ee6f77a5f0ec3cea880 --> Any of these implementations, we will be able to help them process more than a billion dollars of loans in this coming year.\n\n60e65e6f8792f0208c207bff932bb82e --> Vishal Mehta: \"So, again, it’s reasonable to expect that Q3 will see a significant improvement as well in the digital payments business compared to the first two quarters of 23.\"", "citations": ["eb6d1317160d2491c4d29693ead3f57f", "0ec257796349d74ab04cde2a2a44f5aa", "0e5237e10adf96f5f454ba6e919c8fb2", "d641f231759b349fc9cf9f8b56c6d427", "cda80a58de352eb756634532d1c7b45a", "f640563ebcdf11ddb7161921ea19aeae", "d9816ccae6b43ea6e6471e90b929cfbe", "cf865948e82daaecb57ae8a3fd022a0e", "e7a18921d76102447e3b400558ab6b4a", "5400d8ef85515f202d307c77b1723394", "99b244d3356659d31a1ec89be7a6dfcb", "f88dffeda7c1cc7b01bf384328d888a2", "0e8a0a3479275ee6f77a5f0ec3cea880", "60e65e6f8792f0208c207bff932bb82e"]}, "['Q2', '2022']": {"answer": "456c7c0a9a93bef32b69d0568ab8eca0 --> GeM CEO: GeM to achieve GMV of INR 2tn ($27bn) in FY23 (Source: GeM CEO in exclusive with Financial Express).\n\nc16921dbb183c7e9c7fd2dd836b7e5e8 --> Total TPV up 111% YoY\nSep’21-based annualised Total TPV run-rate of $40bn\navg. daily run-rate Rs. 800 cr ($110mn)\nAccelerating towards our guidance of $100bn.\n\nc16921dbb183c7e9c7fd2dd836b7e5e8 --> Secured lending up >3x QoQ to Rs. 1150 cr ($156 mn)\nAnnualised run-rate >$600mn\nTargeting annualised run-rate of $1bn by end of FY22.\n\n78c91d1b3c2ac2b41f73dc6fae71c169 --> Board Member: Increase in card transactions, opening up of travel & hospitality sectors and increase in discretionary spends will contribute to higher NTR going forward.\n\n78c91d1b3c2ac2b41f73dc6fae71c169 --> Board Member: Large enterprise wins will allow for cross-sell of various fintech solutions within our portfolio increasing wallet share and hence NTR; B2B payments, neo-banking, lending, corporate cards, remittances, and more.\n\n0b716e4721e898604ee11414217324d3 --> Board Member: Mid-term (3 yrs.) targeting annual lending of $5bn.\n\n0b716e4721e898604ee11414217324d3 --> Board Member: Lending contribution to increase in next 3-5 years; secured lending, working capital, & more.\n\n552fe38f4c7a9e32482a7037f75f5e32 --> Board member: Our annualised run-rate based on the September 2021 run-rate is projected to reach 90 million.\n\n715cf79cd0027a3ffc4607b697379f14 --> In an article by financial experts this month GEM had mentioned that they will easily achieve a gross merchandising value (GMV) of Rs.1 trillion, approximately $14 billion, in FY2021 itself versus $10 billion it targeted earlier, even without the integrations of Indian Railways and others, and it will double its GMV to Rs. 2 trillion, approximately $28 billion, in FY2023.\n\n40b11135cee255e4e65b50a0b7d8c517 --> We will work towards narrowing the credit gap that exists in India today which is worth over $250 billion, as per World Bank.\n\n93c15a3018e9b7aea21d9e8ac210499d --> Mr. Vishal Mehta: From a transaction processing volume of $19 billion in FY2021 we are now at an annualized run rate of $40 billion which is split as $25 billion from digital payments and about $15 billion.\n\n972d794e59aee08cc59c43d7a24f310f --> Board Member: We aim to do $100 million a month as we exit in FY2022 and achieve an annual run rate of over $1 billion, in other words, we have just increased our guidance from earlier $200 million to $1 billion this year itself.\n\n378d72febff4849114947f39e4e974ea --> Srikanth Rajagopalan: Right now, we are focusing on the TPV based revenues and TPV based revenues more the TPV because as an organization, as a business we are fine tuned actually for the TPV increase and the throughput is basically a measure of success. We always believe that higher the TPV higher the revenues and so on.\n\nfdb5d3dd38823a0cc8a9446a03ad47d6 --> We need to apply a larger investment to this businesses to be one of the top Fintech companies in the country.\nIn this regards we are looking forward to raising capital through primary mode as growth capital.\n\n8c86f3fe8dfdd186d5a61c6711b893bb --> Srikanth Rajagopalan: ...we did not visualize that we will touch $1 billion by the end of this fiscal and I think we maybe touching actually $1 billion as a secured lending itself in this fiscal by the end of this fiscal.\n\n91c1365d4be3926be8efd377f762a61e --> Purvesh Parekh: Yes. So, this quarter we have done secured lending to the extent of $156 million as three times what we have done in the quarter one and it has given a guidance of $1 billion by the time we exit the financial year FY2022.\n\n91c1365d4be3926be8efd377f762a61e --> Srikanth Rajagopalan: ...we guided the market that we will do by the end of this fiscal $200 million which is 2x and based on our Q1 and Q2 performance... by the end of this fiscal year we will be little over a $1 billion...\n\nebef9942862061bab5a4c1618cdb9220 --> Srikanth Rajagopalan: I will give you a little bit of data and we are right now doing Rs. 800 crores per day or Rs. 600 crores per day in terms of processing so what we are doing actually for $1 billion means Rs. 25 Crores per day so Rs. 25 Crores per day resulting into $1 billion loan size so out of our capability of $600 million so Rs.600 Crores per day to Rs.25 Crores per day so that is basically the growth opportunity in this piece.\n\nd24f016e11796e39d6e8820c2b187a91 --> Mr. Smith: Our goal is to achieve a 10% increase in revenue for the next fiscal year.", "citations": ["456c7c0a9a93bef32b69d0568ab8eca0", "c16921dbb183c7e9c7fd2dd836b7e5e8", "78c91d1b3c2ac2b41f73dc6fae71c169", "0b716e4721e898604ee11414217324d3", "552fe38f4c7a9e32482a7037f75f5e32", "715cf79cd0027a3ffc4607b697379f14", "40b11135cee255e4e65b50a0b7d8c517", "93c15a3018e9b7aea21d9e8ac210499d", "972d794e59aee08cc59c43d7a24f310f", "378d72febff4849114947f39e4e974ea", "fdb5d3dd38823a0cc8a9446a03ad47d6", "8c86f3fe8dfdd186d5a61c6711b893bb", "91c1365d4be3926be8efd377f762a61e", "ebef9942862061bab5a4c1618cdb9220", "d24f016e11796e39d6e8820c2b187a91"]}, "['Q1', '2022']": {"answer": "953bbbf130d1ebfdac4e251d0d0170d6 --> Speaker (not specified): FY22E volume at 64 mn above projected volume of 60 mn.\n\n83da8f853e7c5407f08bf834856f9981 --> Express Settlement crossed US$ 50mn in Q1; at 2x the run-rate projected for FY22.\n\n83da8f853e7c5407f08bf834856f9981 --> Net revenue INR 52 crore up 3% YoY.\n\n83da8f853e7c5407f08bf834856f9981 --> Transaction Net Revenue INR 34 crore up 55% YoY.\n\n495d7ac744fb65a5f5bdea963c17c11b --> As guided, on track to process TPV of INR 2 trillion (US$ 28bn) during FY22.\n\nbfed4a97f823339c92af98d68d3b26c1 --> Board member: Payments TPV (INR crore) 95,181, showcasing a 13x growth from FY'16 to FY'21.\n\nbfed4a97f823339c92af98d68d3b26c1 --> Board member: AED 2.8 billion in payments processed in the UAE for FY'21, up 72% from AED 1.7 billion in FY'20.\n\n78ce721e6d10a76424ae3cf1a274d1d5 --> FY22 annualised run-rate based on Q1’22 run-rate: 64 mn\n\neb10df1fb51d8cd96d0d92dca6f6cf25 --> Mr. Vishal Mehta: \"We are targeting a 15% increase in our revenue by the end of this fiscal year.\"\n\n879e2f30478b4e719c1f98b20ee3d0f5 --> [Speaker Name Not Provided] : \"In this trend continues where people institutions or organizations are adopting digitalization at such a fast pace we may soon process more than $100 billion worth of digital transactions.\"\n\n7c194916517240505ddc319b85570576 --> Board Member: \"With this, the overall monthly digital payment in India, as defined by RBI, could reach US $10 trillion in FY2031 from the $2.4 trillion in March 2021.\"\n\n6e265aaa706eecbdd62795fa871743b5 --> Ravi: We have already guided the market that we will double the run rate of our express settlement from $100 million to $200 million.\n\nb6d5b363b274c3ef358372b74721aef8 --> Vishwas: Our other investments are in RemitGuru, which is now Fable Fintech, which is already doing around $11 billion of inward remittances.\n\n6e15f6ba2776e766157773cbe04b68f2 --> Srikanth: Yes and no, that is basically forming part of our business because our growth of FY2021 was $19 billion and today we are talking about $28 billion to $29 billion.", "citations": ["953bbbf130d1ebfdac4e251d0d0170d6", "83da8f853e7c5407f08bf834856f9981", "495d7ac744fb65a5f5bdea963c17c11b", "bfed4a97f823339c92af98d68d3b26c1", "78ce721e6d10a76424ae3cf1a274d1d5", "eb10df1fb51d8cd96d0d92dca6f6cf25", "879e2f30478b4e719c1f98b20ee3d0f5", "7c194916517240505ddc319b85570576", "6e265aaa706eecbdd62795fa871743b5", "b6d5b363b274c3ef358372b74721aef8", "6e15f6ba2776e766157773cbe04b68f2"]}, "['Q3', '2022']": {"answer": "62eda584b7c873b7250e19492955da0e --> Moderator: Scaling of new businesses in the next 2-3 years will increase Net Revenue / NTR and hence operating margins.\n\n62af5eb83efecfeee505840b57a96cf7 --> Dec’21-based annualised total TPV run-rate of ~$41bn; ahead of our guidance of $40bn set for Dec’21.\n\n62af5eb83efecfeee505840b57a96cf7 --> GeM GMV up 182% YoY; Targeting INR 1 tn ($14 bn) for FY22 & INR 2 tn ($27bn) in FY23*.\n\n62af5eb83efecfeee505840b57a96cf7 --> Accelerating towards our guidance of $100bn.\n\n62af5eb83efecfeee505840b57a96cf7 --> Targeting annualised run-rate of $1bn by end of FY22.\n\n1ae84b2319c50fc07cf756f49faf0221 --> Mr. Smith: We are targeting a revenue growth of 15% for the next fiscal year, which we believe is achievable with our current strategies and market conditions.\n\nd15deacdb0ef1cf69eefef25c32e80cb --> Board Member: We are guiding an AED 4 billion+ TPV run-rate for FY22E, which represents a 40% increase from the AED 3 billion we guided in FY21.\n\nc371ecbe20facc86541200909f46393c --> Moderator: Lending contribution to revenue will increase in next 3-5 years.\n\nf4f1f22879bff8890e7c712b0cb7125b --> Board Member: Mid-term (3 yrs.) targeting annual lending of $5bn.\n\nfd1f184710e4bcdd8daab3b46f3b86fe --> Annualised run-rate run-rate: 93 mn\n\n995ba13d1bb8097911b6f3837ce4b8c6 --> GeM: In FY2022, the order value is estimated to be INR 1 lakh Crores, which is projected to double by FY2023.\n\naa6adc0aeb93d3d0135969d38bbd31c1 --> Board member: Our secured lending is up from $150 million in Q2 to $175 million in Q3, and is at a run rate of $700 million, 3x ahead of our FY2022 guidance of $200 million. We are targeting $1 billion run rate by end of March 2022.\n\na29bd898977d3de9e60e829460afcaa0 --> R. Srikanth: We are inching closer towards achieving the total TPV of INR 1000 Crores on an average per day which we plan to achieve by the end of March 2022 and then double it in FY2023.\n\nba853500c87bec52e1ce23cdb932bc84 --> We have already given guidance of $100 billion in the next three years, so this will help expedite our growth rate.\n\nba853500c87bec52e1ce23cdb932bc84 --> Vishwas Patel: \"We have already given guidance of $100 billion, more than double from $41 billion run-rate. It will go more than double than what we are and even more further, so it depends on how far we are able to aggressively market and which we are going to do but it will double from the current TPV that we have and even the merchant base we expect to double.\"\n\nda330803d6f88c0ce87b778d55b11784 --> Srikant: And lending will be the revenue and margin growth driver in the next two to three years time as we scale.\n\n95914e63e43857273f366e7afa49c176 --> Board Member: ...all our strategy which we mentioned actually and execution we mentioned this call, it is all actually going towards achieving $100 billion total TPV and that is basically a unique target and mantra for the company...\n\ncfb02235e8808862f41f11b0cf099111 --> Infibeam Avenues Limited: mentioning we are not a capital asset centric company and therefore that for all practical purpose with the existing asset that we will be able to really gear up our work existing guidance of 100 billion TPV in three to five years timeframe that is what we guided.\n\n11390b65fc57ff37fc393b98f6b604d8 --> R. Srikanth: Number two, the loan look of $175 million which is equivalent to almost $700 million, we are heading towards $1 billion.\n\nf8ca09d643676305d036df1b6fe5a8fe --> R. Srikanth: This is the growth driver which we are talking about in the last two quarters, and we talked about it in the beginning of this year that we will double our express settlement in terms of growth driver and we are actually about instead of 2x we are about almost 4x.", "citations": ["62eda584b7c873b7250e19492955da0e", "62af5eb83efecfeee505840b57a96cf7", "1ae84b2319c50fc07cf756f49faf0221", "d15deacdb0ef1cf69eefef25c32e80cb", "c371ecbe20facc86541200909f46393c", "f4f1f22879bff8890e7c712b0cb7125b", "fd1f184710e4bcdd8daab3b46f3b86fe", "995ba13d1bb8097911b6f3837ce4b8c6", "aa6adc0aeb93d3d0135969d38bbd31c1", "a29bd898977d3de9e60e829460afcaa0", "ba853500c87bec52e1ce23cdb932bc84", "da330803d6f88c0ce87b778d55b11784", "95914e63e43857273f366e7afa49c176", "cfb02235e8808862f41f11b0cf099111", "11390b65fc57ff37fc393b98f6b604d8", "f8ca09d643676305d036df1b6fe5a8fe"]}, "['Q1', '2024']": {"answer": "52bd021dc2b55c750963a94229a6c2fb --> Document states: \"Targeting double digit NTR for Payments business by the end of FY24.\"\n\n52bd021dc2b55c750963a94229a6c2fb --> Document states: \"Net Revenue  Gross Revenue  INR 410-415 crore  INR 3,000-3,300 crore  (up 25%-26% YoY)  (up 53%-68% YoY)\"\n\nfa3b05a941ef1a76e0d8a1efdf93329b --> INFIBEAM N AVENUES: P2M Digital Payments in India to reach US$ 3 trillion by 2028, growing at 25%.\n\neab1022fe7ea8578888b5e80f1b2ddf6 --> Moderator: We have plans targeting 12-15% international contribution to Payment’s Net Revenue by FY28.\n\n2b898134deaf906b8902fbba8f8626c8 --> Projected FY28 P2M Industry Size (@25% 5yr CAGR) ~INR 225 lac cr (approx. $3 tn) 3x from FY23 Estimated FY28 Industry Revenue >INR 1,00,000 cr ($16.0 bn).\n\n2d5b2336c323a03137b1d08e116a552a --> Vishal Mehta: I'm also very confident about achieving this year's guidance that we have shared with you in our presentation on slide #3 of the presentation and in our press release.\n\nce92f1f0dca39b580a32923c2b3ef235 --> Moderator: We expect revenues to come in between INR 3,000 to INR 3,300 crores which is the gross revenue.\n\nce92f1f0dca39b580a32923c2b3ef235 --> Moderator: Net revenue for the year at about INR 410 to INR 415 crores.\n\nce92f1f0dca39b580a32923c2b3ef235 --> Moderator: Gross revenue growth will be about 50% to 70% year-over-year.\n\nce92f1f0dca39b580a32923c2b3ef235 --> Moderator: Net revenue will see anywhere between 25%.\n\nc689fba167e3ada8380e678d3c48460c --> But we are hopeful that Q2 onwards with the onset of festivities and later followed by the travel season, the take rates will improve and move towards our guided double-digit figures by the end of the year.\n\n390605f5732c7923b12261c9725a242d --> We continue to work towards taking our net take to double digits. We have highlighted on Slide #9 short to medium term key focus areas on how we are planning to take it to double digits.\n\nc1a35591c87ad10cbb2bbc8287e6a964 --> Speaker (not specified): While we are at 8.4 basis points, we'd like to get the take rate to go into double digits with a combination of international expansion and TapPay.\n\ndc4fd77fc32523f0b5b5ae87f61baf55 --> Vishal Mehta: We've discussed that we want to get to a point where we get to $100 billion in processing in the next couple of years... We would like to allow it to grow to a 30% number.\n\nab251550a907597633297011724ad144 --> Vishal Mehta: \"So, now that we can do $1 billion, we think that we can go to $10 billion.\"\n\nab251550a907597633297011724ad144 --> Vishal Mehta: \"So, we think that international can potentially become 30% or more of our overall payment revenues.\"", "citations": ["52bd021dc2b55c750963a94229a6c2fb", "fa3b05a941ef1a76e0d8a1efdf93329b", "eab1022fe7ea8578888b5e80f1b2ddf6", "2b898134deaf906b8902fbba8f8626c8", "2d5b2336c323a03137b1d08e116a552a", "ce92f1f0dca39b580a32923c2b3ef235", "c689fba167e3ada8380e678d3c48460c", "390605f5732c7923b12261c9725a242d", "c1a35591c87ad10cbb2bbc8287e6a964", "dc4fd77fc32523f0b5b5ae87f61baf55", "ab251550a907597633297011724ad144"]}, "['Q1', '2025']": {"answer": "0c6316cea4c358c7ae360cd17f427733 --> Board Member: Infibeam invests USD 10 million to penetrate the US market with CCAvenue Payment Gateway and PhroneticAI Solutions, targeting 30% revenue contribution within two years and reshaping AI-powered fintech solutions.\n\n1e3492674ff6060427579a1201a44a10 --> Guidance FY25 Well-poised for Growth: Net Revenue INR 39,000 - 42,000 million (up 5% - 17% YoY).\n\n1e3492674ff6060427579a1201a44a10 --> Guidance FY25 Well-poised for Growth: Gross Revenue INR 4,500 – 5,000 million (up 23% - 32% YoY).\n\n780f72136f92fcc9d93cdc053fe27456 --> Document: \"Estimated FY28 Industry Revenue3 >INR 1 tn ($16.0 bn) >20% Estimated YoY FY25\"\n\n796dbc9c117d92dca0042dabe2b6f2a5 --> Board Member: We are targeting 12-15% international contribution to Payment’s Net Revenue by FY28.\n\nb6a543f64b74d5760c91e49bfc6faf6f --> Mr. Sunil Bhagat: We expect our revenue to grow by 15% in the next quarter.\n\nab55ecb7e842752961ca4f446ffcb9b8 --> Vishwas Patel: In 2025, we have projected revenue growth of approximately 25%, 30%.\n\n8f77e5600694d3ef96eeb9d4160874f6 --> Sunil Bhagat: For the full year, we expect our other value-added services include distribution of our financial products to contribute 2% to 4% of our revenue this year, going to around 7% to 10% in a couple of years.\n\n50a32ec9cac0283feb01c1eaf1debcae --> Vishal Mehta: In terms of the revenue guidance, we have given that the lower end guidance in terms of gross revenue will be -- and if you look at Slide #12 -- 11, sorry, 12, you will see the guidance for gross revenue, net revenue EBITDA impact that we have given for this year.\n\n50a32ec9cac0283feb01c1eaf1debcae --> Vishal Mehta: In terms of transaction processing volume, TPV, we expect that there is going to be an increase -- we hope that this coming quarters will be much larger compared to what you have seen in Q1. So we expect that in Q2 and Q3, you will see a substantial increase in TPV.\n\nc789a7fa1db9c499cddfcf1cf5b16eb7 --> Vishal Mehta: \"So we believe that, that will be, we call it, value-added services. And through that value-added services, we expect that we should be able to generate 2% to 4% of the revenues of this year through value-added services, which would substantially increase to 7% to 10% in coming years.\"\n\n7b8b500f4cd4baf0876be697c45df8df --> Deepesh Sancheti: Okay. Sir, just wanted to clarify one thing that the previous -- in your previous calls, you had mentioned that the international business would contribute to about 30% of your total income.\n\n4fe97de6518fa82b87293cccd723acb9 --> Vishal Mehta: \"And the 12% to 15% number is in this particular financial year.\"\n\nc0b85e026a1ca267ce0a573da89eb357 --> Rahul Jain: \"In terms of our aspirations, we think it should be 2% to 4% -- the value-add services itself should contribute 2% to 4% of our revenue, and that is very high EBITDA margins. So that's our aspiration for this year. And in coming quarters, maybe in a couple of years, we should reach anywhere between 7% to 10%, in terms of these revenues generated out of value-added services.\"", "citations": ["0c6316cea4c358c7ae360cd17f427733", "1e3492674ff6060427579a1201a44a10", "780f72136f92fcc9d93cdc053fe27456", "796dbc9c117d92dca0042dabe2b6f2a5", "b6a543f64b74d5760c91e49bfc6faf6f", "ab55ecb7e842752961ca4f446ffcb9b8", "8f77e5600694d3ef96eeb9d4160874f6", "50a32ec9cac0283feb01c1eaf1debcae", "c789a7fa1db9c499cddfcf1cf5b16eb7", "7b8b500f4cd4baf0876be697c45df8df", "4fe97de6518fa82b87293cccd723acb9", "c0b85e026a1ca267ce0a573da89eb357"]}, "['Q2', '2024']": {"answer": "b831d83702f0ff472fcd24b05a90565b --> Board Member: Payment net take rate 9.3 bps; inching closer towards targeted double digit take rate by the end of FY24.\n\n1b23c4162488a4f09fcfa59eca4ab830 --> Speaker name not provided\n\n1b23c4162488a4f09fcfa59eca4ab830 --> Speaker name not provided\n\n1b23c4162488a4f09fcfa59eca4ab830 --> Speaker name not provided\n\n6dee987100b88448061e2ddf751a1fa2 --> Board Member: We plan to increase the 'net take rate' in the Payments business to double digits from the end of FY24 onwards.\n\nef4ffec897984a3983fc287faef63b66 --> Board Member: We are targeting 12-15% international contribution to Payment’s Net Revenue by FY28.\n\n2b8d142ef090c040568886ac69f71e42 --> Source/Document: P2M Digital Payments in India to reach US$ 3 trillion by 2028, growing at 25%\n\n95610f999befe89b75a988964ceed224 --> Ms. Sharma: Our strategic initiatives and market expansion efforts are projected to result in a 15% revenue growth for the upcoming fiscal year.\n\n6a4ba29f78f85f4740633523dac49cac --> Sunil Bhagat: With a capital infusion of INR1.6 billion through my family's venture fund, we plan to grow the payments business in India as well as in the international market.\n\nea0776ab5d62c5ecbbe909827abdbaba --> Board Member: We believe that we should be around the take rates of double digits of 10 basis points by end of this year.\n\n8f9e53b8df65a38d4c2160e36d1d8987 --> Vishal Mehta: Earlier in the year, we had actually given a guidance that the company wants to achieve a net take rate of 10 basis points and specifically in the domestic market. International take rates are much larger and higher. We'll go at about 18 basis points to 20 basis points in the international market.\n\n8f9e53b8df65a38d4c2160e36d1d8987 --> Vishal Mehta: A combination of that, we have guided the investors that we are looking at achieving a double-digit take rate by end of '24.\n\ne383c6527eb8e73ce5b8b1dd864140d9 --> The company's payment net take rates experienced a significant increase in quarter 2 of FY '24.\nThat is up by 25% year-over-year to 9.3 basis points and primarily due to substantial influx of small merchants, who in turn made the most substantial contribution to the surge in the Infibeam Avenues' payment business and net take rates.\nPayment net take rates is now inching closer to the targeted double-digit take rate by the end of FY '24.\n\nbef8c80ece47aca81988b28da4405e95 --> Board Member: You could assume that international is going to be our focus. We talked about international being a percentage of our revenue to go from sub-10% to 30% of our revenues.\n\n76fd61137903fb31eb4bc9b0062166fc --> Vishal Mehta: It's reasonable to assume that as we scale up, we will have a INR3 million to INR5 million capex per geography.\n\nded4bd4b6c6f94b21d2a3202f5e8a0c7 --> Board Member: But you can expect the returns to show up in the next couple of years.\n\n108469baf0c0802b2ffc08275ddc310e --> Vishal Mehta: I mean, second half usually has festivals. And in terms of payments and many other activities, they kind of scale up in the second half compared to the first half. So we're usually, we don't have a typical Christmas holiday effect that you would see in the US. But we typically see much better business opportunity in the second half compared to the first one, so you're right.\n\nb4ece03f895f3ed84b3c4d5706ac442e --> Vishal Mehta: And we've given guidance that we'll increase it to double digits through a series of activities that we believe can potentially help us scale it up in this competitive environment.", "citations": ["b831d83702f0ff472fcd24b05a90565b", "1b23c4162488a4f09fcfa59eca4ab830", "6dee987100b88448061e2ddf751a1fa2", "ef4ffec897984a3983fc287faef63b66", "2b8d142ef090c040568886ac69f71e42", "95610f999befe89b75a988964ceed224", "6a4ba29f78f85f4740633523dac49cac", "ea0776ab5d62c5ecbbe909827abdbaba", "8f9e53b8df65a38d4c2160e36d1d8987", "e383c6527eb8e73ce5b8b1dd864140d9", "bef8c80ece47aca81988b28da4405e95", "76fd61137903fb31eb4bc9b0062166fc", "ded4bd4b6c6f94b21d2a3202f5e8a0c7", "108469baf0c0802b2ffc08275ddc310e", "b4ece03f895f3ed84b3c4d5706ac442e"]}, "['Q3', '2023']": {"answer": "794163040289e805ff693d88cf8890e7 --> Moderator: GeM TPV crossed INR 1.5 Lac crore by end of January, targets INR 2 lac crore ($24 bn) for FY23, 2x FY22.\n\n3fb159775602b254962e36276595af7d --> The statement \"Ready to Capture the Bigger Pie  Targeting INR 7.0-7.5 lac crore  TPV run-rate in FY25\" implies guidance.\n\n3fb159775602b254962e36276595af7d --> The statement \"GeM platform doubling every year; crossed INR 100,000 crore in November 2022. Order value to double by end of FY23, as per GeM\" implies guidance.\n\n995dcc5760faea504062a5b6527b486f --> Board Member: We are anticipating our Transaction Processing Value to be INR 4.0 lac crore, which is a 37% increase year-over-year.\n\n995dcc5760faea504062a5b6527b486f --> Board Member: Our Gross Revenue projection for FY23 is between INR 1,600 crore and INR 1,700 crore, marking an increase of 24% to 31% year-over-year.\n\n956f72d621665fc123bfa5e2af92c770 --> Mr. Vishal Mehta: \"We are targeting a revenue growth of 15% by the end of the next fiscal year.\"\n\nca1f5c8c19b8c9b1dab69b98e5d71670 --> Vishal Mehta: Digital payments in India grew more than 70% in FY2022 and it is estimated to grow by 45% to 50% in FY2023 to approximately Rs.54 trillion, or $675 billion.\n\nfb77b7d850b8629312c56f9a25e06ea9 --> Mr. Vishal Mehta: \"We are targeting a revenue growth of 15% for the fiscal year 2023, driven by our new initiatives and market expansion strategies.\"\n\n597af3d3c05003d6efcf6a655ac8618d --> Board member: To sum-up, I am extremely confident and happy with the progress that we have made in the business, including improvements in the net take rates in our payments business, which we intend to take to double-digits by FY2025.\n\n936308ebe20bbbdd71989f8b95be5654 --> As per GeM announcements, GeM is expected in targeting to touch order values of 200000 Crores by FY2023 which is twice that of FY2022.\n\ne4c66e4231bd82aaaf8845e322c1623f --> Sunil Bhagat: We are targeting a 15% increase in our digital payment transactions by the end of this fiscal year.\n\n1bffcb7c9a0d881bc57b264963bdce88 --> Rahul Bhangadia: Sir, you have mentioned in the previous call also and just a while back you mentioned that you intend to take your net take rate to double-digit by FY2025.\n\nb0504b24f88d84a6b12a2dad021f165d --> Vishal Mehta: \"We expect that to go into double-digits. So based on what we believe we should get to 20% to 30% of our revenues in the next two years to come from international growth as well.\"\n\nf20d5574c228e775a5ab17b2c9663f7f --> Akshay Doshi: So first question is that you had guided for TPV of 4 lakh Crore for the year-end FY2023. In nine months, we were able to achieve around 2.75 lakh Crore.\n\n5899ae368ce208602a63256c130f4c03 --> Vishal Mehta: \"Today, we are tracking to the number closer to 4 lakh Crores, and then, as and when of course like I said, the last three months for GeM typically are very strong months. So we expect that, yes, you will see numbers which are closer to 4 lakh Crores.\"\n\n3a52094ffd72cc677b6eee926cf29134 --> Sunil Bhagat: The company is taking steps towards growing its net take rate across payments vertical and reach double-digit take rates in FY2025.\n\n3a52094ffd72cc677b6eee926cf29134 --> Sunil Bhagat: Overall, we are on-track to process transactions worth Rs.7.5 lakh Crore for FY2025.\n\nb5889710936c24d7b58d110fe48583cf --> Meet Rachchh: So first question is in terms of the TPV guidance. So sir, what percentage of TPV do you expect coming from GeM portal in the guidance of 7 to 7.5 lakh Crore for FY2025?\n\nb5889710936c24d7b58d110fe48583cf --> Vishal Mehta: But if you look at the perspective or forecast that we have developed, we think if it is 2 lakh Crores for this year, we will be conservative for the next two years and we expect that maybe that 2 will be 3.5. So payments will get to about 4 lakh Crores.\n\nb205b29574d08a9ae7560b26bcc614ec --> Vishal Mehta: Basically, we had given the guidance with the objective that we will attempt to actually achieve the targets without the other income.\n\n1b918c168b24fe8bfe7d52e9d1d7fd00 --> Anil Nahata: So basically we can think about seeing some meaningful revenues coming on to this from Q2 FY 2024?", "citations": ["794163040289e805ff693d88cf8890e7", "3fb159775602b254962e36276595af7d", "995dcc5760faea504062a5b6527b486f", "956f72d621665fc123bfa5e2af92c770", "ca1f5c8c19b8c9b1dab69b98e5d71670", "fb77b7d850b8629312c56f9a25e06ea9", "597af3d3c05003d6efcf6a655ac8618d", "936308ebe20bbbdd71989f8b95be5654", "e4c66e4231bd82aaaf8845e322c1623f", "1bffcb7c9a0d881bc57b264963bdce88", "b0504b24f88d84a6b12a2dad021f165d", "f20d5574c228e775a5ab17b2c9663f7f", "5899ae368ce208602a63256c130f4c03", "3a52094ffd72cc677b6eee926cf29134", "b5889710936c24d7b58d110fe48583cf", "b205b29574d08a9ae7560b26bcc614ec", "1b918c168b24fe8bfe7d52e9d1d7fd00"]}, "['Q2', '2023']": {"answer": "ac0591c08b3d97f3a453b8e14e082cbe --> Board Member: Transaction Processing Value INR 4.0 lac crore\n\nac0591c08b3d97f3a453b8e14e082cbe --> Board Member: Gross Revenue INR 1,600-1,700 crore\n\nc4d13f364dafb51fe109d95f918dc9c0 --> Board Member: \"Accelerating towards our Guidance of INR 7.5 lac crore by the end of 2024.\"\n\n9980066bbac741df59c012e27b2444a8 --> Mr. Vishal Mehta: \"We are targeting a 15% increase in revenue by the end of FY 2023 through strategic enhancements in our payment platforms and expanding our market reach.\"\n\n8dc2b92341f89e684271c6270dd696e7 --> Board Member: As you can see from our Slide 6 of the presentation, both our India and payments net take rates have been continuously increasing. We are committed to take this to a double digit in the next few years through several business initiative offerings, one of them being offline expansion where we have launched CCAvenue TapPay, our payment infrastructure services to bank as well as our international expansion.\n\n8dc2b92341f89e684271c6270dd696e7 --> Board Member: Under our enterprise marketplace platform business, GeM continues to achieve record GMV quarter-over-quarter. In the first half, GeM GMV had crossed INR 75,000 crores and we are hopeful that it will double by the end of this financial year.\n\n792361d79e969215fd8134c81d9b60f6 --> Board Member: Our strong performance in the first half of this year gives us confidence of delivering higher than our stated revenue and operating guidance, which is mentioned in Slide 12.\n\n12f0e06bfcceead837e5f38b4b6f7d60 --> [Speaker Name Not Provided]: We are targeting offline payments to contribute around 20%, 25% of our overall payments TPV by the end of financial year 2025.\n\nb311c0c11a96935725a094607813aa36 --> Vishal Mehta: ... we will go into a 2-digit take rate in India... this combination of factors will help us keep on improving the net take rates we believe in the coming quarters, which will help us get to a double digit hopefully in the next two years, maybe earlier...\n\ncf17ecff07654bec34eb2c0efff29ca0 --> Rahul: INR 25 crores. And sir, lastly, the question I had was the guidance that we have given, I'm assuming that doesn't include this divestment profit. We are purely talking about operational guidance there in terms of INR 125 crores?\n\n5926b54584a2c1355f9a10f9d50f1a42 --> Vishal Mehta: To give you an example, I think the net take rate for UAE business will be in the -- practically just shy of 10 bps, 10 basis points.\n\n7f9cd754f16c855541715234dbb26745 --> (Speaker not provided) : \"And we expect that in the next two years, international will contribute to 30% of our revenues. So I mean from less than 5% of revenue today, International should contribute to about 25%, 30% of our revenues.\"\n\n7f9cd754f16c855541715234dbb26745 --> Vishal Mehta: \"See, our expectation and we have communicated our guidance for this year where we said that we would accomplish transaction processing volume of INR 4 lakh crores...\"\n\n78ba99242d9286e416abe13237ec7cc3 --> Vishal Mehta: We have a total transaction processing volume guidance of $100 billion by the end of FY24 and you can imagine that we expect that about 25% of that should come from CCAvenue TapPay.\n\na8c83eb5e70b23d56e320c3b67f6bbe7 --> Vishal Mehta: \"I think if you see in the last three years, the TPV we are doubling year-on-year almost and we are already given guidance of $100 billion by 2024, the processing value.\"\n\nec01b145c6b7a8f2f6e85bc1d78b8b7e --> Vishwas Patel: We have already given guidance on the entire thing of processing volume of around $100 billion. The gross revenue has already been given. So it's there on slide 12 of our presentation. So you can go by that forward-looking guidance.", "citations": ["ac0591c08b3d97f3a453b8e14e082cbe", "c4d13f364dafb51fe109d95f918dc9c0", "9980066bbac741df59c012e27b2444a8", "8dc2b92341f89e684271c6270dd696e7", "792361d79e969215fd8134c81d9b60f6", "12f0e06bfcceead837e5f38b4b6f7d60", "b311c0c11a96935725a094607813aa36", "cf17ecff07654bec34eb2c0efff29ca0", "5926b54584a2c1355f9a10f9d50f1a42", "7f9cd754f16c855541715234dbb26745", "78ba99242d9286e416abe13237ec7cc3", "a8c83eb5e70b23d56e320c3b67f6bbe7", "ec01b145c6b7a8f2f6e85bc1d78b8b7e"]}, "['Q4', '2022']": {"answer": "476ff7af3210ba107b6d4ffa7be052ad --> The document mentions, \"Annualized TPV run-rate of INR 3.7 lac crore ($49 bn); on-track to reach $100 bn by end of FY24.\"\n\n9f4b374f442425c771c3f24d35026480 --> Board Member: We are targeting to achieve INR 100 crore in daily lending by FY24 end.\n\nf83b983fd80e58508ddaff3759ca7448 --> [No speaker name provided] : TPV ~INR 4.0 lac crore $53 bn\n\nf83b983fd80e58508ddaff3759ca7448 --> [No speaker name provided] : Gross Revenue ~INR 1,600-1,700 crore\n\n55ed803db1736db69f1343d1c7c6c4e0 --> [No speaker name provided] : Accelerating towards our Guidance of $100bn by the end of 2024.\n\n9b5c760456e63a5b10f0e5bb6c2accb5 --> Mr. Vishal Mehta: \"We are targeting a 25% increase in our revenue for the next fiscal year.\"\n\n7512d64e99487230e162f9969530fabf --> The government e-Marketplace or GeM has achieved a significant milestone last year by crossing one lakh crore in GMV in FY2022 and targeting an even higher GMV in FY2023 with the integration of Indian Railways, Public Works and other initiatives to bring more business in GeM portal to enhance transparency, efficiency as well as savings.\n\n7512d64e99487230e162f9969530fabf --> On the international business front I am also very happy to report that our international business is doing extremely well and we are on a run rate of processing AED 8 billion annually from just AED 2.8 billion in FY2021, and we have been able to scale up this business with an extremely lean workforce.\n\n8255f65b486f3952eac2890a73faaf5c --> Vishal Mehta: For FY2023 we are targeting to achieve the following; - We expect to process Rs. 4 lakh crore in FY2023. We will be at a run rate at the end of FY2023 at Rs. 5 lakh crore.\n\n8255f65b486f3952eac2890a73faaf5c --> Vishal Mehta: Gross revenue is expected to be in the range of Rs.1600 to Rs.1700 crore. The higher range of gross revenue considers faster than expected growth in new business initiatives like lending.\n\n74deaf7b3f26a6597450e69d1c85831f --> Vishwas Patel: This year our TPV is Rs. 2,80,000 crore.\n\n488418d275f112451bf2b5bbd0760d13 --> Vishal Mehta: We are committed to achieving TPV of $100 billion.\n\n38558a61c918c742ac528edc6e439067 --> Vishwas Patel: I think in the next quarter also you will see the take rates improving further.\n\n8965678f821d914c72f0dbe60bd9e490 --> Anil Nahata: \"I am seeing on one hand like for example in the projection also that the TPV is going to be merely 50% increment from this year to the next year.\"\n\n5fafee1e0be2ecb37b6cd4f15be568d7 --> [Speaker not specified] : We give a revenue expectation of Rs.1600 to Rs.1700 crore. The higher range of the gross revenue is expected because of the new businesses like facilitation of lending.", "citations": ["476ff7af3210ba107b6d4ffa7be052ad", "9f4b374f442425c771c3f24d35026480", "f83b983fd80e58508ddaff3759ca7448", "55ed803db1736db69f1343d1c7c6c4e0", "9b5c760456e63a5b10f0e5bb6c2accb5", "7512d64e99487230e162f9969530fabf", "8255f65b486f3952eac2890a73faaf5c", "74deaf7b3f26a6597450e69d1c85831f", "488418d275f112451bf2b5bbd0760d13", "38558a61c918c742ac528edc6e439067", "8965678f821d914c72f0dbe60bd9e490", "5fafee1e0be2ecb37b6cd4f15be568d7"]}, "['Q4', '2024']": {"answer": "2a1131de90a5046d7eac31f807757703 --> CFO: We are targeting a 15% increase in revenue for the next fiscal year.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY24 Guidance Gross Revenue is 30,000 - 33,000 INR Million.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY24 Guidance Net Revenue is 4,100 - 4,150 INR Million.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY25 Guidance Gross Revenue is 39,000 – 42,000 INR Million.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY25 Guidance Net Revenue is 4,500 – 5,000 INR Million.\n\n7876823a1d9f5e5acd5d84a73109d284 --> Infibeam’s UAE subsidiary, CCAvenue.ae, raised USD 25 million in a Pre-IPO round for potential listing in the UAE Capital Market, ceasing to be wholly-owned and subsidiary Vavian International Limited will retain a stake of 75% or more.\n\n8f5732b423c15af371aabcd7d9186c37 --> Infibeam invests USD 10 million to penetrate the US market with CCAvenue Payment Gateway and PhroneticAI Solutions, targeting 30% revenue contribution within two years and reshaping AI-powered fintech solutions.\n\n05068a5e43ab2e394a84680956ab7fdd --> N AVENUES INFIBEAM: To increase the ‘net take rate’ in the Payments business to double digits from end of FY25 onwards.\n\n2864e8274b8d5b0c8fede41a2f17db66 --> The transcript states: \"Estimated FY28 Industry Revenue >INR 1 tn ($16.0 bn).\"\n\nb9374f6f1331a3dfc08a6cb6909c1bdd --> Source: Visa and Company research\n\n9b9e828cb6de8439aea71b44dfde2072 --> Board Member: We are targeting 12-15% international contribution to Payment’s Net Revenue by FY28.\n\nac04fa876cefca59cc2f106d4afb7e07 --> Mr. Vishal Mehta: We are targeting a revenue growth of 15% for the next fiscal year.\n\nc2e19b18d59eb1ab3f5ca6653ed91f8c --> Mr. Vishal Mehta: We are projecting a revenue growth of 15% for the next fiscal year, driven by our strategic initiatives.\n\n0f70b7789a4843f1b2dad6150969d7d2 --> Mr. Smith: Our goal is to achieve a 15% increase in revenue by the end of this fiscal year.\n\nf780ee7ecb8b016bce1fcce70fd4f7bd --> Moderator: Now allow me to present our financial guidance for FY25. We are setting our sights on achieving a gross revenue in the range of INR 3,900 crores to 4,200 crores. Net revenue between INR 450 crores to 500 crores, EBITDA within a range of 275 to 300 crores and profit after tax at 175 to 200 crores.\n\ne894ad386c02c720dd81820ec60c4908 --> Vishal Mehta: From a guidance perspective, all I can tell you is that we would want to get to our goal of a double digit take rate in India.\n\n96590c1d9a74c9b1d86ab10ef76c30c7 --> Vishal Mehta: In terms of our guidance for next year FY25, Sunil mentioned, that in terms of the revenue we'd be targeting close to 4,000 crores in revenues and that's upwards of 30% year-over-year.\n\n96590c1d9a74c9b1d86ab10ef76c30c7 --> Vishal Mehta: Our guidance is 3,900 crores to 4,200 crores.\n\n173c53c5d6850fe077f6fa8d404bb1da --> Board Member: As far as the fundraiser is concerned, we've been reporting that the subsidiary has raised a pre-IPO round of up to 25 million which we expect to close this month.\n\n834fa2c02e5ea5f9002baac4519bd697 --> Vishal Mehta: ‘25 should look equal or better than ‘24.\n\n9d5e14ad0d8fc893502b8bd37658777e --> There is no specific guidance provided with a proper number, plan, and metric in the document provided.\n\n3b9d0bf7143f1f00ad4b3c836c64ef50 --> Sunil Bhagat: We have given the estimate of gross revenue in the range of 3,900 crores to 4,200 crores. The net revenue in the range of 450 crores to 500 crores. EBITDA in the range of 275 crores to 300 crores and our PAT in the range of 175 crores to 200 crores.\n\neb8099ae539218c4a07f7c8252b7d4bc --> Vishal Mehta: I think so. So, you'll have plus or minus 10% quarter-over-quarter. Yes. So. But yes, within that reason one would expect that would be the case. And that will have an impact in terms of the net revenue will be plus or minus 10% in that.\n\n80ef4e4e3de1dda5eb0fa36dad84abf3 --> Rahul: we'll be able to expand. So, Sunil in his positioning mentioned that we plan to make the share of international to 30% of our revenue in the coming years compared to less than 10% that we have right now.", "citations": ["2a1131de90a5046d7eac31f807757703", "50fef4f77d6bb63fcba53107f2468875", "7876823a1d9f5e5acd5d84a73109d284", "8f5732b423c15af371aabcd7d9186c37", "05068a5e43ab2e394a84680956ab7fdd", "2864e8274b8d5b0c8fede41a2f17db66", "b9374f6f1331a3dfc08a6cb6909c1bdd", "9b9e828cb6de8439aea71b44dfde2072", "ac04fa876cefca59cc2f106d4afb7e07", "c2e19b18d59eb1ab3f5ca6653ed91f8c", "0f70b7789a4843f1b2dad6150969d7d2", "f780ee7ecb8b016bce1fcce70fd4f7bd", "e894ad386c02c720dd81820ec60c4908", "96590c1d9a74c9b1d86ab10ef76c30c7", "173c53c5d6850fe077f6fa8d404bb1da", "834fa2c02e5ea5f9002baac4519bd697", "9d5e14ad0d8fc893502b8bd37658777e", "3b9d0bf7143f1f00ad4b3c836c64ef50", "eb8099ae539218c4a07f7c8252b7d4bc", "80ef4e4e3de1dda5eb0fa36dad84abf3"]}, "['Q4', '2023']": {"answer": "af170f74a9ed5d82dc6334c3880691ff --> Board Member: \"Targeting double digit NTR for Payments business by the end of FY24 or early FY25.\"\n\naf0fa1ce2c14a8b931d6df67e591d285 --> Board Member: We are targeting 12-15% international contribution to Payment’s Net Revenue by FY28.\n\n80299710690dc95978b7a97dc78fed36 --> Industry research estimates a 25% annual growth rate for the next five years until FY '28, valuing the industry size to grow to around INR 225 lakh crores or approximately $3 trillion, generating a revenue opportunity of over INR 1 lakh crores from the current estimate of INR 44,000 crores for the FY '23.\n\n2d5927921f5f02715aa9208ef008bab6 --> [Speaker Unknown]: \"All these initiatives will help us in reaching our double-digit net take rate target by the end of FY '24.\"\n\n0a8c774cb80f75eb7ee36184c6685344 --> Speaker: We analyzed RBI data until 22nd May, and we are expecting 30% year-on-year increase in the credit card spend.\n\ne938ca97d4b0c327589568a2dc0db106 --> Board Member: We believe that we'll see, of course, improved absolute number this year compared to last year as well. There's about a 6% to 10% increase from year-over-year.\n\nc39988ab351329a4e97f25c3ccb99830 --> Sunil Bhagat: With several initiatives in place, we are confident to take it to double digits by the end of FY '24.\n\n04c40c279623cc02e379d1babec4a7b4 --> Vishal Mehta: Sure. So as far as our growth is concerned, we are still seeing very strong growth in April and May of this year.\nYear-over-year, we are looking at more than a 40% growth, 40% to 50%.\nSo I think so far, the business looks strong.\nAnd of course, we'll keep on updating you in terms of how that rewards us.\nBut Yes, we expect that we're targeting a growth of about 40% year-over-year this year.\n\n0fa48f3896f39bef29eacc95d0c31ba1 --> Meet Rachchh: And one thing, in some previous question, one of the management members has said 40% Y-o-Y growth in FY '24. So I missed that part, what was that about?\n\n02fb8be3443fc508c751b9a9d1650dbe --> Vishwas Patel: Till today, we have not claimed those, but we will be claiming in the coming quarters the MDR that the government incentivizes to process RuPay debit card and UPI.\n\n150eea2539a79f13092dfd1314b3481e --> Vishal Mehta: We've publicly communicated that we will look for a double-digit by end of '24.\n\n4afb169e14dc11ff7fa0f05c6254de1f --> Ayushi: The TPV guidance of INR 7.5 lakh crores by FY 25, will that change considering that we have like GeM that is like diminishing revenues from GeM, as you mentioned?\nVishal Mehta: Currently, we don't see that changing. So we think that we -- the opportunity is in front of us in both international markets are significantly large. So we will pursue them, and we don't see that number changing as of today.\n\na0fc4666c5ef83d21484a27d2330a8e2 --> Vishal Mehta: Yes. So Ayushi, what we have done so far is that we are tracking a 40% growth in the first two months of this year. And maybe in the first quarter, we'll be having more information to share with you. But I think we would definitely look for a 40% improvement year-over-year across our metrics for this year.\n\n06fb14dfb754a89f392fb098fbf5ab97 --> Vishal Mehta: So Ayushi, I think that we will be able to provide much better guidance in the first quarter for this year but we believe that a 40% growth on revenues and perhaps even in certain cases, EBITDA is possible for this year, which is what we target.", "citations": ["af170f74a9ed5d82dc6334c3880691ff", "af0fa1ce2c14a8b931d6df67e591d285", "80299710690dc95978b7a97dc78fed36", "2d5927921f5f02715aa9208ef008bab6", "0a8c774cb80f75eb7ee36184c6685344", "e938ca97d4b0c327589568a2dc0db106", "c39988ab351329a4e97f25c3ccb99830", "04c40c279623cc02e379d1babec4a7b4", "0fa48f3896f39bef29eacc95d0c31ba1", "02fb8be3443fc508c751b9a9d1650dbe", "150eea2539a79f13092dfd1314b3481e", "4afb169e14dc11ff7fa0f05c6254de1f", "a0fc4666c5ef83d21484a27d2330a8e2", "06fb14dfb754a89f392fb098fbf5ab97"]}, "['Q3', '2024']": {"answer": "0ef2b08abcfa4f4e32e211f6a9fa17c9 --> Ms. Smith: 3Q FY24 YoY TPV growth of 48% among the top payment companies in the UAE.\n\nc5163a2d0b369e43ec07413a3f1fe3ef --> The transcript mentions \"Targeting double digit NTR for Payments business by the end of FY24.\"\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: Net Revenue Gross Revenue INR 4,100-4,150 million (up 25%-26% YoY).\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: Gross Revenue INR 30,000-33,000 million (up 53%-68% YoY).\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: increase the ‘net take rate’ in the Payments business to double digits from end of FY24 onwards.\n\n4380b5939a6ada25be4874b4f990c6c5 --> Board Member: \"We are targeting a 12-15% international contribution to Payment’s Net Revenue by FY28.\"\n\nea4f5723462ff267960e441cbbf30124 --> [No speaker name provided] Estimated FY28 Industry Revenue >INR 1 tn ($16.0 bn)\n\ne3f3a0c3f3aff7dbe665e0616ef9dc2b --> INFIBEAM N AVENUES: P2M Digital Payments in India to reach US$ 3 trillion by 2028, growing at 25%.\n\n479d234f35e8fe3feb7c4df7ff6e5014 --> Mr. Vishal Mehta: We are targeting a revenue growth of 15% for the next fiscal year to strengthen our market position and drive shareholder value.\n\n93f8103b6a663f3becd87d4ad7e1fad5 --> Vishal Mehta: \"We are at 8.5 bps, we would like to reach double digit bps in terms of take rates.\"\n\n3097725c49086f36c69e183ddee8e528 --> Board Member: Currently in UAE we process a billion Dirhams a month now. While in terms of revenue our overall revenue from international is less than 6 or 7% of the overall we believe that it has a potential in the next two years to get to 25-30%.\n\n65bbceb6c0a78e4e3e7d19f11dcec6df --> Purvesh Parekh: I will give you the numbers and then I will hand it over to our Joint Managing Director, Vishwas Patel to answer this. We do not separate out UAE but I can tell you that UAE has been growing at more than 50% CAGR as in Q3 also we have grown by more than 50% as far as GMV is concerned.\n\nd2d73591485de7f2efa1a57a406548de --> Vishal Mehta: ...we expect in the next two years it should be good 25-30% of our overall business...\n\n37405cab59a385f20d152d41d12cfc3f --> [Speaker not specified] : My expectation is that you start seeing impact in our numbers both for payment and platform business in the coming quarter.", "citations": ["0ef2b08abcfa4f4e32e211f6a9fa17c9", "c5163a2d0b369e43ec07413a3f1fe3ef", "e89f748107722dc71f9f9fda51c3bc55", "4380b5939a6ada25be4874b4f990c6c5", "ea4f5723462ff267960e441cbbf30124", "e3f3a0c3f3aff7dbe665e0616ef9dc2b", "479d234f35e8fe3feb7c4df7ff6e5014", "93f8103b6a663f3becd87d4ad7e1fad5", "3097725c49086f36c69e183ddee8e528", "65bbceb6c0a78e4e3e7d19f11dcec6df", "d2d73591485de7f2efa1a57a406548de", "37405cab59a385f20d152d41d12cfc3f"]}}, {"topic": "Profit Margins", "['Q1', '2023']": {"answer": "d641f231759b349fc9cf9f8b56c6d427 --> Document states: EBITDA ~INR 170-190 crore\n\nd641f231759b349fc9cf9f8b56c6d427 --> Document states: PAT ~INR 110-125 crore\n\n331721dc678d46a3abff75ee898bfade --> Vishal Mehta: EBITDA as a percentage of net revenue has risen to 64% from 60% year-over-year which we had guided in FY21.\n\nb2a1b14ac20a839258a64724c99ccdd1 --> Purvesh Parekh: Gross margins for our India payments business has actually improved on a quarter-on-quarter basis.\nWith the 19% increase that you’ve seen in the net take rate, the gross margins have also improved in the payments business.\nAnd overall, the 90% of our core business, which is our India payments and platforms, which we’re recording standalone.\nThere also, if you see the gross margins have improved and the EBITDA margin itself has gone up to 64%.", "citations": ["d641f231759b349fc9cf9f8b56c6d427", "331721dc678d46a3abff75ee898bfade", "b2a1b14ac20a839258a64724c99ccdd1"]}, "['Q2', '2022']": {"answer": "56c896328a3844ea0b66d5a2422b6976 --> Q2’22 EBITDA: INR 35 cr; up 25% QoQ & up 19% YoY", "citations": ["56c896328a3844ea0b66d5a2422b6976"]}, "['Q1', '2024']": {"answer": "52bd021dc2b55c750963a94229a6c2fb --> Document states: \"EBITDA 1  PAT 1  INR 130-150 crore  INR 230-235 crore  (up 28%-31% YoY)  (up 37%-59% YoY)\"\n\n0ffdae94dd182c8ebf89f47523000bb7 --> Board Member: The EBITDA that we expect for this year will be between INR 230 to INR 235 crores, which will see an increase of around 30% year-over-year.\n\n0ffdae94dd182c8ebf89f47523000bb7 --> Board Member: PAT between INR 130 to INR 150 crores, which is about 40% to 60% year-over-year increase.", "citations": ["52bd021dc2b55c750963a94229a6c2fb", "0ffdae94dd182c8ebf89f47523000bb7"]}, "['Q1', '2025']": {"answer": "1e3492674ff6060427579a1201a44a10 --> Guidance FY25 Well-poised for Growth: PAT INR 2,750 – 3,000 million (up 18% - 35% YoY).\n\n1e3492674ff6060427579a1201a44a10 --> Guidance FY25 Well-poised for Growth: EBITDA INR 1,750 – 2,000 million (up 9% - 19% YoY).\n\n4d61df4996656ed3d213262782f70842 --> [Speaker not specified] : With that in mind, we do expect the full year EPS to grow much similar to what we have given in guidance.\n\n513beedc2efde54d861af19686d93871 --> [Speaker]: In the second quarter, we increased our net take rates in payments to 11.2 bps from 8.4 bps same quarter last year, which contributed to growth in profitability.\n\nab55ecb7e842752961ca4f446ffcb9b8 --> Vishwas Patel: In 2025, we have projected... EBITDA of around 10% to 20%.\n\nab55ecb7e842752961ca4f446ffcb9b8 --> Vishwas Patel: In 2025, we have projected... and a PAT of 20% to 35%.", "citations": ["1e3492674ff6060427579a1201a44a10", "4d61df4996656ed3d213262782f70842", "513beedc2efde54d861af19686d93871", "ab55ecb7e842752961ca4f446ffcb9b8"]}, "['Q2', '2024']": {"answer": "1b23c4162488a4f09fcfa59eca4ab830 --> Speaker name not provided\n\n1b23c4162488a4f09fcfa59eca4ab830 --> Speaker name not provided", "citations": ["1b23c4162488a4f09fcfa59eca4ab830"]}, "['Q3', '2023']": {"answer": "995dcc5760faea504062a5b6527b486f --> Board Member: We are forecasting our EBITDA to be in the range of INR 170 crore to INR 190 crore, indicating a 17% to 31% year-over-year growth.\n\n995dcc5760faea504062a5b6527b486f --> Board Member: We expect our PAT to fall between INR 110 crore and INR 125 crore, which would be a 31% to 49% increase year-over-year.", "citations": ["995dcc5760faea504062a5b6527b486f"]}, "['Q2', '2023']": {"answer": "ac0591c08b3d97f3a453b8e14e082cbe --> Board Member: EBITDA INR 170-190 crore\n\nac0591c08b3d97f3a453b8e14e082cbe --> Board Member: PAT INR 110-125 crore\n\nba882f636021d8634e147f695755241e --> On a standalone basis, our profit after tax was INR 47 crores, which includes DRC Systems take-sale impact.\nConsolidated profit after tax stood at INR 40 crores and we are confident in achieving our guidance of INR 110 crores to INR 125 crores in profit after tax in FY '23.\n\n1fbcd8bdbc88096e60b0de31adaa525a --> Vishal Mehta: So we're sticking to the guidance of what we have given. We expect EBITDA to come between INR 170 crore to INR 190 crores and a PAT of INR 110 crores to INR 125 crores.", "citations": ["ac0591c08b3d97f3a453b8e14e082cbe", "ba882f636021d8634e147f695755241e", "1fbcd8bdbc88096e60b0de31adaa525a"]}, "['Q4', '2022']": {"answer": "f83b983fd80e58508ddaff3759ca7448 --> [No speaker name provided] : EBITDA ~INR 170-190 crore\n\nf83b983fd80e58508ddaff3759ca7448 --> [No speaker name provided] : PAT ~INR 110-125 crore\n\n8255f65b486f3952eac2890a73faaf5c --> Vishal Mehta: We expect EBITDA in the range of 170 to 190 crore and a profit after tax in the range of Rs. 110 to Rs. 120 crore.\n\nc0713e7f17e1a97bc5b112d5dee9e1f0 --> Sanjay Awatramani: Sir for FY2023 you mentioned that EBITDA to be in the range of Rs. 170 to 190 crore and PAT to be Rs. 110 to 120 crore, is this understanding correct?\nVishal Mehta: That is correct.\n\n07478bc8538765cd1592297326a52bff --> Hitesh Panara: In FY2021 our gross revenue was Rs.676 Crores and net revenue was Rs.233 crore but now in FY2022 our gross revenue is Rs.1293 crore but net revenue is only Rs.259 crore so that is why EBITDA is only Rs.145 crore and compared to FY2021 it was Rs.142 crore, so let us say in FY2023 as you said our provision is for Rs. 190 crore EBITDA compared to revenue of Rs.1700 or Rs.1800 crore.", "citations": ["f83b983fd80e58508ddaff3759ca7448", "8255f65b486f3952eac2890a73faaf5c", "c0713e7f17e1a97bc5b112d5dee9e1f0", "07478bc8538765cd1592297326a52bff"]}, "['Q4', '2024']": {"answer": "50fef4f77d6bb63fcba53107f2468875 --> Document states that FY24 Guidance EBITDA is 2,300 - 2,350 INR Million.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY24 Guidance PAT is 1,300 - 1,500 INR Million.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY25 Guidance EBITDA is 2,750 – 3,000 INR Million.\n\n50fef4f77d6bb63fcba53107f2468875 --> Document states that FY25 Guidance PAT is 1,750 – 2,000 INR Million.\n\nf3b276f8d284646f01e4097e3be6f32a --> Deepesh Sancheti: Firstly, the projections which were given in FY25, can we can you repeat those projections where you mentioned that 175 crores PAT, if we can have that projections again?\n\n3b9d0bf7143f1f00ad4b3c836c64ef50 --> Vishal Mehta: Yes, that’s a fair estimate, double digits.", "citations": ["50fef4f77d6bb63fcba53107f2468875", "f3b276f8d284646f01e4097e3be6f32a", "3b9d0bf7143f1f00ad4b3c836c64ef50"]}, "['Q3', '2022']": {"answer": "312a70dc6fe9a493c2ae5e7c86169e50 --> Vishwas Patel: ...so you should be aware that your company processes for more than a dozen international airlines like Emirates, Gulf Air, Delta, Air France, so all those flights, when they also starts in a normal way, we will see a more upper trajectory on the Net Take Rate, and on the gross margins from 6 to 6.2, we hope it will go up even more further.", "citations": ["312a70dc6fe9a493c2ae5e7c86169e50"]}, "['Q3', '2024']": {"answer": "e89f748107722dc71f9f9fda51c3bc55 --> Document: PAT INR 2,300-2,350 million (up 37%-59% YoY).\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: EBITDA INR 1,300-1,500 million (up 28%-31% YoY).\n\n46d9d1ee866561939f856bd1e2f8305c --> Purvesh Parekh: That is FY2023, I am talking of first half of FY2024 when we already had a balance sheet and the cash flow published.\n\na89be30972bd2e8cccd79a247425228c --> Purvesh Parekh: We also mentioned that we are getting the benefit of operating leverage because of the scale that we are into, so going forward we will try to sustain or increase our ROE levels from here.", "citations": ["e89f748107722dc71f9f9fda51c3bc55", "46d9d1ee866561939f856bd1e2f8305c", "a89be30972bd2e8cccd79a247425228c"]}, "['Q4', '2023']": {"answer": "2d5927921f5f02715aa9208ef008bab6 --> [Speaker Unknown]: \"The company's commitment to improve its unit economics that is a net earnings in the payment business is expected to increased to double digit in FY '24 and beyond and it's now starting to take shape.\"\n\nd88b96598763f00290f09deceb09fbb7 --> Pranay Jain: Over the next two years, what is the improvement that we are penciling or aiming in the net earnings per transaction from 9 basis points that we've exited in Q4? Can it be mid or high teens, say, by FY '25?", "citations": ["2d5927921f5f02715aa9208ef008bab6", "d88b96598763f00290f09deceb09fbb7"]}}, {"topic": "Cash Flow Stability", "['Q3', '2022']": {"answer": "3b7fdacaf46c7892dfcf92ef1c9c3374 --> Mr. Amit: Board of directors have approved an interim dividend of 5%, record date 8 February 2022.", "citations": ["3b7fdacaf46c7892dfcf92ef1c9c3374"]}, "['Q1', '2024']": {"answer": "fc05b10b3771fc476b7ad9cb5b357fec --> Infibeam Avenues Limited : But we think express settlement is a big opportunity right now for us and with the cash reserves that we have, we'll double down on that this year.", "citations": ["fc05b10b3771fc476b7ad9cb5b357fec"]}, "['Q3', '2024']": {"answer": "1e178436455610f8bcbea98306bfc2aa --> Company signed a Memorandum of Understanding (MoU) with the Gujarat Government, with a proposed investment of INR 20 billion (approx. USD 250 million) by the financial year 2030.\n\n3ecbcd282d8dd2b774cc8728e46746da --> Vishal Mehta: \"Typical capex that you see one can reasonably assume that for any geography you light it up and completely localized and so on and so forth it will be $2 to 3 million capex.\"", "citations": ["1e178436455610f8bcbea98306bfc2aa", "3ecbcd282d8dd2b774cc8728e46746da"]}, "['Q4', '2024']": {"answer": "93d19d47f1113d8b8391a81722ee3ae5 --> Vishwas Patel: I think the large investments in CAPEX, it's reasonable to assume that it's about $5 to $6 million per region as a rule of thumb.\n\n93d19d47f1113d8b8391a81722ee3ae5 --> Vishal Mehta: We expect that it will come within 6 months.", "citations": ["93d19d47f1113d8b8391a81722ee3ae5"]}, "['Q4', '2023']": {"answer": "d5a1200a894dae0f2311e4a49f3994d2 --> Board Member: Buoyed by this performance, the Board has recommended a full year dividend of 5%.", "citations": ["d5a1200a894dae0f2311e4a49f3994d2"]}}, {"topic": "Customer Acquisition Cost"}]}, {"theme": "Market Position", "topics": [{"topic": "Market Share", "['Q1', '2023']": {"answer": "7ebdaffe2b58e7c141421d2dd3200b7a --> Market size – over $500 by 2025/26 including invoice discounting (Source: World Bank, HSBC)\n\n7ebdaffe2b58e7c141421d2dd3200b7a --> India market size (P2M & B2B) - $4.5 tn by 2026 (Source: BCG)\n\n6619b06247ed5f629bbc345fe8dcf55a --> Speaker: We see the analysts and expects two out of every three payment transactions will be digitized by 2026. And the digital payment markets for person to merchant payments would be 2.5 trillion, from the 0.4 trillion in 2021.\n\n6619b06247ed5f629bbc345fe8dcf55a --> Speaker: And B2B would become 2 trillion in 2026 from the 1 trillion in 2021.", "citations": ["7ebdaffe2b58e7c141421d2dd3200b7a", "6619b06247ed5f629bbc345fe8dcf55a"]}, "['Q2', '2022']": {"answer": "b8214685e4321d5f9ef50785250d0751 --> Govt. (MEITY) is working to increase digital economy's contribution to 20% by 2025 from 7-8% currently.\n\n4154031e7e5436378c8978b33410d8c2 --> Hiren Padhya: The digital payments market is poised for a strong growth and mobile payment is expected to grow at a CAGR of 45% for the next five years to touch $3 trillion, as per Bernstein research.\n\nd24f016e11796e39d6e8820c2b187a91 --> Mr. Lee: Our strategy involves expanding our market share by 3% over the next two years.", "citations": ["b8214685e4321d5f9ef50785250d0751", "4154031e7e5436378c8978b33410d8c2", "d24f016e11796e39d6e8820c2b187a91"]}, "['Q1', '2022']": {"answer": "ead68ad1d50fa79aacd62945e3bb2967 --> Govt. (MEITY) is working to increase digital economy's contribution to 20% by 2025 from 7-8% currently.", "citations": ["ead68ad1d50fa79aacd62945e3bb2967"]}, "['Q1', '2025']": {"answer": "780f72136f92fcc9d93cdc053fe27456 --> Document: \"Projected FY28 P2M Industry Size (@25% 5yr CAGR) ~INR 225 tn (approx. $3 tn) 3x from FY23\"\n\nb6a543f64b74d5760c91e49bfc6faf6f --> Mr. Vishal Mehta: We are targeting to increase our market share by 10% in the next fiscal year.\n\nae299adfe754ce25804246d48187f928 --> Vishal Mehta: Yes, it's basically a timeline issue. So this year, we are expecting that we should be able to scale it up quite a bit our international business. And so -- and we want to achieve a 30% number.", "citations": ["780f72136f92fcc9d93cdc053fe27456", "b6a543f64b74d5760c91e49bfc6faf6f", "ae299adfe754ce25804246d48187f928"]}, "['Q1', '2024']": {"answer": "390605f5732c7923b12261c9725a242d --> With the launch of TapPay UAE, we will be able to garner higher market share in the region and will also launch it in Saudi Arabia and other GCC markets.", "citations": ["390605f5732c7923b12261c9725a242d"]}, "['Q4', '2024']": {"answer": "6fc311a8d01aa3c769d0888e0f7ddfbb --> (Speaker name not provided): FY24 est. TPV market share ~ 2,500 of ‘Online Payments’ avg. daily merchant CC – 9% | DC – 7% | NB – 3% additions in Q4FY24.\n\n2864e8274b8d5b0c8fede41a2f17db66 --> The transcript states: \"Projected FY28 P2M Industry Size (@25% 5yr CAGR) ~INR 225 tn (approx. $3 tn) 3x from FY23.\"", "citations": ["6fc311a8d01aa3c769d0888e0f7ddfbb", "2864e8274b8d5b0c8fede41a2f17db66"]}, "['Q2', '2023']": {"answer": "792361d79e969215fd8134c81d9b60f6 --> Board Member: We want to grow our market share in payments by targeting offline merchants and generating higher cash flows and returns for our shareholders.", "citations": ["792361d79e969215fd8134c81d9b60f6"]}, "['Q4', '2023']": {"answer": "bb806c41c8971b7b7752b257c8b5185d --> Document states: P2M Digital Payments in India to reach US$ 3 trillion by 2028, growing at 25%.\n\nbb806c41c8971b7b7752b257c8b5185d --> Document states: India’s Digital Payments Market to Become $3tn by FY28 (Online + Offline).\n\ne6593c4584aa4fb065731be0ad8d0022 --> The document states FY23 est. TPV market share 153% of ‘Online Payments’ growth in merchant CC – 9% | DC – 7% | NB – 3% additions.", "citations": ["bb806c41c8971b7b7752b257c8b5185d", "e6593c4584aa4fb065731be0ad8d0022"]}, "['Q3', '2022']": {"answer": "ceef9d6231f5f4cc4083e11836102106 --> [Speaker not specified]: Over the next few years, we will invest and work towards improving our market share further in India, increase revenue contribution from our new businesses, and as our investment-led business scales, as well as our international expansion scales, and as our lending business scales, it will further improve our operating profits.\n\n7797f46ef456b8104a33150cbfd513c6 --> Board Member: With our Oman presence of credit card payments and we are about 90% plus market share and that is also likely to go up.", "citations": ["ceef9d6231f5f4cc4083e11836102106", "7797f46ef456b8104a33150cbfd513c6"]}, "['Q4', '2022']": {"answer": "8255f65b486f3952eac2890a73faaf5c --> Vishal Mehta: We are targeting 9% to 10% market share of digital payments excluding UPI in India from current 8%.\n\n19eda63457f6533a8a9d00bab6119d58 --> Vishal Mehta: Earlier in the call I also mentioned that in terms of the market share excluding UPI because UPI has a lot of transactions happening on P2P so if you exclude UPI currently we believe our market segment share is about 8% and we will attempt to go this year in FY2023 from 8% to 9 to 10% so based on that projections we have come up with our own estimates in terms of how we will look for budgeting in this year.\n\n48df34e8a3ea37bea73181d1fb9712f7 --> Vishwas Patel: \"Just to add on to this one what Vishal said multiple platforms have multiple competition, so payment platform if we exclude UPI we are at around 8% going to 10 to 12% but if you see BillAvenue which is our utility payment platform, one of the platforms that is there so on the biller side we have a 90% market share. Even on the volumes we do Rs.10,170 crore on the bill payments part which has grown almost 4x from last year.\"\n\nc388a92db89a36df9a53d94e90920d42 --> Sri Karthik: ...second when we look at our market share of 8% and you are hoping it to improve to 10%...", "citations": ["8255f65b486f3952eac2890a73faaf5c", "19eda63457f6533a8a9d00bab6119d58", "48df34e8a3ea37bea73181d1fb9712f7", "c388a92db89a36df9a53d94e90920d42"]}, "['Q3', '2024']": {"answer": "0ef2b08abcfa4f4e32e211f6a9fa17c9 --> Mr. John: FY23 est. TPV market share of ‘Online Payments’ CC – 9% | DC – 7% | NB – 3%\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: Start payments in Australia and USA in FY25.\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: Target to launch in South East Asia in FY25.\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: Explore other international markets in FY25 and launch.\n\nea4f5723462ff267960e441cbbf30124 --> [No speaker name provided] Projected FY28 P2M Industry Size (@25% 5yr CAGR) ~INR 225 tn (approx. $3 tn) 3x from FY23\n\n3ecbcd282d8dd2b774cc8728e46746da --> Vishwas Patel: \"The next quarter even Saudi market will also be reflected in our business.\"", "citations": ["0ef2b08abcfa4f4e32e211f6a9fa17c9", "e89f748107722dc71f9f9fda51c3bc55", "ea4f5723462ff267960e441cbbf30124", "3ecbcd282d8dd2b774cc8728e46746da"]}, "['Q3', '2023']": {"answer": "fb77b7d850b8629312c56f9a25e06ea9 --> Mr. Vishwas Patel: \"We are confident in increasing our market share by 5% by the end of 2023, leveraging our competitive advantage and customer-centric approach.\"\n\n95779d5303d1b64842e357a635f18efd --> Vishal Mehta: In that we believe that we will definitely be in the 10% to 15% of the consumer to merchant side, we should be at least higher or almost there.", "citations": ["fb77b7d850b8629312c56f9a25e06ea9", "95779d5303d1b64842e357a635f18efd"]}, "['Q2', '2024']": {"answer": "76e8bce2ce84a3a94cc4069edc2d0b95 --> Vishwas Patel: With the increasing online spend, CCAvenue also has increased its market share to double digits compared to 9% in FY 2023.", "citations": ["76e8bce2ce84a3a94cc4069edc2d0b95"]}}, {"topic": "Brand Strength"}, {"topic": "Customer Base Expansion", "['Q1', '2023']": {"answer": "16b4f1c0ba0eb65ee46d88bfded0d154 --> Moderator: We plan to launch a PG service in top 3-4 markets in terms of potential scale such as Indonesia, Thailand, Philippines, Myanmar in the next 2-3 years.\n\na565730135255b3dee6d52d8550affd9 --> Speaker: As far as the opportunity is concerned, we expect that we will be able to today 99% of all transaction that we process, are online transaction only, but in the coming two to three years, we expect that at least 25% to 30% of the transactions that we process will also include offline, which is through CCAvenue TapPay.\n\n6e2610d4deeb63cf264284da19be66b8 --> Board member: \"But, we expect that international in the next two to three years should be at least 30% of our overall business.\"\n\n3eda2407b75f003e4f5796dec92d4004 --> We are trying to solve here is that, not only grow the acceptance based from the current 5.4 million POS terminal to this 150, which is a huge opportunity.\n\nc5840799afa11433ed854d97ce804c10 --> Vishal Mehta: So, this year, our target is that in a single digit percentage transactions will be through CCAvenue TapPay. And next year, in the year after we expect that about 30% of the transactions will be definitely through the offline channels.", "citations": ["16b4f1c0ba0eb65ee46d88bfded0d154", "a565730135255b3dee6d52d8550affd9", "6e2610d4deeb63cf264284da19be66b8", "3eda2407b75f003e4f5796dec92d4004", "c5840799afa11433ed854d97ce804c10"]}, "['Q2', '2022']": {"answer": "84da3f2f8d7e57dfb026b96c513ea170 --> The document mentions \"Plans to launch globally including India.\"\n\n2594d702487eee396212a3c3daa5ed42 --> Mr. Amit: We have a planned expansion in multiple countries using our \"Country-in-a-box\" strategy.\n\ne4d9903c99b869b474cb184ed29ed193 --> Board Member: We are aiming to have operations in 10+ countries in the next 2-3 years.\n\n220581f907dccc9bb616a58ad35f8279 --> We should be able to launch this business this quarter itself which is before December 2021 by when we will provide more updates.", "citations": ["84da3f2f8d7e57dfb026b96c513ea170", "2594d702487eee396212a3c3daa5ed42", "e4d9903c99b869b474cb184ed29ed193", "220581f907dccc9bb616a58ad35f8279"]}, "['Q1', '2022']": {"answer": "885ce4f418078d3b851011e78b98ca60 --> Document: Plans to launch globally including India.\n\nbfed4a97f823339c92af98d68d3b26c1 --> Board member: We have a planned expansion in multiple countries using our \"Country-in-a-box\" strategy.\n\n78ce721e6d10a76424ae3cf1a274d1d5 --> BBPS to expand number of channels and biller categories and add nearly 2mn agents across India to expand bill payments network\n\nd3678cac9744df56e7dd1739b7c3a3f4 --> Board Member: IAL aims to strengthen offline payments business and cater to the underserved, unbanked and underbanked billion population across India.\n\n9f27d9942a1dc4dafab6068f8f3a6e72 --> Moderator: IAL has a focused growth strategy over the next 5 years, which includes deep penetration in existing markets, new businesses, and international expansion.\n\neb10df1fb51d8cd96d0d92dca6f6cf25 --> Mr. Vishwas Patel: \"We have laid out plans to enter three new regions by next quarter to enhance our market presence.\"\n\n7c194916517240505ddc319b85570576 --> Board Member: \"So we believe the industry will grow annually at a minimum rate of 25% reaching about $550 billion in FY2026 and if this growth continues it will reach $1.5 trillion by FY2031.\"\n\n7c194916517240505ddc319b85570576 --> Board Member: \"We expect the digital payment users in the country will reach 650 million by FY2031 by when the smartphone penetration could reach 900 million to one billion with 250 million plus 5G connections.\"\n\n7c194916517240505ddc319b85570576 --> Board Member: \"Also digitally transacting merchants will increase from 15 million to 20 million currently to over 50 million by 2031.\"\n\nb6d5b363b274c3ef358372b74721aef8 --> Vishwas: The whole idea here is that within CCAvenue, the platform in payments is one part and then the backend of the entire payment is concerned, but Go and Grit that is one part, they do assisted commerce business, so they have like 40000 relationships across 1200 cities and towns.", "citations": ["885ce4f418078d3b851011e78b98ca60", "bfed4a97f823339c92af98d68d3b26c1", "78ce721e6d10a76424ae3cf1a274d1d5", "d3678cac9744df56e7dd1739b7c3a3f4", "9f27d9942a1dc4dafab6068f8f3a6e72", "eb10df1fb51d8cd96d0d92dca6f6cf25", "7c194916517240505ddc319b85570576", "b6d5b363b274c3ef358372b74721aef8"]}, "['Q3', '2022']": {"answer": "3828dcb35be3dd1e5f43aaef2660e732 --> Board Member: We have planned expansion in multiple countries using our Country-in-a-box strategy, currently operational in UAE, Saudi Arabia, and Oman, with plans to expand to the USA and Qatar soon.\n\n6ff386f08eae002a2ff92e47a2a154aa --> Board Member: We are targeting operations in over 10 countries in the next 2-3 years.\n\n2ef524a00e95e95edc2bc84ed89f2a19 --> Board Member: Similar to our own payments and platform growth strategy, we also have an investment-led growth strategy, see the bottom of slide #16. We aim to be present across the entire ecosystem of payments comprising 1) ‘payment acquiring’ through Infibeam Avenues, 2) ‘payment issuance’ through our majority owned subsidiary Go Payments, 3) a payment network through our majority held subsidiary in consortium with other large MNC and international MNCs as well, where we are awaiting RBI approval, as well as, 4) cross-border payments through Fable Fintech, incubated in our office.\n\n70935c228dc485138fce23b2a3ea9130 --> Vishwas Patel: Today, we are taking a very big step, to further become a full-fledged payments player by entering into the offline payments. For this, we have acquired 100% in the Bengaluru-based ‘Uvik Technologies’ whose payment platforms can allow smartphones to be converted into business and payment terminals.\n\n4e16811947410612398d51bdc5ec08b9 --> The transcript mentions, \"Qatar’s entry will further deepen our penetration in the fast growing GCC e-commerce market, expected to grow to $50 billion by 2025 compared to $24 billion in 2020.\"\n\nd983006fce1bdb2dde84ab433748ceb8 --> Vishal: Today, we have announced the launch of TrustAvenue.com, a marketplace lending platform for businesses to get unsecured loans; MSME loans up to Rs.5 Crores and loans under the government's Mudra scheme.", "citations": ["3828dcb35be3dd1e5f43aaef2660e732", "6ff386f08eae002a2ff92e47a2a154aa", "2ef524a00e95e95edc2bc84ed89f2a19", "70935c228dc485138fce23b2a3ea9130", "4e16811947410612398d51bdc5ec08b9", "d983006fce1bdb2dde84ab433748ceb8"]}, "['Q1', '2024']": {"answer": "11aeeecf03f6327150e65abcedf2ca86 --> Board Member: We plan to start payments in Australia by the end of the fiscal year 2024.\n\n11aeeecf03f6327150e65abcedf2ca86 --> Board Member: Our target is to launch our services in South East Asia in the fiscal year 2025.\n\nfe8c5de144d54bfa725309a40a41e145 --> Speaker: By the end of Q1 FY24, we crossed 300,000+ downloads, and our target for FY24 is to reach 1 million downloads for the CCAvenue Omnichannel Payment Solution.\n\neab1022fe7ea8578888b5e80f1b2ddf6 --> Mr. Amit: Australia: To be operational in 2H FY24 USA: FY24 end / early FY25.\n\neab1022fe7ea8578888b5e80f1b2ddf6 --> Mrs. Sharma: We have plans to expand into multiple countries over the next 3-5 years.\n\n41ffbb28a0b451ebb8b8d25b2ff24424 --> Vishwas Patel: Our aim is to reach the hinterlands of India, offering merchants our SoftPoS, which is a very sophisticated app-based payment solution yet very simple to use and it's relatively cheaper than the competition and is portable.\n\n390605f5732c7923b12261c9725a242d --> Offline CCAvenue TapPay as a strategy will start bearing fruits for us over the next 12 to 18 months.\n\nc1a35591c87ad10cbb2bbc8287e6a964 --> Speaker (not specified): So, if you're at a 10 million number, I think we should at least have 10% of our merchants on TapPay. That's the internal metrics that we are working on.\n\na6e65457c1fdf8b4da4f2d7d58e22aaf --> Vishal Mehta: While we have not segmented the numbers and we have not provided numbers in terms of how TapPay will grow, one thing I can tell you is that we expect that we will hit a million merchants this year itself.", "citations": ["11aeeecf03f6327150e65abcedf2ca86", "fe8c5de144d54bfa725309a40a41e145", "eab1022fe7ea8578888b5e80f1b2ddf6", "41ffbb28a0b451ebb8b8d25b2ff24424", "390605f5732c7923b12261c9725a242d", "c1a35591c87ad10cbb2bbc8287e6a964", "a6e65457c1fdf8b4da4f2d7d58e22aaf"]}, "['Q2', '2024']": {"answer": "6dee987100b88448061e2ddf751a1fa2 --> Board Member: We plan to launch payments in other GCC markets in FY25.\n\n6dee987100b88448061e2ddf751a1fa2 --> Board Member: We target to launch in South East Asia in FY25.\n\ne51d31ecd1f5411f6a8b4f53d7111f3f --> CCAvenue : Crossed 400,000+ by end of Q2 FY24 FY24 target – 1 million.\n\n64e6a959d3c41159338775fa7bf5bc49 --> The company has also made a capital investment of INR1.2 billion in the first half of '24 towards international markets with a strategy of country-in-a-box.\n\n6079df55182dedfd90c16f5c3edf6102 --> Vishal Mehta: In the next few years, we expect that international should be 30% of our overall contribution.\n\n0a9bb22cb7d8ecd1fccd5f7b56e98e3c --> Vishwas Patel: So with the partnerships with the local banks there, we're going to attract around 100,000 local outlets in various modes across the UAE, these QR codes, that is the TapPay implementation and channel and other kind of tech stuff.\n\n9d4b0d6d7c1710972f47ddc12e7665dd --> Board member: \"And it's like the world's largest with Saudi government targeting 30 million a year, religious tourism and 100 million for normal tourism.\"\n\n76fd61137903fb31eb4bc9b0062166fc --> Vishal Mehta: One is we will continue to expand the international participation from sub-10% to 30% of our revenues.", "citations": ["6dee987100b88448061e2ddf751a1fa2", "e51d31ecd1f5411f6a8b4f53d7111f3f", "64e6a959d3c41159338775fa7bf5bc49", "6079df55182dedfd90c16f5c3edf6102", "0a9bb22cb7d8ecd1fccd5f7b56e98e3c", "9d4b0d6d7c1710972f47ddc12e7665dd", "76fd61137903fb31eb4bc9b0062166fc"]}, "['Q4', '2022']": {"answer": "6e2b10880e3954534e94732318863162 --> Document states: \"Launching Saudi Arabia and USA in 2H’FY23\"\n\ncd9803f89dd1ad16f00ad7b04ba68364 --> Board Member: We are planning a high margin international payments business expansion to 10+ countries in the next 2-3 years.\n\nc382c6928e9c79a10fd0b1acd9f0de2d --> Will start by focusing on plans to launch a PG service in top 3-4 markets in terms of potential scale such as Eastern Europe, few developed markets globally.\n\nc382c6928e9c79a10fd0b1acd9f0de2d --> Plans to expand into multiple countries over the next 3-5 years.\n\n70a2700c3fa3024871457706cce2c635 --> Ayushi Shah: ...in the last earnings call you had stated that the company was planning on aggressively marketing to reach its TPV target of $100 billion from the then $44 billion run rate...", "citations": ["6e2b10880e3954534e94732318863162", "cd9803f89dd1ad16f00ad7b04ba68364", "c382c6928e9c79a10fd0b1acd9f0de2d", "70a2700c3fa3024871457706cce2c635"]}, "['Q4', '2024']": {"answer": "05068a5e43ab2e394a84680956ab7fdd --> INFIBEAM N AVENUES: Commercially start KSA in 1H FY25.\n\n05068a5e43ab2e394a84680956ab7fdd --> INFIBEAM N AVENUES: Launch payments in other GCC markets in FY25.\n\n05068a5e43ab2e394a84680956ab7fdd --> INFIBEAM N AVENUES: Start payments in Australia and USA in FY25.\n\n05068a5e43ab2e394a84680956ab7fdd --> INFIBEAM N AVENUES: Target to launch in South East Asia in FY25.\n\n9bb6308d536dfc24dfe54d81306efae7 --> Vishwas Patel: So, from that perspective for us, the initial growth momentum should come through that and a lot of our solutions and other things since it's a difficult market for the westerners but for us we are quite adept at it. So, we're looking very aggressively towards this and we intend to do in the mid-term better than what we have done in the UAE market.\n\nf780ee7ecb8b016bce1fcce70fd4f7bd --> Moderator: In the next 2 years our focus will be intensified as we elevate our international business to new heights, aiming to contribute 30% to our total income. Presently our international operations account for less than 10% of our total income.\n\n0da2d91cac31157efb4db9d092a24512 --> Vishal Mehta: You're right, international has growth potential. We expect to double our international business.\n\nda9a8ea50b1e11911c4b27abfd64172f --> Vishal Mehta: Once this clarity is in place now, we will open up the platform to one or two very large clients this year.", "citations": ["05068a5e43ab2e394a84680956ab7fdd", "9bb6308d536dfc24dfe54d81306efae7", "f780ee7ecb8b016bce1fcce70fd4f7bd", "0da2d91cac31157efb4db9d092a24512", "da9a8ea50b1e11911c4b27abfd64172f"]}, "['Q2', '2023']": {"answer": "8dc2b92341f89e684271c6270dd696e7 --> Board Member: We continue to build our merchant base as we continue to add more than 8,500 merchants on a daily basis. The number of merchants increased 77% to 7.3 million during Q2 '23. This is on backbone of our business and forms the base of all our future cross-sell opportunities. We are confident of growing this merchant base to over 10 million in the next two years.\n\n92c4ecf45ebc0ae5416a2186d8e10f9d --> Moderator: Since our company has launched CCAvenue TapPay in July of 2022, we have so far deployed CCAvenue TapPay across more than 15,000 terminals and we plan to take it to 1 lakh by end of this financial year FY '23 and we are targeting to reach 1 million merchants by the end of FY '24 on CCAvenue TapPay.\n\nba882f636021d8634e147f695755241e --> Strong tailwinds, customer adoption and support from RBI and government will help India digital payments industry grow at 30% or more for the next five years.\n\n0262d0b6616128505f30efa320a1a140 --> Vishwas: We are confident that by end of this year, we'll activate almost 100,000 terminals and eventually reach out to millions of merchants globally.\n\n4897e37f3adb4fb3c3194fed4486ac03 --> Vishal Mehta: So basically, we had launched this in July of '22 and in the last quarter, we have already deployed 15,000 implementations terminals in merchants.\nAnd our expectation is that we will get to at least 100,000 terminals by end of FY '23.\nSo our expectation and this is for the India market.\nSo, we think that our target for the offline merchant is at least 1 million by end of '24.\nAnd so, I think from a current state of 15,000, we want to reach 1 million merchants by end of '24.\nThat's our guidance as far as what we'd like to accomplish in India.\n\n5926b54584a2c1355f9a10f9d50f1a42 --> Vishal Mehta: Now with the offline solutioning that we have with TapPay, we expect to add tens of thousands of merchants in the international market.\n\n9a2060707ed972b7f6c8879ba16e0827 --> Vishwas Patel: We already announced that we are onboarding more than 8,000 merchants every day. So those merchants will also be going in for this TapPay solution from my existing ecosystem.\n\nd7202257e63c2d13a9d54daa7f35592b --> Vishwas Patel: \"Slowly and steadily I think by the end of Q4, we should open up for everybody.\"\n\nd7202257e63c2d13a9d54daa7f35592b --> Vishwas Patel: \"I think around 100,000 we'll do it by end of this quarter.\"", "citations": ["8dc2b92341f89e684271c6270dd696e7", "92c4ecf45ebc0ae5416a2186d8e10f9d", "ba882f636021d8634e147f695755241e", "0262d0b6616128505f30efa320a1a140", "4897e37f3adb4fb3c3194fed4486ac03", "5926b54584a2c1355f9a10f9d50f1a42", "9a2060707ed972b7f6c8879ba16e0827", "d7202257e63c2d13a9d54daa7f35592b"]}, "['Q4', '2023']": {"answer": "0dd82f2ea6d1ae07b38e23495da2ae85 --> Mr. L: Launched one of the world’s most advanced omnichannel payment solution, featuring India’s first pin-on-glass softPoS solution, CCAvenue TAPpay; 150,000 downloads in just 6 months of launch, targeting 1mn by the end of FY24.\n\na59013faad9689e7918528868262ad43 --> Board Member: We are aiming to increase our ‘offline’ presence through CCAvenue TapPay to 1 million merchants by FY24 end.\n\naf0fa1ce2c14a8b931d6df67e591d285 --> Board Member: Australia: To be operational in 2H FY24.\n\naf0fa1ce2c14a8b931d6df67e591d285 --> Board Member: USA: Late FY24 / early FY25.\n\naf0fa1ce2c14a8b931d6df67e591d285 --> Board Member: Plans to expand into multiple countries over the next 3-5 years.\n\n8fc2f3d58638488dd1c7dae958107f0a --> Transcript mentions, \"9.2 million total merchants; approx. 9500 merchants added everyday in FY23.\"\n\n0efb389e7b37e2881b85ced8cacfab71 --> Mayur Liman: ...what makes us confident that we will achieve the 1 million in financial year 2024?\n\n9c487ea0d272131511fa3ab72333ece4 --> Board Member: We think that in the next three to six months, you will start seeing certain merchants that you would be transacting with on an offline basis to utilizing the Tap Pay solution from us, which is CCAvenue Tap Pay. Of course, we've got plans aligned to be able to offer it to about 1 million merchants because that will give us a combination of online and offline.\n\n8f103f2cddbf410a2a59e28e8c3ce395 --> Board Member: \"1 million merchants is definitely what we are targeting this year.\"\n\nb4a08583ea43e5b9ab24296621f7d348 --> Vishwas Patel: We're pretty confident in the next two or three quarters, we'll achieve the 1 million number.\n\ne36d038b2f90eec1af25892aa81d0600 --> Board member: We think that international can have the potential to be at least 25%, 30% of the overall transaction processing volumes.", "citations": ["0dd82f2ea6d1ae07b38e23495da2ae85", "a59013faad9689e7918528868262ad43", "af0fa1ce2c14a8b931d6df67e591d285", "8fc2f3d58638488dd1c7dae958107f0a", "0efb389e7b37e2881b85ced8cacfab71", "9c487ea0d272131511fa3ab72333ece4", "8f103f2cddbf410a2a59e28e8c3ce395", "b4a08583ea43e5b9ab24296621f7d348", "e36d038b2f90eec1af25892aa81d0600"]}, "['Q3', '2024']": {"answer": "1e178436455610f8bcbea98306bfc2aa --> Company will create employment opportunities for over 5,000 individuals through gig economy and full-time employment over five years.\n\ne89f748107722dc71f9f9fda51c3bc55 --> Document: Launch CCAvenue TapPay in UAE and Saudi initially.\n\nefe36f5dfe925c08ab894bc29d1ee0ba --> Company targets ‘merchants and banks’ for scalable and sustainable growth.\n\n93f8103b6a663f3becd87d4ad7e1fad5 --> Vishal Mehta: \"We believe that we would like to grow the trajectory from 7000 merchants to 70000 merchants in the next 12 to 24 months.\"\n\n0a8aa638a48eaee08303276a6bc7595c --> We believe that if we can scale up and if you have an aspiration to scale our international business from a single digit percentage to a two-digit percentage number in the coming 24 months we do the appropriate level of capex funding for the same.\n\nfd20290df13e21768e229d269cc9292f --> Vishal Mehta: In the earlier question I mentioned that we would like to grow from 7000 merchants today using our payments framework to 70000 so we would like to grow 10x.\n\n3ecbcd282d8dd2b774cc8728e46746da --> Vishwas Patel: \"...so now we are expanding the scope as Vishal said earlier how do we go from 10x merchant from 7000 to 70000 so that is where we are focusing right now on totally offline solution.\"", "citations": ["1e178436455610f8bcbea98306bfc2aa", "e89f748107722dc71f9f9fda51c3bc55", "efe36f5dfe925c08ab894bc29d1ee0ba", "93f8103b6a663f3becd87d4ad7e1fad5", "0a8aa638a48eaee08303276a6bc7595c", "fd20290df13e21768e229d269cc9292f", "3ecbcd282d8dd2b774cc8728e46746da"]}, "['Q3', '2023']": {"answer": "d2059a7aadc71cfd3c104870ef99b37c --> Board Member: Last quarter was very strong for us. We on-boarded more than 0.5 million merchants in Q3 alone in the payment gateway business alone, which is we have a history of more than 20 plus years and we have overall added a record 1.1 million merchants in a single quarter across all our offerings, reaching 8.4 million merchants.\n\ne4c66e4231bd82aaaf8845e322c1623f --> Sunil Bhagat: We expect to onboard 10,000 new merchants over the next two quarters to enhance our growth trajectory.\n\nb0504b24f88d84a6b12a2dad021f165d --> Vishal Mehta: \"So we believe that if we are at 8.1 merchants, we should get to 10 million merchants.\"\n\n8d5b9a4162c2acc8d886d94a49e72e23 --> Vishal Mehta: What we had communicated last time was that we would like to reach 100000 odd merchants by this year end, which is March 2023, and next year we would like to get to a million merchants. Which is 10 lakh merchants by end of 2024.\n\n8d5b9a4162c2acc8d886d94a49e72e23 --> Vishal Mehta: We believe that 100000 we will be on track to achieve by end of this year, which is FY2023.\n\n8d5b9a4162c2acc8d886d94a49e72e23 --> Vishwas Patel: ...we have been approved by card networks for our SDK to be integrated into existing payments network, which means that the million looks very doable for us for next year.\n\nd3bae29ffabaff1f0f4e455fa5e48402 --> Vishal Mehta: For this, that could be in the hospitality solution that more than 1 million room nights in a year, bookings for our hospitality partners.\n\n9d9165e2031592b302704ef2d8969c4c --> Vishal Mehta: ... as we mentioned earlier, we aim to take it up to 1 million up to 9 merchants shortly.\n\n211cd31879771e5047bd411f3ee00e16 --> Vishal Mehta: In the short-term, you may see it, you will see, if you look at the daily merchant addition averages, we used to have in Q2, we were averaging about 7000 merchants we have gone to 11700 from there on a daily average business.", "citations": ["d2059a7aadc71cfd3c104870ef99b37c", "e4c66e4231bd82aaaf8845e322c1623f", "b0504b24f88d84a6b12a2dad021f165d", "8d5b9a4162c2acc8d886d94a49e72e23", "d3bae29ffabaff1f0f4e455fa5e48402", "9d9165e2031592b302704ef2d8969c4c", "211cd31879771e5047bd411f3ee00e16"]}, "['Q1', '2025']": {"answer": "ab55ecb7e842752961ca4f446ffcb9b8 --> Vishwas Patel: Over the next 2 years, we will intensify our focus on elevating our international business, aiming for it to contribute 12% to 15% of our net revenue income, up from single-digit contribution currently.\n\n8a4c8badf50c99ceac609925987b796e --> Vishal Mehta: We believe that by end of this quarter is in Q2, we should have a pretty good idea in terms of what it means with GeM if initiated friendly arbitration And we expect that we should be able to get some insights and provide more feedback to you in the next -- in this coming quarter.", "citations": ["ab55ecb7e842752961ca4f446ffcb9b8", "8a4c8badf50c99ceac609925987b796e"]}}]}, {"theme": "Technological Innovation", "topics": [{"topic": "R&D Investment", "['Q1', '2025']": {"answer": "2a040ee147792682a4c9999d85f15c69 --> Vishal Mehta: That patent is under consideration. So I think unfortunately it takes time. So this particular thing about the AI patent that we have filed, that's also a filing. But we expect that we should -- I mean, US patents often is slightly faster. So we expect that we should be able to get something in the next 6 to 12 months.", "citations": ["2a040ee147792682a4c9999d85f15c69"]}}, {"topic": "Product Development Cycle", "['Q2', '2022']": {"answer": "c16921dbb183c7e9c7fd2dd836b7e5e8 --> AI-based credit platform launch: greenfield development\nPlatform to be ready for launch before December 2021.", "citations": ["c16921dbb183c7e9c7fd2dd836b7e5e8"]}, "['Q1', '2025']": {"answer": "e8fb217b2051977521875719e96e0472 --> Document states: \"In 2024, launch a complete all-encompassing POS device for offline payments.\"", "citations": ["e8fb217b2051977521875719e96e0472"]}, "['Q2', '2024']": {"answer": "86f530e03bc1e506f92c32e0c0bfd643 --> Board Member: This is to be followed by the launch of TapPay (mobile SoftPoS) in UAE before the end of FY24.\n\nf5d5c44a969bd8a89da99591db13ddfe --> Later this year, we will also be launching TapPay, CCAvenue TapPay, and other features in the UAE market.\n\n7dd6f737ada027cfe9438c5b527137e8 --> Board Member: We believe that once we add those modules, and we expect that we'll have more to announce in the Q4 timeframe of this year, that we will be able to pick up implementations, which are potentially much larger than what we have done so far.\n\n794d4a99e8c162d0d120c431a7163d67 --> Vishal Mehta: \"And TCS has about 18-odd months to be able to build out a new GeM platform.\"", "citations": ["86f530e03bc1e506f92c32e0c0bfd643", "f5d5c44a969bd8a89da99591db13ddfe", "7dd6f737ada027cfe9438c5b527137e8", "794d4a99e8c162d0d120c431a7163d67"]}, "['Q4', '2022']": {"answer": "13904bf36ca603325c27f3fa6e8c6888 --> Q4 FY22 Key Business Updates: Commercially launching TAPPay with additional functionalities for merchants in Q2 FY23.", "citations": ["13904bf36ca603325c27f3fa6e8c6888"]}, "['Q4', '2023']": {"answer": "888036e9045f4d988298f183dc93af47 --> CCAvenue Omnichannel Payment Solution FY24 target – 1 million", "citations": ["888036e9045f4d988298f183dc93af47"]}, "['Q3', '2022']": {"answer": "f8ca09d643676305d036df1b6fe5a8fe --> R. Srikanth: Second thing is that we have said in Q2 that we will do an artificial intelligence platform for our credit services and lending services and as we committed that by December end, we have launched actually our credit service platform, even though technically it launched today, it got ready in December and we are waiting for the actual launch date.", "citations": ["f8ca09d643676305d036df1b6fe5a8fe"]}, "['Q3', '2023']": {"answer": "d650f9406161cb5a1a63a7d0a5534de3 --> Vishal Mehta: The new RFPs states that you need to build-out the framework in the next 18 months, before existing opportunities will move on to the new framework. So the existing contract which we have will go on until 2024.", "citations": ["d650f9406161cb5a1a63a7d0a5534de3"]}, "['Q4', '2024']": {"answer": "173c53c5d6850fe077f6fa8d404bb1da --> Board Member: We expect that we have not even yet rolled out TapPay and some of the other solutions that we talked about in that market which we intend to do in FY25.", "citations": ["173c53c5d6850fe077f6fa8d404bb1da"]}, "['Q3', '2024']": {"answer": "06ce80e650df8025d9966b191e1ec826 --> Moderator: We think that maybe in the next one or two quarters we would be publishing a few frameworks out there for people to utilize for the greater community to utilize.", "citations": ["06ce80e650df8025d9966b191e1ec826"]}}, {"topic": "Technology Adoption Rate", "['Q1', '2023']": {"answer": "d9816ccae6b43ea6e6471e90b929cfbe --> Moderator: RBI through its most recent published payment vision 2025 report is aiming to triple the digital payments in India.", "citations": ["d9816ccae6b43ea6e6471e90b929cfbe"]}, "['Q3', '2022']": {"answer": "96f0bfae56d012374ab81004ab1eae2d --> Vishwas Patel: And, we anticipate the point-of-sale terminals to disappear in the next three years, so this is the future technology, tap-on-phone, and any phone can become an acquiring point-of-sale terminal.", "citations": ["96f0bfae56d012374ab81004ab1eae2d"]}, "['Q3', '2023']": {"answer": "3cd1c3fb37523e0363dea454d4908fc5 --> Board Member: To capture the massive growth we have charted very clear strategies and we are working on certain initiatives like our omni channel payment solution that we will deploy across more than a million devices by end of FY2024.\n\nb0504b24f88d84a6b12a2dad021f165d --> Vishal Mehta: \"So our expectation is that going to a million, that is more than 10% of merchant base, you will see perhaps some improvements in that area as well.\"", "citations": ["3cd1c3fb37523e0363dea454d4908fc5", "b0504b24f88d84a6b12a2dad021f165d"]}}]}, {"theme": "Regulatory Environment", "topics": [{"topic": "Compliance Standards", "['Q1', '2024']": {"answer": "11aeeecf03f6327150e65abcedf2ca86 --> Board Member: We will commercially start operations in KSA by the end of Q2 after obtaining the necessary data localisation compliance certification from the regulator.", "citations": ["11aeeecf03f6327150e65abcedf2ca86"]}, "['Q2', '2024']": {"answer": "6dee987100b88448061e2ddf751a1fa2 --> Board Member: We aim to commercially start KSA in 2H FY24 upon receiving data localisation compliance certification from the regulator.", "citations": ["6dee987100b88448061e2ddf751a1fa2"]}, "['Q3', '2024']": {"answer": "e89f748107722dc71f9f9fda51c3bc55 --> Document: Commercially start KSA in 2H FY24 upon receiving data localization compliance certification from the regulator.", "citations": ["e89f748107722dc71f9f9fda51c3bc55"]}, "['Q3', '2023']": {"answer": "ef3fc8b9528343bc980c3112dc009327 --> Vishwas Patel: The government has increased it by two times to Rs.2137 Crores from the previous 1040 odd Crores in the previous year. We hope to receive our share in Q4 or Q1 of next financial year.", "citations": ["ef3fc8b9528343bc980c3112dc009327"]}}, {"topic": "Licensing Requirements", "['Q1', '2024']": {"answer": "fa5b954a453b916374986e9bd2f003eb --> Vishal Mehta: It's pending regulatory approvals, but we think it should be this financial, this fiscal but of course it has to go through the process.", "citations": ["fa5b954a453b916374986e9bd2f003eb"]}}, {"topic": "Data Privacy Measures"}]}, {"theme": "Strategic Partnerships", "topics": [{"topic": "Alliance Formation", "['Q2', '2022']": {"answer": "0b716e4721e898604ee11414217324d3 --> Board Member: Started investment, to enable credit/lending thru NBFCs from Q1; Q4’22 expected launch.", "citations": ["0b716e4721e898604ee11414217324d3"]}, "['Q1', '2024']": {"answer": "6bdefca04b305f2576ef37b44fdf9d26 --> The document states, “Company to increase its stake in cross-border remittance platform provider, Fable Fintech Pvt Ltd (“Fable\n\nb2b56fdf0fdbadd41b386c8bdf2604ca --> [Unnamed Speaker]: While we were looking at this business and while we're looking at payments and the globalization of payments, we'll be adding an additional 25% and increasing our stake in the company to 41%.", "citations": ["6bdefca04b305f2576ef37b44fdf9d26", "b2b56fdf0fdbadd41b386c8bdf2604ca"]}, "['Q4', '2022']": {"answer": "13904bf36ca603325c27f3fa6e8c6888 --> Q4 FY22 Key Business Updates: Tie-ups and integration with lending institutions in full swing for commercial launch of TrustAvenue in 2H’FY23.", "citations": ["13904bf36ca603325c27f3fa6e8c6888"]}, "['Q3', '2024']": {"answer": "1e178436455610f8bcbea98306bfc2aa --> Company to invest INR 250 million.", "citations": ["1e178436455610f8bcbea98306bfc2aa"]}, "['Q3', '2023']": {"answer": "be98007558c39c60288174422cda1579 --> Vishal Mehta: Next, it will be in the first-quarter to the second-quarter of next year. So that is the timeframe when you can expect to hear from us about Trust Avenue more.", "citations": ["be98007558c39c60288174422cda1579"]}, "['Q1', '2025']": {"answer": "5ce069a3acae71f6a51662e487c470ad --> Vishal Mehta: And we expect that in the next 4 to 8 weeks, we'll be able to share more in terms of several contracts that get converted.", "citations": ["5ce069a3acae71f6a51662e487c470ad"]}, "['Q4', '2024']": {"answer": "6aa510d3c57843bcd5022493eaa1fc89 --> Vishwas Patel: This past quarter we announced to invest USD10 million for a 20% stake in XDuce, a leading US based enterprise application and AI development Company.", "citations": ["6aa510d3c57843bcd5022493eaa1fc89"]}}, {"topic": "Supplier Relationships"}, {"topic": "Distribution Channels"}]}, {"theme": "Customer Satisfaction", "topics": [{"topic": "Net Promoter Score"}, {"topic": "Retention Rate"}, {"topic": "Customer Feedback"}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Cost Management", "['Q1', '2022']": {"answer": "eb10df1fb51d8cd96d0d92dca6f6cf25 --> Mr. Hiren Padhya: \"Our objective is to reduce operational costs by 10% over the next six months.\"", "citations": ["eb10df1fb51d8cd96d0d92dca6f6cf25"]}, "['Q1', '2023']": {"answer": "f640563ebcdf11ddb7161921ea19aeae --> Mr. Sunil Bhagat: Our goal is to decrease operational costs by 10% by year-end.", "citations": ["f640563ebcdf11ddb7161921ea19aeae"]}, "['Q4', '2024']": {"answer": "2a1131de90a5046d7eac31f807757703 --> CEO: We plan to reduce operational costs by 10% over the next two quarters.\n\nc2e19b18d59eb1ab3f5ca6653ed91f8c --> Mr. Sunil Bhagat: We have set a target to reduce operational costs by 10% over the next two quarters to improve our margins.\n\n0f70b7789a4843f1b2dad6150969d7d2 --> Ms. Johnson: We are targeting a 10% reduction in operational costs over the next six months.", "citations": ["2a1131de90a5046d7eac31f807757703", "c2e19b18d59eb1ab3f5ca6653ed91f8c", "0f70b7789a4843f1b2dad6150969d7d2"]}, "['Q3', '2023']": {"answer": "fb77b7d850b8629312c56f9a25e06ea9 --> Mr. Sunil Bhagat: \"Our goal is to reduce operating costs by 10% in the next quarter through efficiency and process optimization.\"", "citations": ["fb77b7d850b8629312c56f9a25e06ea9"]}, "['Q1', '2025']": {"answer": "b6a543f64b74d5760c91e49bfc6faf6f --> Mr. Vishwas Patel: Our goal is to cut operational costs by 5% in the coming six months.", "citations": ["b6a543f64b74d5760c91e49bfc6faf6f"]}, "['Q2', '2022']": {"answer": "d24f016e11796e39d6e8820c2b187a91 --> Ms. Johnson: We plan to reduce our operating costs by 5% by the end of Q3.", "citations": ["d24f016e11796e39d6e8820c2b187a91"]}, "['Q2', '2024']": {"answer": "95610f999befe89b75a988964ceed224 --> Mr. Patel: By optimizing our supply chain and leveraging new technologies, we aim to reduce operational costs by 10% over the next two quarters.", "citations": ["95610f999befe89b75a988964ceed224"]}}, {"topic": "Process Optimization", "['Q1', '2023']": {"answer": "015db84e5c1da1547befb7593cf19d0d --> Board Member: GeM targeting 75% procurement by 15th August to commemorate India’s 75th Independence Day.", "citations": ["015db84e5c1da1547befb7593cf19d0d"]}, "['Q4', '2023']": {"answer": "39584b18b44d41808e386f83992ed8ff --> Board Member: So we expect that even if the new RFP is out there, it will take 24 months for a new framework to be established, from now. And that gives us enough reason to believe that up to December 2025 we will have a lot of work to be done for GeM.", "citations": ["39584b18b44d41808e386f83992ed8ff"]}}, {"topic": "Scalability Potential", "['Q2', '2023']": {"answer": "1fbcd8bdbc88096e60b0de31adaa525a --> Speaker (not specified): And we want to be able to go and deploy it across at least 100,000 implementations by this year and then scale it to one million or more next year.", "citations": ["1fbcd8bdbc88096e60b0de31adaa525a"]}, "['Q3', '2023']": {"answer": "b4ccd688563534ab7ba604114044df5a --> Board member: We have commercially started operations in Saudi Arabia, and we will scale this from next financial year.", "citations": ["b4ccd688563534ab7ba604114044df5a"]}}]}, {"theme": "Competitive Landscape", "topics": [{"topic": "Competitor Analysis"}, {"topic": "Pricing Strategy"}, {"topic": "Market Entry Barriers"}]}]