[{"theme": "Revenue Growth and Financial Strategy", "topics": [{"topic": "Margin expansion initiatives", "data": {"['Q1', '2023']": {"answer": "b2a1b14ac20a839258a64724c99ccdd1 --> The EBITDA margin has gone up to 64% in the core business, which includes India payments and platforms.", "citations": ["b2a1b14ac20a839258a64724c99ccdd1"]}, "['Q1', '2024']": {"answer": "390605f5732c7923b12261c9725a242d --> The company plans to take their net take rate to double digits in the short to medium term.", "citations": ["390605f5732c7923b12261c9725a242d"]}, "['Q3', '2023']": {"answer": "597af3d3c05003d6efcf6a655ac8618d --> The speaker mentioned their intention to improve the net take rates in the payments business to double-digits by FY2025.", "citations": ["597af3d3c05003d6efcf6a655ac8618d"]}, "['Q1', '2025']": {"answer": "32ba32a22ba8d388edaaefcac20823be --> The CFO mentioned that the company plans to reduce debt by 15% over the next two quarters.\n\nc95b1b646f1402736a68b487cfc953b5 --> The CFO mentioned an expectation to achieve a gross margin improvement of 5% by the end of the fiscal year.", "citations": ["32ba32a22ba8d388edaaefcac20823be", "c95b1b646f1402736a68b487cfc953b5"]}, "['Q4', '2024']": {"answer": "93d19d47f1113d8b8391a81722ee3ae5 --> Vishwas Patel stated that the large investments in CAPEX are expected to be about $5 to $6 million per region.", "citations": ["93d19d47f1113d8b8391a81722ee3ae5"]}, "['Q2', '2024']": {"answer": "5fbb828823c95491074e29542be60d02 --> The CFO indicated a target of achieving a 30% gross margin by the end of fiscal year 2024.\n\n95610f999befe89b75a988964ceed224 --> The CFO projected a 12% rise in EBITDA margin by the end of the fiscal year.\n\n64e6a959d3c41159338775fa7bf5bc49 --> The management is committed to increasing take rates to double digits by the end of this financial year.\n\nb4ece03f895f3ed84b3c4d5706ac442e --> Vishal Mehta (Inferred as CEO) stated that they have given guidance to increase net take rates to double digits.", "citations": ["5fbb828823c95491074e29542be60d02", "95610f999befe89b75a988964ceed224", "64e6a959d3c41159338775fa7bf5bc49", "b4ece03f895f3ed84b3c4d5706ac442e"]}, "['Q4', '2023']": {"answer": "c728f7ae16caa38151190cee4efb9e52 --> The Chief Financial Officer mentioned that the company's gross margin is expected to improve by 5% within the next two quarters.\n\nc39988ab351329a4e97f25c3ccb99830 --> Sunil Bhagat stated their intention to take the payment net take rate to double digits by the end of FY '24.", "citations": ["c728f7ae16caa38151190cee4efb9e52", "c39988ab351329a4e97f25c3ccb99830"]}}}, {"topic": "Profitability metrics", "data": {"['Q1', '2023']": {"answer": "6941bc39d631c0b752ff9682707795f1 --> The CFO provided guidance on achieving a 20% increase in EBITDA by the end of the current fiscal year.\n\n331721dc678d46a3abff75ee898bfade --> EBITDA as a percentage of net revenue has risen to 64% from 60% year-over-year which we had guided in FY21.\n\n5400d8ef85515f202d307c77b1723394 --> The speaker mentioned the expectation of take rates to improve quarter-over-quarter.\n\n90dbfd73259133242dd07dccd350c2e2 --> The management has given guidance for revenue and net profit.", "citations": ["6941bc39d631c0b752ff9682707795f1", "331721dc678d46a3abff75ee898bfade", "5400d8ef85515f202d307c77b1723394", "90dbfd73259133242dd07dccd350c2e2"]}, "['Q1', '2024']": {"answer": "2d5b2336c323a03137b1d08e116a552a --> Vishal Mehta expressed confidence in achieving the year's guidance as shared in their presentation and press release.\n\n0ffdae94dd182c8ebf89f47523000bb7 --> The management expects the EBITDA for the year to be between INR 230 to INR 235 crores, with an increase of around 30% year-over-year.\n\n0ffdae94dd182c8ebf89f47523000bb7 --> The management expects PAT for the year to be between INR 130 to INR 150 crores, which is about 40% to 60% year-over-year increase.\n\n8bca37ade8163d4769a2deb7ced336e1 --> Vishwas Patel mentioned that Go Payments has achieved profitability from this month.", "citations": ["2d5b2336c323a03137b1d08e116a552a", "0ffdae94dd182c8ebf89f47523000bb7", "8bca37ade8163d4769a2deb7ced336e1"]}, "['Q2', '2023']": {"answer": "ba882f636021d8634e147f695755241e --> The company expects to achieve a profit after tax of INR 110 crores to INR 125 crores in FY '23.\n\nb0c64d49312b9aa583dcb54dc65d50aa --> Vishal Mehta stated that typically, there will not be such a large difference in the reported PAT between the consolidated and standalone numbers going forward.\n\ncf17ecff07654bec34eb2c0efff29ca0 --> The guidance given is for an operational profit of INR 125 crores, excluding the divestment profit.\n\n60b916601b931bc5798a89d8e93452e1 --> No explicit guidance was provided in the transcript excerpt regarding specific metrics, timelines, or actionable objectives.\n\n1fbcd8bdbc88096e60b0de31adaa525a --> We expect EBITDA to come between INR 170 crore to INR 190 crores and a PAT of INR 110 crores to INR 125 crores.", "citations": ["ba882f636021d8634e147f695755241e", "b0c64d49312b9aa583dcb54dc65d50aa", "cf17ecff07654bec34eb2c0efff29ca0", "60b916601b931bc5798a89d8e93452e1", "1fbcd8bdbc88096e60b0de31adaa525a"]}, "['Q3', '2023']": {"answer": "2a30305a25bdaf3af39725e879e735b8 --> The CFO mentioned plans to reduce the debt-to-equity ratio to below 1.5 by the end of the fiscal year.\n\n1bffcb7c9a0d881bc57b264963bdce88 --> The company intends to achieve a double-digit net take rate by FY2025.\n\nb0504b24f88d84a6b12a2dad021f165d --> Vishal Mehta aims to achieve a better take rate by focusing on profitable sectors and leveraging international growth and offline payments.\n\n3a52094ffd72cc677b6eee926cf29134 --> Overall, we are on-track to process transactions worth Rs.7.5 lakh Crore for FY2025.\n\nb205b29574d08a9ae7560b26bcc614ec --> Vishal Mehta stated that the guidance for revenues is definitely on the higher-end, for EBITDA will be in the higher-end of the range, and for PAT, the performance in Q4 will be assessed before further updates.", "citations": ["2a30305a25bdaf3af39725e879e735b8", "1bffcb7c9a0d881bc57b264963bdce88", "b0504b24f88d84a6b12a2dad021f165d", "3a52094ffd72cc677b6eee926cf29134", "b205b29574d08a9ae7560b26bcc614ec"]}, "['Q1', '2025']": {"answer": "4d61df4996656ed3d213262782f70842 --> The speaker mentioned that they expect the full year EPS to grow similarly to previous guidance provided.\n\nab55ecb7e842752961ca4f446ffcb9b8 --> Vishwas Patel projected revenue growth of approximately 25% to 30%, EBITDA of around 10% to 20%, and PAT of 20% to 35% for 2025.\n\n06171f43f42fbe7625020b093a50d677 --> The CFO outlined the goal to reduce debt by $50 million by the close of the financial year.\n\n513beedc2efde54d861af19686d93871 --> The company increased its net take rates in payments to 11.2 bps from 8.4 bps in the same quarter last year, contributing to growth in profitability.\n\nd6ddafe40a6a389449d17cdf0dd59dbb --> The management team mentioned achieving a double-digit take rate.\n\n134bcf1b04f6bbbea11d18047b02f1a3 --> Vishal Mehta stated that ODigMa will have annual revenue of INR30 crores and profitability of less than INR1 crore.\n\n4fe97de6518fa82b87293cccd723acb9 --> The 30% number is projected over a 2- to 3-year time horizon and the 12% to 15% growth is expected in this particular financial year.", "citations": ["4d61df4996656ed3d213262782f70842", "ab55ecb7e842752961ca4f446ffcb9b8", "06171f43f42fbe7625020b093a50d677", "513beedc2efde54d861af19686d93871", "d6ddafe40a6a389449d17cdf0dd59dbb", "134bcf1b04f6bbbea11d18047b02f1a3", "4fe97de6518fa82b87293cccd723acb9"]}, "['Q4', '2024']": {"answer": "fc815e956bf7db62c30ed5c12019da47 --> Infibeam had a gross revenue target of 3,000 to 3,300 crores and a net revenue target of 410 to 415 crores for the full year FY24.\n\nfc815e956bf7db62c30ed5c12019da47 --> The target for EBITDA was 235 crores for the year.\n\ne894ad386c02c720dd81820ec60c4908 --> Vishal Mehta stated the goal of achieving a double digit take rate in India.\n\n3b9d0bf7143f1f00ad4b3c836c64ef50 --> Sunil Bhagat provided guidance on gross revenue, net revenue, EBITDA, and PAT for the upcoming period.\n\n3b9d0bf7143f1f00ad4b3c836c64ef50 --> Vishal Mehta confirmed an expectation of double-digit ROE for FY25.\n\ne79daccb47f1186d774a59af78c43ef5 --> The CFO mentioned targeting an EBITDA margin of 25% by the end of the fiscal year.\n\neb8099ae539218c4a07f7c8252b7d4bc --> Vishal Mehta indicated that the net revenue run rate is expected to be around 55 crores per quarter, with a variance of plus or minus 10%.\n\n93d19d47f1113d8b8391a81722ee3ae5 --> Vishal Mehta stated that potential dues and receivables such as the UPI dues from banks are expected to be received within 6 months.", "citations": ["fc815e956bf7db62c30ed5c12019da47", "e894ad386c02c720dd81820ec60c4908", "3b9d0bf7143f1f00ad4b3c836c64ef50", "e79daccb47f1186d774a59af78c43ef5", "eb8099ae539218c4a07f7c8252b7d4bc", "93d19d47f1113d8b8391a81722ee3ae5"]}, "['Q2', '2024']": {"answer": "e383c6527eb8e73ce5b8b1dd864140d9 --> The company aims to achieve a double-digit payment net take rate by the end of FY '24.\n\nea0776ab5d62c5ecbbe909827abdbaba --> The speaker mentioned that take rates are expected to be around double digits or 10 basis points by the end of this year.\n\n8f9e53b8df65a38d4c2160e36d1d8987 --> Vishal Mehta stated that the company plans to achieve a net take rate of 10 basis points in the domestic market and 18 to 20 basis points in the international market by the end of 2024.", "citations": ["e383c6527eb8e73ce5b8b1dd864140d9", "ea0776ab5d62c5ecbbe909827abdbaba", "8f9e53b8df65a38d4c2160e36d1d8987"]}, "['Q4', '2023']": {"answer": "d5a1200a894dae0f2311e4a49f3994d2 --> The Board has recommended a full year dividend of 5%.\n\n2d5927921f5f02715aa9208ef008bab6 --> The company expects its net earnings in the payment business to increase to double-digit levels by the end of FY '24.\n\n24021d68c23d729e9fe6f1783b9c38e2 --> Mr. Vishal Mehta (MD) did not provide any explicit numerical guidance, timeline, or actionable objectives in the provided transcript segment.\n\nd88b96598763f00290f09deceb09fbb7 --> The improvement in net earnings per transaction is aimed to reach mid or high teens by FY '25.\n\n150eea2539a79f13092dfd1314b3481e --> Vishal Mehta stated that they are looking for a double-digit take rate by the end of 2024.\n\na0fc4666c5ef83d21484a27d2330a8e2 --> Vishal Mehta stated a 40% year-over-year growth target for revenues and EBITDA for the current year.", "citations": ["d5a1200a894dae0f2311e4a49f3994d2", "2d5927921f5f02715aa9208ef008bab6", "24021d68c23d729e9fe6f1783b9c38e2", "d88b96598763f00290f09deceb09fbb7", "150eea2539a79f13092dfd1314b3481e", "a0fc4666c5ef83d21484a27d2330a8e2"]}, "['Q3', '2024']": {"answer": "8afb02a19bfcb2de45c6b73745193f6f --> The CEO indicated that the company has resolved to focus on growing profitably instead of just growth at any cost.\n\n93f8103b6a663f3becd87d4ad7e1fad5 --> Vishal Mehta mentioned the aim to reach double-digit basis points (bps) in terms of take rates in India.\n\n8a7e0e839d8f3300fc81aedb3f0352ef --> The CFO projected a 5% increase in net profit margin by the end of the fiscal year.\n\n46d9d1ee866561939f856bd1e2f8305c --> Purvesh Parekh indicated that the standalone business is generating an ROE of somewhere close to 25% for the first half of FY2024.", "citations": ["8afb02a19bfcb2de45c6b73745193f6f", "93f8103b6a663f3becd87d4ad7e1fad5", "8a7e0e839d8f3300fc81aedb3f0352ef", "46d9d1ee866561939f856bd1e2f8305c"]}}}, {"topic": "Revenue diversification strategies", "data": {"['Q1', '2023']": {"answer": "e7a18921d76102447e3b400558ab6b4a --> Vishal Mehta stated the goal of achieving a transaction processing value run rate of 7.5 lakh crore by the end of FY24.\n\n5315ce4cc59f1d9651695a78eeefc54d --> Vishal Mehta stated that they are entering into working capital and invoice discounting soon, though the precise timeline was not provided in this excerpt.\n\n0e8a0a3479275ee6f77a5f0ec3cea880 --> The company plans to help process more than a billion dollars of loans in the coming year.\n\n99b244d3356659d31a1ec89be7a6dfcb --> Vishal Mehta expects to cross more than a billion dollars of financing for settlement loans.\n\n732754e2a986cf3dc6a1abb687073186 --> The CFO stated that the company is targeting a 20% increase in total revenue contribution from new businesses by the end of the fiscal year.", "citations": ["e7a18921d76102447e3b400558ab6b4a", "5315ce4cc59f1d9651695a78eeefc54d", "0e8a0a3479275ee6f77a5f0ec3cea880", "99b244d3356659d31a1ec89be7a6dfcb", "732754e2a986cf3dc6a1abb687073186"]}, "['Q1', '2024']": {"answer": "ce92f1f0dca39b580a32923c2b3ef235 --> The speaker expected revenues to come in between INR 3,000 to INR 3,300 crores for the year, with gross revenue growth estimated at about 50% to 70% year-over-year, and net revenue projected to be around INR 410 to INR 415 crores.\n\nc1a35591c87ad10cbb2bbc8287e6a964 --> The speaker inferred as a management member mentioned a target to increase the take rate to double digits through international expansion and focusing on certain high-yield verticals.\n\nfc05b10b3771fc476b7ad9cb5b357fec --> The company plans to double down on express settlement this year using their cash reserves.\n\nc689fba167e3ada8380e678d3c48460c --> The company expects take rates to improve and move towards double-digit figures by the end of the year.\n\nab251550a907597633297011724ad144 --> Vishal Mehta mentioned that they aim to increase express settlement from $1 billion to $10 billion.", "citations": ["ce92f1f0dca39b580a32923c2b3ef235", "c1a35591c87ad10cbb2bbc8287e6a964", "fc05b10b3771fc476b7ad9cb5b357fec", "c689fba167e3ada8380e678d3c48460c", "ab251550a907597633297011724ad144"]}, "['Q2', '2023']": {"answer": "b311c0c11a96935725a094607813aa36 --> Vishal Mehta indicated that the company aims to achieve a double-digit net take rate in India within the next two years, potentially earlier.\n\n792361d79e969215fd8134c81d9b60f6 --> The management expects to deliver higher than their stated revenue and operating guidance as mentioned in Slide 12.\n\n7f9cd754f16c855541715234dbb26745 --> Vishal Mehta communicated guidance for the transaction processing volume of INR 4 lakh crores for the fiscal year.\n\na8c83eb5e70b23d56e320c3b67f6bbe7 --> The company has already given guidance of reaching a processing value of $100 billion by 2024.\n\nec01b145c6b7a8f2f6e85bc1d78b8b7e --> Vishwas Patel mentioned the guidance on processing volume of around $100 billion.", "citations": ["b311c0c11a96935725a094607813aa36", "792361d79e969215fd8134c81d9b60f6", "7f9cd754f16c855541715234dbb26745", "a8c83eb5e70b23d56e320c3b67f6bbe7", "ec01b145c6b7a8f2f6e85bc1d78b8b7e"]}, "['Q3', '2023']": {"answer": "936308ebe20bbbdd71989f8b95be5654 --> GeM is targeting to touch order values of 200,000 Crores by FY2023.\n\nb0504b24f88d84a6b12a2dad021f165d --> Vishal Mehta expects international revenue to grow to 20% to 30% of total revenues in the next two years.\n\n3a52094ffd72cc677b6eee926cf29134 --> The company is taking steps towards growing its net take rate across payments vertical and reach double-digit take rates in FY2025.\n\nef3fc8b9528343bc980c3112dc009327 --> Vishwas Patel mentioned an expectation to receive their share of government subsidy incentives in Q4 or Q1 of the next financial year.\n\nb5889710936c24d7b58d110fe48583cf --> Vishal Mehta stated that they expect TPV from payments to increase from 2 lakh Crores for this year to 3.5 lakh Crores, with payments getting to about 4 lakh Crores in the next two years.\n\na3220ab90c07b59af0ed1ac2e5e5e7e3 --> The management indicated that more clarity on pricing, mechanisms, and processes such as charge-backs will be available in the next one or two quarters.\n\nd3bae29ffabaff1f0f4e455fa5e48402 --> Vishal Mehta indicated that the company expects to book more than 1 million room nights in a year for their hospitality partners.\n\n1b918c168b24fe8bfe7d52e9d1d7fd00 --> Anil Nahata inferred that meaningful revenues from the integrated solution are expected starting from Q2 FY 2024.", "citations": ["936308ebe20bbbdd71989f8b95be5654", "b0504b24f88d84a6b12a2dad021f165d", "3a52094ffd72cc677b6eee926cf29134", "ef3fc8b9528343bc980c3112dc009327", "b5889710936c24d7b58d110fe48583cf", "a3220ab90c07b59af0ed1ac2e5e5e7e3", "d3bae29ffabaff1f0f4e455fa5e48402", "1b918c168b24fe8bfe7d52e9d1d7fd00"]}, "['Q1', '2025']": {"answer": "8f77e5600694d3ef96eeb9d4160874f6 --> The company expects its value-added services, including the distribution of financial products, to contribute 2% to 4% of revenue this year, increasing to around 7% to 10% in a couple of years.\n\n8a4c8badf50c99ceac609925987b796e --> Vishal Mehta stated that by the end of Q2, they expect to have a better understanding of the implications of the GeM revenue situation through initiated arbitration.\n\nc789a7fa1db9c499cddfcf1cf5b16eb7 --> Vishal Mehta stated that value-added services are expected to generate 2% to 4% of the revenues of this year, which would substantially increase to 7% to 10% in coming years.\n\nc0b85e026a1ca267ce0a573da89eb357 --> Rahul Jain stated that the value-added services are expected to contribute 2% to 4% of revenue this year, with aspirations to reach 7% to 10% in a couple of years.", "citations": ["8f77e5600694d3ef96eeb9d4160874f6", "8a4c8badf50c99ceac609925987b796e", "c789a7fa1db9c499cddfcf1cf5b16eb7", "c0b85e026a1ca267ce0a573da89eb357"]}, "['Q4', '2024']": {"answer": "fcd2048c738e8cae9643d6ebf151020d --> The CFO stated that there will be no revenue reported from GeM in Q4 FY24 onwards due to unresolved commercial negotiations.\n\nf780ee7ecb8b016bce1fcce70fd4f7bd --> The moderator presented the financial guidance for FY25 with specific revenue and profit targets.\n\n173c53c5d6850fe077f6fa8d404bb1da --> The subsidiary has raised a pre-IPO round of up to 25 million, expected to close this month.\n\n96590c1d9a74c9b1d86ab10ef76c30c7 --> Vishal Mehta stated that revenue is expected to be in the range of 3,900 crores to 4,200 crores for FY25, targeting upwards of 30% year-over-year growth.\n\nf3b276f8d284646f01e4097e3be6f32a --> Vishwas Patel mentioned that the PayPal partnership is expected to generate good revenues through transaction services and marketing joint initiatives in the Middle East region.", "citations": ["fcd2048c738e8cae9643d6ebf151020d", "f780ee7ecb8b016bce1fcce70fd4f7bd", "173c53c5d6850fe077f6fa8d404bb1da", "96590c1d9a74c9b1d86ab10ef76c30c7", "f3b276f8d284646f01e4097e3be6f32a"]}, "['Q2', '2024']": {"answer": "3b0c865e8f49b396ca4c115f6495f85e --> Vishal Mehta mentioned that by the end of Q3, the company will have more to share regarding their approach to diversifying options beyond their current concentrated platform.\n\n50029f71af06d47d959459bfd9536797 --> Vishal Mehta, a member of the management team, confirmed the continuation of the transaction-based revenue model with GeM and the licensing fee model for other enterprise customers post-renewal of contracts.\n\n108469baf0c0802b2ffc08275ddc310e --> Vishal Mehta indicated that the company expects better revenues and better net payment take rates in the second half compared to the first half.", "citations": ["3b0c865e8f49b396ca4c115f6495f85e", "50029f71af06d47d959459bfd9536797", "108469baf0c0802b2ffc08275ddc310e"]}, "['Q4', '2023']": {"answer": "02fb8be3443fc508c751b9a9d1650dbe --> Vishwas Patel stated that the company will be claiming the MDR that the government incentivizes to process RuPay debit card and UPI in the coming quarters.\n\n4afb169e14dc11ff7fa0f05c6254de1f --> Vishal Mehta confirmed that the TPV guidance of INR 7.5 lakh crores by FY 25 remains unchanged.\n\n242f7d3eeb6b68b418f641582a99c914 --> Vishwas Patel mentioned that the government had sanctioned INR 2,400 crores for this financial year as incentive for processing UPI and RuPay debit cards.", "citations": ["02fb8be3443fc508c751b9a9d1650dbe", "4afb169e14dc11ff7fa0f05c6254de1f", "242f7d3eeb6b68b418f641582a99c914"]}, "['Q3', '2024']": {"answer": "93ccc2048d974c63fa3fcf9b55239b63 --> The management expects resolution on the intellectual property and commercial discussions with GeM within this quarter.\n\n152f7fbcb33f278dd67306de04c6b47c --> The CEO announced a target of achieving $300 million in revenue by the end of 2024.\n\nc2f67fcb331b4e7b07c32d2ef4f29468 --> Vishal Mehta mentioned that revenues have been accounted for only until December 14, 2023.\n\n6ba51164dbcb6784e16d348427f21c10 --> The management indicated that more details regarding their participation and plans in the lending space would be provided within the current quarter.\n\n8cc25c6066c9e20f6498847a160ea7d8 --> Vishal Mehta projected that the AI offerings will start contributing meaningfully to the topline in the next fiscal year.", "citations": ["93ccc2048d974c63fa3fcf9b55239b63", "152f7fbcb33f278dd67306de04c6b47c", "c2f67fcb331b4e7b07c32d2ef4f29468", "6ba51164dbcb6784e16d348427f21c10", "8cc25c6066c9e20f6498847a160ea7d8"]}}}, {"topic": "Organic growth drivers", "data": {"['Q2', '2023']": {"answer": "8dc2b92341f89e684271c6270dd696e7 --> The GeM GMV is expected to double by the end of this financial year.\n\nfef4a64e0ca9cfacd0fac4e437307f5a --> The CFO projects a 20% increase in revenue for the upcoming fiscal year.", "citations": ["8dc2b92341f89e684271c6270dd696e7", "fef4a64e0ca9cfacd0fac4e437307f5a"]}, "['Q3', '2023']": {"answer": "fb77b7d850b8629312c56f9a25e06ea9 --> Mr. Sunil Bhagat (CFO) stated that the company expects to achieve a revenue growth of 20% for the fiscal year ending March 2023.", "citations": ["fb77b7d850b8629312c56f9a25e06ea9"]}, "['Q1', '2025']": {"answer": "06171f43f42fbe7625020b093a50d677 --> The CEO projected that the company will achieve a 20% increase in digital service subscriptions by the end of the next fiscal year.", "citations": ["06171f43f42fbe7625020b093a50d677"]}, "['Q4', '2024']": {"answer": "e8321210173d055e79b35f917857b3d9 --> The management expects to drive organic growth through domestic and increasing international scale.", "citations": ["e8321210173d055e79b35f917857b3d9"]}, "['Q4', '2023']": {"answer": "80299710690dc95978b7a97dc78fed36 --> The management team provided a growth assumption for the industry, projecting a 25% annual growth rate for the next five years until FY '28.\n\n5c954faf442516836bef5a4c047450ed --> The CFO projected revenue growth of 20% for the upcoming fiscal year.\n\n0a8c774cb80f75eb7ee36184c6685344 --> The company is expecting a 30% year-on-year increase in credit card spend.\n\ne938ca97d4b0c327589568a2dc0db106 --> The management team indicated a 6% to 10% increase in platform revenue year-over-year.\n\n0fa48f3896f39bef29eacc95d0c31ba1 --> One of the management members mentioned a 40% year-over-year growth in FY '24.\n\n04c40c279623cc02e379d1babec4a7b4 --> Vishal Mehta stated that the company is targeting a growth of about 40% year-over-year for the current year.\n\n8562362e001be81a881eebf97f2dc177 --> Vishal Mehta indicated a 40% growth in revenues and transactions for May and June of this year compared to the same quarter last year.\n\n06fb14dfb754a89f392fb098fbf5ab97 --> Vishal Mehta indicated a target of 40% growth in revenues and potentially EBITDA for the year.", "citations": ["80299710690dc95978b7a97dc78fed36", "5c954faf442516836bef5a4c047450ed", "0a8c774cb80f75eb7ee36184c6685344", "e938ca97d4b0c327589568a2dc0db106", "0fa48f3896f39bef29eacc95d0c31ba1", "04c40c279623cc02e379d1babec4a7b4", "8562362e001be81a881eebf97f2dc177", "06fb14dfb754a89f392fb098fbf5ab97"]}, "['Q3', '2024']": {"answer": "84f7d6079ff039155debbf58265e6aad --> The CFO stated that revenue is expected to grow by 12% in the upcoming fiscal year.\n\n93f8103b6a663f3becd87d4ad7e1fad5 --> Vishal Mehta expects the platform revenue to recover in the next one or two quarters.\n\n55674439cbf4fc9f46f978a7b8aef7df --> Vishal Mehta indicated that historically, Q4 is a significant quarter for GeM due to the election year, implying potential growth or increased activity.\n\na596085f6eb4043596a795978d9d2763 --> The CFO stated that revenue is expected to grow by 15% in the next fiscal year.\n\n37405cab59a385f20d152d41d12cfc3f --> The management expects to start seeing impact in their numbers both for payment and platform business in the coming quarter.", "citations": ["84f7d6079ff039155debbf58265e6aad", "93f8103b6a663f3becd87d4ad7e1fad5", "55674439cbf4fc9f46f978a7b8aef7df", "a596085f6eb4043596a795978d9d2763", "37405cab59a385f20d152d41d12cfc3f"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "Payment solutions enhancement", "data": {"['Q3', '2023']": {"answer": "3cd1c3fb37523e0363dea454d4908fc5 --> The company plans to deploy their omni-channel payment solution across more than a million devices by the end of FY2024.\n\ne6b3be0558b3585fd4587df810cd4eb2 --> The company has the exclusive certification for pin-on-glass for transactions above 5000, and existing terminals are expected to be eliminated in the next two or three years.", "citations": ["3cd1c3fb37523e0363dea454d4908fc5", "e6b3be0558b3585fd4587df810cd4eb2"]}, "['Q4', '2024']": {"answer": "173c53c5d6850fe077f6fa8d404bb1da --> The capital from the pre-IPO round will be used for faster payment processing, geographical expansion, and rolling out TapPay.", "citations": ["173c53c5d6850fe077f6fa8d404bb1da"]}}}, {"topic": "New product launches", "data": {"['Q1', '2023']": {"answer": "0ea49394ccf4486bd84c85645fd533b4 --> The speaker mentioned that they will offer the CCAvenue mobile app with TapPay feature for merchants as an app for free to proliferate payments across India.", "citations": ["0ea49394ccf4486bd84c85645fd533b4"]}, "['Q1', '2024']": {"answer": "c61572e2d80671ec5a7fd75aa2ff95b4 --> The CEO outlined a plan to launch a new product line in Q4 2023.", "citations": ["c61572e2d80671ec5a7fd75aa2ff95b4"]}, "['Q2', '2023']": {"answer": "fef4a64e0ca9cfacd0fac4e437307f5a --> The CEO anticipates a launch of a new product line by Q3 next year.", "citations": ["fef4a64e0ca9cfacd0fac4e437307f5a"]}, "['Q3', '2023']": {"answer": "fb77b7d850b8629312c56f9a25e06ea9 --> Mr. Vishal Mehta (Managing Director) mentioned that the company aims to launch a new payment platform by Q3 of the next fiscal year.\n\nbe98007558c39c60288174422cda1579 --> Vishal Mehta stated that the integration and updates regarding Trust Avenue will be discussed between the first quarter and the second quarter of next year.", "citations": ["fb77b7d850b8629312c56f9a25e06ea9", "be98007558c39c60288174422cda1579"]}, "['Q1', '2025']": {"answer": "9079f14aa1430bbfc490c1521a8ea57d --> Mr. Vishal Mehta (Chairman and Managing Director) stated that they anticipate launching new products in the next quarter to enhance their platform's capabilities.\n\nb6a543f64b74d5760c91e49bfc6faf6f --> The Chairman and Managing Director confirmed plans to launch a new platform feature by Q4 2024.\n\nd2491a90848ff51e83975e5161507fad --> Vishal Mehta mentioned the launch of a new device in the market for banks, with CCAvenue expected to be integrated into merchants in the coming quarters, specifically stating the current quarter.", "citations": ["9079f14aa1430bbfc490c1521a8ea57d", "b6a543f64b74d5760c91e49bfc6faf6f", "d2491a90848ff51e83975e5161507fad"]}, "['Q4', '2024']": {"answer": "0f70b7789a4843f1b2dad6150969d7d2 --> The CEO stated that the company plans to launch two new payment solutions in the next six months.", "citations": ["0f70b7789a4843f1b2dad6150969d7d2"]}, "['Q2', '2024']": {"answer": "95610f999befe89b75a988964ceed224 --> The COO outlined a timeline for launching three new products by Q3 next year.\n\nf5d5c44a969bd8a89da99591db13ddfe --> The company plans to launch TapPay, CCAvenue TapPay, and other features in the UAE market later this year.\n\n7dd6f737ada027cfe9438c5b527137e8 --> The speaker mentioned that they expect to have more announcements regarding new modules within their framework in the Q4 timeframe of this year.\n\n02312977da7a75b009457d0409e5e059 --> The speaker inferred as an executive mentioned that more information about the AT hub will be shared in the Q4 timeframe or Q1 of the next year.\n\n794d4a99e8c162d0d120c431a7163d67 --> TCS has about 18 months to build out a new GeM platform.", "citations": ["95610f999befe89b75a988964ceed224", "f5d5c44a969bd8a89da99591db13ddfe", "7dd6f737ada027cfe9438c5b527137e8", "02312977da7a75b009457d0409e5e059", "794d4a99e8c162d0d120c431a7163d67"]}, "['Q4', '2023']": {"answer": "5c954faf442516836bef5a4c047450ed --> The CEO committed to launching three new products by the end of Q4.", "citations": ["5c954faf442516836bef5a4c047450ed"]}, "['Q3', '2024']": {"answer": "84f7d6079ff039155debbf58265e6aad --> The CEO confirmed a targeted launch of a new product line by Q3 of this year.\n\n06ce80e650df8025d9966b191e1ec826 --> The company plans to publish a few frameworks for financial institutions and the greater community to utilize in the next one or two quarters.\n\n74fa6241c9f3e2f57a36d0a646233797 --> By Q4 of this year, we aim to launch our new payment integration service.", "citations": ["84f7d6079ff039155debbf58265e6aad", "06ce80e650df8025d9966b191e1ec826", "74fa6241c9f3e2f57a36d0a646233797"]}}}, {"topic": "Technology advancements", "data": {"['Q1', '2024']": {"answer": "665cb63da66f0674daf1b9c66901f6a9 --> Vishwas Patel mentioned a timeline for deploying the GeM 2.0 platform.", "citations": ["665cb63da66f0674daf1b9c66901f6a9"]}, "['Q1', '2025']": {"answer": "2a040ee147792682a4c9999d85f15c69 --> Vishal Mehta mentioned that they expect to get a US patent in the next 6 to 12 months.", "citations": ["2a040ee147792682a4c9999d85f15c69"]}, "['Q3', '2024']": {"answer": "89e9408c18d62c4fe73f0cfd469ad625 --> Vishal Mehta indicated that more information about ERP examples like GeM, Jio, Sony will be provided by the end of the year.", "citations": ["89e9408c18d62c4fe73f0cfd469ad625"]}}}, {"topic": "R&D investment focus", "data": {"['Q2', '2024']": {"answer": "95610f999befe89b75a988964ceed224 --> The CEO mentioned an increase in R&D spending by 20% over the next year to support new product development.", "citations": ["95610f999befe89b75a988964ceed224"]}, "['Q3', '2024']": {"answer": "8a7e0e839d8f3300fc81aedb3f0352ef --> The CEO announced plans to increase R&D spending by 20% over the next year.", "citations": ["8a7e0e839d8f3300fc81aedb3f0352ef"]}}}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Cost reduction strategies", "data": {"['Q1', '2024']": {"answer": "e65593265e044da214cdd8413e95451b --> The CFO mentioned plans to reduce operational costs by 5% within the next two quarters.", "citations": ["e65593265e044da214cdd8413e95451b"]}, "['Q1', '2025']": {"answer": "0675d26236c6e9463fe8d6dbbc16a603 --> The CFO stated that capital expenditures will be reduced by 20% over the next two quarters.", "citations": ["0675d26236c6e9463fe8d6dbbc16a603"]}, "['Q4', '2024']": {"answer": "513bac09d576d1a31f42241262603ce2 --> The CFO outlined a plan to achieve a 12% reduction in operational costs by the end of the current year.", "citations": ["513bac09d576d1a31f42241262603ce2"]}, "['Q3', '2024']": {"answer": "a596085f6eb4043596a795978d9d2763 --> The CEO confirmed a 10% reduction in operating costs by Q2 next year.", "citations": ["a596085f6eb4043596a795978d9d2763"]}}}, {"topic": "Process automation", "data": {"['Q1', '2024']": {"answer": "8f42df59fead587ff5550ab02b392d73 --> Mr. Vishwas Patel (Executive Director) confirmed the company's commitment to reducing the customer onboarding time by 30% within the next six months.", "citations": ["8f42df59fead587ff5550ab02b392d73"]}, "['Q4', '2023']": {"answer": "39584b18b44d41808e386f83992ed8ff --> The speaker inferred as a member of the management team expects that it will take 24 months for a new framework to be established for the GeM RFP.", "citations": ["39584b18b44d41808e386f83992ed8ff"]}}}, {"topic": "Supply chain efficiency", "data": {}}, {"topic": "Workforce productivity enhancements", "data": {"['Q1', '2024']": {"answer": "105a0b570c9aea0b6537b4c803134a95 --> Infibeam will be hiring some well-known industry experts to build the business vertical under the leadership of the speaker.", "citations": ["105a0b570c9aea0b6537b4c803134a95"]}}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "International market penetration", "data": {"['Q1', '2023']": {"answer": "6941bc39d631c0b752ff9682707795f1 --> The CEO announced plans to expand into two new international markets by the third quarter of next year.\n\n6e2610d4deeb63cf264284da19be66b8 --> The speaker stated that international business is expected to be at least 30% of the overall business in the next two to three years.", "citations": ["6941bc39d631c0b752ff9682707795f1", "6e2610d4deeb63cf264284da19be66b8"]}, "['Q1', '2024']": {"answer": "390605f5732c7923b12261c9725a242d --> Offline CCAvenue TapPay as a strategy will start bearing fruits over the next 12 to 18 months.\n\ndc4fd77fc32523f0b5b5ae87f61baf55 --> Vishal Mehta stated a target of reaching $100 billion in processing in the next couple of years and increasing international growth to 30%.\n\nab251550a907597633297011724ad144 --> Vishal Mehta stated that international growth is targeted to potentially account for 30% or more of their overall payment revenues.", "citations": ["390605f5732c7923b12261c9725a242d", "dc4fd77fc32523f0b5b5ae87f61baf55", "ab251550a907597633297011724ad144"]}, "['Q2', '2023']": {"answer": "cd8c61640521f327e5edde2590791a96 --> The speaker mentioned that CCAvenue TapPay is being opened up in international regions, specifically in the UAE, simultaneously with India.\n\n5926b54584a2c1355f9a10f9d50f1a42 --> The management expects to add tens of thousands of merchants in the international market with their offline solutioning, specifically in the UAE.\n\n7f9cd754f16c855541715234dbb26745 --> Vishal Mehta stated that they expect international operations to contribute to 30% of revenues in the next two years.", "citations": ["cd8c61640521f327e5edde2590791a96", "5926b54584a2c1355f9a10f9d50f1a42", "7f9cd754f16c855541715234dbb26745"]}, "['Q1', '2025']": {"answer": "ab55ecb7e842752961ca4f446ffcb9b8 --> Vishwas Patel indicated that the international business is expected to contribute 12% to 15% of net revenue income over the next 2 years.\n\n1357f314ed1df5a2f1241d79f1d80828 --> The CEO announced plans to expand into two new international markets by Q4 2024.\n\nae299adfe754ce25804246d48187f928 --> Vishal Mehta mentioned the expectation to achieve a 30% contribution from the international business.", "citations": ["ab55ecb7e842752961ca4f446ffcb9b8", "1357f314ed1df5a2f1241d79f1d80828", "ae299adfe754ce25804246d48187f928"]}, "['Q4', '2024']": {"answer": "9bb6308d536dfc24dfe54d81306efae7 --> Vishwas Patel stated the company's intention to perform better in the Saudi market compared to their performance in the UAE market in the mid-term.\n\na77315fc1d7e9c7f020668a4d67ba826 --> The management announced a pre-IPO round of up to USD25 million to accelerate growth in the Middle East region in FY25.\n\ne79daccb47f1186d774a59af78c43ef5 --> The CEO outlined a plan to expand into three new international markets by Q3 next year.\n\n2c2bc02d915ae92bead4d94e29961738 --> Vishal Mehta confirmed a focus on the funding round in UAE and Saudi Arabia for the current quarter.\n\n80ef4e4e3de1dda5eb0fa36dad84abf3 --> Sunil mentioned that the company plans to make the share of international revenue 30% in the coming years compared to less than 10% currently.\n\n0da2d91cac31157efb4db9d092a24512 --> Vishal Mehta stated that they expect to double their international business.\n\n1dc8354adab208a4d1cee52f2b34d980 --> Pranay Jain indicated plans for international expansion into the US, Australia, and Southeast Asian markets.", "citations": ["9bb6308d536dfc24dfe54d81306efae7", "a77315fc1d7e9c7f020668a4d67ba826", "e79daccb47f1186d774a59af78c43ef5", "2c2bc02d915ae92bead4d94e29961738", "80ef4e4e3de1dda5eb0fa36dad84abf3", "0da2d91cac31157efb4db9d092a24512", "1dc8354adab208a4d1cee52f2b34d980"]}, "['Q2', '2024']": {"answer": "5fbb828823c95491074e29542be60d02 --> The COO mentioned expanding operations into two new international markets by mid-2024.\n\nd35889a9aadc14a2aa5c5f6237785ac8 --> The Chairman and Managing Director announced plans to expand into three new international markets by Q4 2024.\n\n6079df55182dedfd90c16f5c3edf6102 --> The speaker stated that international operations are expected to contribute 30% of the overall business in the next few years.\n\n9d4b0d6d7c1710972f47ddc12e7665dd --> The speaker indicated a target for going live in Saudi Arabia in the next couple of weeks.\n\nded4bd4b6c6f94b21d2a3202f5e8a0c7 --> The management expects returns from the international expansions to show up in the next couple of years.\n\nbef8c80ece47aca81988b28da4405e95 --> The company aims for international revenue to increase from sub-10% to 30% of total revenues.\n\n6a4ba29f78f85f4740633523dac49cac --> Vishwas Bhai mentioned the company's strategic plan for growth in the payments business.\n\n76fd61137903fb31eb4bc9b0062166fc --> Vishal Mehta mentioned the plan to expand international participation from sub-10% to 30% of revenues.\n\n48b12b622379d037d28988ffa68176ff --> Vishal Mehta stated that some portions of the proceeds from Vybe will be used for building out the AT ecosystem and for international expansion, as well as deploying capital for express settlements.", "citations": ["5fbb828823c95491074e29542be60d02", "d35889a9aadc14a2aa5c5f6237785ac8", "6079df55182dedfd90c16f5c3edf6102", "9d4b0d6d7c1710972f47ddc12e7665dd", "ded4bd4b6c6f94b21d2a3202f5e8a0c7", "bef8c80ece47aca81988b28da4405e95", "6a4ba29f78f85f4740633523dac49cac", "76fd61137903fb31eb4bc9b0062166fc", "48b12b622379d037d28988ffa68176ff"]}, "['Q4', '2023']": {"answer": "e36d038b2f90eec1af25892aa81d0600 --> The speaker suggested that international markets could potentially make up at least 25% to 30% of the overall transaction processing volumes.", "citations": ["e36d038b2f90eec1af25892aa81d0600"]}, "['Q3', '2024']": {"answer": "1ee2f034b87e609f19e4398233e10f1e --> The company plans to communicate more about their plans to scale the international business in the coming few weeks to months.\n\n3097725c49086f36c69e183ddee8e528 --> The management indicated that international revenue, currently less than 6 or 7% of the overall revenue, has the potential to grow to 25-30% in the next two years.\n\n0a8aa638a48eaee08303276a6bc7595c --> The speaker mentioned an aspiration to scale the international business from a single-digit percentage to a two-digit percentage number in the coming 24 months.\n\n3ecbcd282d8dd2b774cc8728e46746da --> The next quarter even the Saudi market will also be reflected in our business.\n\nd2d73591485de7f2efa1a57a406548de --> Vishal Mehta expects the international business to grow to 25-30% of the overall business in the next two years.", "citations": ["1ee2f034b87e609f19e4398233e10f1e", "3097725c49086f36c69e183ddee8e528", "0a8aa638a48eaee08303276a6bc7595c", "3ecbcd282d8dd2b774cc8728e46746da", "d2d73591485de7f2efa1a57a406548de"]}}}, {"topic": "Strategic alliances", "data": {"['Q1', '2025']": {"answer": "5ce069a3acae71f6a51662e487c470ad --> Vishal Mehta stated that in the next 4 to 8 weeks, they expect to share more information regarding several contracts getting converted.", "citations": ["5ce069a3acae71f6a51662e487c470ad"]}, "['Q4', '2024']": {"answer": "834fa2c02e5ea5f9002baac4519bd697 --> Vishal Mehta stated that the company plans to sign up one or two very large enterprise clients this year.\n\nda9a8ea50b1e11911c4b27abfd64172f --> Vishal Mehta mentioned opening up the platform to one or two very large clients this year.", "citations": ["834fa2c02e5ea5f9002baac4519bd697", "da9a8ea50b1e11911c4b27abfd64172f"]}, "['Q2', '2024']": {"answer": "b8de8dd5f2c0c1a7125dfaa2753fa71c --> Vishal Mehta stated that the company plans to take up new assignments and share information about these engagements in the first quarter of next year.", "citations": ["b8de8dd5f2c0c1a7125dfaa2753fa71c"]}, "['Q4', '2023']": {"answer": "39584b18b44d41808e386f83992ed8ff --> The speaker inferred as a member of the management team stated that the engagement with GeM will continue until December 2023 and can be extended for two more years.", "citations": ["39584b18b44d41808e386f83992ed8ff"]}, "['Q3', '2024']": {"answer": "5617474bf468af8b8ec647cf00be69dc --> Vishal Mehta expects to provide more details on their lending strategy in the fintech space in the next few weeks.\n\ncab68f8f00f4e728ada54e4c03ea49da --> The speaker mentioned that from FY2025 onwards, particularly from Q4 onwards, there will be a much better performance in the UAE market due to partnerships in the GCC region.\n\nff8c2858fb728071552c47aebd035886 --> Vishal Mehta stated the objective related to the investment in So Hum.", "citations": ["5617474bf468af8b8ec647cf00be69dc", "cab68f8f00f4e728ada54e4c03ea49da", "ff8c2858fb728071552c47aebd035886"]}}}, {"topic": "Competitive positioning", "data": {"['Q1', '2025']": {"answer": "d41815fb6b335347a6b1001f2d971e18 --> The CEO stated that the company aims to increase its market share by 5% over the next year.\n\n3f273d755e70beae16c85f9513ba99d2 --> The CEO announced a target to achieve a 25% market share by the end of 2025.", "citations": ["d41815fb6b335347a6b1001f2d971e18", "3f273d755e70beae16c85f9513ba99d2"]}, "['Q2', '2024']": {"answer": "76e8bce2ce84a3a94cc4069edc2d0b95 --> CCAvenue has increased its market share to double digits compared to 9% in FY 2023.", "citations": ["76e8bce2ce84a3a94cc4069edc2d0b95"]}, "['Q4', '2023']": {"answer": "39584b18b44d41808e386f83992ed8ff --> The speaker inferred as a member of the management team believes that for the next foreseeable couple of years, they will have a role to play in GeM.", "citations": ["39584b18b44d41808e386f83992ed8ff"]}, "['Q3', '2024']": {"answer": "74c792db9d68cace85365db554447d31 --> The CEO provided guidance on increasing the market share by 5% in the next fiscal year.", "citations": ["74c792db9d68cace85365db554447d31"]}}}, {"topic": "Geographic expansion plans", "data": {"['Q1', '2023']": {"answer": "e5eda9858ab5a0a74918dd0417088b2c --> The management expects to invest about seven to eight crores in Australia this year and anticipates launching and generating traction in the region.\n\n8d747daaec65c59a0e2c1ede5f9313d3 --> Vishal Mehta indicated potential expansion of express settlement service to 95% of the merchant base.", "citations": ["e5eda9858ab5a0a74918dd0417088b2c", "8d747daaec65c59a0e2c1ede5f9313d3"]}, "['Q1', '2024']": {"answer": "8f42df59fead587ff5550ab02b392d73 --> Mr. Vishal Mehta (MD) indicated a target of expanding the company's technology platform to 10 new countries by the end of next year.\n\n41ffbb28a0b451ebb8b8d25b2ff24424 --> Vishwas Patel stated that their aim is to reach the hinterlands of India with their SoftPoS solution.\n\n6a768c9adcd863aab25e4174a1ce0aef --> Vishal Mehta mentioned plans to expand the AI hub across multiple cities in India.\n\nfa5b954a453b916374986e9bd2f003eb --> Vishal Mehta mentioned that the company expects to list its subsidiary, Odigma, separately in the market by the end of this fiscal year, pending regulatory approvals.", "citations": ["8f42df59fead587ff5550ab02b392d73", "41ffbb28a0b451ebb8b8d25b2ff24424", "6a768c9adcd863aab25e4174a1ce0aef", "fa5b954a453b916374986e9bd2f003eb"]}, "['Q2', '2023']": {"answer": "12f0e06bfcceead837e5f38b4b6f7d60 --> The management plans to start the payment business in Saudi Arabia and Australia by the end of this financial year.\n\n6cd19bbdb60a534c91e8dea2bed6a1cf --> Vishal Mehta mentioned that UAE and Saudi will account for 60% of the volume.\n\n1fbcd8bdbc88096e60b0de31adaa525a --> We want to be able to go and deploy it across at least 100,000 implementations by this year and then scale it to one million or more next year.", "citations": ["12f0e06bfcceead837e5f38b4b6f7d60", "6cd19bbdb60a534c91e8dea2bed6a1cf", "1fbcd8bdbc88096e60b0de31adaa525a"]}, "['Q3', '2023']": {"answer": "936308ebe20bbbdd71989f8b95be5654 --> The company is expected to expand geographies and discuss other launches in FY2024 while building more tie-ups and onboarding more partners.\n\nb4ccd688563534ab7ba604114044df5a --> The company plans to scale its operations in Saudi Arabia starting from the next financial year.\n\nd650f9406161cb5a1a63a7d0a5534de3 --> Vishal Mehta mentioned that the new RFP requires building out the framework in the next 18 months, and the existing contract will continue into 2024.", "citations": ["936308ebe20bbbdd71989f8b95be5654", "b4ccd688563534ab7ba604114044df5a", "d650f9406161cb5a1a63a7d0a5534de3"]}, "['Q1', '2025']": {"answer": "06171f43f42fbe7625020b093a50d677 --> The CEO stated the company aims to expand its market presence in Southeast Asia by launching operations in two new countries within the next 18 months.\n\n513beedc2efde54d861af19686d93871 --> The company plans to take full advantage of its ability to onboard new merchants following the granting of a payment aggregator license by RBI.\n\n3f273d755e70beae16c85f9513ba99d2 --> The CFO indicated an increase in capital expenditure by 20% for the upcoming fiscal year to support expansion initiatives.\n\n7b8b500f4cd4baf0876be697c45df8df --> Vishwas Patel mentioned that the company expects to start reporting Saudi Arabian numbers by the end of this quarter.\n\nfad1f49cca5e364af1b47bef2d5361b7 --> The CEO mentioned that the expansion in Saudi Arabia has already started.", "citations": ["06171f43f42fbe7625020b093a50d677", "513beedc2efde54d861af19686d93871", "3f273d755e70beae16c85f9513ba99d2", "7b8b500f4cd4baf0876be697c45df8df", "fad1f49cca5e364af1b47bef2d5361b7"]}, "['Q4', '2024']": {"answer": "6aa510d3c57843bcd5022493eaa1fc89 --> Vishwas Patel mentioned the company's investment and expansion plans in the US market.\n\n173c53c5d6850fe077f6fa8d404bb1da --> The company expects to roll out TapPay and other solutions in the UAE market in FY25.", "citations": ["6aa510d3c57843bcd5022493eaa1fc89", "173c53c5d6850fe077f6fa8d404bb1da"]}, "['Q2', '2024']": {"answer": "0a9bb22cb7d8ecd1fccd5f7b56e98e3c --> Vishwas Patel stated that they are looking to attract around 100,000 local outlets in the UAE with their TapPay implementation and other tech solutions.\n\n76fd61137903fb31eb4bc9b0062166fc --> Vishal Mehta stated that there will be a capital expenditure of INR3 million to INR5 million per geography to scale up internationally.", "citations": ["0a9bb22cb7d8ecd1fccd5f7b56e98e3c", "76fd61137903fb31eb4bc9b0062166fc"]}, "['Q3', '2024']": {"answer": "84f7d6079ff039155debbf58265e6aad --> The COO announced plans to open 15 new retail outlets by the end of the year.\n\n93f8103b6a663f3becd87d4ad7e1fad5 --> Vishal Mehta stated that the company plans to increase its number of merchants in UAE from 7,000 to 70,000 in the next 12 to 24 months.\n\n65bbceb6c0a78e4e3e7d19f11dcec6df --> Purvesh Parekh mentioned that UAE has been growing at more than 50% CAGR and that they will soon be launching in Saudi.\n\n3ecbcd282d8dd2b774cc8728e46746da --> For any geography you light it up and completely localized and so on and so forth it will be $2 to 3 million capex.\n\n8a7e0e839d8f3300fc81aedb3f0352ef --> The COO outlined an expansion plan to open 50 new stores by the end of next year.", "citations": ["84f7d6079ff039155debbf58265e6aad", "93f8103b6a663f3becd87d4ad7e1fad5", "65bbceb6c0a78e4e3e7d19f11dcec6df", "3ecbcd282d8dd2b774cc8728e46746da", "8a7e0e839d8f3300fc81aedb3f0352ef"]}}}]}, {"theme": "Customer Engagement and Experience", "topics": [{"topic": "Customer satisfaction initiatives"}, {"topic": "Loyalty programs"}, {"topic": "User experience improvements"}, {"topic": "Customer feedback integration"}]}, {"theme": "Regulatory Compliance and Risk Management", "topics": [{"topic": "Adherence to financial regulations", "data": {"['Q2', '2023']": {"answer": "835c49a21ddad56589f4fa2f96f54d84 --> Vishal Mehta stated that they have received in-principle approvals from RBI to operate as a Payment Aggregator and have two licenses from RBI, one for operating as a Payment Aggregator and another for bill payments under the Bharat BillPay infrastructure.", "citations": ["835c49a21ddad56589f4fa2f96f54d84"]}}}, {"topic": "Data protection measures", "data": {}}, {"topic": "Risk management practices", "data": {}}, {"topic": "Compliance with industry standards", "data": {}}]}, {"theme": "Strategic Partnerships and Alliances", "topics": [{"topic": "Collaboration with fintech firms", "data": {"['Q1', '2024']": {"answer": "b2b56fdf0fdbadd41b386c8bdf2604ca --> Infibeam Avenues plans to increase its stake in Fable Fintech Private Limited to 41%.", "citations": ["b2b56fdf0fdbadd41b386c8bdf2604ca"]}}}, {"topic": "Expansion of partner network", "data": {}}, {"topic": "Joint venture initiatives", "data": {"['Q3', '2024']": {"answer": "5f4067ab7a965e3ccb50b1b817610150 --> The company has signed an MoU with the Gujarat government for Rs.20 billion for building and developing a state-of-the-art AI hub.", "citations": ["5f4067ab7a965e3ccb50b1b817610150"]}}}]}, {"theme": "Technology and Innovation", "topics": [{"topic": "AI and automation integration", "data": {"['Q1', '2024']": {"answer": "105a0b570c9aea0b6537b4c803134a95 --> Infibeam will establish India's first artificial intelligence hub headquartered in GIFT City and initially focus on fintech and financial sectors.", "citations": ["105a0b570c9aea0b6537b4c803134a95"]}, "['Q4', '2024']": {"answer": "492260b462e308b6c14410e7adecfdb5 --> We continue to invest in our AI business which have tremendous synergies to both our platforms and payment business and will have more to share in FY25.", "citations": ["492260b462e308b6c14410e7adecfdb5"]}, "['Q2', '2024']": {"answer": "f5d5c44a969bd8a89da99591db13ddfe --> The company has invested INR1 billion in creating a new AI hub to accelerate growth in AI opportunities, funded through internal accruals.", "citations": ["f5d5c44a969bd8a89da99591db13ddfe"]}, "['Q3', '2024']": {"answer": "0200e8f86bc9f2f9c7417b89371c42a8 --> Vishal Mehta stated that the company plans to establish an AI hub in collaboration with the Gujarat government, aiming for completion by the end of next year.", "citations": ["0200e8f86bc9f2f9c7417b89371c42a8"]}}}, {"topic": "Blockchain technology applications", "data": {}}, {"topic": "Cybersecurity enhancements", "data": {}}, {"topic": "Cloud infrastructure upgrades", "data": {"['Q2', '2024']": {"answer": "95610f999befe89b75a988964ceed224 --> The CTO announced a 25% increase in digital transformation investments within the next 18 months.", "citations": ["95610f999befe89b75a988964ceed224"]}}}]}, {"theme": "Digital Payment Solutions", "topics": [{"topic": "Payment gateway enhancements", "data": {}}, {"topic": "Merchant acquisition growth", "data": {"['Q1', '2023']": {"answer": "6619b06247ed5f629bbc345fe8dcf55a --> The digital payment market for person to merchant payments is projected to reach 2.5 trillion by 2026, from the 0.4 trillion in 2021.", "citations": ["6619b06247ed5f629bbc345fe8dcf55a"]}, "['Q1', '2024']": {"answer": "a6e65457c1fdf8b4da4f2d7d58e22aaf --> Vishal Mehta stated that the company expects TapPay to hit a million merchants this year.", "citations": ["a6e65457c1fdf8b4da4f2d7d58e22aaf"]}, "['Q2', '2023']": {"answer": "92c4ecf45ebc0ae5416a2186d8e10f9d --> The company plans to deploy CCAvenue TapPay across 1 lakh terminals by the end of the financial year FY '23 and is targeting to reach 1 million merchants by the end of FY '24.\n\nd7202257e63c2d13a9d54daa7f35592b --> Vishwas Patel mentioned that the company plans to enable TapPay for around 100,000 merchants by the end of the current quarter.\n\n9a2060707ed972b7f6c8879ba16e0827 --> Vishwas Patel stated that the company is onboarding more than 8,000 merchants every day.", "citations": ["92c4ecf45ebc0ae5416a2186d8e10f9d", "d7202257e63c2d13a9d54daa7f35592b", "9a2060707ed972b7f6c8879ba16e0827"]}, "['Q3', '2023']": {"answer": "b0504b24f88d84a6b12a2dad021f165d --> Vishal Mehta plans to increase the merchant base from 8.1 million to 10 million merchants with the introduction of offline payments (TapPay).\n\n8d5b9a4162c2acc8d886d94a49e72e23 --> Vishal Mehta stated the goal to reach 100,000 merchants by the end of March 2023 and a million merchants by the end of 2024.\n\n8d5b9a4162c2acc8d886d94a49e72e23 --> Vishal Mehta confirmed that they are on track to achieve 100,000 merchants by the end of FY2023.\n\n8d5b9a4162c2acc8d886d94a49e72e23 --> Vishwas Patel indicated that achieving a million merchants next year is very doable as they have received approval for their SDK integration from card networks.\n\n211cd31879771e5047bd411f3ee00e16 --> Vishal Mehta stated that the company has increased its daily merchant addition average from 7,000 to 11,700 since Q2.\n\n9d9165e2031592b302704ef2d8969c4c --> Vishal Mehta stated that the company aims to take TapPay installations up to 1 million merchants shortly.", "citations": ["b0504b24f88d84a6b12a2dad021f165d", "8d5b9a4162c2acc8d886d94a49e72e23", "211cd31879771e5047bd411f3ee00e16", "9d9165e2031592b302704ef2d8969c4c"]}, "['Q1', '2025']": {"answer": "513beedc2efde54d861af19686d93871 --> The company added 2,30,022 new merchants in the second quarter, with an average of more than 2,550 merchants every day.", "citations": ["513beedc2efde54d861af19686d93871"]}, "['Q4', '2024']": {"answer": "d9361397daba573e1b34e47372bc6851 --> Vishal Mehta announced the plan to build out a separate brand for merchant services under personal finance services.", "citations": ["d9361397daba573e1b34e47372bc6851"]}, "['Q2', '2024']": {"answer": "5bea5d6bd2887e196a1e5b974f0fbd51 --> The CFO mentioned a target for digital payments growth in the upcoming quarters.", "citations": ["5bea5d6bd2887e196a1e5b974f0fbd51"]}, "['Q4', '2023']": {"answer": "9c487ea0d272131511fa3ab72333ece4 --> The management plans to offer the Tap Pay solution to about 1 million merchants in the next three to six months.\n\n0efb389e7b37e2881b85ced8cacfab71 --> Mayur Liman questioned the confidence in achieving the goal of onboarding 1 million merchants in the financial year 2024.", "citations": ["9c487ea0d272131511fa3ab72333ece4", "0efb389e7b37e2881b85ced8cacfab71"]}}}, {"topic": "Transaction volume trends", "data": {"['Q1', '2023']": {"answer": "f640563ebcdf11ddb7161921ea19aeae --> The CFO stated that the company expects to achieve a 20% increase in transaction volume in the next quarter.\n\ncf865948e82daaecb57ae8a3fd022a0e --> The value of digital payments is expected to reach threefold from 3 trillion today, to US 10 trillion by 2026.\n\na565730135255b3dee6d52d8550affd9 --> The speaker (Inferred as CEO) mentioned expecting that in the coming two to three years, at least 25% to 30% of the transactions processed will also include offline transactions through CCAvenue TapPay.\n\n6619b06247ed5f629bbc345fe8dcf55a --> The management expects two out of every three payment transactions to be digitized by 2026.\n\n6619b06247ed5f629bbc345fe8dcf55a --> The B2B digital payment market is expected to grow to 2 trillion by 2026 from 1 trillion in 2021.\n\nd9816ccae6b43ea6e6471e90b929cfbe --> RBI is aiming to triple the digital payments in India by 2025.\n\nd9816ccae6b43ea6e6471e90b929cfbe --> It is expected that digital payments will cross Rs.50 trillion in FY23.\n\nf88dffeda7c1cc7b01bf384328d888a2 --> Vishal Mehta stated that the company expects to achieve a transaction processing volume of $100 billion by FY24.\n\n60e65e6f8792f0208c207bff932bb82e --> Vishal Mehta stated that Q3 will see a significant improvement in the digital payments business compared to the first two quarters of 2023.\n\nc5840799afa11433ed854d97ce804c10 --> Vishal Mehta stated that next year, about 30% of the transactions are expected to be through offline channels.", "citations": ["f640563ebcdf11ddb7161921ea19aeae", "cf865948e82daaecb57ae8a3fd022a0e", "a565730135255b3dee6d52d8550affd9", "6619b06247ed5f629bbc345fe8dcf55a", "d9816ccae6b43ea6e6471e90b929cfbe", "f88dffeda7c1cc7b01bf384328d888a2", "60e65e6f8792f0208c207bff932bb82e", "c5840799afa11433ed854d97ce804c10"]}, "['Q1', '2024']": {"answer": "c61572e2d80671ec5a7fd75aa2ff95b4 --> The CFO stated that the company expects a 20% increase in digital payment volumes by the end of the fiscal year.\n\n8f42df59fead587ff5550ab02b392d73 --> Mr. Sunil Bhagat (CFO) mentioned the goal of achieving a 20% increase in transaction volumes over the next two quarters.\n\ne65593265e044da214cdd8413e95451b --> The CEO stated that the company aims to achieve a 20% increase in digital transactions volume by the end of the fiscal year.", "citations": ["c61572e2d80671ec5a7fd75aa2ff95b4", "8f42df59fead587ff5550ab02b392d73", "e65593265e044da214cdd8413e95451b"]}, "['Q2', '2023']": {"answer": "b148f943093b47bf8bb917d6a075bc51 --> The CFO stated that the company aims to achieve a 20% increase in transaction volume by the end of the next fiscal year.\n\n9980066bbac741df59c012e27b2444a8 --> The CFO stated that the company expects a substantial increase in transaction processing volumes by the end of the fiscal year.\n\n12f0e06bfcceead837e5f38b4b6f7d60 --> The company is targeting offline payments to contribute around 20% to 25% of overall payments TPV by the end of the financial year 2025.\n\n78ba99242d9286e416abe13237ec7cc3 --> Vishal Mehta stated that they have a total transaction processing volume guidance of $100 billion by the end of FY24, with 25% expected to come from CCAvenue TapPay.", "citations": ["b148f943093b47bf8bb917d6a075bc51", "9980066bbac741df59c012e27b2444a8", "12f0e06bfcceead837e5f38b4b6f7d60", "78ba99242d9286e416abe13237ec7cc3"]}, "['Q3', '2023']": {"answer": "2a30305a25bdaf3af39725e879e735b8 --> The CEO provided guidance on achieving a 20% increase in digital transactions over the next year.\n\nca1f5c8c19b8c9b1dab69b98e5d71670 --> Vishal Mehta stated that digital payments in India are estimated to grow by 45% to 50% in FY2023 to approximately Rs.54 trillion, or $675 billion.\n\n956f72d621665fc123bfa5e2af92c770 --> The CFO mentioned that the company aims to achieve a 20% increase in transaction volume by the end of the fiscal year.\n\nf20d5574c228e775a5ab17b2c9663f7f --> The management had previously guided for a Total Payment Volume (TPV) of 4 lakh Crore for the year-end FY2023.\n\n5899ae368ce208602a63256c130f4c03 --> Vishal Mehta stated that they are tracking to achieve a transaction processing volume closer to 4 lakh Crores by the end of the year.", "citations": ["2a30305a25bdaf3af39725e879e735b8", "ca1f5c8c19b8c9b1dab69b98e5d71670", "956f72d621665fc123bfa5e2af92c770", "f20d5574c228e775a5ab17b2c9663f7f", "5899ae368ce208602a63256c130f4c03"]}, "['Q1', '2025']": {"answer": "b6a543f64b74d5760c91e49bfc6faf6f --> The CFO stated that the company expects a 20% increase in digital payment transactions by the end of the fiscal year.\n\n1357f314ed1df5a2f1241d79f1d80828 --> The CFO stated that the company expects a 20% increase in transaction volume by the end of the fiscal year.\n\n50a32ec9cac0283feb01c1eaf1debcae --> The company expects a substantial increase in transaction processing volume (TPV) in Q2 and Q3 compared to Q1.\n\n32ba32a22ba8d388edaaefcac20823be --> The CEO stated that they expect to achieve a 20% increase in digital payment transactions by the end of the fiscal year.\n\nc95b1b646f1402736a68b487cfc953b5 --> The CEO stated that the company aims to increase its digital payment processing volume by 30% over the next 12 months.", "citations": ["b6a543f64b74d5760c91e49bfc6faf6f", "1357f314ed1df5a2f1241d79f1d80828", "50a32ec9cac0283feb01c1eaf1debcae", "32ba32a22ba8d388edaaefcac20823be", "c95b1b646f1402736a68b487cfc953b5"]}, "['Q4', '2024']": {"answer": "ac04fa876cefca59cc2f106d4afb7e07 --> The CFO stated that the company aims to achieve a 20% increase in transaction volumes by the end of FY25.\n\nc2e19b18d59eb1ab3f5ca6653ed91f8c --> The company aims to achieve a 20% increase in its digital payment volumes by the end of the fiscal year 2025.\n\n513bac09d576d1a31f42241262603ce2 --> The CEO projected a 20% increase in digital transaction volumes for the upcoming fiscal year.\n\n0f70b7789a4843f1b2dad6150969d7d2 --> The CFO mentioned that the company aims to achieve a 20% increase in digital transaction volumes by the end of the fiscal year.\n\nc9ac0e973b0d4cedc5f38c4e31cba4fa --> The CFO mentioned that the company expects to achieve a 20% increase in transaction volumes by the end of the fiscal year.", "citations": ["ac04fa876cefca59cc2f106d4afb7e07", "c2e19b18d59eb1ab3f5ca6653ed91f8c", "513bac09d576d1a31f42241262603ce2", "0f70b7789a4843f1b2dad6150969d7d2", "c9ac0e973b0d4cedc5f38c4e31cba4fa"]}, "['Q2', '2024']": {"answer": "5fbb828823c95491074e29542be60d02 --> The CEO projected an increase in digital payment transactions by 25% over the next year.\n\nd35889a9aadc14a2aa5c5f6237785ac8 --> The Chief Financial Officer (CFO) stated that the company aims to achieve a 20% increase in transaction volumes by the end of the fiscal year.", "citations": ["5fbb828823c95491074e29542be60d02", "d35889a9aadc14a2aa5c5f6237785ac8"]}, "['Q4', '2023']": {"answer": "60af4417bbf2345db70754a0b9fe0b10 --> The CFO mentioned that the company expects to achieve a 20% increase in digital transaction volumes by the end of the next fiscal year.\n\nc728f7ae16caa38151190cee4efb9e52 --> The Managing Director stated that the company aims to achieve a 20% increase in transaction volume by the end of the next fiscal year.", "citations": ["60af4417bbf2345db70754a0b9fe0b10", "c728f7ae16caa38151190cee4efb9e52"]}, "['Q3', '2024']": {"answer": "479d234f35e8fe3feb7c4df7ff6e5014 --> The Chairman & Managing Director indicated an expected 20% increase in transaction volume by the end of the fiscal year.\n\n74fa6241c9f3e2f57a36d0a646233797 --> We expect to achieve a 20% increase in our digital payment transactions by the end of the next fiscal year.", "citations": ["479d234f35e8fe3feb7c4df7ff6e5014", "74fa6241c9f3e2f57a36d0a646233797"]}}}]}]