[{"theme": "Financial Performance and Strategy", "topics": [{"topic": "Revenue growth metrics", "data": {"['Q1', '2025']": {"answer": "6f32bad9b6c2400bdf81266a8c6926ca --> We expect to bounce back to normal business performance expected from us from Q3 of financial year '23- '24 with both our initiatives and industry-level steps start showing results.\n\n9f4940ea54b699ac63ef07677f3b9f18 --> We'll be much better on that, really much better than that. You will see the improvement happening in the next quarter and then normalizing from Q3. We'll be much better than that.", "citations": ["6f32bad9b6c2400bdf81266a8c6926ca", "9f4940ea54b699ac63ef07677f3b9f18"]}, "['Q4', '2023']": {"answer": "9af1ce26795f0f8a05d74910c7a5a86b --> Devesh Sachdev: 10% average increase in the average ticket size.\n\nb9186a6af155e8bf37913d08f31e0ef7 --> Devesh Sachdev[Yes, you can assume, Nikhil, that this would be around -- it will move to around 22%.]\n\n56f936805524b3ae3f88baaf086b763f --> So as you would have noticed that last quarter, the Q4 of last year, we had the elbow room available, and that's why we moved INR26 crores in the management overlay. We are going to really move forward in the same spirit. Whenever we will have good quarters, we'll accelerate it. And definitely, you will see that,\n\n450361845199710132ac88317042a1b8 --> So by the end of this financial year or early next year, [ will talk about it. But by that time, I hope we will have some substantial number to show.", "citations": ["9af1ce26795f0f8a05d74910c7a5a86b", "b9186a6af155e8bf37913d08f31e0ef7", "56f936805524b3ae3f88baaf086b763f", "450361845199710132ac88317042a1b8"]}, "['Q4', '2024']": {"answer": "5114f678ddaa0785f82b48eacf8cff05 --> We expect a 10% to 12% growth both in ATS and customer base in 2025.\n\n075ae34f3000fa987564fae9c754f27e --> This is in line with our guidance of AUM growth in mid-20s for financial year '24.\n\nbf0c97d57facc286ad9a23762339541d --> On the back of a good growth in financial year '24, despite some challenges in Punjab, we remain confident of growing in the mid-20s in financial year '25 with healthy return ratio.\n\n40254f357cd799fbfca8e54d68adb7b2 --> We are anticipating similar recovery patterns in the coming quarters.\n\n8aa08613a637bf5cc7b4000062853edc --> Devesh Sachdev [Inferred as CEO][Overall, there will be around 10% to 12% increase in the ticket size and the average outstanding of the customer which should take care of AUM per RO. You will see that maybe in Q4 FY25, because the first 2 quarters, you will be aware we'll be opening new branches and those metrics may not be visible. But then you will start seeing that change happening, and you will see that overall metrics moving up in Q4.]", "citations": ["5114f678ddaa0785f82b48eacf8cff05", "075ae34f3000fa987564fae9c754f27e", "bf0c97d57facc286ad9a23762339541d", "40254f357cd799fbfca8e54d68adb7b2", "8aa08613a637bf5cc7b4000062853edc"]}, "['Q3', '2024']": {"answer": "c48c748863844947334f4b83372f1e2b --> As guided earlier, we are on track to deliver an AUM growth of mid-20s in Financial Year ‘24.\n\n4b7376e92e287e21b629bb6364939d70 --> We would like to mention again that we will share our broad growth strategy on both verticals in Q1 of Financial Year ‘25.\n\n934214f0c1158d068e14786da614d7e4 --> Our guidance is up to 3.5%.\n\n4107000b11ed966962eb6d1b9be13b73 --> But mid-20s, yes. Mid-20s is the growth which we have been guiding and how both the verticals, both MFI and MSME will grow, we will give a more clear granular information in Q1.", "citations": ["c48c748863844947334f4b83372f1e2b", "4b7376e92e287e21b629bb6364939d70", "934214f0c1158d068e14786da614d7e4", "4107000b11ed966962eb6d1b9be13b73"]}, "['Q2', '2024']": {"answer": "950e1b454627eedc86fec161f129922e --> This gives us confidence to grow in mid 20s as what we have been stating always.\n\nc44b18e0ed9a75c8c7245dfc4bd87686 --> Our growth will be mid 20s.\n\n6851189acd6904f69d5ed948590ea7ea --> We are very, very confident that what we have been guiding with mid 20s growth will happen this year.", "citations": ["950e1b454627eedc86fec161f129922e", "c44b18e0ed9a75c8c7245dfc4bd87686", "6851189acd6904f69d5ed948590ea7ea"]}, "['Q1', '2024']": {"answer": "011b93da6f42e66d1d36659eebfec53a --> NIM will expand in the next two quarters before it stabilizes.\n\ncdb7f76465b1b74e1e566703f2be2cd5 --> But overall, we are looking at a good momentum, and we are very confident of that. Whatever the industry average, we'll be either equal or slightly more than the industry average.\n\nee3bfbec0158e9c401a3f6463ba3284e --> We believe that in the next two quarters, three quarters, after three quarters to at least by end of this year, you will see either it is stabilizing or going down. That's our effort.\n\nc214e00731bb7a2baaa82596e614bd0f --> I think we will see that at least 10% to 12% growth from where we are right now this year.\n\ndd2b5348efa2ad85c0b24f8b8cd2636c --> But right now, we would like to make sure that overall, not more than 10% to 12% growth from here in the next three quarters.", "citations": ["011b93da6f42e66d1d36659eebfec53a", "cdb7f76465b1b74e1e566703f2be2cd5", "ee3bfbec0158e9c401a3f6463ba3284e", "c214e00731bb7a2baaa82596e614bd0f", "dd2b5348efa2ad85c0b24f8b8cd2636c"]}, "['Q2', '2025']": {"answer": "de935262c09a3abc04af132ac00658ec --> We have already planned our rights issue; I can confirm again that our promoters are completely behind this 550 crore rights issue.\n\n56523ff8c22ba3e227cf98b10f79a7b2 --> Devesh Sachdev [This INR 550 crore rights issue is giving a good confidence to all our stakeholders and promoters are completely backing us up.]", "citations": ["de935262c09a3abc04af132ac00658ec", "56523ff8c22ba3e227cf98b10f79a7b2"]}}}, {"topic": "Profitability analysis", "data": {"['Q4', '2024']": {"answer": "2c32513dc4d1726be6f1054b393fd6fe --> We are quite confident of delivering ROAs in a guided range of 4.25% to 4.5%, and ROE of 18% to 20% over longterm.\n\n35017f1a38eec8b98bc2f8f24aeef574 --> Our long-term ROA will hover between 4.25% to 4.5%.", "citations": ["2c32513dc4d1726be6f1054b393fd6fe", "35017f1a38eec8b98bc2f8f24aeef574"]}, "['Q3', '2024']": {"answer": "3bf31b7bb11737aa3b4a07d34283eaf1 --> Devesh Sachdev [We have been guiding this since we went to the street first time 4.25 to 4.5% ROA guidance cross cycle and ROE of 18 to 20%. That is what we have been guiding consistently over the last 18 months.]", "citations": ["3bf31b7bb11737aa3b4a07d34283eaf1"]}, "['Q2', '2024']": {"answer": "e44c255aba675d1ba66b2286bceeb2ea --> Our first target is to reach a NIM of 11.2 to 11.5%. The whole trajectory has been like that only and we have also been telling the people that look we are very focused on our cost of fund... I think you will see the NIM reaching the guided level in the next two quarters then we will take a call that how do we want to go forward from there.", "citations": ["e44c255aba675d1ba66b2286bceeb2ea"]}, "['Q1', '2024']": {"answer": "16b84005c3c3b7bddc3e25a46bf66bdc --> As for our guidance, we are confident of delivering ROA of around 4.25% to 4.5% and ROE of 18% to 20% on a sustainable basis.\n\ndd2b5348efa2ad85c0b24f8b8cd2636c --> So that is what -- and if you're still able to protect your NIM, ROA around 4.25% to 4.5%.", "citations": ["16b84005c3c3b7bddc3e25a46bf66bdc", "dd2b5348efa2ad85c0b24f8b8cd2636c"]}, "['Q2', '2025']": {"answer": "526caa03cc7d9c70672bc00931412ab6 --> We had also shared an early estimate of expected provisioning of between 500 to 550 crore for Q2 FY25 in mid-September, which was subject to limited review by auditors.", "citations": ["526caa03cc7d9c70672bc00931412ab6"]}}}, {"topic": "Loan portfolio expansion", "data": {"['Q4', '2023']": {"answer": "e8169fb3bf4818af44b91d6cd904ee8b --> We aim to increase our loan portfolio by 20% over the next fiscal year.\n\n3d271d667efa82764ad533994e5c2e8c --> We have moved our first ticket size loan slightly upward, which is as per our guidance that we reset around 10% to 12%.\n\n03afa693cfc6044be2d08bd1d5ef01ce --> The loan ticket size has been now increased to INR40,000. The average first loan ticket size is still at the range of about INR37,000, which was around INR30,000, INR31,000 earlier.\n\n771d57dc1127bb4e0b8954f51ecf8cf8 --> We have not changed the ticket size for our second, third or fourth or fifth cycle and above customers. We have only changed the first loan cycle amount because earlier it was capped at INR30,000. Now we are saying it is up to INR40,000.", "citations": ["e8169fb3bf4818af44b91d6cd904ee8b", "3d271d667efa82764ad533994e5c2e8c", "03afa693cfc6044be2d08bd1d5ef01ce", "771d57dc1127bb4e0b8954f51ecf8cf8"]}, "['Q4', '2024']": {"answer": "bf0c97d57facc286ad9a23762339541d --> As a diversification strategy, we will tap ECBs and debt capital market in this year.\n\n2f4f3afabdffc9ebdb838cd32fcaba96 --> Micro Finance will remain our core, and we are completely committed on that. But around that, whatever elbow we have available of 25%, we would like to utilize that to do more products as we are already now building MSME.", "citations": ["bf0c97d57facc286ad9a23762339541d", "2f4f3afabdffc9ebdb838cd32fcaba96"]}, "['Q1', '2024']": {"answer": "d13839583c6b096a7938ff20e6a69a2b --> Anand Dama: If you remember last two earning calls, we had mentioned that, we increased our first loan cycle from INR30,000 to up to INR40,000.\n\nd13839583c6b096a7938ff20e6a69a2b --> Anand Dama: What we are trying to drive there is that, it is up to INR40,000.", "citations": ["d13839583c6b096a7938ff20e6a69a2b"]}}}, {"topic": "Cost management strategies", "data": {"['Q1', '2025']": {"answer": "9a9ffb5468a4226eefb30a42a856a648 --> We expect to maintain the cost of fund and marginal cost of funds at similar levels.", "citations": ["9a9ffb5468a4226eefb30a42a856a648"]}, "['Q4', '2023']": {"answer": "e8169fb3bf4818af44b91d6cd904ee8b --> Our goal is to reduce non-performing assets to below 2% by the end of the calendar year.", "citations": ["e8169fb3bf4818af44b91d6cd904ee8b"]}, "['Q4', '2024']": {"answer": "753f73bde54b6ab90269082634113c75 --> We expect it to range between 36% to 38%.\n\na5fbe22099b274e64b882a75f2e4a444 --> Gaurav Maheshwari [You will start looking at this coming in the first quarter onwards because whatever repricing which we needed to do, we have already done that in the incremental sanctions. As mentioned, that in a year, we had, 2 rating upgrades, and our marginal cost has decreased by 44 bps in last year. Now it will show some impact in Q1, Q2 going forward.]\n\nb1561502c8f0d1d3a077e61f8cf5218a --> Gaurav Maheshwari [Utilizing NIM uptick or opex rationalization in H2 of FY25 to create buffers]\n\n68e732b29793a38f5563dbfae3d85056 --> [Devesh Sachdev][There is no plan in the immediate future to reduce the rates.]", "citations": ["753f73bde54b6ab90269082634113c75", "a5fbe22099b274e64b882a75f2e4a444", "b1561502c8f0d1d3a077e61f8cf5218a", "68e732b29793a38f5563dbfae3d85056"]}, "['Q3', '2024']": {"answer": "8400df907346e14e4455f94484321fb4 --> we are confident that we will be able to manage the credit cost within the 3.5% for this financial year.\n\nc07a60dcb8fe29c122a20d43a35bf713 --> We will be, if I take out the MSME piece, we will be around 32, 33% cost to income.", "citations": ["8400df907346e14e4455f94484321fb4", "c07a60dcb8fe29c122a20d43a35bf713"]}, "['Q2', '2024']": {"answer": "070e2766a6afe7bbdee21b6543c6f840 --> We are confident for closing this financial year with less than or equal to 36%.\n\n97b2b8e920a664fde5087ce5573d9ffd --> Devesh Sachdev [Credit cost will be less than 3% for March FY2024]", "citations": ["070e2766a6afe7bbdee21b6543c6f840", "97b2b8e920a664fde5087ce5573d9ffd"]}, "['Q1', '2024']": {"answer": "996d90b19be623867c010ad3c1c5d99d --> The cost to income has marginally increased by 9 bps from 36.18% Q4 FY '23 to 36.26% in Q1 FY '24. It would largely be the same for FY '23-'24.\n\n824dc22b60ae2ff8516884800023ac5d --> Gaurav Maheshwari [So as we see that there is an increase in the annual cost of funds. So we have passed on near about 40 bps to the customer. And as it is into -- it will be starting from July onwards, 7, July, I would rather be very precise. And it will have obviously incremental impact on the incremental portfolio which we are going to end.]", "citations": ["996d90b19be623867c010ad3c1c5d99d", "824dc22b60ae2ff8516884800023ac5d"]}, "['Q2', '2025']": {"answer": "11c39427b5f1ea1e2ceeab65edef2a65 --> We have already planned additional remedial measures, including the rights issue of up to INR 550 crore, on which we have been working on the last month or so. Now that our Q2 numbers are out, we have fast tracked the process and hope to file it within this quarter.", "citations": ["11c39427b5f1ea1e2ceeab65edef2a65"]}}}]}, {"theme": "Market Position and Competition", "topics": [{"topic": "Competitive landscape analysis"}, {"topic": "Market share development"}, {"topic": "Differentiation strategies"}]}, {"theme": "Risk and Compliance Management", "topics": [{"topic": "Regulatory changes impact", "data": {"['Q1', '2024']": {"answer": "824dc22b60ae2ff8516884800023ac5d --> Devesh Sachdev [The write of policy was that, when the days passed to be more than 365 days, then only we write off from the book, which has been now been changed to 270.]", "citations": ["824dc22b60ae2ff8516884800023ac5d"]}}}, {"topic": "Risk mitigation strategies", "data": {"['Q1', '2025']": {"answer": "dfd0b484fc9c316a83b1bd3f50f1d76c --> The adjustment which we have done in our PD and LGD, is earlier we used to take 5 years average. Now we have shifted to 3 years average.", "citations": ["dfd0b484fc9c316a83b1bd3f50f1d76c"]}, "['Q3', '2024']": {"answer": "7a0044cfbfd6b2c15f98ecf656d814f0 --> Gaurav Maheshwari[As we have mentioned previously that this business is having a steady-state gross NPA between 1.5 to 1.8%. It is going to be continuing.]", "citations": ["7a0044cfbfd6b2c15f98ecf656d814f0"]}, "['Q2', '2024']": {"answer": "857d87a605088b2b7fe367d43b37350c --> So Viral as we have already mentioned it is not that write-offs will come continuously in lot of quarters but as we have changed our write-off policy in the last Board meeting post our Q1, so there would another leg of write-off which will come in the next quarter. Beyond that you will see a regular course of normalized credit cost, but it will not be as significant as we did in this and in the next quarter.", "citations": ["857d87a605088b2b7fe367d43b37350c"]}}}, {"topic": "Compliance adherence", "data": {"['Q1', '2025']": {"answer": "5577ceb766792a8857be08f8bda64c2b --> MFIN came out with a set of guardrails to control the over lending to customers. It has restricted sourcing of customers already having 4 lenders and also those having microfinance loan outstanding of more than INR2 lakh.", "citations": ["5577ceb766792a8857be08f8bda64c2b"]}, "['Q1', '2024']": {"answer": "cdb7f76465b1b74e1e566703f2be2cd5 --> In this Board meeting, which happened yesterday, we have the policy to write off after 270 days has been approved. So going forward, yes, we will be looking at it.", "citations": ["cdb7f76465b1b74e1e566703f2be2cd5"]}}}]}, {"theme": "Operational Efficiency and Expansion", "topics": [{"topic": "Process optimization", "data": {"['Q1', '2025']": {"answer": "1000476608bf59675e32e68ac3b60a7b --> But overall, I think in terms of our capacity, we can do even 25% to 30% more than what we are doing for the last 2 quarters.", "citations": ["1000476608bf59675e32e68ac3b60a7b"]}, "['Q3', '2024']": {"answer": "438597dd4f5bea3806a194dac945a2a2 --> Devesh Sachdev [every six months we will share the data. We shared the data in September. So, we will share again after the Q4 results.]\n\n438597dd4f5bea3806a194dac945a2a2 --> Devesh Sachdev [But more granular data which we have already provided after the September result, we will provide again after Q4.]", "citations": ["438597dd4f5bea3806a194dac945a2a2"]}, "['Q2', '2024']": {"answer": "c1cd2a39bc72a23f7c4d3abc3c8e5b14 --> Yes Pranav that is a very fair assumption. Our endeavor would be in this direction only.", "citations": ["c1cd2a39bc72a23f7c4d3abc3c8e5b14"]}, "['Q1', '2024']": {"answer": "903786227444b1c71eaa355dcc59cd61 --> We'll be sharing some of these cuts with you every quarter.", "citations": ["903786227444b1c71eaa355dcc59cd61"]}}}, {"topic": "Branch network strategy", "data": {"['Q1', '2025']": {"answer": "80f56e738e31fa15408ffd0eca5d8d71 --> Opex for Q1 saw an increase on account of new branch openings and annual increments. This should normalize in the latter half of the year.\n\n409cf3ce0617bb75a1b9d59bcc0ca87f --> Devesh Sachdev [We have actually calibrated our growth because I can give you -- if you look at the sense here -- that the last 6 to 8 months, we have added close to 25% to 30% to our branch network.]\n\n409cf3ce0617bb75a1b9d59bcc0ca87f --> Devesh Sachdev [Even in the first quarter, we have added 100 branches -- out of which 47 branches are split.]\n\nd0df34bc44cd9220ba5339aeb15091f7 --> 40-50 branches, which are going to open. Otherwise, we are done for this year.\n\nfb25d01015d2a27c2bfb989fa93b99ea --> We want to maintain around 450 because we have in the last quarter, we have added new ROs there under training, and they will be put up in the new branches or the existing branches.", "citations": ["80f56e738e31fa15408ffd0eca5d8d71", "409cf3ce0617bb75a1b9d59bcc0ca87f", "d0df34bc44cd9220ba5339aeb15091f7", "fb25d01015d2a27c2bfb989fa93b99ea"]}, "['Q4', '2023']": {"answer": "cb12f5a87c7e5ead409d22822022832a --> We have added 152 branches in financial year '23. Our branch strength now stands at 1,086 versus 934 in the financial year 2022, which is a growth of around 16%.\n\ne8169fb3bf4818af44b91d6cd904ee8b --> We expect to open 50 new branches by the end of the next quarter.", "citations": ["cb12f5a87c7e5ead409d22822022832a", "e8169fb3bf4818af44b91d6cd904ee8b"]}, "['Q4', '2024']": {"answer": "5114f678ddaa0785f82b48eacf8cff05 --> We will maintain similar growth rate of branches in the coming year with approximately 66% of branches planned to be opened outside of our top 5 states.\n\na14d6f8affa3ffffb831f349948e7b18 --> So top 5 states, branch openings will be only 17%... This year, around 50, which is again 17% of total branch network.\n\na14d6f8affa3ffffb831f349948e7b18 --> We are going to split around 60 branches, which is around 20%-25% of the branches will get split, where the portfolio has moved up.\n\n68e732b29793a38f5563dbfae3d85056 --> [Devesh Sachdev][For the entire year, we would have added close to about 17-odd branches.]", "citations": ["5114f678ddaa0785f82b48eacf8cff05", "a14d6f8affa3ffffb831f349948e7b18", "68e732b29793a38f5563dbfae3d85056"]}, "['Q3', '2024']": {"answer": "4b7376e92e287e21b629bb6364939d70 --> We are targeting to add approximately 200 branches in Financial Year ‘24.\n\n8400df907346e14e4455f94484321fb4 --> we first stopped the disbursement in the impacted branches. Then finally we took a call-in end December to actually stop disbursement in every branch.\n\n52d9170b2c64bb59d79f4da013da46c9 --> We will keep on splitting the branches which crossed a certain AUM size or number of customers.\n\nc07a60dcb8fe29c122a20d43a35bf713 --> We will be adding good number of branches even the coming year, which we will give some guidance in financial year, in Q1 of '25.", "citations": ["4b7376e92e287e21b629bb6364939d70", "8400df907346e14e4455f94484321fb4", "52d9170b2c64bb59d79f4da013da46c9", "c07a60dcb8fe29c122a20d43a35bf713"]}, "['Q2', '2024']": {"answer": "86f7199a080428eb296d4445cbb0f9bd --> We are targeting to open approximately 160 to 170 branches in FY2024.\n\ndc96a98b035e97317f35434caea88231 --> The idea is that and our policy is when the branch touches more than 15 Crores of portfolio we split that branch, so 75% of those branches the split has happened in top five states especially.\n\nca47c2e7b91d767bbc981984f41bdfae --> We have close to around 76 branches, we are opening another 30 branches this year, and it will be 100 branches, it is already 4% of our overall portfolio, it shows the kind of focus we are giving to this vertical.\n\n97b2b8e920a664fde5087ce5573d9ffd --> Devesh Sachdev [160-170 additional branches will be opened this year]", "citations": ["86f7199a080428eb296d4445cbb0f9bd", "dc96a98b035e97317f35434caea88231", "ca47c2e7b91d767bbc981984f41bdfae", "97b2b8e920a664fde5087ce5573d9ffd"]}, "['Q2', '2025']": {"answer": "379756df026c0b3c7819c2718354723d --> We already have given offer to around 60 people in the first phase, we will bring it around in 200 branches.", "citations": ["379756df026c0b3c7819c2718354723d"]}}}, {"topic": "Workforce productivity programs", "data": {"['Q1', '2025']": {"answer": "d19f6468487b4885072be054a7bef474 --> We are strengthening our collection team. We have changed our model in terms of how many collection officers we need.\n\nf94f2e6309dac25c278b5d72d1c6451d --> Devesh Sachdev [Disbursement calibration has already happened in July. We stopped disbursement in around 50, 60 branches last month. We have stopped another 40 branches this month from 1st August. New customer sourcing criteria has been tightened from 1st August. The rationalization of customer handling at RO level has been going on, incentive structure has also been aligned from 1st August and collection team is strengthening, has already happened. We have added last month, 50 more people in the collection team. A very senior guy we have hired is joining on 20th of August. More than 100 people will be added in the collection team in this month, August only.]\n\n64ae7f75176ad74c608aaae6c9f27219 --> We have already over the last six, eight months, we have been rationalizing our field officer.", "citations": ["d19f6468487b4885072be054a7bef474", "f94f2e6309dac25c278b5d72d1c6451d", "64ae7f75176ad74c608aaae6c9f27219"]}, "['Q2', '2025']": {"answer": "1ab983cf0b2678a14c620ae333a87264 --> We have already reduced our customer handling per relationship officer to 380 customers per relationship officer, so that we can improve our customer outreach on ground with strong focus on customers with irregular attendance.", "citations": ["1ab983cf0b2678a14c620ae333a87264"]}}}]}, {"theme": "Customer Engagement and Retention", "topics": [{"topic": "Customer acquisition strategies", "data": {"['Q4', '2024']": {"answer": "075ae34f3000fa987564fae9c754f27e --> If you remember, this is above our guidance of 10% to 12% of new customer addition.", "citations": ["075ae34f3000fa987564fae9c754f27e"]}, "['Q3', '2024']": {"answer": "2cb6399851d048b324ae08a6412d9fd3 --> Inferred as Management: This is in line with our stated 10 to 12% increase every year in new customer acquisition.", "citations": ["2cb6399851d048b324ae08a6412d9fd3"]}, "['Q2', '2024']": {"answer": "72b2429687588cfd75ead91f360f7858 --> It will be pertinent to say that this is in line with our stated 10 to 12% increase in new customer acquisition year-on-year.", "citations": ["72b2429687588cfd75ead91f360f7858"]}, "['Q2', '2025']": {"answer": "b1f06acb9cabb75847eee2f7c90141be --> We have brought this point, that we will not onboard a customer if it has gone more than 30+.", "citations": ["b1f06acb9cabb75847eee2f7c90141be"]}}}, {"topic": "Client retention initiatives", "data": {}}, {"topic": "Satisfaction and loyalty programs", "data": {}}]}, {"theme": "Credit and Portfolio Management", "topics": [{"topic": "Credit risk assessment", "data": {"['Q4', '2024']": {"answer": "2c32513dc4d1726be6f1054b393fd6fe --> In financial year '25, we do not expect our net credit cost to exceed 3%.\n\na5fbe22099b274e64b882a75f2e4a444 --> Management [Net credit costs would be less than 3% for FY '25.]\n\n41c7b5f6ae3eb021f1656e1686e40247 --> Net credit cost, we are saying that it should come down to sub 3% it should not exceed 3%.\n\n6c1b7138b34668f76f82fdcb8e300ec7 --> Bhavik Dave [We would like the credit cost to be hovering anywhere between 2.5% to 2.75%.]", "citations": ["2c32513dc4d1726be6f1054b393fd6fe", "a5fbe22099b274e64b882a75f2e4a444", "41c7b5f6ae3eb021f1656e1686e40247", "6c1b7138b34668f76f82fdcb8e300ec7"]}, "['Q3', '2024']": {"answer": "3c50220111f634c970d9d08ae9ba22b5 --> We expect to close the year with a net credit cost of up to 3.5%, which will take care of major impact of this state.\n\n54e775c89ed881828f4634289fd25310 --> So, that is why we have given upto 3.5% of credit cost as the guidance.\n\n344ab2e3225d225583c2350293e7551c --> We expect a normalized credit cost starting next financial year.\n\n004dff10995f5a16ad15f7aefec56f2a --> We are confident for closing FY '24 with the net credit cost of up to 3.5%.", "citations": ["3c50220111f634c970d9d08ae9ba22b5", "54e775c89ed881828f4634289fd25310", "344ab2e3225d225583c2350293e7551c", "004dff10995f5a16ad15f7aefec56f2a"]}, "['Q2', '2024']": {"answer": "161f8b53a582a379c639ebbfc1b69c28 --> Given the traction we have seen, we are confident of having a credit cost of less than 3% in this financial year.\n\n23d85c85b596b3a7859c26884ee611d2 --> Gaurav Maheshwari [CFO] [going forward I think you will have a similar sort of write-off in Q3 and after that in Q4 and onwards you will see a normalized credit cost going forward.]\n\nbe18c83952f6c642a8c381916eee5d1d --> we are very confident that we will keep the credit cost less than 3% and that is the traction we are now looking at.\n\nbe18c83952f6c642a8c381916eee5d1d --> in this financial year it should come down to less than 3%.\n\n857d87a605088b2b7fe367d43b37350c --> Yes that is what we are saying.", "citations": ["161f8b53a582a379c639ebbfc1b69c28", "23d85c85b596b3a7859c26884ee611d2", "be18c83952f6c642a8c381916eee5d1d", "857d87a605088b2b7fe367d43b37350c"]}, "['Q1', '2024']": {"answer": "f04248a46739f335d3a0e606d4208ffb --> We are hopeful that the credit costs will normalize in next two quarters to three quarters as we deal with these issues in a very organic manner.\n\ndd2b5348efa2ad85c0b24f8b8cd2636c --> I think ideally, I would like that the credit costs remain anywhere between 1.5% to 2.25% up to 2% kind of thing because you have the now capacity to really -- because keeping in mind, it's unsecured.", "citations": ["f04248a46739f335d3a0e606d4208ffb", "dd2b5348efa2ad85c0b24f8b8cd2636c"]}}}, {"topic": "Loan portfolio strategy", "data": {"['Q4', '2024']": {"answer": "2eae1eb88df9e7bec1aff61911e8410b --> We are holding 25% of the provision of the INR317 crores of book of Punjab as on 31st March 2024.\n\n6c1b7138b34668f76f82fdcb8e300ec7 --> Bhavik Dave [In FY25, we would definitely like to improve there and that's how we said it would be less than 3%.]", "citations": ["2eae1eb88df9e7bec1aff61911e8410b", "6c1b7138b34668f76f82fdcb8e300ec7"]}, "['Q3', '2024']": {"answer": "4b7376e92e287e21b629bb6364939d70 --> We have been guiding that we would like to maintain portfolio mix of 65% to 70% secured and 30% to 35% unsecured in MSME to balance risk and return and we are absolutely on track. We are confident of reaching this mix in the next three quarters.", "citations": ["4b7376e92e287e21b629bb6364939d70"]}, "['Q2', '2024']": {"answer": "d945a9aa8b1a61f0ca17b39a9aa80bde --> We have been guiding that we would like to maintain a portfolio mix of 65 to 70% secured and 25 to 30% unsecured balancing prudence and yield. We are confident of reaching this ratio mix in next three quarters.\n\n857d87a605088b2b7fe367d43b37350c --> Yes we are going to continue and if option is being given we are going to increase thal coverage.", "citations": ["d945a9aa8b1a61f0ca17b39a9aa80bde", "857d87a605088b2b7fe367d43b37350c"]}, "['Q1', '2024']": {"answer": "011b93da6f42e66d1d36659eebfec53a --> The whole portfolio churning will be done in the next two to three quarters, and most of the portfolio will be at the new price.\n\n2901c5dd4c0db8131615f4d16497f590 --> From December onwards, you will see that the older portfolio will go out from the portfolio. And you will see the normalized credit cost.", "citations": ["011b93da6f42e66d1d36659eebfec53a", "2901c5dd4c0db8131615f4d16497f590"]}, "['Q2', '2025']": {"answer": "b582d45b4120396638e6792bf79d0fe3 --> We have gone further tighter in terms of even old indebtedness. What we have done is that, though at the sector level the indebtedness limit, has been fixed by the SRO at 2 lakh. We have gone state-by-state, we have looked at certain states which have given more pain. We have even gone further and say, okay we will be only 1.5 lakh. Then we are doing some more granular work in terms of understanding the villages.", "citations": ["b582d45b4120396638e6792bf79d0fe3"]}}}, {"topic": "Delinquency management", "data": {"['Q1', '2025']": {"answer": "a069a6fad0e523c1ea683eb0706e8ce7 --> We are still hopeful that though we have earmarked these customers in Stage 3, we will be doing all efforts to make sure that we start recovery from these customers in the next two to three months.\n\nd19f6468487b4885072be054a7bef474 --> But now we are saying that from 1st August, we have put up a policy where we say, okay, if a customer has gone beyond 30 DPD, we will not on board that customer.", "citations": ["a069a6fad0e523c1ea683eb0706e8ce7", "d19f6468487b4885072be054a7bef474"]}, "['Q4', '2024']": {"answer": "c7e13a160ebf2828dd562da438c23515 --> We have already accelerated our write-offs. Instead of 365 days, we are now writing off in 270 days.", "citations": ["c7e13a160ebf2828dd562da438c23515"]}, "['Q2', '2024']": {"answer": "3ab544b248ad62f5373c7c4522712c5e --> Gaurav Maheshwari[Yes it will come down.]", "citations": ["3ab544b248ad62f5373c7c4522712c5e"]}}}]}, {"theme": "Technology and Digital Transformation", "topics": [{"topic": "Digital lending platforms"}, {"topic": "IT infrastructure advancements"}, {"topic": "Cybersecurity measures"}]}, {"theme": "Geographic Strategy and Performance", "topics": [{"topic": "State-level concentration", "data": {"['Q3', '2024']": {"answer": "1af5f1db578283fb79fd939088ee1c50 --> So, I think we have an overall district strategy of not being more than 4% in any district. Highest district today is 1.59%. So, yes, I think we are very confident this strategy will play out.", "citations": ["1af5f1db578283fb79fd939088ee1c50"]}}}, {"topic": "Geographic diversification plans", "data": {"['Q4', '2023']": {"answer": "d789597ddec535116794a2f783119274 --> We have also recently launched our business in Karnataka, and also now looking at entering Andhra Pradesh and Telangana post the favourable Telangana High Court order.", "citations": ["d789597ddec535116794a2f783119274"]}, "['Q3', '2024']": {"answer": "32353aa9f119965ca71c38e6ba1402f1 --> Tarun Mehndiratta [70% of the expansion has come in non-top 5 states... 64 branches out of these 156 came into these 3 states.]", "citations": ["32353aa9f119965ca71c38e6ba1402f1"]}}}, {"topic": "Regional performance metrics", "data": {}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New product launches"}, {"topic": "R&D investment focus"}, {"topic": "Technology advancements"}]}]