[{"theme": "Regulatory and Compliance Risks", "topics": [{"topic": "Statutory and regulatory changes", "data": {"['Q1', '2024']": {"answer": "2be9a2c337a9f4dc883d87ab0ed61fd5 --> We would not want to go below 75% in that entity.\n\ndff25efeeb4c7f727acfb4f7fed680de --> Anindya Banerjee [The BRSR will come out hopefully in the next 10 to 15 days, and then the numbers would be in the public domain.]", "citations": ["2be9a2c337a9f4dc883d87ab0ed61fd5", "dff25efeeb4c7f727acfb4f7fed680de"]}}}, {"topic": "Political or economic instability", "data": {}}, {"topic": "Sovereign rating changes", "data": {}}]}, {"theme": "Financial Risk Management", "topics": [{"topic": "Nonperforming loans increase", "data": {}}, {"topic": "Interest and foreign exchange rate impacts", "data": {"['Q3', '2024']": {"answer": "2f1486c422a70f93ab294f60e1597ab7 --> Anindya Banerjee [There will be some more increase in the cost of deposits in Q4 and possibly a little bit into Q1 as well. It should be less than what we have seen and the NIM impact should also be less than what we have seen in this quarter.]", "citations": ["2f1486c422a70f93ab294f60e1597ab7"]}, "['Q2', '2024']": {"answer": "0e79f7313cd6aeb7f1efe39f1bf75c0e --> We would continue to expect to see some increase in the cost of deposits on the book, and therefore some moderation in margins over the next quarter or so as well, as we have articulated in the past, but on a full year basis, we continue to expect that the margins would be at a similar level as they were in FY23.\n\ne0f3ced977f3c893193857bf59570d90 --> It will be stable in Q3 and then reverse in Q4.", "citations": ["0e79f7313cd6aeb7f1efe39f1bf75c0e", "e0f3ced977f3c893193857bf59570d90"]}, "['Q4', '2024']": {"answer": "4c4743a36ec5628889ef452849639ec1 --> we will still see some increase in deposit costs, both as the repricing comes through and given the increase in retail deposit rates during Q4 as well. So I guess we could see some further moderation in the NIM, but I would expect it to be pretty range bound from here on for the next few quarters until a rate cut actually happens.", "citations": ["4c4743a36ec5628889ef452849639ec1"]}, "['Q2', '2025']": {"answer": "5d26091e00e39769d78941b58273fd5a --> The movement in net interest margin from Q1 to Q2 includes the impact of the higher number of days in the current quarter, which should seasonally reverse in Q4.", "citations": ["5d26091e00e39769d78941b58273fd5a"]}, "['Q3', '2023']": {"answer": "ddd18544f6633eb0b44fd986a3a8a382 --> Our aim is to increase net interest margin by 20 basis points over the next two quarters.", "citations": ["ddd18544f6633eb0b44fd986a3a8a382"]}, "['Q1', '2024']": {"answer": "d0516a061ac1ed612436d6167d976bf2 --> We expect the cost of deposits to continue to increase over the next couple of quarters.\n\n87d14b334eebcb7633a41b38a8275e62 --> Anindya Banerjee [We will see the cost of funds continue to increase I would guess, for the next couple of quarters. And by then, the repricing impact should have largely taken place, that trajectory will continue.]\n\n42d8bea28cbbcf2806001f6b3e79a52e --> Anindya Banerjee [We will see a continuing increase in the cost of deposits for the next couple of quarters.]", "citations": ["d0516a061ac1ed612436d6167d976bf2", "87d14b334eebcb7633a41b38a8275e62", "42d8bea28cbbcf2806001f6b3e79a52e"]}}}, {"topic": "Credit losses allowance adequacy", "data": {"['Q4', '2024']": {"answer": "fd8b9a88412c583a6c2bd2d5ac1d69ba --> I think, if you kind of adjust out one offs or if you take a more adjusted view, we would still be under 50 basis points. That may normalize upwards slightly, but I don't see anything very dramatic there.", "citations": ["fd8b9a88412c583a6c2bd2d5ac1d69ba"]}, "['Q1', '2025']": {"answer": "c985f60e13c8747f00ce02f3a6f83f78 --> The credit cost to advances would be about 50 bps, which is the adjusted credit cost level we had spoken of in the earnings calls for the previous two quarters as well.", "citations": ["c985f60e13c8747f00ce02f3a6f83f78"]}}}]}, {"theme": "Market and Economic Conditions", "topics": [{"topic": "Global economic impacts", "data": {"['Q2', '2024']": {"answer": "d402dcd24266b8b341b4d0fd155b5598 --> We do expect margins to moderate further from the Q2 level. And hopefully, the extent of moderation could be somewhat lower. And we would be at a similar level of margins as we were last year.", "citations": ["d402dcd24266b8b341b4d0fd155b5598"]}, "['Q2', '2025']": {"answer": "42d1b49ff5e6bdd4a4fcac385449baf7 --> Anindya Banerjee [We would expect margins to be broadly stable in H2 relative to H1 until a rate cut cycle starts.]", "citations": ["42d1b49ff5e6bdd4a4fcac385449baf7"]}}}, {"topic": "Indian economic resilience", "data": {"['Q2', '2025']": {"answer": "6664bcfe6ed174832bf4304fb86a1afe --> Anindya Banerjee[For the first half this year, while the Q2 number is indeed year-on-year growth is very low at 6.6%, for the first half this year, it's about 8.5% or so. And it could be slightly higher in the second half, given all the festive season-related spends and other technology spends, etc., that we have planned out. But broadly, around this level, give or take a couple of percentage points is where we should see it in the near term.]", "citations": ["6664bcfe6ed174832bf4304fb86a1afe"]}}}, {"topic": "Rural demand trends", "data": {"['Q1', '2025']": {"answer": "a16cceb90d1c689f9743decf37096316 --> By the time we end this year it will be closer to 20% kind of number or lower.", "citations": ["a16cceb90d1c689f9743decf37096316"]}}}]}, {"theme": "Growth and Expansion Strategies", "topics": [{"topic": "Future business plans", "data": {"['Q3', '2024']": {"answer": "31f2c9cb06afd15198367ed526a23d98 --> Looking ahead, we see many opportunities to drive risk calibrated profitable growth. We believe our focus on customer 360, extensive franchise and collaboration within the organisation, backed by our digital offerings, process improvements and service delivery initiatives will enable us to deliver holistic solutions to customers in a seamless manner and grow market share across key segments. We will continue to make investments in technology, people, distribution and building our brand. We will remain focused on maintaining a strong balance sheet with prudent provisioning and healthy levels of capital. The principles of “Return of Capital”, “Fair to Customer, Fair to Bank” and “One Bank, One Team, One RoE” will continue to guide our operations. We remain focused on delivering consistent and predictable returns to our shareholders.", "citations": ["31f2c9cb06afd15198367ed526a23d98"]}, "['Q4', '2024']": {"answer": "fd8b9a88412c583a6c2bd2d5ac1d69ba --> We will see an increase there in the first quarter as the promotions, increments come through. But, in terms of the headcount, I would expect stability to moderate increase from here on.", "citations": ["fd8b9a88412c583a6c2bd2d5ac1d69ba"]}, "['Q2', '2025']": {"answer": "13b51c40789046031150f037fca9ce89 --> Anindya Banerjee [On a portfolio growth perspective, as we mentioned that it has come down from 40% to 17% and you will see it trend-down further over the next couple of quarters definitely.]", "citations": ["13b51c40789046031150f037fca9ce89"]}, "['Q4', '2023']": {"answer": "7eeb0c43a98ba842923749a521a82d9d --> We expect our loan book to grow by 15% in the next fiscal year.", "citations": ["7eeb0c43a98ba842923749a521a82d9d"]}, "['Q3', '2023']": {"answer": "ddd18544f6633eb0b44fd986a3a8a382 --> We expect to maintain a credit growth of 15% to 17% for the remainder of the fiscal year.", "citations": ["ddd18544f6633eb0b44fd986a3a8a382"]}, "['Q1', '2024']": {"answer": "2be9a2c337a9f4dc883d87ab0ed61fd5 --> Enter into a Scheme of Arrangement and make it a wholly-owned subsidiary.", "citations": ["2be9a2c337a9f4dc883d87ab0ed61fd5"]}}}, {"topic": "Demand for banking products", "data": {"['Q2', '2024']": {"answer": "25055c38d4797dc3aeeba66f647547c8 --> Anindya Banerjee [mortgages growing at 16%-17%, auto is growing above 20%, commercial vehicles which was flat or growing just about in single digits for a long time, this quarter the year-on-year growth is more like 14%. Our SME and business banking portfolios are growing at the 30% kind of level.]", "citations": ["25055c38d4797dc3aeeba66f647547c8"]}, "['Q3', '2023']": {"answer": "0c528f1ca2963a741760799633342083 --> Anindya Banerjee[During the quarter we have grown our total deposit base by over INR 300 billion and as we had mentioned last time, as the retail deposit rates have started moving up, we've seen a pretty healthy increase in the accretion to retail deposits and that momentum is continuing.]", "citations": ["0c528f1ca2963a741760799633342083"]}}}, {"topic": "Expansion in business", "data": {"['Q4', '2024']": {"answer": "916988103e3dc11b6851ecc8e8d05168 --> We will continue to open branches and expand the franchise. And for that, whatever employee base additions need to be done will happen, but it would be at a much more measured level than what it was over the last 12 to 15 months.", "citations": ["916988103e3dc11b6851ecc8e8d05168"]}, "['Q4', '2023']": {"answer": "7eeb0c43a98ba842923749a521a82d9d --> We are planning to open 50 new branches over the next two years.\n\nbd89879a234feb1d87a5751fb0078651 --> We should see significantly higher branch additions next year than what we have seen this year.", "citations": ["7eeb0c43a98ba842923749a521a82d9d", "bd89879a234feb1d87a5751fb0078651"]}, "['Q3', '2023']": {"answer": "ddd18544f6633eb0b44fd986a3a8a382 --> We plan to open 100 new branches by the end of the next fiscal year.", "citations": ["ddd18544f6633eb0b44fd986a3a8a382"]}}}]}, {"theme": "Strategic Focus and Governance", "topics": [{"topic": "360-degree customer approach"}, {"topic": "Risk-calibrated growth"}, {"topic": "Governance standards enhancement"}]}, {"theme": "Operational Metrics and Efficiency", "topics": [{"topic": "Liquidity coverage ratio", "data": {"['Q2', '2025']": {"answer": "2ae292807edbe5b7d90b06d6358fb48c --> LCR is 120", "citations": ["2ae292807edbe5b7d90b06d6358fb48c"]}, "['Q3', '2023']": {"answer": "d8f2e5c831d8547b71f3dd41042296ea --> Anindya Banerjee [cost to income has come down to 38%. But it's going to be in that range I would say, around 40%.]", "citations": ["d8f2e5c831d8547b71f3dd41042296ea"]}, "['Q1', '2025']": {"answer": "4c97e52ca5fdde71825cd3dc56c1b885 --> Anindya Banerjee [As far as the LDR is concerned, I think this low-to-mid 80s is the level of domestic LDR that we have historically operated at and I don't see any big change in that, it may vary one quarter here up or down, but broadly it should be at that level.]", "citations": ["4c97e52ca5fdde71825cd3dc56c1b885"]}}}, {"topic": "Delivery capability enhancement", "data": {"['Q3', '2024']": {"answer": "b25a298d943f7d6084a0f4d9050aa3ea --> Anindya Banerjee [We expect the full year margin of this year to be at a similar level as of last year, and that implies some further margin compression in Q4, but it should be much lower than what we have seen. I mean, Q3 was already much lower than Q2, and Q4 should be lower than what we have seen in Q3.]", "citations": ["b25a298d943f7d6084a0f4d9050aa3ea"]}}}, {"topic": "Process simplification", "data": {"['Q4', '2024']": {"answer": "e03b035aefdf610aaeb208958a191593 --> As happens every year, the operating expenses are expected to increase on account of annual increments and promotions during the first quarter of every fiscal year.\n\n916988103e3dc11b6851ecc8e8d05168 --> We will probably see opex growth at a moderate pace from here on.", "citations": ["e03b035aefdf610aaeb208958a191593", "916988103e3dc11b6851ecc8e8d05168"]}}}]}, {"theme": "Loan and Credit Portfolio Management", "topics": [{"topic": "Retail loan expansion", "data": {}}, {"topic": "Corporate and SME exposure", "data": {"['Q2', '2025']": {"answer": "f12ea6f9575f30b9242bb1f04f5c80db --> In line with the revised presentation of composition of the loan portfolio, we would be providing the BB and below corporate portfolio from the current quarter onwards.", "citations": ["f12ea6f9575f30b9242bb1f04f5c80db"]}}}, {"topic": "Credit card portfolio growth", "data": {}}]}, {"theme": "Asset Quality and Provisions", "topics": [{"topic": "Net NPA ratio trends", "data": {"['Q4', '2023']": {"answer": "7eeb0c43a98ba842923749a521a82d9d --> Our target is to reduce the NPA ratio to below 2% by the end of 2024.", "citations": ["7eeb0c43a98ba842923749a521a82d9d"]}, "['Q1', '2025']": {"answer": "ce809f87936fcecf2e8f03514e77225f --> Anindya Banerjee [On the recoveries, I think we have been saying for some time that the pace of recoveries will vary and may not continue at the same pace, because we were still collecting out of the pool of NPAs that got created in fiscal ’21 and fiscal ‘22. So, that pace will come-off and therefore, the credit cost will also normalize upwards. But, as I mentioned earlier, finally, if we look at it, the credit costs are still at or below around 50 basis points and then NPL ratios, provisioning coverage are all fine. So, I think that's the way we would look at it.]", "citations": ["ce809f87936fcecf2e8f03514e77225f"]}}}, {"topic": "Provisions and coverage ratio", "data": {}}, {"topic": "Contingency provisions", "data": {"['Q3', '2023']": {"answer": "37bf8f2b56ce6a40aabaa7286ca393f6 --> We will keep revisiting the contingency provision every quarter based on developments and risk markers.", "citations": ["37bf8f2b56ce6a40aabaa7286ca393f6"]}}}]}, {"theme": "Capital Adequacy and Liquidity Management", "topics": [{"topic": "CET-1 ratio analysis", "data": {"['Q1', '2025']": {"answer": "29137e0792ab10fc481ae65dcff9c5e3 --> Sandeep [Role not specified] talked about the capital adequacy position with a CET-1 ratio, including profits for Q1 of 2025, of 15.92%, Tier 1 ratio of 15.92% and total capital adequacy ratio of 16.63% at June 30, 2024.", "citations": ["29137e0792ab10fc481ae65dcff9c5e3"]}}}, {"topic": "Total capital adequacy ratio", "data": {"['Q3', '2023']": {"answer": "ddd18544f6633eb0b44fd986a3a8a382 --> Capital adequacy ratio is expected to remain above 18% for the foreseeable future.", "citations": ["ddd18544f6633eb0b44fd986a3a8a382"]}}}, {"topic": "Revised LCR guidelines", "data": {"['Q1', '2025']": {"answer": "ce809f87936fcecf2e8f03514e77225f --> Anindya Banerjee [On the first one, I think it's a fairly easy calculation to do because the LCR disclosures are public and at least I think all the analyst reports that we've seen as of yesterday for the major banks talk about between a 10 to 15 percentage point impact and I think that's a fair estimate.]", "citations": ["ce809f87936fcecf2e8f03514e77225f"]}}}]}, {"theme": "Digital Transformation and Innovation", "topics": [{"topic": "Growth in digital offerings", "data": {"['Q4', '2023']": {"answer": "7eeb0c43a98ba842923749a521a82d9d --> We aim to improve our digital transaction share to 70% by the end of this year.", "citations": ["7eeb0c43a98ba842923749a521a82d9d"]}}}, {"topic": "Technology investment", "data": {"['Q3', '2024']": {"answer": "31f2c9cb06afd15198367ed526a23d98 --> We will continue to make investments in technology, people, distribution and building our brand.", "citations": ["31f2c9cb06afd15198367ed526a23d98"]}}}, {"topic": "Cybersecurity enhancements", "data": {}}]}]