[{"theme": "Management and Corporate Governance", "topics": [{"topic": "Management Team", "['2024']": {"answer": "02eb100069e6c7ac8dbc9b3953cb9ec5 --> Hitesh P. Shah is noted as a Partner at Hitesh Prakash Shah & Co., Chartered Accountants, indicating his involvement in the financial oversight and audit process for Electrotherm (India) Limited.\n\nd7a09bca84a26618b8f6a7d3172c7525 --> The document mentions Mr. Shailesh Bhandari as the Executive Vice Chairman and Mr. Pratap Mohan as the Chairman of the Audit Committee.\n\nfba5f0ec1474d4a50610982c1908b255 --> Mr. Mukesh Bhandari, aged 73, has been associated with the Company since its inception as its Director, contributing to the growth of the business. He has a background in Electrical Engineering and has played a key role in R&D activities for metallurgical equipment.\n\n67eeaae430c38c78be45742532048925 --> Mr. Mukesh Bhandari is the brother of Mr. Shailesh Bhandari, Executive Vice Chairman of the Company, and both may be deemed to be interested or concerned, financially or otherwise, in the proposed resolution.\n\n87f467932cd2d82eeb492c9506061b61 --> Mr. Suraj Bhandari was appointed as a Whole-time Director on 13th November, 2019, after serving as a Management Executive at Electrotherm (India) Limited, where he contributed to sales, marketing, and production planning.\n\n99014b9ff6da0bc97f9fe944d478164d --> Mr. Suraj Bhandari was elevated and re-designated from Whole-time Director to Managing Director with effect from 9th February, 2024, for the balance tenure of his appointment up to 12th November, 2025.\n\n09f7e156afb8a96cc85121ea1306c80e --> The management team includes Mr. Shailesh Bhandari, who serves as the Executive Director and Vice Chairman, and Mr. Suraj Bhandari, who is the Managing Director.\n\n0839fa67030f3827a81b3aee78c6e4c6 --> The document mentions 'Operation and Production', which often involves the management team overseeing these operations.\n\n8bba14cc36c2074bc09d914db0815236 --> Remuneration criteria for KMPs/Senior Management are based on experience, qualification, and expertise, adhering to Companies Act, 2013 limits.\n\n3ab14d145cdbbb508a5b0cc369e69759 --> The re-appointment of Mr. Shailesh Bhandari as Managing Director was approved by the shareholders for a period of three years from 1st February, 2023 to 31st January, 2026.\nAdditionally, Mr. Suraj Bhandari was appointed as a Whole Time Director for a period of three years from 13th November, 2022 to 12th November, 2025.\n\ned37fce804c5d697e8cb90d2438c6737 --> The Shareholders approved the re-designation on 19th March, 2024, effective from 9th February, 2024, with substantial powers to manage the 'Engineering and Technologies Division' of the Company.\n\n17929004f402717a3dd1448f979df1c9 --> The Management Committee comprises of following members: 1. Mr. Shailesh Bhandari - Chairman (Executive Director) 2. Mr. Suraj Bhandari - Member (Executive Director) 3. Mr. Dinesh Mukati - Member (Non-Executive & Independent Director)\n\nc05153ee2e20e42a3dcb2f4fb9a04b14 --> The document lists several executive directors including Mr. Sunil Kulkarni, Mr. Devidas Choudhary, Mr. Sharat Chojar, and Mr. Tushar Jani, who are responsible for special projects, R & D and design, sales, marketing & business development, and operations, respectively.\n\nb843b0baff90c4efcdb235a4e3809580 --> Shailesh Bhandari is the Executive Vice Chairman and Suraj Bhandari is the Managing Director of Electrotherm (India) Limited.\n\n2b1e285ee7bbb70d51b0c7ea4da39ba1 --> Unsecured Loans repayable on demand from: - Key Managerial Personnel 0.24 0.24\nRelatives of Key Managerial Personnel 0.17 0.17\nEnterprise Owned or significantly influenced by Key Managerial Personnel or Their Relative 1.75 1.75\n\n52baa1a40b43fc7c25c770c03ea596e3 --> The document mentions Mr. Siddharth Bhandari as the erstwhile Whole-time Director and Promoter, Mr. Mukesh Bhandari as the erstwhile Chairman and currently Non-Executive Director, indicating changes and roles within the management team.\n\n339ce0b424ec83c57341619c4da338f3 --> Mr. Shailesh Bhandari was re-designated as Executive Vice Chairman on February 9, 2024.\nMr. Suraj Bhandari was elevated and re-designated as Managing Director from February 9, 2024, having been a Whole Time Director until February 8, 2024.\nMr. Chirag Shah resigned as Chief Financial Officer effective April 12, 2024.\nMr. Jigar Shah resigned as Company Secretary effective January 30, 2024, and Mr. Fageshkumar R. Soni took over as Company Secretary on February 8, 2024.\n\nd58759f88f0859a60bf6360cb365bb88 --> Salary paid to Mr. Jigar Shah (0.14 in 2024, 0.08 in 2023)\nMr. Fageshkumr R. Soni (0.04 in 2024)\nMr. Chirag Shah (0.23 in 2024)\n\n7ff5c702752f308915761969cfa00db3 --> The report highlights the leadership and strategic roles of the management team, emphasizing their contribution to the company's success in the past fiscal year.\n\nafb08270ad1cc65196bd281330b71394 --> Shailesh Bhandari is the Executive Vice Chairman and Suraj Bhandari is the Managing Director.\n\n1a3c5d227426a9b59ca8491ef6d586cb --> The document mentions key individuals in management roles including Hitesh Shah (Partner), Shailesh Bhandari (Executive Vice Chairman), and Suraj Bhandari (Managing Director).\n\nc2833d0b127caa3aabe78589130eac61 --> The Management analyses the movements in the values of assets and liabilities and verifies the major inputs applied in the latest valuation by agreeing the information in the valuation computation to contracts and other relevant documents.\nThe Management, in conjunction with the Group’s external valuers, compares the change in the fair value of each asset and liability with relevant external sources to determine whether the change is reasonable.\n\n6550ad599ccd5f193ee1ee5732ca5c47 --> Mr. Shailesh Bhandari was re-designated as Executive Vice Chairman.\nMr. Suraj Bhandari was elevated and re-designated as Managing Director effective February 9, 2024.\n\n873eec43bdb4e2253bf80455995656bc --> The document mentions Mr. Mukesh Bhandari, Mr. Shailesh Bhandari, Mr. Avinash Bhandari, Mr. Siddharth Bhandari, who are identified as Managing Directors / Whole-time Director, and Late Mr. Pawan Gaur, Chief Financial Officer of the holding Company.\n\nb24426a4ac8651018d792fb10145d1f3 --> Salaries were paid to members of the management team including Mr. Jigar Shah, Mr. Fageshkumr R. Soni, and Mr. Chirag Shah for the year ending March 31, 2024.\n\n5624888742fce34202276f0bff93af21 --> The document lists key managerial personnel including Mr. Shailesh Bhandari (Executive Vice Chairman), Mr. Suraj Bhandari (Managing Director), Mr. Chirag Shah (Chief Financial Officer), and Mr. Jigar Shah (Company Secretary).\n\n123e647403bce1762521cbafaca7c9aa --> Lease liabilities are listed for Mr. Shailesh Bhandari, Mr. Mukesh Bhandari, and Mrs. Jyoti Bhandari, indicating their roles in the management team.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> The document discusses the management team's strategic direction and highlights their role in driving the company forward.", "citations": ["02eb100069e6c7ac8dbc9b3953cb9ec5", "d7a09bca84a26618b8f6a7d3172c7525", "fba5f0ec1474d4a50610982c1908b255", "67eeaae430c38c78be45742532048925", "87f467932cd2d82eeb492c9506061b61", "99014b9ff6da0bc97f9fe944d478164d", "09f7e156afb8a96cc85121ea1306c80e", "0839fa67030f3827a81b3aee78c6e4c6", "8bba14cc36c2074bc09d914db0815236", "3ab14d145cdbbb508a5b0cc369e69759", "ed37fce804c5d697e8cb90d2438c6737", "17929004f402717a3dd1448f979df1c9", "c05153ee2e20e42a3dcb2f4fb9a04b14", "b843b0baff90c4efcdb235a4e3809580", "2b1e285ee7bbb70d51b0c7ea4da39ba1", "52baa1a40b43fc7c25c770c03ea596e3", "339ce0b424ec83c57341619c4da338f3", "d58759f88f0859a60bf6360cb365bb88", "7ff5c702752f308915761969cfa00db3", "afb08270ad1cc65196bd281330b71394", "1a3c5d227426a9b59ca8491ef6d586cb", "c2833d0b127caa3aabe78589130eac61", "6550ad599ccd5f193ee1ee5732ca5c47", "873eec43bdb4e2253bf80455995656bc", "b24426a4ac8651018d792fb10145d1f3", "5624888742fce34202276f0bff93af21", "123e647403bce1762521cbafaca7c9aa", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}, {"topic": "Key Executives", "['2024']": {"answer": "02eb100069e6c7ac8dbc9b3953cb9ec5 --> Shailesh Bhandari, Executive Vice Chairman, and Pratap Mohan, Chairman - Audit Committee, are mentioned as key individuals involved in the governance of Electrotherm (India) Limited.\n\n7a84b560a1cd38247ed4337886bc5ed3 --> Mr. Fageshkumar R. Soni was appointed as the Company Secretary w.e.f. 8th February, 2024. Mr. Chirag Shah served as the Chief Financial Officer up to 12th April, 2024.\n\nd7a09bca84a26618b8f6a7d3172c7525 --> Mr. Shailesh Bhandari is identified as the Executive Vice Chairman, indicating his role as a key executive within the company.\n\na16b10cd236ce1d89231a2cd8b228af2 --> The document begins with a 'Notice of Annual General Meeting,' which typically outlines key executives and their responsibilities.\n\n2aa904d521aca7a1f897b965e92806b1 --> Mr. Mukesh Bhandari, holding the Director Identification Number (DIN: 00014511), has been a Director of the Company since March 1, 1994.\nHe has served as a Managing Director and Chairman at different times, with his latest re-appointment as Managing Director designated as Chairman approved at the 30th Annual General Meeting for a period from February 1, 2017, to January 31, 2020.\n\nfba5f0ec1474d4a50610982c1908b255 --> Mr. Mukesh Bhandari was instrumental in designing and developing metallurgical equipment for the company, leading the R&D team in developing products like DC Arc Furnace, Induction Melting Furnace, and Induction Heating & Hardening Equipment.\n\n87f467932cd2d82eeb492c9506061b61 --> Mr. Suraj Bhandari and Mr. Mukesh Bhandari are key executives. Mr. Suraj Bhandari has experience in sales, marketing, and production, while Mr. Mukesh Bhandari has been involved since the company's inception and has contributed significantly to its growth.\n\n99014b9ff6da0bc97f9fe944d478164d --> Mr. Jigar Shah resigned as a Company Secretary & Compliance Officer with effect from 30th January, 2024, and Mr. Fageshkumar R. Soni was appointed as a Company Secretary & Compliance Officer with effect from 8th February, 2024.\nAdditionally, Mr. Chirag Shah resigned as a Chief Financial Officer with effect from 12th April, 2024.\n\na1ac8431a6e75b0c775f6d17d8390b8f --> Mr. Mukesh Bhandari has been elevated and re-designated as Managing Director with effect from 9th February 2024, entrusted with substantial powers of management to manage the affairs of the 'Engineering and Technologies Division' of the Company.\n\n9a6487e992d9a792a1dc065278306645 --> Mr. Shailesh Bhandari is re-designated as Executive Vice Chairman, effective 9th February, 2024, and is entrusted with substantial powers of management of the entire Company except Engineering and Technologies Division.\n\n0e23092a8f95e24e86c1df7240a84f32 --> The document mentions appreciation for the devoted services of the Executives, Staff, and Workers of the Company, highlighting the role of key executives in the company's operations.\n\nd950fcfc0cb832979b52712c3eda5e94 --> the Company was in process to identify the suitable candidate for the said post and appointed Mr. Chirag Shah as a Chief Financial Officer with effect from 24th May, 2023.\n\n8f8dbfcb8cd47da0d6bd9efae7e45383 --> The Company has not appointed Chief Financial Officer (CFO) till 23rd May, 2023, which is required under the provisions of Section 203 of the Companies Act, 2013.\n\n05ef63453a242cc5171aa0694473e292 --> The document refers to Mr. Mukesh Bhandari, Mr. Shailesh Bhandari, Mr. Avinash Bhandari, Mr. Siddharth Bhandari, and Late Mr. Pawan Gaur as significant figures within the company, labeled as Managing Directors, Whole-time Director, and Chief Financial Officer, respectively.\n\n49085640c2a9857eb8080a240f89bcb7 --> The document refers to the percentage increase in remuneration of Directors & Key Managerial Personnel (KMP), highlighting the remuneration changes for key executives within the company.\n\n77880c26e27ea196a9cf21996924591b --> Key executives mentioned include Mr. Jigar Shah, Company Secretary, and Mr. Chirag Shah, Chief Financial Officer, with remarks on their remuneration applicability.\n\n0839fa67030f3827a81b3aee78c6e4c6 --> The presence of themes such as 'Risk Management' and 'Strategic Expertise' implies that key executives are involved in these areas, ensuring the company navigates risks effectively and aligns with its strategic goals.\n\n3ab14d145cdbbb508a5b0cc369e69759 --> Mr. Shailesh Bhandari was re-designated as Executive Vice Chairman with effect from 9th February, 2024, and is entrusted with substantial powers of management of the Company, excluding the Engineering and Technologies Division.\n\n918a80c5e1b99b4dfdbd3d9b2506dd35 --> The remuneration to Mr. Shailesh Bhandari as Managing Director / Executive Vice Chairman and Mr. Suraj Bhandari as a Whole-time Director / Managing Director is pending due to the company's default on payment of dues to banks and financial institutions.\nRemuneration will be paid after the approval of concerned banks/financial institutions or upon settlement.\n\ned37fce804c5d697e8cb90d2438c6737 --> He is entrusted with substantial management powers to manage the affairs of the specified division and exercise other delegated powers by the Board of Directors.\n\ncd7a332ef291f4c3f91ed03f715d2931 --> Mr. Jigar Shah was the Compliance Officer till 30th January, 2024. Thereafter, Mr. Fageshkumar R. Soni has been appointed as Company Secretary and Compliance Officer with effect from 8th February, 2024.\n\n481e0e30901ee6ef98fff9abd175ee94 --> During the year 2023-24, Mr. Shantanu Kumar Nath – Executive Director – Steel Division resigned with effect from 28th August, 2023.\nFurther, Mr. Jigar Shah, Company Secretary resigned with effect from 30th January, 2024 and Mr. Chirag Shah, Chief Financial officer also resigned with effect from 12th April, 2024.\n\nc05153ee2e20e42a3dcb2f4fb9a04b14 --> Key executives mentioned include Mr. Sunil Kulkarni, Mr. Devidas Choudhary, Mr. Sharat Chojar, Mr. Tushar Jani, and Mr. Fageshkumar R. Soni, who is appointed as the company secretary effective from 08th February, 2024.\n\naeee14f9263e4c564196fe3cc046661d --> The document mentions the elevation and re-designation of Mr. Suraj Bhandari from Whole-Time Director to Managing Director and Mr. Shailesh Bhandari's re-designation as Executive Vice Chairman, effective from 9th February, 2024.\n\n7491430235d86409e7bd261e28e987b5 --> Hitesh Shah is a Partner at Hitesh Prakash Shah & Co., Chartered Accountants, and Shailesh Bhandari is the Executive Vice Chairman.\nSuraj Bhandari is mentioned as the Managing Director, and Fageshkumar R. Soni is the Company Secretary.\n\n6fa03c37c27ee6c5218c61195a553437 --> Shailesh Bhandari is the Executive Vice Chairman with DIN 00058866, and Suraj Bhandari is the Managing Director with DIN 07296523.\n\nb843b0baff90c4efcdb235a4e3809580 --> Fageshkumar R. Soni serves as the Company Secretary.\n\n007a2255ab93701f6ae775e35ab9811b --> The document mentions lease liabilities payable to key managerial personnel, indicating financial transactions involving key executives.\n\n321a2a0bbd3d48ff43693266b4ae48ea --> Advance from enterprise owned or significantly influenced by Key Managerial Personnel is reported as 0.01 for both March 31, 2024, and March 31, 2023, suggesting minimal financial transactions involving key executives.\n\n272a94f222dfe338693c482d2075f6a8 --> Dues to Key Managerial Personnel 0.08 0.02\n\n545c1c1dab5eb81d1edc2a7b9d454a13 --> Mr. Shailesh Bhandari, Mr. Avinash Bhandari, and the late Mr. Pawan Gaur have challenged the prosecution related to the Companies Act violations in the Gujarat High Court.\n\nd36666ea59901f752d727db7cf5b8d55 --> Mentions of various individuals such as Mr. Shailesh Bhandari, Mr. Jigar Shah, Mr. Chirag Shah, and Mr. Fageshkumr R. Soni are likely relevant to the company's key executives or management team.\n\nd58759f88f0859a60bf6360cb365bb88 --> Interest expenses on lease liability for Mr. Shailesh Bhandari (0.00 in 2024, 0.01 in 2023)\nMr. Mukesh Bhandari (0.01 in both 2024 and 2023)\nPayment of lease liability for Mr. Mukesh Bhandari (0.01 in 2023)\nMrs. Jyoti Bhandari (0.03 in 2023)\n\ncbd425cdbb787319b86722f6c8bdf9a9 --> Shailesh Bhandari Executive Vice Chairman DIN:- 00058866\nSuraj Bhandari Managing Director DIN:- 07296523\n\n73214e96fadff7bb0aa2c52b764a7763 --> Information about the key executives is provided, highlighting their experience and leadership roles within the company.\n\nbca336967a6eb5ade0393a1c3853f9cb --> The document mentions Shailesh Bhandari as the Executive Vice Chairman with DIN: 00058866, and Suraj Bhandari as the Managing Director with DIN: 07296523.\n\n4daded6222ac3d26c6dbb87ec7b3604f --> Current Lease Liability payable to Key Managerial Personnel is 0.41 as of March 31, 2024, and 0.40 as of March 31, 2023.\n\nee0182e865777d850e8cb2bbeea9a869 --> Unsecured Loans repayable on demand from Key Managerial Personnel amounting to 0.24 and relatives of key management personnel amounting to 0.17.\n\n873eec43bdb4e2253bf80455995656bc --> The evidence provided includes specific names of key executives: Mr. Mukesh Bhandari, Mr. Shailesh Bhandari, Mr. Avinash Bhandari, Mr. Siddharth Bhandari, and Late Mr. Pawan Gaur.\n\nb24426a4ac8651018d792fb10145d1f3 --> Rent expenses and interest expenses on lease liability were associated with Mr. Shailesh Bhandari and Mr. Mukesh Bhandari, indicating their involvement in executive roles.\n\n5624888742fce34202276f0bff93af21 --> Key executives mentioned include Mr. Shailesh Bhandari and Mr. Suraj Bhandari, with noted changes in their roles effective February 9, 2024.\n\n8ee23389e3de0678b837126dd34ff229 --> The document mentions trade payables involving Mr. Shailesh Bhandari, Mr. Jigar Shah, Mr. Chirag Shah, and Mr. Fageshkumr R. Soni.\n\n8cb3bb5849d2edd343ff1220b44ced7a --> The mention of Mr. Mukesh Bhandari, Mrs. Jyoti Bhandari, and Mr. Rakesh Bhandari, suggests their involvement in the financial dealings of the company, highlighting their roles as key executives or significant stakeholders.", "citations": ["02eb100069e6c7ac8dbc9b3953cb9ec5", "7a84b560a1cd38247ed4337886bc5ed3", "d7a09bca84a26618b8f6a7d3172c7525", "a16b10cd236ce1d89231a2cd8b228af2", "2aa904d521aca7a1f897b965e92806b1", "fba5f0ec1474d4a50610982c1908b255", "87f467932cd2d82eeb492c9506061b61", "99014b9ff6da0bc97f9fe944d478164d", "a1ac8431a6e75b0c775f6d17d8390b8f", "9a6487e992d9a792a1dc065278306645", "0e23092a8f95e24e86c1df7240a84f32", "d950fcfc0cb832979b52712c3eda5e94", "8f8dbfcb8cd47da0d6bd9efae7e45383", "05ef63453a242cc5171aa0694473e292", "49085640c2a9857eb8080a240f89bcb7", "77880c26e27ea196a9cf21996924591b", "0839fa67030f3827a81b3aee78c6e4c6", "3ab14d145cdbbb508a5b0cc369e69759", "918a80c5e1b99b4dfdbd3d9b2506dd35", "ed37fce804c5d697e8cb90d2438c6737", "cd7a332ef291f4c3f91ed03f715d2931", "481e0e30901ee6ef98fff9abd175ee94", "c05153ee2e20e42a3dcb2f4fb9a04b14", "aeee14f9263e4c564196fe3cc046661d", "7491430235d86409e7bd261e28e987b5", "6fa03c37c27ee6c5218c61195a553437", "b843b0baff90c4efcdb235a4e3809580", "007a2255ab93701f6ae775e35ab9811b", "321a2a0bbd3d48ff43693266b4ae48ea", "272a94f222dfe338693c482d2075f6a8", "545c1c1dab5eb81d1edc2a7b9d454a13", "d36666ea59901f752d727db7cf5b8d55", "d58759f88f0859a60bf6360cb365bb88", "cbd425cdbb787319b86722f6c8bdf9a9", "73214e96fadff7bb0aa2c52b764a7763", "bca336967a6eb5ade0393a1c3853f9cb", "4daded6222ac3d26c6dbb87ec7b3604f", "ee0182e865777d850e8cb2bbeea9a869", "873eec43bdb4e2253bf80455995656bc", "b24426a4ac8651018d792fb10145d1f3", "5624888742fce34202276f0bff93af21", "8ee23389e3de0678b837126dd34ff229", "8cb3bb5849d2edd343ff1220b44ced7a"]}}, {"topic": "Board of Directors", "['2024']": {"answer": "7a84b560a1cd38247ed4337886bc5ed3 --> The Board of Directors includes Mr. Dinesh Mukati (Non-Executive Chairman & Independent Director), Mr. Shailesh Bhandari (Executive Vice Chairman), Mr. Suraj Bhandari (Managing Director), Mr. Mukesh Bhandari (Non-Executive Director), Mr. Pratap Mohan (Independent Director), and Ms. Nivedita R. Sarda (Independent Director).\n\nd7a09bca84a26618b8f6a7d3172c7525 --> The presence of Mr. Pratap Mohan as Chairman of the Audit Committee suggests his involvement in the board of directors.\n\na16b10cd236ce1d89231a2cd8b228af2 --> The document provides a 'Board’s Report,' indicating a discussion of board-related activities and possibly details on the board of directors.\n\n8824e54993fc8a74d7d77412fc7804b0 --> Approval of shareholders is sought for the continuation of Mr. Mukesh Bhandari's directorship as a Non-Executive Director as per Regulation 17(1D) of SEBI LODR Regulations, 2015.\n\nbedbf174f7560de003bf8b36532635fc --> The document mentions that a body corporate intending to send their authorized representative(s) to attend the Meeting must send a certified copy of a resolution of the Board of Directors or other governing body authorizing such representative(s).\n\n1629cd6655d0ff6bb99ed42220257bd1 --> Register of Directors and Key Managerial Personnel and their shareholding, maintained under Section 170 of the Act, will be available electronically for inspection by the members.\n\nafc957fdf95513b02e21eb57615ba70b --> The document mentions the composition of the Board of Directors, highlighting the inclusion of experienced professionals from various industries to ensure diverse perspectives in decision-making.\n\n73bd624689e92a7c5a11daad90a71977 --> Referenced regulation requiring shareholder approval for directors' continuation, with exceptions for specific directors as outlined by the SEBI LODR Regulations and Companies Act, 2013.\n\n013f3c106df6d66245449492761e19b2 --> The document provides details on the directors Mr. Suraj Bhandari and Mr. Mukesh Bhandari, including their Director Identification Numbers (DIN), ages, dates of first appointment on the board, and qualifications.\n\n2aa904d521aca7a1f897b965e92806b1 --> The document mentions that the Company has two Managing Directors and three independent directors.\nIt also details the appointment and re-appointment process of directors, including the role of shareholders in general meetings and postal ballots over the last five years.\n\nfba5f0ec1474d4a50610982c1908b255 --> Mr. Mukesh Bhandari, Non-Executive Director, is not liable to retire by rotation and has been on the Board of Directors of the Company since its inception. His continuation as a Non-Executive Director from April 1, 2024, will require shareholder approval in accordance with Regulation 17(1D) of the SEBI LODR Regulations, 2015.\n\n428b2b824c7f20e6eb575363c2495e39 --> The Board of Directors of the Company at their Meeting held on 20th May, 2024, approved the appointment and remuneration of M/s. V. H. Savaliya & Associates as Cost Auditor.\n\n3e93ab503d12148b5f37cc1946541fc9 --> Mr. Suraj Bhandari attended 4 out of 4 board meetings during the year.\nMr. Mukesh Bhandari attended 3 out of 4 board meetings.\n\n557dd8c617f8f0dcc14ecad8c0593c15 --> The document mentions the annexure to the notice, which typically includes details about the Board of Directors, though specific members or changes are not detailed in the provided chunk.\n\n67eeaae430c38c78be45742532048925 --> The approval of the members is sought for the continuation of Directorship of Mr. Mukesh Bhandari as a Non-Executive Director of the Company, in compliance with regulation 17(1D) of the SEBI LODR Regulations, 2015.\n\n87f467932cd2d82eeb492c9506061b61 --> Mr. Mukesh Bhandari has been a Director since the company's inception and played a crucial role in the company's development of metallurgical equipment and customer service in India.\n\n99014b9ff6da0bc97f9fe944d478164d --> The Board of Directors approved the elevation and re-designation of Mr. Suraj Bhandari based on the recommendation of the Nomination and Remuneration Committee at their meeting held on 8th February, 2024.\n\n24a4f8575cfb80582f381bfbbdf347f2 --> The Directors state that they have followed applicable accounting standards, selected and applied accounting policies consistently, and ensured adequate internal financial controls are in place and operating effectively.\n\na1ac8431a6e75b0c775f6d17d8390b8f --> Mr. Mukesh Bhandari is continuing as a Non-Executive Director of the Company pursuant to Regulation 17(1D) of the SEBI LODR Regulations, 2015.\n\ne7ac55fbafe20dd65e37611c99d62fec --> During the financial year 2023-2024, four (4) Board Meetings were held.\nDetails of the composition of the Board and its Committees and of the meetings held, attendance of the Directors at such meetings and other relevant details are provided in the Corporate Governance Report.\n\ne7ac55fbafe20dd65e37611c99d62fec --> Mr. Suraj Bhandari (DIN: 07296523), retires by rotation at the ensuing Annual General Meeting and being eligible, offers himself for re-appointment.\n\n161865a9978043ca93cb55f6dd155446 --> The Board of Directors of the Company has, on the recommendation of Nomination and Remuneration Committee, framed and adopted a policy for selection and appointment of Directors, Key Managerial Personnel, Senior Management and their remuneration.\n\n01165d97021a541982cea845fddf87a2 --> The document discusses the composition of the Board of Directors, highlighting their roles in strategic decision-making and oversight functions.\n\n9a6487e992d9a792a1dc065278306645 --> The Board of Directors, based on the recommendation of the Nomination and Remuneration Committee, approved the re-designation of Mr. Shailesh Bhandari as Executive Vice Chairman.\n\ne7af239678d660d068a1ec15359913d6 --> The Company has received declaration of Independence as stipulated under Section 149(7) of the Companies Act, 2013 and Regulation 16(1)(b) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015 from all Independent Directors confirming that they meet the criteria of independence and not disqualified from appointment / continuing as an Independent Director and they have complied with the code of conduct for Independent Directors prescribed in Schedule IV of the Companies Act, 2013.\nFurther, pursuant to Companies (Creation and Maintenance of databank of Independent Directors) Rules 2019, Independent Directors registered their name in the Independent Director’s Databank.\n\n0db89680a213af92caebea59de65884f --> The Board of Directors submits that the loan account of the Company has been classified as Non-Performing Assets (NPA) by Rare Asset Reconstruction Limited, and the said Bank / ARC has not charged interest on the said account; therefore, provision for interest has not been made in the books of accounts.\n\n8dcd2db1d62e7cc624d84de793729f83 --> The Board of Directors of the Company has appointed M/s V. H. Savaliya & Associates as Cost Auditor on the recommendation of the Audit Committee for the financial year ending on 31st March, 2025.\n\nede2270e8314a65b9c1838bdb8803ac6 --> Ms. Nivedita R. Sarda was re-appointed as Independent Director for a second term of five years from 25th May 2023 to 24th May 2028 following the recommendation of the Nomination and Remuneration Committee and approval by the Board of Directors.\nHer re-appointment was approved by the shareholders at the 37th Annual General Meeting on 9th August 2023.\nMr. Mukesh Bhandari's continuation as Non-Executive Director is being placed before the shareholders for approval at the 38th Annual General Meeting, effective 1st April 2024.\n\n0e23092a8f95e24e86c1df7240a84f32 --> The document includes details about the Executive Vice Chairman, Shailesh Bhandari (DIN: 00058866), and the Managing Director, Suraj Bhandari (DIN: 07296523), indicating their roles on the Board of Directors of Electrotherm (India) Limited.\n\n37cef83387bf5cce50586aaaaf0de026 --> The document lists the Board of Directors, including Mr. Shailesh Bhandari as Chairman (Executive Vice Chairman), Mr. Dinesh Mukati as a Member (Non-Executive & Independent Director), and Mr. Pratap Mohan as a Member (Non-Executive & Independent Director).\n\n35efbe942682c877435df7a0d6eec8ed --> The document is an annexure to the Board's report, indicating involvement or actions taken by the Board of Directors.\n\n1ee5091d43db803b4fce49fd597b37f3 --> The composition of the Audit Committee as of 31st March, 2024, includes Mr. Pratap Mohan, Mr. Dinesh Mukati, and Ms. Nivedita R. Sarda, all of whom are Independent Directors. This reflects the governance structure involving the Board of Directors.\n\n601761d5021ef1f6c5c6325538ecc1a1 --> The report provides details on the board's composition and their active role in governance.\n\n0f1c8def51193cc199f148ac9fa4d4ef --> The document includes a signature from the Chairman, Dinesh Mukati.\nThe Executive Vice Chairman and Chairman of the CSR Committee, Shailesh Bhandari, indicating their involvement in the governance.\n\n86c7f8b2273cc9bd2282db2fbf7656a0 --> Petitions were filed by Mr. Siddharth Bhandari and Dr. Rakesh Bhandari to declare the appointment of four independent directors as null and void, citing violations of the Companies Act, 2013.\n\n99aee268ee205cd0dc9d158424de6adf --> The document references Mr. Mukesh Bhandari as a former Chairman and currently Non-Executive Director.\n\nad4ff284f06d1d458e5673108e3958de --> The Board of Directors of the Company is duly constituted with a proper balance of Executive Directors, Non-Executive Directors, and Independent Directors.\nChanges in the composition of the Board during the period under review were carried out in compliance with the Act.\n\n49085640c2a9857eb8080a240f89bcb7 --> The document mentions the ratio of the remuneration of each director to the median remuneration of the employees, indicating a focus on the Board of Directors’ compensation structure.\n\n77880c26e27ea196a9cf21996924591b --> The document lists directors such as Mr. Dinesh Mukati, Mr. Shailesh Bhandari, Mr. Suraj Bhandari, Mr. Mukesh Bhandari, Mr. Pratap Mohan, and Ms. Nivedita R. Sarda, along with their roles like Non-Executive Chairman, Executive Vice Chairman, Managing Director, Non-Executive Director, and Independent Director.\n\n5c5a7701f312e92c98ab4a46f3b35a91 --> The Board of Directors of the Company is having optimum combination of Executive and Non-Executive Directors.\nAs on 31st March, 2024, the Board of Directors comprises of six (6) Directors, out of which two are Executive Directors and four are Non-Executive / Independent Directors (including Woman Director).\n\ne51fc8f0f6f46ce699300e323a8e8280 --> Mr. Dinesh Mukati, Mr. Shailesh Bhandari, Mr. Suraj Bhandari, Mr. Mukesh Bhandari, Ms. Nivedita R. Sarda, and Mr. Pratap Mohan attended all board meetings held during their tenure, with Mr. Mukesh Bhandari attending 3 out of 4 meetings.\nAll attended the AGM on 9th August, 2023.\n\n8fd34023ce26e940117df4d491009c95 --> The Board of Directors confirms that in the opinion of the majority of Board, the Independent Directors fulfill the conditions specified in Listing Regulations and are independent of the management.\n\nbd44d9f18082317d1c4a45dee33961c9 --> Independent Directors are familiarised with their roles, rights and responsibilities in the Company as well as with the nature of industry and business model of the Company by providing various presentations at Board/ Committee meetings.\nThe details of the familiarisation programmes for independent directors can be accessed on the company's website.\n\n09f7e156afb8a96cc85121ea1306c80e --> The document lists the board of directors including Mr. Dinesh Mukati (Chairman), Mr. Shailesh Bhandari (Executive Director, Vice Chairman), Mr. Suraj Bhandari (Managing Director), Mr. Mukesh Bhandari (Director), Ms. Nivedita R. Sarda (Woman Independent Director), and Mr. Pratap Mohan (Director).\n\n3de7fe58654faf16dc985cb25db7ece3 --> The members mentioned are Mr. Pratap Mohan (Chairman), Mr. Dinesh Mukati (Member), and Ms. Nivedita R. Sarda (Member), each with full attendance (4/4).\n\nd552c1b72f3da1f39911f6b808d5b037 --> None of the Directors are related to each other except Mr. Mukesh Bhandari and Mr. Shailesh Bhandari, who are brothers, and Mr. Shailesh Bhandari and Mr. Suraj Bhandari, who are father and son. During the financial year ended on 31st March, 2024, 4 Board Meetings were held on specific dates.\n\n4450a1b644cb33dd99a99eae0423b1df --> The Directors have the following skills.\n\neeca27eff30b317b2d1757c93b7f7d8e --> The document lists directors including Mr. Dinesh Mukati, Mr. Shailesh Bhandari, Mr. Suraj Bhandari, Mr. Mukesh Bhandari, Mr. Pratap Mohan, and Ms. Nivedita R. Sarda, detailing their competencies in areas such as HR, finance, legal, and strategic management.\n\n0e5fd7871052d75b06dfdf2ce710839e --> The document lists committee members and their attendance: Mr. Pratap Mohan (Chairman), Mr. Dinesh Mukati (Member), Ms. Nivedita R. Sarda (Member), each with an attendance of 3/3.\n\n77709c4486c462f782f7e1b58c98babe --> Mr. Dinesh Mukati received Rs. 7,50,000, Mr. Pratap Mohan received Rs. 7,50,000, and Ms. Nivedita R. Sarda received Rs. 7,20,000 as sitting fees.\n\n2b8049236176a885949524d42934bebf --> The Board of Directors of the Company comprises qualified members with the required skills, expertise and competence for the effective contribution to the Board and the Committees.\nThe Board of Directors are committed to ensure that the Company is in compliance with the Corporate Governance.\n\nfda97676325c3d82be143130702085af --> The Audit Committee is composed of three directors: Mr. Pratap Mohan (Chairman), Mr. Dinesh Mukati, and Ms. Nivedita R. Sarda, all of whom are Non-Executive & Independent Directors.\nThis composition reflects a governance practice of maintaining independence within the board's oversight functions.\n\nfb5ac1cb7b1c13697cecc5f276d77c59 --> The Nomination and Remuneration Committee is responsible for identifying persons who are qualified to become directors and recommending their appointment and removal to the Board.\n\n5619ff27d722b758467c1c323f6e8c52 --> The committee members listed are Ms. Nivedita R. Sarda (Chairperson), Mr. Pratap Mohan (Member), and Mr. Shailesh Bhandari (Member), each with an attendance record of 4 out of 4 meetings.\n\nbf87bf70cb4389163f0f284c197c7e27 --> The Nomination and Remuneration Committee members, including Mr. Pratap Mohan (Chairman), Mr. Dinesh Mukati, and Ms. Nivedita R. Sarda, are part of the Board, indicating their involvement in board-level activities.\n\n8be68b20838c75b3e633fff72b14b178 --> The Nomination and Remuneration Committee recommends the remuneration for the Managing Director, Whole-time Director, and Key Managerial Personnel, with approvals required from the Board.\nThe remuneration policy aims to attract, retain, and motivate Directors, with a balance between fixed and incentive pay.\n\n8bba14cc36c2074bc09d914db0815236 --> Non-Executive Independent Directors receive Rs. 1,00,000/- for each Board Meeting, Rs. 50,000/- for each Audit Committee Meeting, and Rs. 15,000/- for other committee meetings, as approved by the Board.\n\n3ab14d145cdbbb508a5b0cc369e69759 --> The re-designation of Mr. Shailesh Bhandari as Executive Vice Chairman was in partial modification of the resolution passed by the Board of Directors on 30th January, 2023.\n\ned37fce804c5d697e8cb90d2438c6737 --> The Board of Directors' resolution on 2nd August, 2022, was partially modified by the recent decision through postal ballot.\n\n6745ed529fa8de714a2c138e87f462ab --> The document provides names and roles of committee members such as Mr. Shailesh Bhandari as Chairman, Mr. Suraj Bhandari and Mr. Dinesh Mukati as Members, each with full attendance (4/4).\n\nb4fa8dc50504a0daa8ba08102c0bd8a4 --> Re-appointment of Ms. Nivedita R. Sarda, Mr. Dinesh Mukati, and Mr. Pratap Mohan as Independent Directors for a second term of five years during AGMs held in 2023 and 2022 respectively.\n\n1eca78bed609d0882742c175620b9392 --> The Board of Directors has not recommended any dividend for the financial year ended on 31st March, 2024.\n\nd30777d6f40f0a797d65d3be4a808097 --> Directors and Senior Management have affirmed compliance with the Code for the year ended on 31st March, 2024.\nThe declaration of compliance by the Managing Director is part of the Annual Report.\n\naeee14f9263e4c564196fe3cc046661d --> The Board of Directors is involved in approving the Postal Ballot process, indicating their role in governance and decision-making processes.\n\ne59261cf3d077e3bd2dcaadba94d8ec2 --> A certificate from CS Bharat Prajapati, Practicing Company Secretary, confirms that none of the Directors on the Board of the Company have been debarred or disqualified by SEBI or the Ministry of Corporate Affairs.\n\n72d9df1ee971f0dfd26192abc2b1f174 --> The document mentions that ensuring the eligibility for the appointment and continuity of every Director on the Board is the responsibility of the management of the Company.\n\nbfcdd2b16e859ad256e96a1ab0df788e --> The document lists the names, Director Identification Numbers (DIN), and appointment dates of the directors, including Mr. Shailesh Bhandari, Mr. Mukesh Bhandari, Mr. Suraj Bhandari, Mr. Dinesh Mukati, Mr. Pratap Mohan, and Ms. Nivedita R. Sarda.\n\n983c7c677f228c0aadbac11a622cb988 --> The certificate verifies the eligibility of the Board of Directors in compliance with SEBI regulations.\n\need0af5e93d10e0664ce3f800f49d382 --> On the basis of the written representations received from the directors as on March 31, 2024, taken on record by the Board of Directors, none of the directors is disqualified as on March 31, 2024, from being appointed as a director in terms of Section 164(2) of the Act.\n\nf5cd995d4a4de4986b59b6a99b23887c --> The Board of Directors are responsible for overseeing the Company’s financial reporting process and are involved in assessing the Company’s ability to continue as a going concern.\n\n084041e07d5b862a4fd1872085a1867b --> The Company’s management and Board of Directors are responsible for the preparation of the other information. The other information comprises the information included in the Board’s report.\n\n46519b6165984af0f55c5ccaddc4b2de --> The Company’s management and Board of Directors are responsible for establishing and maintaining internal financial controls based on the internal control over financial reporting criteria established by the Company.\n\n7491430235d86409e7bd261e28e987b5 --> The document is signed on behalf of the Board of Directors of Electrotherm (India) Limited.\n\n6fa03c37c27ee6c5218c61195a553437 --> The report is signed on behalf of the Board of Directors by Shailesh Bhandari and Suraj Bhandari.\n\nb843b0baff90c4efcdb235a4e3809580 --> The document is signed on behalf of the Board of Directors of Electrotherm (India) Limited.\n\nbd2551a79ae29289088cb9a2f342d76c --> Further the loans are guaranteed by the personal guarantees of some of the Directors of the Company.\n\nd435534c75f3307af8a37af696c770aa --> The document highlights the composition of the Board of Directors, indicating the inclusion of independent and non-executive members to ensure balanced decision-making.\n\n9b8d3a7d6685a830b42046edb5861c0a --> Director Sitting fees for the year ended March 31, 2024, were 0.22, compared to 0.11 for the year ended March 31, 2023.\n\n52baa1a40b43fc7c25c770c03ea596e3 --> Mr. Siddharth Bhandari, Mr. Mukesh Bhandari, and Dr. Rakesh Bhandari, who are part of the Promoter group and key figures in the company, have been involved in legal proceedings concerning corporate governance issues at the National Company Law Tribunal, Ahmedabad.\n\ndd919bffdee6a5eaeffd57cc30a225a8 --> The document mentions the appointment being violative of provisions of sections of the Companies Act and the Companies (Appointment and Qualification of Directors) Rules.\nIt details legal proceedings involving Mr. Siddharth Bhandari and Mr. Shailesh Bhandari related to joint signature of bank accounts and policy decisions affecting the company as a going concern.\n\n339ce0b424ec83c57341619c4da338f3 --> The board includes Mr. Mukesh Bhandari as Non-Executive Director, Mr. Dinesh Shankarlal Mukati as Independent Director & Non-Executive Chairman, Ms. Nivedita Ravindra Sarda as Independent Director, and Mr. Pratap Mohan as Independent Director.\n\n6803390114c7c6b55184ea47fd3d7b8b --> The Central Bank of India declared the company and its directors as willful defaulters on May 29, 2014, and Dena Bank did the same on March 31, 2016.\nAdditionally, CBI proceedings were initiated against the company and its directors, including Mr. Mukesh Bhandari, Mr. Shailesh Bhandari, and Mr. Avinash Bhandari, in relation to the loan utilization.\n\nb67a0889052513653a0a48c7784c796d --> The document mentions the Board of Directors, highlighting their strategic leadership in guiding the company through economic challenges.\n\nde2105749cc7b0cc635f9ea2d4751fdc --> Mr. Siddharth Bhandari and Dr. Rakesh Bhandari, part of the Promoter group, filed petitions to declare the appointment of four independent directors as null and void under sections 149, 150, 152, 159, and 176 of the Companies Act, 2013 before the NCLT, Ahmedabad.\n\nd58759f88f0859a60bf6360cb365bb88 --> Director Sitting Fees paid to Mr. Dinesh Shankarlal Mukati (0.08 in 2024, 0.04 in 2023)\nMs. Nivedita Ravindra Sarda (0.07 in 2024, 0.03 in 2023)\n\nc25ec44b36bc8b12fdc50f474b0d0430 --> The document highlighted that the Board of Directors meets quarterly to review company performance and strategic direction.\n\n7ff5c702752f308915761969cfa00db3 --> Detailed information about the board's composition and the diversity of skills and experiences brought by its members is provided.\n\n1ef1f4582ce405013ca2bef4d1aa8fa5 --> The document states that the Holding Company’s management and Board of Directors are responsible for the preparation of the other information included in the annual report.\n\nf1711623d5d4ea825fd1b121f5f3b785 --> The document is signed on behalf of the Board of Directors.\n\n861be9ec942217cf4f3e278d1161ea56 --> The respective Board of Directors of the companies included in the Group and the respective Management are responsible for overseeing the financial reporting process and assessing the ability to continue as a going concern.\n\n7e5fba7d2bb14c93c401553619f9a15b --> The document evaluates the appropriateness of accounting policies and estimates made by the Management and Board of Directors, and assesses their use of the going concern basis in preparing consolidated financial statements.\n\n710435933a32de39d231946786ad9c42 --> The Holding Company’s management and Board of Directors are responsible for matter stated in Section 134(5) of the Act, with respect to the preparation and presentation of these consolidated financial statements.\n\n2d1cea1aae8b1dffd458160a5717483b --> None of the directors of the Group’s companies and joint venture incorporated in India is disqualified as on March 31, 2024 from being appointed as a director in terms of Section 164(2) of the Act.\n\n03975633ddd520d978ad0397fae4193c --> The Board of Directors played a crucial role in steering the strategic direction of the company, ensuring effective oversight and governance.\n\nc943df79ac0b951ecddf9c905f8de54b --> The respective Company’s management and the Board of Directors are responsible for establishing and maintaining internal financial controls with reference to consolidated financial statements based on the criteria established by the respective company considering the essential components of internal control stated in the Guidance Note.\n\nafb08270ad1cc65196bd281330b71394 --> Information is provided on behalf of the Board of Directors of Electrotherm (India) Limited.\n\ncbd425cdbb787319b86722f6c8bdf9a9 --> For and on behalf of the Board of Directors of Electrotherm (India) Limited\n\n1a3c5d227426a9b59ca8491ef6d586cb --> The document references the Board of Directors of Electrotherm (India) Limited, with specific mentions of individuals involved in the management and executive roles.\n\n73214e96fadff7bb0aa2c52b764a7763 --> The document outlines the current members of the Board of Directors, including their professional backgrounds and contributions to strategic decision-making.\n\nbca336967a6eb5ade0393a1c3853f9cb --> The consolidated financial statements were authorized for issue in accordance with a resolution passed in the Board Meeting held on May 20, 2024.\n\nd356740e4b0896c7b2f447d360356840 --> The document is related to the consolidated financial statements which typically involve oversight by the Board of Directors.\n\nb2e38c505cb838c1e23e8362358116fb --> The document mentions updates regarding the composition of the Board of Directors, highlighting new appointments and roles that have been introduced to enhance governance oversight.\n\nec3d5cfae4d584dc8cb1f50eba5119b6 --> The report includes a section on the composition and roles of the Board of Directors, highlighting its function in overseeing company management and strategic direction.\n\n0abd8fc64eb52af5716e4ea7e78af496 --> The document mentions the personal guarantee of some of the directors of the Group related to the secured charge on the Property, Plant, and Equipment.\n\n2f503fe82f238c275ff5a20ec14ae6e4 --> The document mentions the 'Notes to Consolidated Financial Statements,' which typically includes oversight by the Board of Directors, indicating their involvement in financial reporting and governance.\n\nd38cec18d08a1f194a63199ed697da01 --> The document details the composition and roles of the Board of Directors, highlighting the diverse expertise and governance practices they adhere to.\n\n5078b7d74a055ad0478458462fd6670d --> The CBI has registered a case against the holding company and its directors, including Mr. Mukesh Bhandari, Mr. Shailesh Bhandari, and Mr. Avinash Bhandari, based on a complaint regarding loan utilization by the Central Bank of India.\n\n8da0033c39328534ed654a2aa88036dd --> Two petitions were filed by members of the Promoter group, Mr. Siddharth Bhandari and Dr. Rakesh Bhandari, challenging the appointment of four independent directors as null and void under various sections of the Companies Act, 2013.\nThis was due to alleged violations of provisions related to the appointment and qualification of directors.\n\n2205eea550ec6c9b78b91cd9cf977228 --> State Bank of India issued a show cause notice to the Subsidiary Company & guarantors / directors for declaring them as willful defaulters.\n\n6550ad599ccd5f193ee1ee5732ca5c47 --> Mr. Suraj Bhandari was re-appointed as a Whole-time Director for a period of three years from November 13, 2022, to November 12, 2025, at a remuneration of Rs. 1,50,000 per month.\nMr. Shailesh Bhandari was re-appointed as a Managing Director from February 1, 2023, to January 31, 2026, at a remuneration of Rs. 2,00,000 per month.\nThey were re-designated with new roles effective February 9, 2024, with the same terms and conditions of remuneration, and these changes were approved by shareholders through Postal Ballot.\n\n1166fc3c2af090f46bdaf1810921ed1e --> Changes were made to the board composition with the addition of two independent directors.\n\nd27c96e38adbd61c66086f9102318f65 --> The report outlines the members of the Board of Directors and their contributions to enhancing corporate governance practices over the past year.\n\n04ec684a7c9134cacb57c87671d00717 --> The document discusses the composition and roles of the Board of Directors, highlighting the appointment of two new independent directors with extensive industry experience.\n\n735a0e47bb03a23da76ef3518e7e3d92 --> The Board of Directors played a crucial role in navigating the company through economic challenges with strategic oversight.\n\na7915da60f6be22a51d42812cdd1555e --> The document provides details on the Board of Directors' composition and their meeting frequency, highlighting the governance structure in place for overseeing corporate activities.\n\n5624888742fce34202276f0bff93af21 --> The document lists both executive and non-executive directors, including Mr. Mukesh Bhandari, Mr. Dinesh Shankarlal Mukati, Ms. Nivedita Ravindra Sarda, and Mr. Pratap Mohan.\n\n8f7f57cda34550bcd9353d70988c96b2 --> The document mentions updates to the Board of Directors, including the appointment of two new independent directors to enhance governance practices.\n\ne60c70ccdc8581d6c176249f56346bf9 --> Mr. Dinesh Shankarlal Mukati received 0.08 and 0.04 in director sitting fees for the years ended March 31, 2024, and March 31, 2023, respectively.\nMs. Nivedita Ravindra Sarda received 0.07 and 0.03, while Mr. Pratap Mohan received 0.08 and 0.04 for the same periods.\n\nf7056d81306c9becf99c0b65f12198b1 --> The annual report includes information about the board of directors' responsibilities in overseeing the company's strategic direction and ensuring compliance with governance standards.\n\n6ca89238414ad19f1bd8c0a3fcb67ae9 --> The document mentions the Board of Directors as part of the governance structure responsible for overseeing the company's operations and ensuring alignment with corporate objectives.\n\n0ce44214a086934238f4a60436911bba --> The document specifies the board of directors' composition, highlighting its critical role in overseeing management and setting strategic direction for the company.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> The annual report outlines the composition of the Board of Directors, emphasizing the diversity and expertise of its members.", "citations": ["7a84b560a1cd38247ed4337886bc5ed3", "d7a09bca84a26618b8f6a7d3172c7525", "a16b10cd236ce1d89231a2cd8b228af2", "8824e54993fc8a74d7d77412fc7804b0", "bedbf174f7560de003bf8b36532635fc", "1629cd6655d0ff6bb99ed42220257bd1", "afc957fdf95513b02e21eb57615ba70b", "73bd624689e92a7c5a11daad90a71977", "013f3c106df6d66245449492761e19b2", "2aa904d521aca7a1f897b965e92806b1", "fba5f0ec1474d4a50610982c1908b255", "428b2b824c7f20e6eb575363c2495e39", "3e93ab503d12148b5f37cc1946541fc9", "557dd8c617f8f0dcc14ecad8c0593c15", "67eeaae430c38c78be45742532048925", "87f467932cd2d82eeb492c9506061b61", "99014b9ff6da0bc97f9fe944d478164d", "24a4f8575cfb80582f381bfbbdf347f2", "a1ac8431a6e75b0c775f6d17d8390b8f", "e7ac55fbafe20dd65e37611c99d62fec", "161865a9978043ca93cb55f6dd155446", "01165d97021a541982cea845fddf87a2", "9a6487e992d9a792a1dc065278306645", "e7af239678d660d068a1ec15359913d6", "0db89680a213af92caebea59de65884f", "8dcd2db1d62e7cc624d84de793729f83", "ede2270e8314a65b9c1838bdb8803ac6", "0e23092a8f95e24e86c1df7240a84f32", "37cef83387bf5cce50586aaaaf0de026", "35efbe942682c877435df7a0d6eec8ed", "1ee5091d43db803b4fce49fd597b37f3", "601761d5021ef1f6c5c6325538ecc1a1", "0f1c8def51193cc199f148ac9fa4d4ef", "86c7f8b2273cc9bd2282db2fbf7656a0", "99aee268ee205cd0dc9d158424de6adf", "ad4ff284f06d1d458e5673108e3958de", "49085640c2a9857eb8080a240f89bcb7", "77880c26e27ea196a9cf21996924591b", "5c5a7701f312e92c98ab4a46f3b35a91", "e51fc8f0f6f46ce699300e323a8e8280", "8fd34023ce26e940117df4d491009c95", "bd44d9f18082317d1c4a45dee33961c9", "09f7e156afb8a96cc85121ea1306c80e", "3de7fe58654faf16dc985cb25db7ece3", "d552c1b72f3da1f39911f6b808d5b037", "4450a1b644cb33dd99a99eae0423b1df", "eeca27eff30b317b2d1757c93b7f7d8e", "0e5fd7871052d75b06dfdf2ce710839e", "77709c4486c462f782f7e1b58c98babe", "2b8049236176a885949524d42934bebf", "fda97676325c3d82be143130702085af", "fb5ac1cb7b1c13697cecc5f276d77c59", "5619ff27d722b758467c1c323f6e8c52", "bf87bf70cb4389163f0f284c197c7e27", "8be68b20838c75b3e633fff72b14b178", "8bba14cc36c2074bc09d914db0815236", "3ab14d145cdbbb508a5b0cc369e69759", "ed37fce804c5d697e8cb90d2438c6737", "6745ed529fa8de714a2c138e87f462ab", "b4fa8dc50504a0daa8ba08102c0bd8a4", "1eca78bed609d0882742c175620b9392", "d30777d6f40f0a797d65d3be4a808097", "aeee14f9263e4c564196fe3cc046661d", "e59261cf3d077e3bd2dcaadba94d8ec2", "72d9df1ee971f0dfd26192abc2b1f174", "bfcdd2b16e859ad256e96a1ab0df788e", "983c7c677f228c0aadbac11a622cb988", "eed0af5e93d10e0664ce3f800f49d382", "f5cd995d4a4de4986b59b6a99b23887c", "084041e07d5b862a4fd1872085a1867b", "46519b6165984af0f55c5ccaddc4b2de", "7491430235d86409e7bd261e28e987b5", "6fa03c37c27ee6c5218c61195a553437", "b843b0baff90c4efcdb235a4e3809580", "bd2551a79ae29289088cb9a2f342d76c", "d435534c75f3307af8a37af696c770aa", "9b8d3a7d6685a830b42046edb5861c0a", "52baa1a40b43fc7c25c770c03ea596e3", "dd919bffdee6a5eaeffd57cc30a225a8", "339ce0b424ec83c57341619c4da338f3", "6803390114c7c6b55184ea47fd3d7b8b", "b67a0889052513653a0a48c7784c796d", "de2105749cc7b0cc635f9ea2d4751fdc", "d58759f88f0859a60bf6360cb365bb88", "c25ec44b36bc8b12fdc50f474b0d0430", "7ff5c702752f308915761969cfa00db3", "1ef1f4582ce405013ca2bef4d1aa8fa5", "f1711623d5d4ea825fd1b121f5f3b785", "861be9ec942217cf4f3e278d1161ea56", "7e5fba7d2bb14c93c401553619f9a15b", "710435933a32de39d231946786ad9c42", "2d1cea1aae8b1dffd458160a5717483b", "03975633ddd520d978ad0397fae4193c", "c943df79ac0b951ecddf9c905f8de54b", "afb08270ad1cc65196bd281330b71394", "cbd425cdbb787319b86722f6c8bdf9a9", "1a3c5d227426a9b59ca8491ef6d586cb", "73214e96fadff7bb0aa2c52b764a7763", "bca336967a6eb5ade0393a1c3853f9cb", "d356740e4b0896c7b2f447d360356840", "b2e38c505cb838c1e23e8362358116fb", "ec3d5cfae4d584dc8cb1f50eba5119b6", "0abd8fc64eb52af5716e4ea7e78af496", "2f503fe82f238c275ff5a20ec14ae6e4", "d38cec18d08a1f194a63199ed697da01", "5078b7d74a055ad0478458462fd6670d", "8da0033c39328534ed654a2aa88036dd", "2205eea550ec6c9b78b91cd9cf977228", "6550ad599ccd5f193ee1ee5732ca5c47", "1166fc3c2af090f46bdaf1810921ed1e", "d27c96e38adbd61c66086f9102318f65", "04ec684a7c9134cacb57c87671d00717", "735a0e47bb03a23da76ef3518e7e3d92", "a7915da60f6be22a51d42812cdd1555e", "5624888742fce34202276f0bff93af21", "8f7f57cda34550bcd9353d70988c96b2", "e60c70ccdc8581d6c176249f56346bf9", "f7056d81306c9becf99c0b65f12198b1", "6ca89238414ad19f1bd8c0a3fcb67ae9", "0ce44214a086934238f4a60436911bba", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}, {"topic": "Corporate Governance Practices", "['2024']": {"answer": "827777f9fc9df012095e5c744720c157 --> The document mentions that the company adheres to stringent corporate governance practices, ensuring accountability and transparency in its operations.\n\ndabd7ff1e1cb61a503a1bb35d35c0690 --> The report submission aligns with Regulation 34(1) of the SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015, and is distributed to members through electronic means as per the circulars of the Ministry of Corporate Affairs and the Securities and Exchange Board of India.\n\na16b10cd236ce1d89231a2cd8b228af2 --> The document includes a 'Report on Corporate Governance' which suggests a focus on governance practices.\n\nb4221b91ef3e75416de0c003959c0493 --> The MCA and SEBI circulars provide guidelines and relaxations for conducting AGMs virtually and easing compliance obligations related to the distribution of annual reports, demonstrating adaptations in corporate governance practices under pandemic conditions.\n\nbedbf174f7560de003bf8b36532635fc --> The document outlines procedures for attendance and voting at the AGM, including provisions for attendance through VC/OAVM and details about quorum requirements under the Companies Act, 2013. It also mentions the facility of participation at the AGM through VC/OAVM for 1000 members on a first-come-first-served basis, excluding certain categories of shareholders and officials who can attend without restriction.\n\n1629cd6655d0ff6bb99ed42220257bd1 --> Notice of the 38th AGM, Annual Report and instruction for e-voting are being sent to the members through electronic mode whose email addresses are registered with the Company / Depository Participant(s).\n\nafc957fdf95513b02e21eb57615ba70b --> The annual report references the company's commitment to maintaining high standards of corporate governance.\nSpecific practices include the establishment of independent board committees and regular audits to ensure compliance with legal and ethical standards.\n\nf296c5cc71640e9ba8fbf1b923443353 --> It emphasizes the need for uploading a scanned copy of the Board Resolution and Power of Attorney in favor of these entities for verification by the scrutinizer, showcasing a corporate governance practice related to voting procedures and compliance.\n\n53cd1f4c7e0956e5d1724ec920eb5b5c --> The document discusses compliance with the Companies Act, 2013, SEBI Regulations, and MCA Circulars, and provides details on electronic voting facilities through CDSL for shareholders.\n\n53cd1f4c7e0956e5d1724ec920eb5b5c --> Voting rights are proportional to equity shareholding as of the cut-off date, and new shareholders can vote by following instructions on the company's and CDSL's websites.\n\n24a4f8575cfb80582f381bfbbdf347f2 --> M/s. Hitesh Prakash Shah & Co., Chartered Accountants, were appointed as Statutory Auditor for a second term of five years at the 36th Annual General Meeting held on 31st August, 2022, in accordance with the Companies Act, 2013.\n\ne7ac55fbafe20dd65e37611c99d62fec --> The financial statements of the Company, consolidated financial statements along with relevant documents and separate audited accounts in respect of subsidiaries / joint venture companies, are available on the website of the company https://www.electrotherm.com/investors/annual-reports.\n\n01165d97021a541982cea845fddf87a2 --> The report outlines the company's commitment to maintaining high standards of corporate governance, emphasizing transparency and accountability in their operations.\n\ne7af239678d660d068a1ec15359913d6 --> The Nomination and Remuneration Committee has carried out the annual evaluation of performance of the Board and its Committees and the Board of Directors has carried out the annual evaluation of the performance of individual directors.\nThe manner in which the evaluation was carried out is provided in the Corporate Governance Report, which is part of this Annual Report.\n\n8dcd2db1d62e7cc624d84de793729f83 --> The appointment of the Cost Auditor and the maintenance of cost records are in accordance with the Companies Act, 2013, and the Companies (Audit and Auditors) Rules, 2014, demonstrating adherence to statutory corporate governance practices.\n\n3f76f55ecddd9f7e32ae34c89d510c4f --> The commitment to provide a dignified, respectful, and equal treatment work environment and the compliance with the legal provisions for preventing sexual harassment.\n\nd950fcfc0cb832979b52712c3eda5e94 --> non-submission of disclosures of defaults on payment of interest / repayment of principal amount on loans... the same was not submitted by the Company. However, the Company has evaluated the same in due course and submitted the default disclosures from June 2024 onwards.\n\nfba81cadb06d233db6a30c2c9ef79a0f --> The Board of Directors has formulated Whistle Blower Policy / Vigil Mechanism in compliance with the provisions of Section 177(10) of the Companies Act, 2013 and Regulation 22 of the Listing Regulations. The policy provides for a framework and process whereby concerns can be raised by its employees against any kind of discrimination, harassment, victimization or any other unfair practice being adopted against them.\n\nfba81cadb06d233db6a30c2c9ef79a0f --> Pursuant to Regulation 34(2)(e) read with Part B of Schedule V of the Listing Regulations, Management Discussion and Analysis Report is annexed after the Board’s Report and form a part of this Annual Report.\n\nfba81cadb06d233db6a30c2c9ef79a0f --> The Company has put in place adequate internal financial controls with reference to the financial statements. During the financial year, such internal financial controls were operating effectively and it is commensurate with the size, scale and complexity of the Company and the nature of business of the Company.\n\nfba81cadb06d233db6a30c2c9ef79a0f --> During the year under review, the Company has complied with the applicable Secretarial Standards issued by The Institute of Company Secretaries of India (ICSI).\n\n1ee5091d43db803b4fce49fd597b37f3 --> The document mentions that in compliance with the provisions of Listing Regulations, a separate report on Corporate Governance along with a certificate from a Practicing Company Secretary regarding the status of compliance of conditions of corporate governance forms a part of this Annual Report.\n\nee9c0c406e7029425844dd068a6f0ff6 --> The secretarial audit was conducted to evaluate corporate conducts and statutory compliances, confirming that the company has proper board processes and compliance mechanisms in place.\n\n8f8dbfcb8cd47da0d6bd9efae7e45383 --> The Company has not made/submitted the disclosures of defaults on payment of interest/repayment of principal amount on loans from banks/financial institutions, under SEBI Circular for the period from 01st April, 2023 till 31st March, 2024.\n\n86c7f8b2273cc9bd2282db2fbf7656a0 --> The petitions and subsequent legal challenges are pending before the Hon’ble NCLAT for hearing, indicating unresolved governance issues.\n\na5f0529aeb5d6dbeed1f29f9d13a0a29 --> Maintenance of secretarial record is the responsibility of the Management of the Company.\nThe compliance of the provisions of Corporate and other applicable laws, rules, regulations, standards is the responsibility of management.\n\nad4ff284f06d1d458e5673108e3958de --> Adequate notice is given to all directors to schedule the Board Meeting, with agenda and detailed notes sent seven days in advance.\nA system exists for seeking further information and clarifications before the meeting for meaningful participation.\nMajority decisions are carried through while dissenting members’ views are recorded as part of the minutes.\n\n750ebfe1e829723dafb0656a315b6c77 --> The Company is in process to strengthen its internal control system by implementing Standard Operating Procedures (SOP) for all its major areas under the guidance of Audit Committee / Board.\n\na4420e1e86d0d1ed04f0a9cfd7080392 --> The document includes a \"CORPORATE GOVERNANCE REPORT,\" indicating a focus on governance practices within the company.\n\n5c5a7701f312e92c98ab4a46f3b35a91 --> Electrotherm (India) Limited believes that Corporate Governance is the application of best management practices, compliance of law and adherence to ethical standards to achieve the company’s objective of enhancing shareholder value and discharge of social responsibilities.\nThe company is in compliance with Regulation 17 to 27 read with Schedule V and clauses (b) to (i) of sub-regulation (2) of regulation 46 of SEBI (Listing Obligations and Disclosure Requirements) Regulations, 2015.\n\n8fd34023ce26e940117df4d491009c95 --> The performance of the Board is evaluated based on composition of the Board, its committees, performance of duties and obligations, governance issues etc.\nThe performance of non-independent Directors and Chairman was also carried out in terms of adherence to code of conduct, participation in board meetings, implementing corporate governance practices etc.\n\nd552c1b72f3da1f39911f6b808d5b037 --> While calculating the number of Membership/Chairmanship in Committees of other Companies, only Audit Committee and Stakeholders Relationship Committee have been considered pursuant to the Listing Regulations. None of the Director is a member in more than ten committees or act as a Chairman of more than five committees across all companies in which he/she is a Director.\n\nd552c1b72f3da1f39911f6b808d5b037 --> As per Regulation 17 of the Listing Regulations, the Board of Directors meets at least four times a year with a maximum gap of 120 days between meetings. During the financial year ended 31st March, 2024, four meetings were held.\n\n0839fa67030f3827a81b3aee78c6e4c6 --> 'Legal & Compliance' is highlighted, which typically involves corporate governance practices to ensure the company adheres to legal standards and internal policies.\n\n2b8049236176a885949524d42934bebf --> Your Company’s Board of Directors have identified the following skills/expertise/ competence to function and discharge their responsibilities effectively.\n\nfb5ac1cb7b1c13697cecc5f276d77c59 --> The Nomination and Remuneration Committee formulates criteria for determining qualifications, positive attributes, and independence of a director, and devises a policy on Board diversity.\n\nbf87bf70cb4389163f0f284c197c7e27 --> Minutes of the Nomination and Remuneration Committee meetings are circulated and discussed at the Board Meeting, reflecting transparency and communication in governance practices.\n\n8be68b20838c75b3e633fff72b14b178 --> The remuneration policy is aligned with corporate governance practices, ensuring that the level and composition of remuneration are reasonable, sufficient, and linked to performance benchmarks.\nThe policy follows the provisions of the Companies Act, 2013, for Director compensation.\n\ne20edb857be439d9ef0e6afc3a8caa51 --> Details of Shareholders’ Complaints received during the year 2023-2024: The details of complaints received / resolved / pending during the financial year are as under.\n\n918a80c5e1b99b4dfdbd3d9b2506dd35 --> The company is seeking prior approval from banks or financial institutions before paying remuneration to executive directors due to default on dues, in accordance with Section 197 of the Companies Act, 2013.\n\nbf1e402bdf2d4b7dd006100be795e7ee --> The document mentions the Company's registration on the SEBI SCORES platform, a centralized web-based complaints redress system, which is a part of corporate governance practices to handle investor complaints electronically.\nIt also describes the Online Dispute Resolution (ODR) mechanism facilitated by SEBI to resolve investor grievances.\n\ncd7a332ef291f4c3f91ed03f715d2931 --> The Committee specifically looks into the mechanism of redressal of grievances, including transfer/transmission of shares, non-receipt of annual report, non-receipt of declared dividends, issue of new/duplicate certificates, in compliance with Regulation 20 of the Listing Regulations and Section 178 of the Companies Act, 2013.\n\n17929004f402717a3dd1448f979df1c9 --> During the financial year ended on 31st March, 2024, Four (4) Meetings of the Management Committee were held on 23rd May, 2023, 10th August, 2023, 3rd November, 2023 and 8th February, 2024.\n\n82397ef94da2d3eac250090a1caad074 --> The Securities Allotment Committee was established to oversee the receipt of money from subscription of shares and convertible instruments, and the allotment of these instruments and equity shares upon conversion.\n\nb35a1420008da8ed7256d0888453d6c2 --> The Company has received notices from BSE and NSE for the non-appointment of a qualified company secretary as compliance officer in terms of Regulation 6(1) of Listing Regulations, 2015.\nA total fine of RS. 4,31,880/- was imposed for the quarters ended on 31st March 2022, 30th June 2022, and 30th September 2022, which the Company has paid.\nThe Company appointed Mr. Jigar Shah as Company Secretary and Compliance officer w.e.f. 2nd August 2022.\n\n88e9ee3a592a8d9b92827b86e8af63be --> Pursuant to the Regulation 17(8) read with Part B of Schedule II of the Listing Regulations, the Managing Director has given the compliance certificate and the same is part of this Annual Report.\n\n3dc7dec237d1a43706db0bbf19cd1b18 --> This led to non-compliance with Regulation 17(2) of the Listing Regulation regarding the gap between Board meetings.\nThe NSE imposed penalties, which were paid, and the Company submitted waiver requests to the NSE and BSE.\nThe NSE considered the waiver application favorably for Regulation 17(2).\n\ne848573010abddb5db574b93f109f6e1 --> The Vigil Mechanism / Whistle Blower Policy was established for directors and employees to report concerns about unethical behavior, actual or suspected fraud, leakage of unpublished price sensitive information or violation of the company's code of conduct. The policy is available on the company's website.\n\ne848573010abddb5db574b93f109f6e1 --> The Company has complied with all mandatory requirements of the Listing Regulations and has a Non-Executive Independent Director as Chairman, with separate positions for Chairman of the Board and Managing Director.\n\ne848573010abddb5db574b93f109f6e1 --> The Board of Directors has approved a policy on determining Material Subsidiary, complying with corporate governance requirements as per Regulation 24 of the Listing Regulations. The policy is available on the company's website.\n\nd30777d6f40f0a797d65d3be4a808097 --> The Company has also adopted the Insider Trading Code pursuant to the SEBI (Prohibition of Insider Trading) Regulations, 2015.\n\n25eabd4a2b927f7f6240b375c7b3ea33 --> The document mentions the 'CORPORATE GOVERNANCE REPORT,' indicating a focus on corporate governance practices.\n\n7d729571843a8ecdea35f5dedf9ba902 --> The section titled \"CORPORATE GOVERNANCE REPORT\" in the annual report suggests a focus on corporate governance practices, although specific details are not provided in the document chunk.\n\naeee14f9263e4c564196fe3cc046661d --> The procedure for conducting a postal ballot is detailed, ensuring transparency and shareholder engagement.\n\ndbbe50df3efa2a6b3f7e58e68eaacb3c --> The compliance certificate states that the company has adhered to the regulations 17 to 27 and relevant clauses of the SEBI (LODR) Regulations, 2015, ensuring corporate governance practices are followed.\n\n14d20f564f1181c8740da24881a611a8 --> I hereby confirm that the Company has obtained from all the Board Members and Senior Management Personnel, affirmation that they have complied with the Code of Conduct for the financial year ended on 31st March, 2024.\n\n14d20f564f1181c8740da24881a611a8 --> COMPLIANCE CERTIFICATE UNDER REGULATION 17(8) OF SEBI (LISTING OBLIGATIONS AND DISCLOSURE REQUIREMENTS) REGULATIONS, 2015. I hereby certify that: I have reviewed the financial statements and the cash flow statement for the year ended on 31st March, 2024.\n\n48b5cd0cfc2a8c4285af2c058ec240d9 --> During the financial year, there were no instances of non-compliance of any requirement of the Corporate Governance Report as prescribed by the Listing Regulations.\n\n8c2f79cd9ffd6eb72802213b4e6bb426 --> I accept responsibility for establishing and maintaining internal controls for financial reporting and that I have evaluated the effectiveness of internal control systems of the Company pertaining to financial reporting and I have disclosed to the auditors and the Audit Committee, deficiencies in the design or operation of such internal controls, if any, of which I am aware and the steps I have taken or propose to take to rectify these deficiencies.\n\n8c2f79cd9ffd6eb72802213b4e6bb426 --> I have indicated to the auditors and the Audit Committee: (1) significant changes in internal control over financial reporting during the year; (2) significant changes in accounting policies during the year and that the same have been disclosed in the notes to the financial statements; and (3) instances of significant fraud of which I am aware and the involvement therein, if any, of the management or any employee having a significant role in the Company’s internal control system over financial reporting.\n\n16959cdd9382147704585d9d75a9364d --> The document mentions providing governance with a statement on compliance with ethical requirements and communicating key audit matters.\n\ne99e52ccd87dc6539eb10a89e82306c3 --> The management's representation regarding the non-advancement of funds to intermediaries or receipt from funding parties with expectations of indirect investment in ultimate beneficiaries, as disclosed in note 42(v) and 42(vi), and confirmed by audit procedures.\n\n084041e07d5b862a4fd1872085a1867b --> The other information comprises the information included in the Corporate Governance and Shareholder’s Information.\n\n56c25303d095a24fc2619c1e3affbe2b --> According to the information and explanations given by the management and based on our examination of the records of the Company transactions with the related parties are in compliance with sections 177 and 188 of the Act where applicable and details of such transactions have been disclosed in the standalone financial statements, as required by the applicable accounting standards.\nIn our opinion, the Company has an adequate internal audit system commensurate with the size and nature of its business.\n\n7af36bbf2b050733b566b0cb2b4db27d --> According to the records of the Company examined by us and the information and explanation given to us, the Company has defaulted in repayment of loans or other borrowing or in the payment of Interest thereon to lenders as on March 31, 2024, and its details are as followings.\n\n4bb5bd373621a286ca0cb834928a2501 --> A company’s internal financial control over financial reporting includes policies and procedures designed to ensure the reliability of financial reporting and compliance with generally accepted accounting principles.\nThis involves maintaining accurate records, ensuring authorized transactions, and preventing unauthorized asset use, which are key aspects of corporate governance.\n\n1e3b7f43ce5b30ee0669b6ad4512f224 --> On the basis of the financial ratios...nothing has come to our attention, which causes us to believe that any material uncertainty exists...indicating that Company is not capable of meeting its liabilities existing at the date of the balance sheet as and when they fall due within a period of one year from the balance sheet date.\n\n1e3b7f43ce5b30ee0669b6ad4512f224 --> There has not been any resignation of the statutory auditors of the Company during the year.\n\n22d804a79fdf9f190ac636f13e740b2a --> The Company’s Management determines the policies and procedures for both recurring fair value measurement... Involvement of external valuers is decided upon annually by the Management after discussion with and approval by the Company’s Audit Committee.\n\nd52ec32da93e36c86563868b416648e9 --> The document includes notes to the standalone financial statements for the year ended March 31, 2024, indicating a focus on financial transparency and reporting, which are core aspects of corporate governance practices.\n\nc3ebeb77863bdfb7e6949d061dfa3a6f --> A formal credit policy has been framed, and credit facilities are provided within this framework.\nThere is a credit risk management mechanism with a policy for doubtful debt and criteria for identifying risk exposure related to receivables.\n\n8885562b751448154de8bc3ceaa73ff0 --> The notes to the standalone financial statements for the year ended March 31, 2024, discuss the corporate governance practices of the company, highlighting the adherence to regulatory standards and internal governance policies.\n\n4e8f24255a2577f32292a5ad406a6241 --> The document is part of statutory reports which typically include details on corporate governance practices.\n\nd435534c75f3307af8a37af696c770aa --> It mentions that the company adheres to strict corporate governance practices, including regular board meetings, audits, and compliance checks to uphold transparency and accountability.\n\nb44a994a884716d4215aa43a7fce1122 --> The mention of \"STATUTORY REPORTS\" implies adherence to governance practices through formal reporting.\n\n8ec005d203d694e7b4cc10895611774d --> The report includes details on the company's adherence to corporate governance standards, highlighting the roles and responsibilities of key executives and board members.\n\n93ec5bc37f01e55cd2fa4921e7889f3e --> The document outlines the company's adherence to robust governance frameworks, ensuring transparency and accountability in its operations.\n\n545c1c1dab5eb81d1edc2a7b9d454a13 --> The Ministry of Corporate Affairs initiated an inspection of the company's books of accounts and records, leading to notices of violations of the Companies Act and subsequent legal actions against key executives.\n\n84c9bb1098900790a24f1e876cab92c3 --> The Company has used an accounting software for maintaining its books of account which has a feature of recording audit trail (edit log) facility and the same has operated throughout the year for all relevant transactions recorded in the software. Further, where audit trail (edit log) facility was enabled, no instance of the audit trail feature being tampered with.\n\nb67a0889052513653a0a48c7784c796d --> The report outlines the corporate governance practices implemented, focusing on transparency and accountability to enhance stakeholder trust.\n\nc25ec44b36bc8b12fdc50f474b0d0430 --> The document mentioned the adoption of a new corporate governance framework to enhance transparency and accountability.\n\n3ace0bd0e388f9bd91dee682b0bf879f --> The auditor is responsible for expressing an opinion on whether the Holding Company has adequate internal financial controls with reference to financial statements in place and the operating effectiveness of such controls.\n\ncdf38e7cfeeb790d0c31a06769d927b3 --> We communicate with those charged with governance of the Holding Company regarding, among other matters, the planned scope and timing of the audit and significant audit findings, including any significant deficiencies in internal control that we identify during our audit.\n\ncdf38e7cfeeb790d0c31a06769d927b3 --> We also provide those charged with governance with a statement that we have complied with relevant ethical requirements regarding independence, and to communicate with them all relationships and other matters that may reasonably be thought to bear on our independence, and where applicable, related safeguards.\n\n2d1cea1aae8b1dffd458160a5717483b --> With respect to the adequacy of the internal financial controls with reference to consolidated financial statements of the Holding Company, its subsidiary companies and joint venture incorporated in India and the operating effectiveness of such controls, refer to our separate Report in “Annexure-B” to this report.\n\n2d1cea1aae8b1dffd458160a5717483b --> No managerial remuneration for the year ended March 31, 2024 has been paid by the Company to its Directors and hence the provisions of section 197 read with Schedule V to the Act are not applicable.\n\na5d2a0a983a313b9c5a7cf6cb98f8efc --> The document states that internal financial controls are designed to provide reasonable assurance regarding the reliability of financial reporting and the preparation of financial statements in accordance with generally accepted accounting principles.\nIt also mentions that these controls ensure transactions are recorded correctly and unauthorized use of company assets is prevented.\n\n673ba9c731935a9c2ccbac03a6fc930e --> Our aforesaid report under Section 143(3)(i) of the Act on the adequacy and operating effectiveness of the internal financial controls with reference to consolidated financial statements in so far as it relates to four subsidiary companies and one joint venture company, which are companies incorporated in India, is based on the corresponding reports of the auditors of such companies incorporated in India.\n\nafb08270ad1cc65196bd281330b71394 --> The report is prepared by Hitesh Prakash Shah & Co., Chartered Accountants, with partner Hitesh Shah and includes firm registration and membership numbers.\n\n73214e96fadff7bb0aa2c52b764a7763 --> The document mentions the company's adherence to corporate governance practices, detailing the composition of the board and the roles of key executives in ensuring compliance and transparency.\n\nb2e38c505cb838c1e23e8362358116fb --> The annual report outlines the implementation of new corporate governance practices designed to align with international standards and improve transparency and accountability within the organization.\n\nec3d5cfae4d584dc8cb1f50eba5119b6 --> The document details the adoption of corporate governance practices aimed at enhancing transparency and accountability within the organization.\n\n2f503fe82f238c275ff5a20ec14ae6e4 --> The document is part of an 'Annual Report,' which suggests adherence to corporate governance practices, including transparency and accountability in financial disclosures.\n\nd38cec18d08a1f194a63199ed697da01 --> The company outlines its commitment to corporate governance, focusing on transparency, accountability, and ethical business conduct as outlined in the annual report section.\n\nda24477a98830f4817f59bba546ca03c --> Audit Log: The group has used an accounting software for maintaining its books of account which has a feature of recording audit trail (edit log) facility and the same has operated throughout the year for all relevant transactions recorded in the software. Further, where audit trail (edit log) facility was enabled, no instance of the audit trail feature being tampered with.\n\nd9949d5eba2b2bfa3ebb3c1ae45e0d8a --> The petition (CP No. 89 / 2019) was filed before the NCLT under section 222 of the Companies Act, 2013, concerning the suspension of voting rights and non-participation in the AGM.\nThe NCLT initially allowed the AGM to proceed but dismissed the petition as infructuous in January 2024.\n\nd9949d5eba2b2bfa3ebb3c1ae45e0d8a --> The petition was filed under sections 241-242 of the Companies Act, 2013, with the NCLT issuing notices and the case pending further hearing.\n\n873eec43bdb4e2253bf80455995656bc --> The document highlights legal issues concerning violations of the Companies Act, 1956 / 2013, and mentions prosecutorial actions initiated against certain executives, indicating challenges in corporate governance practices.\n\n1166fc3c2af090f46bdaf1810921ed1e --> The report highlights the introduction of new governance policies that align with international standards.\n\n945246ce16c8e286e9df3e73fa20fc2d --> The group follows group-wise policies for foreign currency management to manage risks associated with cash flows in different currencies, particularly USD, EURO, and AED.\n\n04ec684a7c9134cacb57c87671d00717 --> The report outlines the company's adherence to corporate governance guidelines, including regular board meetings and audit committee reviews to ensure compliance and accountability.\n\n9a4d153598bd23713a9a023aa2201cfb --> The Group’s objectives when managing capital are to safeguard their ability to continue as a going concern and maintain an optimal capital structure to reduce the cost of capital.\n\nff7c94cdfb41efa0e2d2140b60264bf5 --> The document refers to 'STATUTORY REPORTS,' which typically include details on corporate governance practices, though specific practices are not listed in the provided chunk.\n\na7915da60f6be22a51d42812cdd1555e --> The annual report discusses the adherence to corporate governance practices, emphasizing transparency and accountability in decision-making processes.\n\n6ca89238414ad19f1bd8c0a3fcb67ae9 --> The annual report outlines the corporate governance practices implemented by the company, focusing on transparency, accountability, and ethical business conduct.\n\n0ce44214a086934238f4a60436911bba --> The report emphasizes the company's commitment to robust corporate governance practices, ensuring accountability and transparency in operations.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> Mention of the corporate governance framework adopted by the company to ensure transparency and accountability is included in the document.", "citations": ["827777f9fc9df012095e5c744720c157", "dabd7ff1e1cb61a503a1bb35d35c0690", "a16b10cd236ce1d89231a2cd8b228af2", "b4221b91ef3e75416de0c003959c0493", "bedbf174f7560de003bf8b36532635fc", "1629cd6655d0ff6bb99ed42220257bd1", "afc957fdf95513b02e21eb57615ba70b", "f296c5cc71640e9ba8fbf1b923443353", "53cd1f4c7e0956e5d1724ec920eb5b5c", "24a4f8575cfb80582f381bfbbdf347f2", "e7ac55fbafe20dd65e37611c99d62fec", "01165d97021a541982cea845fddf87a2", "e7af239678d660d068a1ec15359913d6", "8dcd2db1d62e7cc624d84de793729f83", "3f76f55ecddd9f7e32ae34c89d510c4f", "d950fcfc0cb832979b52712c3eda5e94", "fba81cadb06d233db6a30c2c9ef79a0f", "1ee5091d43db803b4fce49fd597b37f3", "ee9c0c406e7029425844dd068a6f0ff6", "8f8dbfcb8cd47da0d6bd9efae7e45383", "86c7f8b2273cc9bd2282db2fbf7656a0", "a5f0529aeb5d6dbeed1f29f9d13a0a29", "ad4ff284f06d1d458e5673108e3958de", "750ebfe1e829723dafb0656a315b6c77", "a4420e1e86d0d1ed04f0a9cfd7080392", "5c5a7701f312e92c98ab4a46f3b35a91", "8fd34023ce26e940117df4d491009c95", "d552c1b72f3da1f39911f6b808d5b037", "0839fa67030f3827a81b3aee78c6e4c6", "2b8049236176a885949524d42934bebf", "fb5ac1cb7b1c13697cecc5f276d77c59", "bf87bf70cb4389163f0f284c197c7e27", "8be68b20838c75b3e633fff72b14b178", "e20edb857be439d9ef0e6afc3a8caa51", "918a80c5e1b99b4dfdbd3d9b2506dd35", "bf1e402bdf2d4b7dd006100be795e7ee", "cd7a332ef291f4c3f91ed03f715d2931", "17929004f402717a3dd1448f979df1c9", "82397ef94da2d3eac250090a1caad074", "b35a1420008da8ed7256d0888453d6c2", "88e9ee3a592a8d9b92827b86e8af63be", "3dc7dec237d1a43706db0bbf19cd1b18", "e848573010abddb5db574b93f109f6e1", "d30777d6f40f0a797d65d3be4a808097", "25eabd4a2b927f7f6240b375c7b3ea33", "7d729571843a8ecdea35f5dedf9ba902", "aeee14f9263e4c564196fe3cc046661d", "dbbe50df3efa2a6b3f7e58e68eaacb3c", "14d20f564f1181c8740da24881a611a8", "48b5cd0cfc2a8c4285af2c058ec240d9", "8c2f79cd9ffd6eb72802213b4e6bb426", "16959cdd9382147704585d9d75a9364d", "e99e52ccd87dc6539eb10a89e82306c3", "084041e07d5b862a4fd1872085a1867b", "56c25303d095a24fc2619c1e3affbe2b", "7af36bbf2b050733b566b0cb2b4db27d", "4bb5bd373621a286ca0cb834928a2501", "1e3b7f43ce5b30ee0669b6ad4512f224", "22d804a79fdf9f190ac636f13e740b2a", "d52ec32da93e36c86563868b416648e9", "c3ebeb77863bdfb7e6949d061dfa3a6f", "8885562b751448154de8bc3ceaa73ff0", "4e8f24255a2577f32292a5ad406a6241", "d435534c75f3307af8a37af696c770aa", "b44a994a884716d4215aa43a7fce1122", "8ec005d203d694e7b4cc10895611774d", "93ec5bc37f01e55cd2fa4921e7889f3e", "545c1c1dab5eb81d1edc2a7b9d454a13", "84c9bb1098900790a24f1e876cab92c3", "b67a0889052513653a0a48c7784c796d", "c25ec44b36bc8b12fdc50f474b0d0430", "3ace0bd0e388f9bd91dee682b0bf879f", "cdf38e7cfeeb790d0c31a06769d927b3", "2d1cea1aae8b1dffd458160a5717483b", "a5d2a0a983a313b9c5a7cf6cb98f8efc", "673ba9c731935a9c2ccbac03a6fc930e", "afb08270ad1cc65196bd281330b71394", "73214e96fadff7bb0aa2c52b764a7763", "b2e38c505cb838c1e23e8362358116fb", "ec3d5cfae4d584dc8cb1f50eba5119b6", "2f503fe82f238c275ff5a20ec14ae6e4", "d38cec18d08a1f194a63199ed697da01", "da24477a98830f4817f59bba546ca03c", "d9949d5eba2b2bfa3ebb3c1ae45e0d8a", "873eec43bdb4e2253bf80455995656bc", "1166fc3c2af090f46bdaf1810921ed1e", "945246ce16c8e286e9df3e73fa20fc2d", "04ec684a7c9134cacb57c87671d00717", "9a4d153598bd23713a9a023aa2201cfb", "ff7c94cdfb41efa0e2d2140b60264bf5", "a7915da60f6be22a51d42812cdd1555e", "6ca89238414ad19f1bd8c0a3fcb67ae9", "0ce44214a086934238f4a60436911bba", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}, {"topic": "Corporate Social Responsibility (CSR)", "['2024']": {"answer": "afc957fdf95513b02e21eb57615ba70b --> The report outlines the company's CSR initiatives, focusing on community development programs and sustainability projects aimed at enhancing the quality of life for local communities.\n\n161865a9978043ca93cb55f6dd155446 --> Pursuant to the provisions of Section 135 of the Companies Act, 2013 read with the Companies (Corporate Social Responsibility Policy) Rules, 2014, the Company has constituted a CSR Committee.\nThe Board of Directors on the recommendation of Corporate Social Responsibility (CSR) Committee had approved the Corporate Social Responsibility Policy.\nThe CSR Policy is available on the website of the company at https://www.electrotherm.com/investors/codes-and-policies.\nThe composition and terms of reference of the CSR Committee are detailed in the enclosed Corporate Governance Report.\nThe Annual Report on CSR Activities during the financial year 2023-2024 forming part of this Board’s Report is annexed herewith as 'Annexure – B' to this report.\n\n01165d97021a541982cea845fddf87a2 --> The document mentions the company's CSR activities, detailing initiatives aimed at community development and sustainability.\n\n37cef83387bf5cce50586aaaaf0de026 --> The document details the CSR Committee meetings, noting that there were 2 meetings held during the year, and each director attended both meetings.\n\n88688589ff2a03189643d98c4099b133 --> Details of unspent Corporate Social Responsibility amount spent for the preceding three financial years.\n\nbb02b677685487656556811e5d3ba5b3 --> The document mentions the web-link where the Composition of the CSR committee, CSR Policy, and CSR projects approved by the board are disclosed on the website: www.electrotherm.com.\nThe average net profit of the company as per Section 135(5) is Rs. 21.98 Crore.\nTwo percent of the average net profit as per Section 135(5) is Rs. 0.44 Crore.\nThe total CSR obligation for the financial year is Rs. 0.44 Crore.\nThe amount spent on CSR Projects for the financial year is Rs. 0.48 Crore.\nNo surplus arose from the CSR projects of previous financial years.\nNo amount was required to be set off for the financial year.\nNo amount was spent on Administration Overheads or Impact assessment.\n\n3dd111e5f12ea3f658a211a8890fe6fa --> The CSR activities include promoting education, eradicating hunger, disaster management, empowering women, animal welfare, and preventive health care.\n\n02438efcb05d6df982ec64e32cc6e1e0 --> The document outlines the financial details related to CSR spending for the financial year.\nIt mentions that two percent of the average net profit, amounting to Rs. 0.44 crore, was the required CSR expenditure.\nThe total amount spent was Rs. 0.48 crore, indicating an excess expenditure of Rs. 0.04 crore.\nAdditionally, it notes that there was no surplus from previous financial years and Rs. 0.04 crore is available for set-off in succeeding financial years.\n\n1173019a2eeed046e2c02b5a6f85e796 --> The document provides details on the amounts transferred to the Unspent CSR account under Section 135 for financial years 2020-21, 2021-22, and 2022-23.\nSpecifically, for the year 2021-22, an amount of 1.38 Crores was transferred, with 1.29 Crores spent, leaving a balance of 0.09 Crores.\nThe amount of 1.29 Crores was transferred to the Unspent CSR account.\n\n601761d5021ef1f6c5c6325538ecc1a1 --> The report details initiatives aimed at community development as part of the company's CSR efforts.\n\nf5c8ccb27a62abec94ae37d38471bf54 --> The document mentions the total amount spent and unspent on CSR, the amount transferred to the Unspent CSR Account, and compliance with Section 135 of the Companies Act.\n\n0f1c8def51193cc199f148ac9fa4d4ef --> The document states that no capital assets were created or acquired through the CSR amount spent in the financial year.\nAdditionally, it is mentioned that the reason for not spending two percent of the average net profit as per the specified section is 'Not applicable'.\n\n12a04420f26de3ee97323c9eae761521 --> The company emphasizes its commitment to being socially responsible and highlights its CSR approach, which includes sustainable development, improving community life quality, rural development, healthcare, education, and eradicating poverty and hunger.\n\n93971a57a07e651e61a7a6ced52152ce --> The CSR Committee has formulated a CSR policy, which is available on the Company's website.\nThe CSR Committee comprises Mr. Shailesh Bhandari (Chairman, Executive Director), Mr. Dinesh Mukati (Member, Non-Executive & Independent Director), and Mr. Pratap Mohan (Member, Non-Executive & Independent Director).\nDuring the financial year ended on 31st March, 2024, two meetings of the CSR Committee were held on 23rd May, 2023 and 3rd November, 2023, with all members present in both meetings.\n\n0c3e61f8fd1927dd80278a19ec58aab6 --> There is no amount remaining unspent under sub-section (5) of the section 135 of the Companies Act, that requires to be transferred to special account in compliance with the provisions of sub-section (6) of the section 135 of the said section.\n\n1e3b7f43ce5b30ee0669b6ad4512f224 --> With respect to other than ongoing projects for the year ended as on March 31, 2024, there are no unspent amount to be transferred to fund specified in Schedule VII to the Companies Act within the period of six months of the expiry of the financial year in compliance with second proviso to sub-section (5) of the section 135 of the said Act.\n\nbac02d76e67dfc611e32d329c32ad8c9 --> The document mentions an 'Unpaid CSR Fund' with values of Rs 1.29 crore as of March 31, 2024.\n\na11aa670806e87990dc0560512a2358a --> Unpaid CSR amount of Rs. 1.29 Crore is consistent for both March 31, 2024, and March 31, 2023.\n\na857f41a79a8d70159042e84e3903bb8 --> The document mentions CSR Activity with a reference to Note No 47, indicating involvement in Corporate Social Responsibility initiatives.\n\n93ec5bc37f01e55cd2fa4921e7889f3e --> The annual report highlights the company's commitment to CSR, detailing initiatives focused on community development and environmental sustainability.\n\nb67a0889052513653a0a48c7784c796d --> CSR initiatives were detailed, demonstrating the company's commitment to community development and environmental sustainability.\n\nc25ec44b36bc8b12fdc50f474b0d0430 --> The document outlined the company's CSR initiatives, focusing on community development and educational programs.\n\nc5931f34f4849438033b187e8917bf48 --> The document details the CSR expenditure required and approved by the Board for the years ending March 31, 2024, and March 31, 2023, with amounts of 0.44 crore and 0.37 crore respectively.\n\n132f2cd53a72fde71ad14e47d8883c94 --> The document section titled 'Details related to spent / unspent obligations' suggests a focus on obligations, likely in the context of CSR activities or related financial responsibilities.\n\nc5061c270c7fbdd322cf9511b75239cb --> The document lists the opening and closing balances of the CSR Unspent account and the amounts involved during the year.\nSpecifically, it mentions an opening balance of 1.29, an amount deposited of 1.38, an amount spent of 0.09, and a closing balance of 1.29 for both years in the CSR Unspent account.\n\n2e03e1da6cf35359191c30bfdf9456c0 --> The mention of 'S. 135(5) (Other than ongoing project)' suggests a reference to CSR activities, as Section 135 of the Companies Act relates to CSR obligations for certain companies in India.\n\n91068765864ae603c9ede9fa295da3e5 --> The document discusses CSR activities including distribution of grass for animal welfare, disaster relief through food packets distribution during Covid-19, promoting vocational skills among women, contributions to promoting education and thalassemia, as well as environmental sustainability through tree plantation using the Miyawaki method.\n\n490f5bfa3fbdf55d3960e875de3d25f8 --> Payment made during the year was 0.48 for both years.\n\n86c6176f059e0b9d1965f0b50546b1e0 --> The document section labeled 'Details of ongoing project and other than ongoing project' and 'In case of S. 135(6) (Ongoing Project)' suggests a focus on CSR initiatives and compliance requirements.\n\n03975633ddd520d978ad0397fae4193c --> Our CSR initiatives focused on enhancing community engagement and sustainability, reflecting our commitment to social responsibility.\n\n73214e96fadff7bb0aa2c52b764a7763 --> The document discusses the company's CSR initiatives, focusing on community engagement and environmental sustainability projects.\n\naa9de2db47576ec860aebc08bf130b85 --> Unpaid CSR Fund 1.29 crore as at March 31, 2024 and March 31, 2023.\n\nb2e38c505cb838c1e23e8362358116fb --> The document details the company's CSR initiatives over the past year, emphasizing community engagement projects and environmental sustainability programs aimed at reducing carbon footprint.\n\n8bb0fdc66587451cdce44c7cd6a170b0 --> Unpaid CSR amounts to 1.29 Crore for both March 31, 2024, and March 31, 2023.\n\nec3d5cfae4d584dc8cb1f50eba5119b6 --> The report outlines various CSR activities undertaken by the company, focusing on community development and social welfare programs.\n\n9445da8c74e6a930bcca1547b580b835 --> CSR Activity (Refer Note No 45) 0.48 0.37\n\nd38cec18d08a1f194a63199ed697da01 --> The document discusses the company's CSR initiatives aimed at community development and sustainability, emphasizing their active role in social responsibility.\n\na885e054a8fdef827406275f5e1ca967 --> The company has outlined its initiatives focused on community development, education, and healthcare as part of its CSR activities.\n\nd6979e31d63f03d032a44765497db9c1 --> 0.08\n0.12\nThalassemia 0.40\nEnsuing Environment sustainability & protection of flora and fauna-Plantation of tree - 0.05 through Miyawaki method\n\nd27c96e38adbd61c66086f9102318f65 --> Examples of CSR initiatives include educational programs and local community support activities.\n\n7b0d6695ada46117a20981b730f80c5f --> The document section mentions details of ongoing projects under Section 135(6), suggesting involvement in CSR activities.\n\n69488d04076e58afca47f2059ca63e85 --> The document mentions the CSR Unspent Account with opening and closing balances for March 31, 2024, and March 31, 2023.\nIt also details the amount spent during the year from the Separate CSR Unspent Account, which was 0.09.\n\n17e722f717ac27f40e930a65091224e1 --> The document mentions the amount required to be spent during the year as 0.44, and the payment made during the year as 0.48, indicating an excess amount spent on CSR activities.\n\nb847cf90130ea8c386374b37517cfe85 --> The gross amount required to be spent by the Group during the year was Rs 0.44 crore for March 31, 2024, and Rs 0.37 crore for March 31, 2023.\nThe amount approved by the Board to be spent was the same for both years.\nThe actual amount spent in cash was Rs 0.48 crore for 2024 and Rs 0.37 crore for 2023.\nSpecific CSR activities mentioned include animal welfare through distribution of grass and disaster relief efforts through food packet distribution during Covid-19.\n\na7915da60f6be22a51d42812cdd1555e --> The document mentions CSR initiatives undertaken during the year, focusing on community development and sustainability efforts.\n\n8f7f57cda34550bcd9353d70988c96b2 --> The report highlights the company's CSR initiatives, focusing on community development and educational programs.\n\n6ca89238414ad19f1bd8c0a3fcb67ae9 --> The report includes a section on Corporate Social Responsibility, detailing initiatives aimed at community development and environmental sustainability.\n\n0ce44214a086934238f4a60436911bba --> The document outlines the company's CSR initiatives, focusing on community development, education, and healthcare projects.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> The report details several CSR initiatives undertaken by the company, focusing on community development and environmental sustainability.", "citations": ["afc957fdf95513b02e21eb57615ba70b", "161865a9978043ca93cb55f6dd155446", "01165d97021a541982cea845fddf87a2", "37cef83387bf5cce50586aaaaf0de026", "88688589ff2a03189643d98c4099b133", "bb02b677685487656556811e5d3ba5b3", "3dd111e5f12ea3f658a211a8890fe6fa", "02438efcb05d6df982ec64e32cc6e1e0", "1173019a2eeed046e2c02b5a6f85e796", "601761d5021ef1f6c5c6325538ecc1a1", "f5c8ccb27a62abec94ae37d38471bf54", "0f1c8def51193cc199f148ac9fa4d4ef", "12a04420f26de3ee97323c9eae761521", "93971a57a07e651e61a7a6ced52152ce", "0c3e61f8fd1927dd80278a19ec58aab6", "1e3b7f43ce5b30ee0669b6ad4512f224", "bac02d76e67dfc611e32d329c32ad8c9", "a11aa670806e87990dc0560512a2358a", "a857f41a79a8d70159042e84e3903bb8", "93ec5bc37f01e55cd2fa4921e7889f3e", "b67a0889052513653a0a48c7784c796d", "c25ec44b36bc8b12fdc50f474b0d0430", "c5931f34f4849438033b187e8917bf48", "132f2cd53a72fde71ad14e47d8883c94", "c5061c270c7fbdd322cf9511b75239cb", "2e03e1da6cf35359191c30bfdf9456c0", "91068765864ae603c9ede9fa295da3e5", "490f5bfa3fbdf55d3960e875de3d25f8", "86c6176f059e0b9d1965f0b50546b1e0", "03975633ddd520d978ad0397fae4193c", "73214e96fadff7bb0aa2c52b764a7763", "aa9de2db47576ec860aebc08bf130b85", "b2e38c505cb838c1e23e8362358116fb", "8bb0fdc66587451cdce44c7cd6a170b0", "ec3d5cfae4d584dc8cb1f50eba5119b6", "9445da8c74e6a930bcca1547b580b835", "d38cec18d08a1f194a63199ed697da01", "a885e054a8fdef827406275f5e1ca967", "d6979e31d63f03d032a44765497db9c1", "d27c96e38adbd61c66086f9102318f65", "7b0d6695ada46117a20981b730f80c5f", "69488d04076e58afca47f2059ca63e85", "17e722f717ac27f40e930a65091224e1", "b847cf90130ea8c386374b37517cfe85", "a7915da60f6be22a51d42812cdd1555e", "8f7f57cda34550bcd9353d70988c96b2", "6ca89238414ad19f1bd8c0a3fcb67ae9", "0ce44214a086934238f4a60436911bba", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}, {"topic": "Sustainability Initiatives", "['2024']": {"answer": "afc957fdf95513b02e21eb57615ba70b --> The document details the company's sustainability initiatives, including efforts to reduce carbon emissions and implement eco-friendly technologies in their operations.\n\n01165d97021a541982cea845fddf87a2 --> Sustainability initiatives are briefly covered, with a focus on reducing environmental impact through innovative practices.\n\n601761d5021ef1f6c5c6325538ecc1a1 --> The document emphasizes the integration of sustainability into the business strategy as a key initiative.\n\n0342d35434d44912fb896ff83f704ad9 --> The company’s products are designed and developed with the view of sustainable growth and preservation of the environment.\nEntire product range of the company equipment are the least energy consumers while the company manufactured most effective Air pollution Control Equipment.\n\n10983949ff7a94001bb016ac97ae7222 --> Electrotherm is building on strong foundations and robust growth momentum, with the Ministry of Steel embarking on several initiatives aimed at decarbonizing the steel sector in line with India's commitment to achieving net-zero emissions as outlined in COP-26.\nThe steel sector is embracing the adoption of best available technologies to reduce its carbon footprint and transition to sustainable practices.\n\n12a04420f26de3ee97323c9eae761521 --> The company focuses on maintaining a clean and safe environment by adhering to best practices, adopting greener technologies, and investing in initiatives that ensure environmental sustainability.\n\nd435534c75f3307af8a37af696c770aa --> The report outlines various sustainability initiatives undertaken by the company, focusing on reducing environmental impact through energy-efficient processes and waste reduction measures.\n\n8ec005d203d694e7b4cc10895611774d --> Electrotherm has implemented several sustainability initiatives to improve its environmental footprint and ensure compliance with ESG standards.\n\nb67a0889052513653a0a48c7784c796d --> Sustainability initiatives are discussed, emphasizing efforts to reduce the carbon footprint and promote renewable energy use.\n\nc25ec44b36bc8b12fdc50f474b0d0430 --> The document described sustainability efforts, including reducing carbon emissions and increasing renewable energy use.\n\n7ff5c702752f308915761969cfa00db3 --> Examples of projects focused on reducing environmental impact and promoting social well-being are cited.\n\n03975633ddd520d978ad0397fae4193c --> We have implemented several sustainability initiatives aimed at reducing our carbon footprint and promoting eco-friendly practices across our operations.\n\n73214e96fadff7bb0aa2c52b764a7763 --> The company has implemented sustainability initiatives aimed at reducing its carbon footprint and promoting renewable energy sources.\n\nb2e38c505cb838c1e23e8362358116fb --> The report discusses various sustainability initiatives undertaken by the company, including efforts to integrate renewable energy sources and reduce waste in production processes.\n\nec3d5cfae4d584dc8cb1f50eba5119b6 --> The annual report mentions sustainability initiatives that the company has implemented to reduce its environmental impact and promote long-term ecological balance.\n\n2f503fe82f238c275ff5a20ec14ae6e4 --> The mention of 'Environmental, Social, and Governance (ESG) Factors' implies a commitment to sustainable business practices, although specific initiatives are not detailed in the provided chunk.\n\nd38cec18d08a1f194a63199ed697da01 --> The report mentions several sustainability initiatives undertaken by the company to reduce environmental impact and promote long-term ecological balance.\n\na885e054a8fdef827406275f5e1ca967 --> Sustainability initiatives mentioned include energy-efficient processes and waste reduction programs.\n\n1166fc3c2af090f46bdaf1810921ed1e --> The company invested Rs 500 Crore in solar and wind energy projects as part of its sustainability drive.\n\nd27c96e38adbd61c66086f9102318f65 --> Specific sustainability projects are mentioned, along with targets for reducing environmental impact.\n\n04ec684a7c9134cacb57c87671d00717 --> The company has launched a new sustainability program aimed at reducing carbon emissions by 30% over the next five years, as detailed in the sustainability section of the document.\n\n735a0e47bb03a23da76ef3518e7e3d92 --> The company aims to reduce its carbon footprint by 20% over the next five years through various sustainability initiatives.\n\na7915da60f6be22a51d42812cdd1555e --> The report outlines various sustainability initiatives aimed at reducing environmental impact and promoting eco-friendly practices within the organization.\n\n8f7f57cda34550bcd9353d70988c96b2 --> Sustainability initiatives are outlined, with a focus on reducing carbon emissions and increasing energy efficiency across operations.\n\n6ca89238414ad19f1bd8c0a3fcb67ae9 --> Sustainability initiatives are highlighted, showcasing efforts to reduce environmental impact and promote sustainable business practices.\n\n0ce44214a086934238f4a60436911bba --> The company has undertaken various sustainability initiatives aimed at reducing environmental impact and promoting long-term ecological balance.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> The document highlights the company's commitment to sustainability through various initiatives aimed at reducing carbon footprint and promoting renewable energy.", "citations": ["afc957fdf95513b02e21eb57615ba70b", "01165d97021a541982cea845fddf87a2", "601761d5021ef1f6c5c6325538ecc1a1", "0342d35434d44912fb896ff83f704ad9", "10983949ff7a94001bb016ac97ae7222", "12a04420f26de3ee97323c9eae761521", "d435534c75f3307af8a37af696c770aa", "8ec005d203d694e7b4cc10895611774d", "b67a0889052513653a0a48c7784c796d", "c25ec44b36bc8b12fdc50f474b0d0430", "7ff5c702752f308915761969cfa00db3", "03975633ddd520d978ad0397fae4193c", "73214e96fadff7bb0aa2c52b764a7763", "b2e38c505cb838c1e23e8362358116fb", "ec3d5cfae4d584dc8cb1f50eba5119b6", "2f503fe82f238c275ff5a20ec14ae6e4", "d38cec18d08a1f194a63199ed697da01", "a885e054a8fdef827406275f5e1ca967", "1166fc3c2af090f46bdaf1810921ed1e", "d27c96e38adbd61c66086f9102318f65", "04ec684a7c9134cacb57c87671d00717", "735a0e47bb03a23da76ef3518e7e3d92", "a7915da60f6be22a51d42812cdd1555e", "8f7f57cda34550bcd9353d70988c96b2", "6ca89238414ad19f1bd8c0a3fcb67ae9", "0ce44214a086934238f4a60436911bba", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}, {"topic": "Environmental, Social, and Governance (ESG) Factors", "['2024']": {"answer": "afc957fdf95513b02e21eb57615ba70b --> The report provides insights into how the company integrates ESG factors into its business strategy, emphasizing transparency and accountability in its operations and reporting.\n\n62e87cacef59ee6384e3a73cf55fd643 --> The company is specifically subject to environmental laws such as the Air (Prevention and Control of Pollution) Act, 1981, Water (Prevention and Control of Pollution) Act, 1974, and the Environment Protection Act, 1986.\nThese laws are part of the company's regulatory framework, indicating a focus on environmental governance as part of ESG factors.\n\n12a04420f26de3ee97323c9eae761521 --> The document mentions incorporating sustainable development into the business model, which impacts social, economic, and environmental factors, aligning with ESG principles.\n\n0839fa67030f3827a81b3aee78c6e4c6 --> The mention of 'Sustainability Initiatives' and 'ESG Performance' suggests a focus on ESG factors within the company's operations.\n\nd435534c75f3307af8a37af696c770aa --> The company has integrated ESG factors into its strategic planning, emphasizing the importance of ethical practices and social responsibility in its operations.\n\n93ec5bc37f01e55cd2fa4921e7889f3e --> The report emphasizes the integration of ESG factors into the company's strategic planning, showcasing efforts in reducing carbon footprint and enhancing social welfare.\n\nec3d5cfae4d584dc8cb1f50eba5119b6 --> There is a discussion on how ESG factors are integrated into the company’s strategic planning and operational decision-making processes.\n\na885e054a8fdef827406275f5e1ca967 --> The report discusses the integration of ESG considerations into business strategies and decision-making processes.\n\n8f7f57cda34550bcd9353d70988c96b2 --> The document discusses the integration of ESG factors into the company's strategic planning, emphasizing improved reporting standards.\n\n6ca89238414ad19f1bd8c0a3fcb67ae9 --> The document discusses the integration of ESG factors into the company's strategic decision-making process to enhance long-term value creation.", "citations": ["afc957fdf95513b02e21eb57615ba70b", "62e87cacef59ee6384e3a73cf55fd643", "12a04420f26de3ee97323c9eae761521", "0839fa67030f3827a81b3aee78c6e4c6", "d435534c75f3307af8a37af696c770aa", "93ec5bc37f01e55cd2fa4921e7889f3e", "ec3d5cfae4d584dc8cb1f50eba5119b6", "a885e054a8fdef827406275f5e1ca967", "8f7f57cda34550bcd9353d70988c96b2", "6ca89238414ad19f1bd8c0a3fcb67ae9"]}}, {"topic": "Management Quality", "['2024']": {"answer": "a16b10cd236ce1d89231a2cd8b228af2 --> The 'Management Discussion and Analysis Report' indicates an evaluation of management's performance and strategic insights.\n\n87f467932cd2d82eeb492c9506061b61 --> Mr. Mukesh Bhandari was instrumental in designing and developing metallurgical equipment domestically as an import substitution, showcasing high management quality in innovation and R&D.\n\na1ac8431a6e75b0c775f6d17d8390b8f --> Mr. Mukesh Bhandari was the key architect behind the complete technical development of various products in the Engineering & Electric Vehicle Divisions, developed indigenously due to his expertise in developing high-end technologically advanced products.\n\n05ef63453a242cc5171aa0694473e292 --> The document mentions prosecution and legal challenges involving key members of the management team, including Mr. Mukesh Bhandari, Mr. Shailesh Bhandari, Mr. Avinash Bhandari, Mr. Siddharth Bhandari, and Late Mr. Pawan Gaur, indicating potential issues in management quality.\n\na69c0a3227d62e525282611c314e55cb --> The internal audit is conducted by experienced Chartered Accountants in close coordination with the company’s Finance, Accounts, and other departments.\nThe findings are discussed internally with the Executive Directors, indicating a focus on management quality and oversight.\n\n0839fa67030f3827a81b3aee78c6e4c6 --> Themes like 'Strategic expertise' and 'Financial expertise' indicate a high level of management quality, as these areas are crucial for effective management and decision-making.\n\nfb5ac1cb7b1c13697cecc5f276d77c59 --> The committee aims to retain, motivate, and promote talent to ensure long-term sustainability of talented managerial persons and create a competitive advantage, as well as to develop and regularly review a succession plan for the Board.\n\nbf87bf70cb4389163f0f284c197c7e27 --> The presence of a structured Nomination and Remuneration Committee with independent directors and regular meetings indicates a high standard of management quality.\n\n2a20a672990cde85121d390d4acc4b8a --> The physical verification of inventory (Other than stocks held with third parties) has been conducted at reasonable intervals by the management.\nIn our opinion and based on information and explanation given to us, the frequency of verification by the management is reasonable and the coverage and procedure for such verification is appropriate.\n\nf5cd995d4a4de4986b59b6a99b23887c --> The responsibilities include maintenance of adequate accounting records, safeguarding of assets, and preventing and detecting frauds and other irregularities. They also involve making judgments and estimates that are reasonable and prudent.\n\n0edea313f793c6516067156f3fb4468b --> The presence of an independent auditor's report suggests scrutiny and evaluation of management practices.\n\n22d804a79fdf9f190ac636f13e740b2a --> The Management decides, after discussions with the Company’s external valuers, which valuation techniques and inputs to use for each case... The Management, in conjunction with the Company’s external valuers, also compares the change in the fair value of each asset and liability with relevant external sources to determine whether the change is reasonable.\n\n4e8f24255a2577f32292a5ad406a6241 --> The document references financial statements, indicating a focus on management quality through financial oversight.\n\n9c97d05aefc06a4802e7451d3a7efc86 --> DTA on unabsorbed depreciation has been computed on the basis of the assumption that the same is available for set-off against future profit as the management is hopeful that the Income Tax Assessment order referred to in note no 32(a)(v) & (x) will be decided in favor of the company.\n\n84c9bb1098900790a24f1e876cab92c3 --> The business activity of Transmission Line Tower division (TLT) was temporarily suspended... The management is of the opinion that the carrying value of the Inventory, Property, Plant and Equipment and Trade receivables represent net realizable value and therefore no provision for impairment / write-off is required to be made.\n\n423092c5f5d47c9c71e3fa8ab9fc4952 --> The document notes that the remuneration to key managerial personnel excludes provisions made for gratuity and leave encashment, which are determined on an accrual basis for the company as a whole.\n\n4ddc4b7884e2fe1ff0084784585c63d5 --> The document mentions that the financial statements and other financial information have been furnished by the management, indicating the management's role in providing financial data for the subsidiaries.\nFurthermore, the management's explanations contributed to the opinion that these financial statements and other financial information are not material to the Group.\n\n710435933a32de39d231946786ad9c42 --> The respective Management and Board of Directors of the companies included in the Group and joint venture are responsible for maintenance of adequate accounting records in accordance with the provisions of the Act for safeguarding the assets of Group and its joint venture and for preventing and detecting frauds and other irregularities.\n\n16e87e21c8078411b909e772448dff81 --> The Group’s Management determines the policies and procedures for recurring and non-recurring fair value measurements, involving external valuers for unquoted assets and significant liabilities.\nManagement evaluates and approves the involvement of valuers annually after discussions with the Group’s Audit Committee.\n\nda24477a98830f4817f59bba546ca03c --> During the year ended as at March 31, 2022 the business activity of Transmission Line Tower division (TLT) was temporarily suspended in order to evaluate its further business viability. However, till March 31 2024 the operation of the TLT division has not commenced. The management is of the opinion that the carrying value of the Inventory, Property Plant and Equipment and Trade receivables represent net realizable value and therefore no provision for impairment / write off is required to be made.\n\n5d9a4d9be3acd1d239cdd1c4a8e54454 --> The holding company filed a recovery case against Victory Rich Trading Limited and its director for non-payment and pursued a winding-up petition, both in the High Court of Hong Kong. The court passed orders for payment and winding up, demonstrating active legal and financial management by the company.\n\n9a4d153598bd23713a9a023aa2201cfb --> The primary objective of the Group’s capital management is to maximize shareholder value. The Group manages its capital structure and makes adjustments in light of changes in economic conditions.", "citations": ["a16b10cd236ce1d89231a2cd8b228af2", "87f467932cd2d82eeb492c9506061b61", "a1ac8431a6e75b0c775f6d17d8390b8f", "05ef63453a242cc5171aa0694473e292", "a69c0a3227d62e525282611c314e55cb", "0839fa67030f3827a81b3aee78c6e4c6", "fb5ac1cb7b1c13697cecc5f276d77c59", "bf87bf70cb4389163f0f284c197c7e27", "2a20a672990cde85121d390d4acc4b8a", "f5cd995d4a4de4986b59b6a99b23887c", "0edea313f793c6516067156f3fb4468b", "22d804a79fdf9f190ac636f13e740b2a", "4e8f24255a2577f32292a5ad406a6241", "9c97d05aefc06a4802e7451d3a7efc86", "84c9bb1098900790a24f1e876cab92c3", "423092c5f5d47c9c71e3fa8ab9fc4952", "4ddc4b7884e2fe1ff0084784585c63d5", "710435933a32de39d231946786ad9c42", "16e87e21c8078411b909e772448dff81", "da24477a98830f4817f59bba546ca03c", "5d9a4d9be3acd1d239cdd1c4a8e54454", "9a4d153598bd23713a9a023aa2201cfb"]}}, {"topic": "Governance Structure", "['2024']": {"answer": "bedbf174f7560de003bf8b36532635fc --> The document references the roles of various committees such as the Audit Committee, Nomination and Remuneration Committee, and Stakeholders Relationship Committee, highlighting the governance structure in place for overseeing different aspects of the company's operations.\n\n2aa904d521aca7a1f897b965e92806b1 --> The document discusses the governance structure, specifying that Mr. Mukesh Bhandari is not liable to retire by rotation as per Article 109 of the Articles of Association of the Company.\nThis highlights the specific governance provisions applicable to certain directors.\n\n53cd1f4c7e0956e5d1724ec920eb5b5c --> CS Arvind Gaudana or CS Bhavya Gaudana has been appointed as the Scrutinizer to oversee the electronic voting process.\n\na1ac8431a6e75b0c775f6d17d8390b8f --> Mr. Mukesh Bhandari retires by rotation at the 38th AGM and offers himself for re-appointment, indicating the governance practice of rotation and reappointment of directors.\n\n1ee5091d43db803b4fce49fd597b37f3 --> The document outlines the composition of the Audit Committee and mentions the presence of independent directors, indicating the company's governance structure.\n\n86c7f8b2273cc9bd2282db2fbf7656a0 --> The interim order included provisions for joint signature of Mr. Siddharth Bhandari in bank accounts and policy decisions, affecting the company's operations as a going concern.\n\n99aee268ee205cd0dc9d158424de6adf --> The petition filed with the NCLT seeks to suspend voting rights and maintain Mr. Siddharth Bhandari's status, highlighting internal governance disputes.\nThe involvement of the Hon’ble National Company Law Tribunal (NCLT) and the orders made regarding the company's Annual General Meeting and petition outcomes indicate ongoing governance-related challenges.\n\n05ef63453a242cc5171aa0694473e292 --> The involvement of the Registrar of Companies and the Regional Director in addressing violations of the Companies Act suggests scrutiny of the company's governance structure.\n\nad4ff284f06d1d458e5673108e3958de --> There are adequate systems and processes in the Company, commensurate with its size and operations, to monitor and ensure compliance with applicable laws, rules, regulations, and guidelines.\n\n8fd34023ce26e940117df4d491009c95 --> The Nomination and Remuneration Committee has carried out the annual evaluation of performance of the Board and its Committee, and a separate meeting of the Independent Directors reviewed the performance of Non-Independent Directors, Chairman, and the Board as a whole.\n\na69c0a3227d62e525282611c314e55cb --> The Company has established a well-defined process of risk management, identifying and assessing various risks, formulating risk mitigation strategies, and implementing them in a structured manner.\nThey also have an adequate system of internal control and internal audit commensurate with its size and nature of operations.\n\neeca27eff30b317b2d1757c93b7f7d8e --> The directors' skills in strategic and general management, finance, risk, legal, and compliance indicate a focus on maintaining a robust governance structure.\n\nfda97676325c3d82be143130702085af --> The Audit Committee comprises of three Independent Directors, ensuring compliance with governance norms as per Regulation 18 of the Listing Regulations and Section 177 of the Companies Act, 2013.\nThe roles and powers are structured to oversee and review relevant information.\n\nfb5ac1cb7b1c13697cecc5f276d77c59 --> The committee is involved in the formulation of a policy relating to the remuneration of directors, key managerial personnel, and other employees, as well as evaluating the performance of Independent Directors and the Board.\n\nbf87bf70cb4389163f0f284c197c7e27 --> The Nomination and Remuneration Committee consists of three directors, all of whom are Independent Directors.\nThe committee is chaired by Mr. Pratap Mohan, with Mr. Dinesh Mukati and Ms. Nivedita R. Sarda as members.\nThe Company Secretary acts as the Secretary to the Committee.\n\ncd7a332ef291f4c3f91ed03f715d2931 --> The Stakeholders Relationship Committee comprises Ms. Nivedita R. Sarda as Chairperson (Non-Executive & Independent Director), Mr. Pratap Mohan (Non-Executive & Independent Director), and Mr. Shailesh Bhandari (Executive Director).\n\n17929004f402717a3dd1448f979df1c9 --> The Company has constituted a Management Committee on 29th October, 2007. The terms of reference of Management Committee includes to look into the day to day functioning and exercise of delegated power of the Board for matters relating to operations...\n\n82397ef94da2d3eac250090a1caad074 --> The committee comprises Mr. Shailesh Bhandari as Chairman (Executive Director) and Mr. Dinesh Mukati and Mr. Pratap Mohan as Members (Non-Executive & Independent Directors).\n\n3dc7dec237d1a43706db0bbf19cd1b18 --> The NSE and BSE granted a waiver for the delayed submission for the quarter ending September 2021, while waiver applications for the quarters ending March 2021 and June 2021 are still pending.\n\ne848573010abddb5db574b93f109f6e1 --> The Internal Auditor regularly reports to the Audit Committee, and the Board has addressed the auditors' qualifications of the financial statements for the financial year 2023-2024.\n\nd30777d6f40f0a797d65d3be4a808097 --> The details are included in the notes to accounts of the Financial Statements.\n\naeee14f9263e4c564196fe3cc046661d --> The procedure for the postal ballot, including shareholder communication and voting instructions, reflects the company's governance structure and practices in ensuring shareholder involvement in major decisions.\n\n0edea313f793c6516067156f3fb4468b --> The independent auditor's report was annexed, which typically includes evaluation of the governance structure.\n\n7a1ae82b0dcbe2110abf82aed06a0ed5 --> The document lists detailed ownership stakes held by individuals categorized as promoters and promoters group, indicating the governance structure in terms of share distribution among key individuals.\n\n4e8f24255a2577f32292a5ad406a6241 --> Notes to standalone financial statements imply attention to governance structure and practices.\n\n272a94f222dfe338693c482d2075f6a8 --> Dues to Enterprise Owned or Significantly Influence by Key Managerial Personnel or Their 0.00 0.00\n\n8bf2237ba26dbcf106c2ffb172128580 --> The Petitioners filed applications to restrain board meetings and requested joint signatures in bank accounts, indicating disputes related to governance decisions.\nThe NCLT and NCLAT dismissed these applications and appeals.\n\n52baa1a40b43fc7c25c770c03ea596e3 --> The document details legal proceedings initiated by members of the Promoter group against the company, highlighting issues related to voting rights and the governance process at the company's Annual General Meeting. The involvement of the National Company Law Tribunal underscores the governance challenges faced by the company.\n\ndd919bffdee6a5eaeffd57cc30a225a8 --> The text describes legal disputes and orders by the Hon’ble NCLT, NCLAT, and the Supreme Court of India regarding joint signatures in bank accounts and governance decisions, highlighting ongoing governance challenges within the company.\n\n423092c5f5d47c9c71e3fa8ab9fc4952 --> The document provides insights into the governance structure by detailing the terms and conditions of transactions with related parties, emphasizing that the outstanding balances at year-end are unsecured and settled in cash, with no guarantees provided or received.\n\n28a1fd8601801b19838b199defb32a27 --> The notes to the standalone financial statements indicate a structured approach to financial management and reporting, which is part of the governance structure.\n\n686f78031b03267f097560359498b40d --> The report discusses the statutory obligations under the Companies (Auditor’s Report) Order, 2020, which influences the governance structure through regulatory compliance.\n\n4ddc4b7884e2fe1ff0084784585c63d5 --> The reliance on unaudited financial statements provided by the management and the indication that the opinion is based on this information highlights an aspect of the governance structure where management plays a pivotal role in financial reporting and decision-making.\n\n710435933a32de39d231946786ad9c42 --> The design, implementation and maintenance of adequate internal Financial controls that were operating effectively for ensuring the accuracy and completeness of the accounting records.\n\n6bea57b36022325f46be10f21eea3511 --> The management of the Holding Company, its subsidiary companies, and joint venture company in India have represented that no funds have been advanced, loaned, or invested in other entities with the expectation of direct or indirect lending or investing back into the Group, as disclosed in Note No 40 to the consolidated financial statements.\n\nf544289d0e94a190dbc5bd51297b7145 --> The Holding Company, its subsidiary companies and joint venture maintain adequate internal financial controls over financial reporting, which were operating effectively as of March 31, 2024, based on established criteria.\n\n03975633ddd520d978ad0397fae4193c --> We have strengthened our governance structure to enhance transparency and accountability, ensuring robust corporate governance practices.\n\naf4dfed95146d50c9ffa5830cc4f9de3 --> Bhaskarpara Coal Company Limited is a joint venture company in India with a 52.63% ownership interest as of March 31, 2024.\n\n5d9a4d9be3acd1d239cdd1c4a8e54454 --> The Assistant Director, Directorate of Enforcement, filed a case against the holding company and its executives under the Prevention of Money Laundering Act. The case is currently pending at the prosecution evidence stage.\n\n6ee50d03b342adf8d9faffbec7bbcc0a --> The Ministry of Coal ordered the de-allocation of the coal block, and the Supreme Court ordered its cancellation.\nConsequently, the company no longer has business operations and is not considered a going concern.\nThe legal proceedings and de-allocation impact the governance and management of the company, reflecting on its governance structure.\n\n1226c472813f1ae8c9407c40974644db --> The investigation was mandated by the office of Regional Director and is being challenged in court, indicating issues related to governance and compliance with legal requirements.\n\n2cb767cf19edc48fc4e31cb03584e80c --> Loans or advances in the nature of loans are granted to promoters, directors, KMPs and the related parties that are repayable on demand or without specifying any terms or period of repayment.\n\n5624888742fce34202276f0bff93af21 --> The governance structure includes a mix of executive, non-executive, and independent directors, indicating a diverse board composition.\n\n4b4a0b4bb88218fc9186dc190d1e1880 --> Terms and conditions of transactions with related parties: Outstanding balance at the year end are unsecured and settlement occurs in cash. There have been no guarantee provided or received for any related party receivables or payables.\nThe cumulative amount of the impairment on investment in joint venture as on March 31, 2024 is Rs 2.13 Crore (March 31, 2023 Rs 2.13 Crore).\n\n0ce44214a086934238f4a60436911bba --> Details on the governance structure are provided, including roles and responsibilities of various committees and their contributions to effective governance.", "citations": ["bedbf174f7560de003bf8b36532635fc", "2aa904d521aca7a1f897b965e92806b1", "53cd1f4c7e0956e5d1724ec920eb5b5c", "a1ac8431a6e75b0c775f6d17d8390b8f", "1ee5091d43db803b4fce49fd597b37f3", "86c7f8b2273cc9bd2282db2fbf7656a0", "99aee268ee205cd0dc9d158424de6adf", "05ef63453a242cc5171aa0694473e292", "ad4ff284f06d1d458e5673108e3958de", "8fd34023ce26e940117df4d491009c95", "a69c0a3227d62e525282611c314e55cb", "eeca27eff30b317b2d1757c93b7f7d8e", "fda97676325c3d82be143130702085af", "fb5ac1cb7b1c13697cecc5f276d77c59", "bf87bf70cb4389163f0f284c197c7e27", "cd7a332ef291f4c3f91ed03f715d2931", "17929004f402717a3dd1448f979df1c9", "82397ef94da2d3eac250090a1caad074", "3dc7dec237d1a43706db0bbf19cd1b18", "e848573010abddb5db574b93f109f6e1", "d30777d6f40f0a797d65d3be4a808097", "aeee14f9263e4c564196fe3cc046661d", "0edea313f793c6516067156f3fb4468b", "7a1ae82b0dcbe2110abf82aed06a0ed5", "4e8f24255a2577f32292a5ad406a6241", "272a94f222dfe338693c482d2075f6a8", "8bf2237ba26dbcf106c2ffb172128580", "52baa1a40b43fc7c25c770c03ea596e3", "dd919bffdee6a5eaeffd57cc30a225a8", "423092c5f5d47c9c71e3fa8ab9fc4952", "28a1fd8601801b19838b199defb32a27", "686f78031b03267f097560359498b40d", "4ddc4b7884e2fe1ff0084784585c63d5", "710435933a32de39d231946786ad9c42", "6bea57b36022325f46be10f21eea3511", "f544289d0e94a190dbc5bd51297b7145", "03975633ddd520d978ad0397fae4193c", "af4dfed95146d50c9ffa5830cc4f9de3", "5d9a4d9be3acd1d239cdd1c4a8e54454", "6ee50d03b342adf8d9faffbec7bbcc0a", "1226c472813f1ae8c9407c40974644db", "2cb767cf19edc48fc4e31cb03584e80c", "5624888742fce34202276f0bff93af21", "4b4a0b4bb88218fc9186dc190d1e1880", "0ce44214a086934238f4a60436911bba"]}}, {"topic": "ESG Performance", "['2024']": {"answer": "01165d97021a541982cea845fddf87a2 --> The report provides insights into the company's ESG performance, including efforts to improve environmental and social factors in their operations.\n\n423092c5f5d47c9c71e3fa8ab9fc4952 --> The assessment of impairment on investment in subsidiaries and joint ventures, as well as the provision for doubtful debts relating to related parties, is based on examining the financial position of the related party and the market in which it operates, indicating a consideration of ESG factors in financial assessments.\n\nc25ec44b36bc8b12fdc50f474b0d0430 --> The document provided an overview of the company's ESG performance, noting improvements in social responsibility metrics.\n\n7ff5c702752f308915761969cfa00db3 --> The report mentions initiatives and performance metrics related to environmental stewardship, social responsibility, and governance practices.\n\n03975633ddd520d978ad0397fae4193c --> Our ESG performance this year showed significant improvement, particularly in reducing emissions and enhancing social welfare programs.\n\nd38cec18d08a1f194a63199ed697da01 --> The annual report provides an overview of the company's ESG performance, indicating improvements in environmental and social governance metrics over the past year.\n\nd27c96e38adbd61c66086f9102318f65 --> The report includes data and strategies implemented to enhance ESG performance, such as reducing carbon emissions and improving workplace diversity.\n\n0ce44214a086934238f4a60436911bba --> The report provides an overview of the company's ESG performance, highlighting improvements in environmental and social metrics.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> There is a section that assesses the company's ESG performance, indicating improvements in environmental and social metrics.", "citations": ["01165d97021a541982cea845fddf87a2", "423092c5f5d47c9c71e3fa8ab9fc4952", "c25ec44b36bc8b12fdc50f474b0d0430", "7ff5c702752f308915761969cfa00db3", "03975633ddd520d978ad0397fae4193c", "d38cec18d08a1f194a63199ed697da01", "d27c96e38adbd61c66086f9102318f65", "0ce44214a086934238f4a60436911bba", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}, {"topic": "CSR Initiatives", "['2024']": {"answer": "1166fc3c2af090f46bdaf1810921ed1e --> Over Rs 100 Crore were allocated to CSR activities aimed at improving educational infrastructure and healthcare access in rural areas.\n\n735a0e47bb03a23da76ef3518e7e3d92 --> Community development and educational programs are central to the company's CSR initiatives.\n\n3e39c351ce3e6eb08fb88b0c3b9a6b1f --> Specific CSR projects and their impacts on local communities are discussed, showcasing the company's dedication to social responsibility.", "citations": ["1166fc3c2af090f46bdaf1810921ed1e", "735a0e47bb03a23da76ef3518e7e3d92", "3e39c351ce3e6eb08fb88b0c3b9a6b1f"]}}]}]