[{"theme": "Operational Performance and Efficiency", "topics": [{"topic": "Production rate stabilization", "data": {"['Q3', '2024']": {"answer": "5eb75666197a2bc7ca495a94e2314c7b --> We have been making good progress on stabilizing production and preparing for 38 per month by year-end, but those objectives will now take longer due to the IAM work stoppage.\n\nd783af299b516ab59449b257510d5fad --> We expect to exit next year with real momentum in the business as we return to normal production rates.\n\n55f000a509fc41a563d4ad78a931cb4d --> The program is currently producing at four per month and still plans to return to five per month by year-end.\n\n657e7535dadbdcf7426cd02cb6c0914e --> Our expectation is, once we get back to work, we ramp production and move through next year, we'll get back on track. And then, we'll be having discussions with regulator about increasing beyond 38 per month.", "citations": ["5eb75666197a2bc7ca495a94e2314c7b", "d783af299b516ab59449b257510d5fad", "55f000a509fc41a563d4ad78a931cb4d", "657e7535dadbdcf7426cd02cb6c0914e"]}, "['Q1', '2023']": {"answer": "bfea1096d2c67d17d85619b90386bf30 --> We expect to deliver between 70 and 80 737 MAX airplanes per month by the end of the year.\n\nbfea1096d2c67d17d85619b90386bf30 --> We are planning to ramp up 787 production to five per month by the end of next year.\n\nad054e8b5c39a63d395214ecf74e8751 --> We still expect to deliver 450 737 airplanes this year.\n\nad054e8b5c39a63d395214ecf74e8751 --> Deliveries and production will be lower near-term, but will recover over the coming months, and we plan to increase our rate to 38 per month later this year.\n\na7446e00cf71219ad9ee8136510f09c4 --> We still expect to deliver between 400 and 450 737s this year.\n\neb9583c21edd10dea4a2e618daff19ad --> We had 11 deliveries in the first quarter and still expect 70 to 80 deliveries this year.\n\neb9583c21edd10dea4a2e618daff19ad --> We're producing at three per month and still plan to reach five per month by year-end.\n\n4b031b651b8b76982c9c092aa4429a6e --> April and 2Q deliveries will be lower, but the first half monthly average will be about 30 airplanes per month, in line with what we said previously.\n\n4b031b651b8b76982c9c092aa4429a6e --> The second half deliveries are expected to be around 40 per month with sequential quarterly improvement in the back half.\n\n4b031b651b8b76982c9c092aa4429a6e --> Within final assembly, as Dave mentioned, we expect to increase our rate to 38 per month later this year, and 50 per month in the 2025/2026 timeframe.\n\nf345bc1f206491e11dde9083d9071d59 --> Our goal is to increase production rates of the 737 to 38 per month by mid-next year.\n\n2b7367e4734479849f3813df67fffb59 --> We have a team that works full-time planning the new routings in the factories and we're confident we can get to 10.\n\n2b7367e4734479849f3813df67fffb59 --> I don't think – not only don't think, we don't see a big demand on investment to get us from what you noted as 7 to 10, so it's just going to take us time, and we've got to remove that join verification effort from our business.\n\nca99d069c8a411f60fbea5ee65b9f641 --> And we are defining the scope of that work and, again, measured in a few weeks, not measured in months.\n\nc1b120e77107eccad48d908c9a12ceec --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co.\n\na207bc8a149e52c9dfd951741c05a467 --> [Inferred as CEO][2024 rather – liquidated by 2024.]\n\n64b75e38b8e657df4ada7d5d9df67601 --> On the first quarter, 787 deliveries were a little light. We'll make that back up in the rest of the year.\n\nc1d2a37f644014687dce2278fa5f8446 --> And then in the second quarter, as I mentioned, we'll be in more of a break-even position largely because of the 737s that are going to push-out. But, again, it's going to be back half benefit.\n\n8413ad1a0e3e3b1521c1473af54b2903 --> We're perfectly comfortable, keeping everyone at pace and holding little buffer. We think that's a better alternative than keeping it a little bit too close to the wire, and we're going to keep having that posture and that's going to help us get to 38 and then beyond.", "citations": ["bfea1096d2c67d17d85619b90386bf30", "ad054e8b5c39a63d395214ecf74e8751", "a7446e00cf71219ad9ee8136510f09c4", "eb9583c21edd10dea4a2e618daff19ad", "4b031b651b8b76982c9c092aa4429a6e", "f345bc1f206491e11dde9083d9071d59", "2b7367e4734479849f3813df67fffb59", "ca99d069c8a411f60fbea5ee65b9f641", "c1b120e77107eccad48d908c9a12ceec", "a207bc8a149e52c9dfd951741c05a467", "64b75e38b8e657df4ada7d5d9df67601", "c1d2a37f644014687dce2278fa5f8446", "8413ad1a0e3e3b1521c1473af54b2903"]}, "['Q3', '2022']": {"answer": "b2180171fc07e1227428aca8c00ce92c --> We expect to increase production of the 737 MAX to 31 per month by the end of the year.\n\n6b25109bf1a36f313ab66012bab0b0c7 --> Inferred as CEO or CFO: Based on the latest assessment of China, and the dash-7, dash-10 certification timelines, we now expect most of the inventoried airplanes to deliver in 2023 and 2024 with some moving into 2025.\n\n19d31ac6399ba3db72aa4790e4a9d140 --> We expect most of these airplanes to be delivered over the next two years.\n\n19d31ac6399ba3db72aa4790e4a9d140 --> We continue to produce at low rate and will gradually return to five airplanes per month over time.\n\n19d31ac6399ba3db72aa4790e4a9d140 --> We now estimate about 375 737 airplanes this year.\n\n19d31ac6399ba3db72aa4790e4a9d140 --> The monthly delivery trend is expected to remain in the low-30s into next year.\n\n7bde5ff8cf34ef21966f55de292d9ad7 --> And what I would say is that my comment on being in the low-30s, year-to-date, we've been in the low-30s. And as we turn the quarter into next year, that all of a sudden isn't going to snap up to a 40-type number. So it's going – into the year, we're going to be constrained, as Dave mentioned, largely by the engines, and it'll be that low-30s. But as we get through next year, that rate will go up. And we'll talk a lot more about that next week.\n\ne22be340eea3848f37b6ce805c173e14 --> The company plans to achieve \"8 to 10 out of storage\" on a monthly basis.\n\ne513c82121b2fc699ca1e69bc6a675d9 --> We have high confidence that they will get done what they need to do to get those inventoried airplanes in the customers' hands over the next two years.\n\n89602269249381b687e183440752e023 --> I think it's going to take probably all of next year before things really do begin to stabilize...", "citations": ["b2180171fc07e1227428aca8c00ce92c", "6b25109bf1a36f313ab66012bab0b0c7", "19d31ac6399ba3db72aa4790e4a9d140", "7bde5ff8cf34ef21966f55de292d9ad7", "e22be340eea3848f37b6ce805c173e14", "e513c82121b2fc699ca1e69bc6a675d9", "89602269249381b687e183440752e023"]}, "['Q4', '2023']": {"answer": "4d0f222e20f7e2a9757b88b85780fdcf --> Today, we're producing 737s at a rate of 38 per month and we will remain at that rate until the FAA and Boeing is satisfied with our quality of manufacturing process.\n\nd4d60f587ecdd44731062395ae971fa2 --> We expect to deliver between 400 and 450 737 MAX airplanes in 2024.\n\na1029540bec6ab009f4e43b0b2e4da5a --> Per the FAA announcement, we'll maintain production at 38 per month, and we're transparently with the FAA to complete all requirements for future increases.\n\n25e974b1fb04e58b1284bc5a7487e38c --> We still expect to return to the strong historical performance levels as we roll in new contracts with tighter underwriting disciplines and we move into the 2025/2026 timeframe.\n\n7299593902d655626c032c586dfc3268 --> We still expect to deliver most of these airplanes by year-end, as we work towards shutting down the shadow factory.\n\n7299593902d655626c032c586dfc3268 --> We expect these to deliver in 2024.\n\n7299593902d655626c032c586dfc3268 --> The program successfully transitioned production to five per month in the quarter and still plan to steadily work our way to 10 per month in the 2025/2026 timeframe.\n\n7299593902d655626c032c586dfc3268 --> We still expect to deliver most of these airplanes by year-end, as we finish the rework and shut down the shadow factory.\n\ndd7e582e7b18cbd39feecfdbdb053db2 --> We'll produce at five per month rate, like we described.\n\n10badb8567497972187a62e894b305b1 --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co.", "citations": ["4d0f222e20f7e2a9757b88b85780fdcf", "d4d60f587ecdd44731062395ae971fa2", "a1029540bec6ab009f4e43b0b2e4da5a", "25e974b1fb04e58b1284bc5a7487e38c", "7299593902d655626c032c586dfc3268", "dd7e582e7b18cbd39feecfdbdb053db2", "10badb8567497972187a62e894b305b1"]}, "['Q2', '2024']": {"answer": "5efc6fe386130aafb0bba53d8eeb7984 --> We gradually increased during the quarter and still expect to be higher in the second half as we move to 38 per month by year-end.\n\n5efc6fe386130aafb0bba53d8eeb7984 --> We expect approximately 10 more delivered in the month of July.\n\n5efc6fe386130aafb0bba53d8eeb7984 --> We still expect to deliver most of these airplanes by year-end as we work towards shutting down the shadow factory.\n\n659063b0402f7e46b315e1c84c3ae4d9 --> We expect these working capital timing impacts will begin to unwind as deliveries and production stabilize later this year.\n\ncd652c99a1389d1b212bf70e4038fe89 --> The program produced below five per month in the quarter as expected, and still plans to return to five per-month by year-end.\n\ncd652c99a1389d1b212bf70e4038fe89 --> We still expect to finish the rework and shutdown the shadow factory by year-end with most of these airplanes delivering this year.\n\n866f134e5fec97489ef30db511816753 --> we believe that we will be able to fill that third line and we believe that we'll be able to get to that 38 per month as we get to the back half of the year.\n\nb65af7358a7c1a52a08d299a64b28a4c --> July we'll do somewhere in that zip code.\n\ncb09db5b3d214bc282a6971e15dd10ca --> We do believe that we'll get to that five per month as we get to the end of the year.\n\n21121057c22b083dc531befcfacc2c6a --> In the fourth quarter, we're going to have stronger deliveries. We're going to have real working capital improvement.\n\n8f60b40a6e26634f9ec9e1cdbd4f7b18 --> We feel good about the progress we've made and we've got proof points that says we've got a real ability to hit our 38 per month as we exit the year.", "citations": ["5efc6fe386130aafb0bba53d8eeb7984", "659063b0402f7e46b315e1c84c3ae4d9", "cd652c99a1389d1b212bf70e4038fe89", "866f134e5fec97489ef30db511816753", "b65af7358a7c1a52a08d299a64b28a4c", "cb09db5b3d214bc282a6971e15dd10ca", "21121057c22b083dc531befcfacc2c6a", "8f60b40a6e26634f9ec9e1cdbd4f7b18"]}, "['Q4', '2020']": {"answer": "df2dc74c44942d82adad514d5a25b15e --> We expect to deliver around 400 aircraft in 2021.\n\n05f9120679a33a7fe278c74eec42e790 --> We expect 787 deliveries to resume later this quarter.\n\n05f9120679a33a7fe278c74eec42e790 --> It will be back-end loaded with no delivery this month and most likely very few, if any, in February.\n\n05f9120679a33a7fe278c74eec42e790 --> We still expect to deliver the vast majority of the 787 aircraft inventory by the end of the year.\n\n05f9120679a33a7fe278c74eec42e790 --> We are transitioning to a rate of five per month in March, at which point 787 final assembly will be consolidated to Boeing South Carolina.\n\n05f9120679a33a7fe278c74eec42e790 --> We now anticipate that the first 777X delivery will occur in late 2023.\n\n9762e5eab8895f180ae95cc45264e3ac --> Our production rate expectations for the combined 777/777X program remains at two per month in 2021.\n\n9762e5eab8895f180ae95cc45264e3ac --> We expect to gradually increase the rate to 31 per month in early 2022, and we expect further gradual increases to correspond with market demand.\n\na1d0ee61f60a0ff507f760bc0e827128 --> Based on what we know today, we anticipate that we will unwind the vast majority of these aircraft during 2021.\n\n58d9d6fa2d3a507c98ae634b65165c17 --> On the P&L side, we also expect improvement in 2021 primarily driven by higher commercial deliveries, absence of 2020 charges, and improved performance and benefits from continued business transformation efforts.\n\na852ea900986089120a1eb50b0728c28 --> We talked about changing corp costs for the aircraft that are currently built as well as we'll have the rate much lower through this period between now and 2023 and the change incorp associated with those.\n\nd52ba272099bd40261d3fbeea100f5fc --> I do anticipate us being through our inventory in 2022 on the MAX.\n\n3a3a5dd1ea951032aa1fd690a135e823 --> Q1 will be the biggest use and little bit less in Q2, and then it will start to moderate through Q3 and Q4.\n\n6c5daed9b63f59e60a54a2e660e2dba8 --> We expect to deliver the majority of that 80 through the balance of 2021. And it will be back-loaded, as Dave indicated, on our current assumptions of when we believe we can start deliveries. So there will still be some burn-off in 2022, but like I said, the majority of that will be in 2021 and be back-loaded associated with that.", "citations": ["df2dc74c44942d82adad514d5a25b15e", "05f9120679a33a7fe278c74eec42e790", "9762e5eab8895f180ae95cc45264e3ac", "a1d0ee61f60a0ff507f760bc0e827128", "58d9d6fa2d3a507c98ae634b65165c17", "a852ea900986089120a1eb50b0728c28", "d52ba272099bd40261d3fbeea100f5fc", "3a3a5dd1ea951032aa1fd690a135e823", "6c5daed9b63f59e60a54a2e660e2dba8"]}, "['Q1', '2022']": {"answer": "f0e66d9c0d6eb12fbbfee32d9366787d --> First, we anticipate reaching key delivery milestones. On the 87, we're on a path to restart deliveries, in the near term. On the 37, we continue to work towards resuming MAX deliveries, to Chinese customers.\n\nb351d545f567609c15cae20ca2f97581 --> As we stated last quarter, we're producing at very low rates and will continue to do so until deliveries resume, gradually returning to five airplanes per-month over time.\n\n14a1e92f9a69f5f8a1cfabd056049a0f --> We still anticipate delivering most of these airplanes by the end of 2023.\n\nfa71e042c44da344fe37a5c3050b6c20 --> Our biggest job right now is to stabilize around that rate. The teams are working hard. They deal with supply constraints that pop-up every now and then, but we've got to be stable around 31 and then anything else is going to be a future decision that we're not prepared to take because we just want to get confidence in what's right in front of us.\n\n282d52a8990e65e0b0077a63c9bd9b6d --> And we have other airplanes and substitution that we could implement and that decision has to get made sometime between now and the end of the year.\n\n725fcd65bafc2467aff468597f206139 --> Brian J. West, Chief Financial Officer & Executive Vice President, Finance, The Boeing Co.", "citations": ["f0e66d9c0d6eb12fbbfee32d9366787d", "b351d545f567609c15cae20ca2f97581", "14a1e92f9a69f5f8a1cfabd056049a0f", "fa71e042c44da344fe37a5c3050b6c20", "282d52a8990e65e0b0077a63c9bd9b6d", "725fcd65bafc2467aff468597f206139"]}, "['Q1', '2024']": {"answer": "a68cbca6c0551ea853f5070606c8f75b --> Production will remain below 38 per month for the first half of the year and will be higher in the second half, as we move back to 38 per month where the timing of rates beyond 38 predicated on the work we're doing with the FAA.\n\n2efeca20888de03b52c84e01aceebfb1 --> By the end of this year, we expect to have largely delivered our 737 and 787 inventory, effectively shutting down our two, large shadow factories.\n\n05dc6e8addcc7e3c70cfea1477105aca --> We are targeting a 20% increase in production rates for the 737 line by the second half of 2024.\n\n2f5475b95c2a76b57d1e8d6be69b5ccd --> We still expect to deliver most of these inventoried airplanes by year-end as we work towards shutting down the shadow factory.\n\n2f5475b95c2a76b57d1e8d6be69b5ccd --> We're slowing near-term production and plan to return to five per month later this year.\n\n2f5475b95c2a76b57d1e8d6be69b5ccd --> We expect to achieve rate increases including 10 per month by 2026.\n\n2f5475b95c2a76b57d1e8d6be69b5ccd --> We still expect to finish the rework airplanes and shutdown the shadow factory by year-end, with most of these airplanes delivering in the year.\n\n935356fc0b5a25eba842aec1e721c59a --> We still expect to return to the strong historical performance levels as we roll in new contracts with tighter underwriting disciplines as we move into the 2025/2026 timeframe.\n\nef84e51ec53e60c11ff7311c47ac6c3e --> If we get ourselves through 38, which is our first objective, and we do it in a steady fashion, moving up another 12 in my view is doable in the window that we're talking about.\n\na53439764f4f7a2f0a4e48916104765c --> As I said, the most important thing that occurs over the next six months or frankly starting in January when we launch this effort is going to be the pace at which clean fuselages come out of Wichita.\n\n7147922025bb989444908204c946bc0a --> I fully expect for them to come up to rate with clean fuselages here as we get into the second half.\n\n2e835e54d481fba982c1f53329123fcf --> We will continue to pace final assembly in line with that master schedule so that we don't sacrifice stability because what we're talking about is a very important near-term investment that we have to stay laser-like focused on so that we don't take a step back, and that's what we're focused, and we believe that we can handle the cash flow fluctuations as we get through the first half, into the second half and position ourselves for 2025.\n\n7c8896522e1770e45ef729ef91e8d8cc --> The improvement plan that we all see gets us where we need to be by the fourth quarter, and we have a lot of confidence in it.\n\nae341379614e5dc465f1fa5ce02f3b1b --> We have a rate increase plan. And as everyone knows, it gets us up to 50 here as we get into that 2025/2026 window.", "citations": ["a68cbca6c0551ea853f5070606c8f75b", "2efeca20888de03b52c84e01aceebfb1", "05dc6e8addcc7e3c70cfea1477105aca", "2f5475b95c2a76b57d1e8d6be69b5ccd", "935356fc0b5a25eba842aec1e721c59a", "ef84e51ec53e60c11ff7311c47ac6c3e", "a53439764f4f7a2f0a4e48916104765c", "7147922025bb989444908204c946bc0a", "2e835e54d481fba982c1f53329123fcf", "7c8896522e1770e45ef729ef91e8d8cc", "ae341379614e5dc465f1fa5ce02f3b1b"]}, "['Q1', '2021']": {"answer": "39751b87d489f067f9c4dea8d0f77cde --> We expect to gradually increase the rate to 31 per month in early 2022 with further gradual increases corresponding with market demand.\n\n39751b87d489f067f9c4dea8d0f77cde --> We still expect to deliver the majority of the 787 aircraft currently in inventory by the end of the year.\n\ne08d8021a60a3a96ebb57557cf0f5aa8 --> As planned, we are transitioning the combined 777/777X production rate to two per month.\n\n6662216893574f5ae2c92be0394cf880 --> We expect to catch up on deliveries over the balance of the year.\n\nc903d5d4bb0e937fb6f13ac6bc2a73f0 --> We estimated that around half of the approximate 450 aircraft we had in storage would be delivered by the end of 2021 and the majority of the remaining by the end of the following year. That estimate is unchanged.\n\n1e6ee1f74e0c90363114ddd7b2434b3a --> [Inferred as CEO][Based on what we know today, we still anticipate that we will deliver the majority of these airplanes during 2021.]\n\nf432b7920236932c124d9f6dbed67f80 --> Revenue improvement from 2020 to 2021 will be driven mainly by higher 737 and 787 deliveries as we plan to unwind inventory and deliver from the production lines.\n\na857216a857bbcf49732ecd653860dd8 --> We're going to be at a rate probably this month at 10 or 12 airplanes.\n\ne264d07b88f365dab82034d9cb3a5818 --> Right now we've got a schedule lined up with – by tail number, by month, by customer that gets the majority of the 100 inventoried aircraft delivered by the end of the year.", "citations": ["39751b87d489f067f9c4dea8d0f77cde", "e08d8021a60a3a96ebb57557cf0f5aa8", "6662216893574f5ae2c92be0394cf880", "c903d5d4bb0e937fb6f13ac6bc2a73f0", "1e6ee1f74e0c90363114ddd7b2434b3a", "f432b7920236932c124d9f6dbed67f80", "a857216a857bbcf49732ecd653860dd8", "e264d07b88f365dab82034d9cb3a5818"]}, "['Q3', '2023']": {"answer": "5a5b6031cdc82377fb2e423b2bebefff --> We're confident in the future and our path to normalizing BDS margin performance by that 2025 and 2026 timeframe is intact.\n\n7eca73d7f3198fb365c2e2b89a167644 --> We now expect 737 deliveries for the year to be in this 375 to 400 range.\n\n7eca73d7f3198fb365c2e2b89a167644 --> We plan to complete the production transition to 38 per month by the end of the year and still plan to reach the key rate of 50 per month by that 2025 and 2026 timeframe.\n\n7eca73d7f3198fb365c2e2b89a167644 --> We're now transitioning production from 4 to 5 per month and expect to meet our delivery range of 70 to 80 for the year, and longer term, we're on track for the rate step up to 10 per month by 2025 and 2026.\n\n8556d4c1d85a554dd3368cb3284c409a --> The team is executing a game plan to get BDS back to the high-single digit margins by the 2025-2026 timeframe.\n\n794f9be275b36c12735de4d72eaa02de --> Considering these latest facts, we expect October deliveries to be in line with September and now expect to deliver between 375 and 400 airplanes for the year.\n\n794f9be275b36c12735de4d72eaa02de --> We still expect most of the MAX inventory aircraft to be delivered by the end of 2024, but more are likely to split into 2025 tied to the fuselage recovery.\n\n794f9be275b36c12735de4d72eaa02de --> We expect to complete the 737 transition to 38 per month by year-end, and we're maintaining plans to increase to 50 per month in the 2025-2026 timeframe.\n\n794f9be275b36c12735de4d72eaa02de --> On the 787 program, we had 19 deliveries in the quarter and 50 year-to-date. We still expect 70 to 80 deliveries this year.\n\n794f9be275b36c12735de4d72eaa02de --> We started transitioning production to five per month in October and still plan to reach 10 per month in the 2025-2026 timeframe.\n\n862678af56f6d7188552ca53ca4189c4 --> The program timeline is unchanged and we plan to resume production later this year.\n\nf1e78948468b4a40fd0ec9d6e80842f9 --> We expect to return to the strong performance levels that we demonstrated historically on these programs as we move into the 2025-2026 timeframe.\n\nbfbc000c94d6f4962861e84a57fcfc6e --> The 737 factory should be recovered from the current nonconformance and will be stabilizing production at 38 per month with step-ups as we move to 50 per month by 2025-2026.\n\nbfbc000c94d6f4962861e84a57fcfc6e --> 787 will be stabilized in production at 5 per month with a focus on stepping up to 10 per month by 2025-2026.\n\nd9e4426e50079d359fdf7080b2059ae4 --> On 4Q specifically, we expect BCA margins to improve sequentially but remain negative more in line with 2Q and we're still not anticipating much in terms of BDS profitability.\n\n16352f5b3857ba46a519dd647159e854 --> We have kept our master schedule intact to get to that 38 a month.\n\n79fd9c931d1e3e207370cfdab90ed9b2 --> we were looking forward to a new line that should be up and running at Everett in 2025; which looks to us you have capacity for well over 60 a month.\n\n3baa5f25fc3eab86bb6b6bc894884c71 --> We'll definitely update guidance for next year as we get into the early part of next year, put these nonconformances in the rearview mirror once and for all, get to a stable rate at 38 a month. And then we're going to be anxious to build from there as fast as we can. We will give guidance based on everything we know early in that year.\n\n0cfc20bfd1cffe8de5ad95bac598049c --> Of course, we're trying get our way to 50 per month by the 2025-2026 timeframe.\n\n0cfc20bfd1cffe8de5ad95bac598049c --> And we're still focused on executing that once we can get to that 38 as we exit this year.\n\n71e59cbcfbcecdc97e1bb03681eba8a2 --> The fourth quarter is going to be sequentially better, but it's still going to be negative.\n\nf6aad16bd566fb2e0c932f25bdae940c --> All that labor that today is working on inventoried airplanes for both the 737 and the 787 is going to go be applied to these ramps in the rates up to 50 and 10 respectively in the 737 and the 787.\n\n3f1fc74d0c81bb5ffe38b62369091177 --> The production rate for 737s is expected to be at least 38 per month exiting the year, with the implication of maintaining this rate for the next year, plus additional deliveries from existing inventory.\n\nabb9307e1fd0b730466a8a1c8a73fa49 --> Deliveries are going to be higher next year.\n\n157547b3f243ae02fb47cde358f89c5d --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [And then, as we think about priming the pump for 38 per month, we're going to move towards January and beyond and hopefully some pretty good execution. So we'll have to wait and see exactly how that plays out. But the underlying system is going to stay at 38 and as we get through next year, obviously there will be certain rate ramps that we'll describe later.]\n\nb961969c1767a374e3bdea61a0d5daaa --> We're going to exit this year with a little more than 100 of the return to service airplanes that we had at the end of 2020. That is what our shadow factories are focused on in a big way to make sure that we can bleed that down to basically nothing by the end of next year.", "citations": ["5a5b6031cdc82377fb2e423b2bebefff", "7eca73d7f3198fb365c2e2b89a167644", "8556d4c1d85a554dd3368cb3284c409a", "794f9be275b36c12735de4d72eaa02de", "862678af56f6d7188552ca53ca4189c4", "f1e78948468b4a40fd0ec9d6e80842f9", "bfbc000c94d6f4962861e84a57fcfc6e", "d9e4426e50079d359fdf7080b2059ae4", "16352f5b3857ba46a519dd647159e854", "79fd9c931d1e3e207370cfdab90ed9b2", "3baa5f25fc3eab86bb6b6bc894884c71", "0cfc20bfd1cffe8de5ad95bac598049c", "71e59cbcfbcecdc97e1bb03681eba8a2", "f6aad16bd566fb2e0c932f25bdae940c", "3f1fc74d0c81bb5ffe38b62369091177", "abb9307e1fd0b730466a8a1c8a73fa49", "157547b3f243ae02fb47cde358f89c5d", "b961969c1767a374e3bdea61a0d5daaa"]}, "['Q4', '2022']": {"answer": "5885a3665e54679f45e53a7fdd92cf52 --> We still expect most inventoried airplanes will be delivered by the end of 2024.\n\n5885a3665e54679f45e53a7fdd92cf52 --> We still expect to hit five per month this year.\n\n5885a3665e54679f45e53a7fdd92cf52 --> Our total year delivery guidance of 70 to 80 is unchanged and there's no change to 2023 cash flows.\n\n076429b948e2e3cc5764b655c779aeb4 --> On the commercial delivery front, 737 deliveries are unchanged, and between 400 and 450 airplanes. 787 deliveries are unchanged, between 70 and 80 airplanes.\n\nad5ee4d12ec2c003607528c78b23c0ec --> I think it's going to take us all year to ultimately demonstrate that stability can and will be achieved.\n\n905e5724bd8ff0db46968c3c9cc04a9d --> And if you look at the 2025 or 2026 timeframe, when you are guiding to 50 airplanes a month, and you were once at 57 airplanes a month, so that would not be new territory...\n\n2cc8a20123c873eb9e3fb7988050a3b3 --> At the high-end, it actually says we do low-30s first half and then low-40s second half.\n\n2cc8a20123c873eb9e3fb7988050a3b3 --> as you guide to 31 airplanes a month of production in 2023\n\nb9523803cdd6b6670c0629ac0d388a77 --> It's going to take us a little bit longer than originally expected which is why we are going to shift out going to 5 airplanes per month a bit later in the year, but we still see 70 to 80 airplanes in the cards and so far so good.\n\nb9523803cdd6b6670c0629ac0d388a77 --> And then obviously, ramp up the factory as we get deeper into the year, but net-net, the 70 to 80 airplanes we still feel good about.\n\n72ba0fcde5c88b722c4fa7e5dc433cf2 --> David L. Calhoun, President, Chief Executive Officer & Director, The Boeing Co. [And that progression will occur over the course of the year when we are at high confidence then we're going to get to the kind of rates that are built into our guidance.]", "citations": ["5885a3665e54679f45e53a7fdd92cf52", "076429b948e2e3cc5764b655c779aeb4", "ad5ee4d12ec2c003607528c78b23c0ec", "905e5724bd8ff0db46968c3c9cc04a9d", "2cc8a20123c873eb9e3fb7988050a3b3", "b9523803cdd6b6670c0629ac0d388a77", "72ba0fcde5c88b722c4fa7e5dc433cf2"]}, "['Q2', '2021']": {"answer": "c122d7489c3223cd7e66603925243074 --> We are currently producing 16 airplanes per month and continue to expect to gradually increase the rate to 31 a month in early 2022, with further gradual increases to correspond with market demand and, importantly, supply chain capacity.\n\n65ea3dea19113ef1b3e9a712c7ad093b --> Of the approximately 100 787s currently in inventory, we expect to deliver fewer than half of them this year.\n\n91d610d84652e5c2cfb4d41f4fe8efe3 --> We announced that we will be opening two new Boeing converted freighter lines in 2022.\n\n51900ca079478d9a6c9eb8df4fdfb314 --> Just prior to the 737 MAX return to service in the US, we estimated that around half of the approximately 450 aircraft we had in storage would be delivered by the end of 2021 and the majority of the remaining aircraft by the end of 2022. That expectation has not changed.\n\n4e714b6ddd3413cb90b01dbbc8cf3ce2 --> We are ramping up in the 737 MAX program. It's 16 per month now, moving to 31 per month at the beginning of next year, and we intend to go higher obviously driven by what we see in the market beyond early next year.\n\n30006d9ebd0d4c79eea34abea8db7072 --> I think we get as high as 50 as we exit the year, and then that begins to make a big dent. And I'm pretty confident we can do that.", "citations": ["c122d7489c3223cd7e66603925243074", "65ea3dea19113ef1b3e9a712c7ad093b", "91d610d84652e5c2cfb4d41f4fe8efe3", "51900ca079478d9a6c9eb8df4fdfb314", "4e714b6ddd3413cb90b01dbbc8cf3ce2", "30006d9ebd0d4c79eea34abea8db7072"]}, "['Q2', '2022']": {"answer": "6adbe4c1e0e0e35e8677f26acd3a496d --> We continue to focus on 737 production stability of 31 MAXs per month.\n\nace1de6f6054945e6cf105dec5375451 --> We now expect deliveries to be closer to the low-400s for 2022, short of what we discussed earlier this year, as we drive stability and predictability.\n\n79f61d9a0914d4fb7269809f8bb9aca1 --> the ramp in deliveries for the MAX, which you're now saying you're going to get to the low-400s on this.\n\n1aa17391462296d26b7c64417521748a --> I do believe we're at a state now where at 31, we're comfortable the industry can get there and maybe have already gotten there, and then we're going to watch as they qualify more capacity going forward before we pull those rates up.\n\nece779098c9ab485c228135ea7877a1b --> Doing both in a stable, predictable manner gets to that low-400s for the year.\n\n5208704235423371f107a55571d1a6ee --> We're aiming at stability around 31, some months might be a little lower, some months might be a little higher.\n\n36bdeabc989a1477c33cd261124ec0e6 --> We will exercise a little extra discipline on the stability front as we begin to march up that curve over the next 18 months.\n\n39d0ccded7acd598746217491a01fbe2 --> I think that reliably month in, month out, we'll aim at 31. Anywhere from 8, 10, 12 is the range on liquidity from inventory, could be in that kind of mix and that gets you to the low-400s for the total year is the way I would think about it.\n\n39d0ccded7acd598746217491a01fbe2 --> And again, the average of 31 with respect to production is a clear objective of ours and even short of that will be disappointing. Our real objective though is to make that a stable rate in each of the months.", "citations": ["6adbe4c1e0e0e35e8677f26acd3a496d", "ace1de6f6054945e6cf105dec5375451", "79f61d9a0914d4fb7269809f8bb9aca1", "1aa17391462296d26b7c64417521748a", "ece779098c9ab485c228135ea7877a1b", "5208704235423371f107a55571d1a6ee", "36bdeabc989a1477c33cd261124ec0e6", "39d0ccded7acd598746217491a01fbe2"]}, "['Q3', '2021']": {"answer": "e27730ae1b8b86646e1508bf894f8c80 --> We increased our production rate to 19 airplanes per month and continued to progress toward a production rate of 31 per month in early 2022.\n\n861c321d82f8150cb6d87531ced848ae --> Once deliveries resume, we expect to return to five per month over time.\n\n861c321d82f8150cb6d87531ced848ae --> We now expect 2022 777 deliveries to be relatively in line with 2021.\n\ned560488719277677b85d895805ec19f --> We anticipate delivering most of these airplanes by the end of 2023.\n\n120f81b28f59719d6c1ed4c921ab5b7e --> I think as we move into next year, we're going to be quite stable on that front.\n\ne2e3d4d7624bfc893b13b85fd5993506 --> The advanced burndown will happen by the end of 2022, and it's going to naturally occur as those deliveries take place.", "citations": ["e27730ae1b8b86646e1508bf894f8c80", "861c321d82f8150cb6d87531ced848ae", "ed560488719277677b85d895805ec19f", "120f81b28f59719d6c1ed4c921ab5b7e", "e2e3d4d7624bfc893b13b85fd5993506"]}, "['Q4', '2021']": {"answer": "54fb958d6efdec79154a8d7fce66f29d --> China is preparing for their MAX return to service and for delivery, and we have set up a plan that allows for that in the first quarter.\n\n4ee665934e941e9a958f9c2fbb43b0c0 --> We plan to increase our production rate for the 737 MAX to 31 per month by the end of 2022.\n\nd7534a393299aea13365d2de19eb8450 --> As a result of increasing freighter demand, we plan to increase the combined 777/777X production rate from two to three per month this year and expect 2022 deliveries to be relatively in line with last year.\n\n03a99aaca671075ef2b143f414d9e414 --> We continue to prepare airplanes for deliveries as early as the first quarter, subject to customer and regulatory approvals in China.\n\n03a99aaca671075ef2b143f414d9e414 --> We are now producing 27 airplanes per month on our way to 31 per month early this year.\n\n03a99aaca671075ef2b143f414d9e414 --> We currently have 335 737 MAX airplanes in inventory and still anticipate delivering most of these airplanes by the end of 2023.\n\nc775c85c90de9fbfeb377f7f2bd64ea2 --> We also delivered the 50th 767-300 converted freighter and announced plans to add 10 new converted freighter lines.\n\n517373eae4af909893d1ec00fc874ece --> We've got 335 units in inventory, and that will liquidate through the year at a quarterly rate that is pretty similar to what we did last quarter.\n\n517373eae4af909893d1ec00fc874ece --> And then the production ramp, as you know, Myles, is going to go from 26 to 31 fairly soon.\n\nc5059f3e9d30012f5caa2790780c300a --> In terms of your question on MAX deliveries, so I go back to where we were last quarter and we kind of had a ballpark what that would look like. That hasn't changed. And again, if we continue to liquidate the inventory at about the rate that we did last quarter and you then have the production ramp go from 26 to 31, it kind of gets us to a spot where we have a pretty good profile of what that's going to look like through the year, with a one caveat is that first quarter is probably going to be a little slow, one, because it usually is and, two, because we like others are wrestling with this Omicron.\n\nf4d4469b9299911b59f2cf1e0622c39c --> We do expect that there will be a relatively sharp acceleration in the back half of the year as we begin to liquidate this inventory.", "citations": ["54fb958d6efdec79154a8d7fce66f29d", "4ee665934e941e9a958f9c2fbb43b0c0", "d7534a393299aea13365d2de19eb8450", "03a99aaca671075ef2b143f414d9e414", "c775c85c90de9fbfeb377f7f2bd64ea2", "517373eae4af909893d1ec00fc874ece", "c5059f3e9d30012f5caa2790780c300a", "f4d4469b9299911b59f2cf1e0622c39c"]}, "['Q2', '2023']": {"answer": "e34acfd62ddbf84d9cf9dc0eaecf77e8 --> The static test article fuselage is complete, with preparation underway for the start of static testing this quarter.\n\nad3a54f83254ed3de97c6993fca435d9 --> We still project full-year 737 deliveries of 400 to 450 with sequential improvement in the second-half.\n\nad3a54f83254ed3de97c6993fca435d9 --> We still expect most MAX inventory airplanes to be delivered by the end of 2024.\n\nad3a54f83254ed3de97c6993fca435d9 --> In light of this progress, we are now transitioning production to 38 per month and still plan to increase to 50 per month in the 2025-2026 timeframe.\n\n6baa1ee7efcf5a17a38ed5e04fc8de3f --> We are on the right path to reach our 737 and 787 delivery guidance for the year and we're steadily increasing our rate on each program with focus on stability every step of the way.\n\nddfdef69abadcca2a0ba740273677331 --> we're tracking, and we're going to make good progress and that will be substantially behind us as we move out of 2024.\n\n5a549b1834f0c2569033f6731d14ad37 --> We had 20 deliveries in the quarter and still expect between 70 and 80 deliveries this year.\n\n5a549b1834f0c2569033f6731d14ad37 --> We increased production to four per month during the quarter and still plan to reach five per month by year-end.\n\n5a549b1834f0c2569033f6731d14ad37 --> We ended the quarter with 85 airplanes in inventory and rework is progressing nicely and we still expect most to be delivered by the end of 2024.\n\n87f9ed650663550898ca5afff0e27447 --> The quarterly rates will be higher than 103, as our expectation. Of course, we had a little bit of the Spirit impact in there. That's why that will get sequentially better. And in terms of the rate itself, we squarely see the middle of that range as high confidence and the question's going to be, how much can we move from the middle of the range up to the higher end, and we'll prove that out, day in and day out, as we execute and build more airplanes.\n\n14b68384a82c92ffd4bbd9e19d221384 --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [In terms of what this portfolio looks like in the 2025-2026 timeframe, we believe the 15% will be stable. We'll be at certain milestones where a lot of the stuff will be in the rearview mirror. And the 85% that's left over is going to be performing very attractive margins because we've done the hard work of stabilizing and then trying to bring in even more productivity programs, including lean manufacturing, so that these businesses can get even healthier and stronger.]\n\ndbbb1ecb843eb33a8714e98ceec7aa04 --> We're happy we can make this first move to 38.\n\n617bbf27ad4751a85ca79ec193272b15 --> Second-half of 2024 is a very important moment in time because I believe that's the step change for BCA in pretty much every way and if we get through that well and we execute well, then we'll be talking to all of you about 60 deliveries.\n\n1c7a7f3ce0ee01726d618b08a96a28c2 --> You've maintained your guidance for 2025-2026 to 50 deliveries a month on the MAX.\n\n64e14682b3cce8666893e2fef7d299d1 --> they are getting to that five per month by the end of the year is a big deal, and no longer are they in the abnormal category. They are back to where —a path where we expect them, and then there will be obviously increases from there to get to the 10 by 2025-2026.\n\ncd4ac52ea4b53b146c4dd1a63def933a --> We are very confident in that 70 to 80 deliveries for this year.", "citations": ["e34acfd62ddbf84d9cf9dc0eaecf77e8", "ad3a54f83254ed3de97c6993fca435d9", "6baa1ee7efcf5a17a38ed5e04fc8de3f", "ddfdef69abadcca2a0ba740273677331", "5a549b1834f0c2569033f6731d14ad37", "87f9ed650663550898ca5afff0e27447", "14b68384a82c92ffd4bbd9e19d221384", "dbbb1ecb843eb33a8714e98ceec7aa04", "617bbf27ad4751a85ca79ec193272b15", "1c7a7f3ce0ee01726d618b08a96a28c2", "64e14682b3cce8666893e2fef7d299d1", "cd4ac52ea4b53b146c4dd1a63def933a"]}}}, {"topic": "Supply chain management", "data": {"['Q3', '2024']": {"answer": "5eb75666197a2bc7ca495a94e2314c7b --> We maintain our objective to position the supply chain to support our ramp post-strike.\n\n55f000a509fc41a563d4ad78a931cb4d --> Our ability to finish the rework and shut down the shadow factory has also been impacted by the work stoppage and will now extend into next year.", "citations": ["5eb75666197a2bc7ca495a94e2314c7b", "55f000a509fc41a563d4ad78a931cb4d"]}, "['Q1', '2023']": {"answer": "eb9583c21edd10dea4a2e618daff19ad --> We ended the quarter with 95 airplanes in inventory, most of which will be delivered by the end of 2024.\n\na928b9e2c16844933717f0060ec13ef1 --> We predicted the supply chain instability would likely continue. The good news is that we planned for it within our financial and delivery guidance.\n\na928b9e2c16844933717f0060ec13ef1 --> We continue to make key investments, including higher inventory buffers and forward deployment of resources as we take appropriate actions to mitigate impacts and improve predictability.\n\na207bc8a149e52c9dfd951741c05a467 --> [Inferred as CEO][The good news is, is that this will not take us off our path to liquidate that inventory in the 737 of 225 largely by the time we get out of 2025.]", "citations": ["eb9583c21edd10dea4a2e618daff19ad", "a928b9e2c16844933717f0060ec13ef1", "a207bc8a149e52c9dfd951741c05a467"]}, "['Q3', '2022']": {"answer": "027aa0850621c193893dfe6b0ea67675 --> We expect it will continue to be challenged over the course of 2023.\n\n3c88a8f49412a5ccf0dc0983c2cd6c1f --> It's going to be about the same in terms of the headwind, to answer your last comment.", "citations": ["027aa0850621c193893dfe6b0ea67675", "3c88a8f49412a5ccf0dc0983c2cd6c1f"]}, "['Q4', '2020']": {"answer": "3a3a5dd1ea951032aa1fd690a135e823 --> So, as we resume deliveries on the 787, we'll start to burn that inventory down. You'll see the benefit of that in the second, third and fourth quarter.", "citations": ["3a3a5dd1ea951032aa1fd690a135e823"]}, "['Q1', '2022']": {"answer": "6ab43060152521c1b6798aaac38adf9c --> We de-risked this year's deliveries significantly and we can de-risk more.\n\n70ab6c46561719f622e9988132cf9862 --> It's going to substantially be done by the end of 2023 which will also correspond with the liquidation of that inventory.", "citations": ["6ab43060152521c1b6798aaac38adf9c", "70ab6c46561719f622e9988132cf9862"]}, "['Q1', '2024']": {"answer": "d718801379fd6bc96ef92f8ec03f3ecc --> And as far as production is concerned, we will be a couple lower than that five per month for most of the year as the supply chain catches up.\n\nae341379614e5dc465f1fa5ce02f3b1b --> Our job now, given the slowdown here in these six months and then sort of the pushout of those rate increases is to make sure we have all the inventory we need to satisfy that 50 number and to have the buffers where they need to be to make sure that the supply chain can demonstrate the capacity to meet those numbers.\n\nc99c6226407af32a1c8c2a604a37a9b4 --> This calendar year, we have a full integration of those two distribution companies in mind.", "citations": ["d718801379fd6bc96ef92f8ec03f3ecc", "ae341379614e5dc465f1fa5ce02f3b1b", "c99c6226407af32a1c8c2a604a37a9b4"]}, "['Q3', '2023']": {"answer": "dbffc4475e3048019372fd0d38a222b7 --> We still plan to deliver most, if not all of the inventory by the end of next year, which will set us on a strong path for 2025 and 2026.", "citations": ["dbffc4475e3048019372fd0d38a222b7"]}, "['Q4', '2022']": {"answer": "7fe7d57668d9423d75659046c7bb6bd1 --> We expect it to happen partly in 2023, but the key, I think, to watch is just the stability of the supply chain is going to be a big, big deal that we're keeping our eye on and that's going to be important as margins will tend to accelerate. The time and the pace remains to be seen, but it will get better in 2023.", "citations": ["7fe7d57668d9423d75659046c7bb6bd1"]}, "['Q2', '2022']": {"answer": "e7b126eb7b3b1d91613107ef53d312f5 --> Stability at 31 and then confidence that engine suppliers will have their castings in order and can predict steady delivery at 38, that will then initiate us to say now it's 38.", "citations": ["e7b126eb7b3b1d91613107ef53d312f5"]}, "['Q3', '2021']": {"answer": "ac8d90cc11cb4af26ea1b2d105b7516c --> Considering the constraints that other industries are seeing with regards to supply chain, raw materials and labor, what gives you the confidence that you can get to 31 per month and sustain that next year?", "citations": ["ac8d90cc11cb4af26ea1b2d105b7516c"]}, "['Q4', '2021']": {"answer": "2fede94cc8508cf03fb8dfd2205e72c8 --> We will work with our supply chain transparently to protect upside on rate as we get to the second half of the year.", "citations": ["2fede94cc8508cf03fb8dfd2205e72c8"]}, "['Q2', '2023']": {"answer": "dbbb1ecb843eb33a8714e98ceec7aa04 --> Most of our time and applied effort with respect to the supply chain is focused on readiness for the 50 deliveries.\n\n70a877b4de848e1d6811455184fb3439 --> We just want to focused on one, the 38, and then as Dave mentioned, the preparation for the entire supply chain to get to a number of 50 deliveries in that 2025-2026 timeframe as Dave mentioned.", "citations": ["dbbb1ecb843eb33a8714e98ceec7aa04", "70a877b4de848e1d6811455184fb3439"]}}}, {"topic": "Quality control improvements", "data": {"['Q1', '2023']": {"answer": "eb9583c21edd10dea4a2e618daff19ad --> We still expect abnormal to be largely done by the end of this year.\n\n4b031b651b8b76982c9c092aa4429a6e --> Within these 225 inventoried airplanes, roughly 75% will require the fuselage rework and the number of inventoried airplanes will likely increase in 2Q, and we still expect most to be delivered by the end of 2024.\n\n47a32b72451dc284a62ad5c45b9ffdd6 --> This last defect will slow them down in measures in weeks and months, not in years, and it will not impede their ability to get to our rate increases.", "citations": ["eb9583c21edd10dea4a2e618daff19ad", "4b031b651b8b76982c9c092aa4429a6e", "47a32b72451dc284a62ad5c45b9ffdd6"]}, "['Q4', '2023']": {"answer": "13644ef1f775533dde4c47373510bb20 --> First and foremost, we will run the door plug literally, from the second a door is received at Wichita through their lines, all 12 positions through our 11 positions here, inspections will be added at every turn, it is on lockdown.", "citations": ["13644ef1f775533dde4c47373510bb20"]}, "['Q2', '2024']": {"answer": "3fef4ebc7c0a6d28c1c03d6fca8fbc30 --> High level of confidence that we're going to complete the engineering work well-before the end of the year, and we've got to get through the test certification work.", "citations": ["3fef4ebc7c0a6d28c1c03d6fca8fbc30"]}, "['Q1', '2024']": {"answer": "3649c65f6f04929dfa021aa4fcb33c0d --> We will be through that process within the next 60 days and then we will just be dealing with clean fuselages out of Wichita.\n\nef84e51ec53e60c11ff7311c47ac6c3e --> But job one is these – is the six months that commenced post-Alaska, and the inspection protocols and the non-conformance fixes that are then embedded into the Wichita facility.", "citations": ["3649c65f6f04929dfa021aa4fcb33c0d", "ef84e51ec53e60c11ff7311c47ac6c3e"]}, "['Q3', '2023']": {"answer": "157547b3f243ae02fb47cde358f89c5d --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [But right now, job one is to exit — get the nonconformance behind us. Remember, we had about a 30 aircraft growth between the second quarter and the third quarter in terms of inventory airplanes. So that's going to be working its way out of the system relatively quickly, which gives us confidence in the November-December timeframe.]", "citations": ["157547b3f243ae02fb47cde358f89c5d"]}, "['Q4', '2022']": {"answer": "7bb52c8bbd407fa74ae88bfbf92cfce1 --> those improvements are accomplished here in the next year or two.", "citations": ["7bb52c8bbd407fa74ae88bfbf92cfce1"]}, "['Q2', '2023']": {"answer": "6baa1ee7efcf5a17a38ed5e04fc8de3f --> All have been contained and will be remedied as we exit the third quarter.", "citations": ["6baa1ee7efcf5a17a38ed5e04fc8de3f"]}}}, {"topic": "Workforce management", "data": {"['Q3', '2024']": {"answer": "19a6afdf49ec2abdfdc84eb27dc7870e --> Robert Kelly Ortberg, President, Chief Executive Officer & Director, The Boeing Co. [it'll probably be a couple of weeks to bring the members back. We have a recertification effort and a retraining effort that we're going to do.]", "citations": ["19a6afdf49ec2abdfdc84eb27dc7870e"]}, "['Q4', '2020']": {"answer": "df2dc74c44942d82adad514d5a25b15e --> We are planning to reduce our workforce by 10% in the next six months.\n\n81ded8776f45ffdd29fa224024b9963f --> We continue to take steps to reach our previously shared plan to bring our overall staffing levels to approximately 130,000 by the end of 2021.", "citations": ["df2dc74c44942d82adad514d5a25b15e", "81ded8776f45ffdd29fa224024b9963f"]}, "['Q2', '2021']": {"answer": "6ca7f56b041d55fc11a78a63aea5bd79 --> We now plan to keep our overall workforce size roughly consistent with where we are today at approximately 140,000.", "citations": ["6ca7f56b041d55fc11a78a63aea5bd79"]}, "['Q2', '2023']": {"answer": "617bbf27ad4751a85ca79ec193272b15 --> For me, there's a moment in time that is really important with respect to execution and the subject of stability and that is second-half of next year when we wind down all of our shadow factory efforts, and we can apply all of the labor to those rate increases.", "citations": ["617bbf27ad4751a85ca79ec193272b15"]}}}]}, {"theme": "Financial Strategy and Management", "topics": [{"topic": "Cash flow optimization", "data": {"['Q3', '2024']": {"answer": "364ffac1b5088559ca437ca27926d9e8 --> We expect 4Q free cash flow to be a usage, driven by the timing of return to work, the pace of our production ramp, and the unwind of inventory in the balance sheet.\n\n2cc85214700c2da5c8e552f745532d49 --> We are focused on maintaining $10 billion of cash in addition to our revolver capacity as we historically have.\n\nb4db4b0dcc7a7e96e335d375958bf492 --> So, net-net, free cash flow for the fourth quarter could look similar to the second quarter depending on a lot of things coming together as we move through the course of the end of the year.\n\nb4db4b0dcc7a7e96e335d375958bf492 --> As it pertains to 2025, 2025 free cash flow will be significantly better than 2024. And we expect the first half to be a cash usage and the second half to turn positive and then build real momentum as we exit the year and return to more stable production rates.", "citations": ["364ffac1b5088559ca437ca27926d9e8", "2cc85214700c2da5c8e552f745532d49", "b4db4b0dcc7a7e96e335d375958bf492"]}, "['Q1', '2023']": {"answer": "bfea1096d2c67d17d85619b90386bf30 --> Our target for free cash flow this year remains at $3 billion to $5 billion.\n\nad054e8b5c39a63d395214ecf74e8751 --> We had a solid first quarter and we continue to make real progress, steady progress in our recovery. Challenges remain. There's more to do, but overall we feel good about the operational and financial outlook shared last November, including cash flow and delivery ranges set for 2023 as well as for the 2025/2026 timeframe where we can see $10 billion in annual free cash flow.\n\n7b705cf605b6dcecc610e20d219190bc --> We expect free cash flow to be breakeven to slightly negative as we work through the 737 recovery.\n\na928b9e2c16844933717f0060ec13ef1 --> The 2023 financial outlook is unchanged from what we've previously shared, including $3 billion to $5 billion of free cash flow generation.\n\nf345bc1f206491e11dde9083d9071d59 --> We expect to achieve a free cash flow of $3 billion by the end of the fiscal year.\n\n50d4ab6570d0e318f5759c91ff800189 --> Forecast of cash flow of $3 billion to $5 billion this year", "citations": ["bfea1096d2c67d17d85619b90386bf30", "ad054e8b5c39a63d395214ecf74e8751", "7b705cf605b6dcecc610e20d219190bc", "a928b9e2c16844933717f0060ec13ef1", "f345bc1f206491e11dde9083d9071d59", "50d4ab6570d0e318f5759c91ff800189"]}, "['Q3', '2022']": {"answer": "b2180171fc07e1227428aca8c00ce92c --> Our goal is to achieve positive free cash flow in 2023.\n\nad4a82c1976264e8a1a2cfae7dbd50d1 --> We expect our primary financial metric free cash flow to be positive for the fourth quarter and the full year\n\nc539088f629e243ff650d250bbedd6f4 --> We're confident that we'll be able to satisfy the maturities in front of us. We'll talk a lot more about that, but given the fact that where we ended the quarter with our cash balance $14-plus billion plus being able to be cash flow positive in the fourth quarter, that's not a concern.", "citations": ["b2180171fc07e1227428aca8c00ce92c", "ad4a82c1976264e8a1a2cfae7dbd50d1", "c539088f629e243ff650d250bbedd6f4"]}, "['Q4', '2023']": {"answer": "f378ac3e3870a03a38e897794af8fedc --> Free cash flow was $3 billion in the quarter, in line with prior year and up sequentially from the third quarter, primarily due to improved commercial deliveries and strong order activity, which drove favorable advance payment timing, some of which was anticipated in the first quarter 2024.\n\nd4d60f587ecdd44731062395ae971fa2 --> Our goal is to achieve a free cash flow of approximately $10 billion by 2025.\n\n7299593902d655626c032c586dfc3268 --> Have approximately $300 million left to go that will wind down by year-end, in line with our expectations.\n\nce5428992c555ec05ccefc41527f3f22 --> Based on what we know today, we expect another steady year of free cash flow, driven by the 737 production at 38 per month, ongoing execution of the 787.", "citations": ["f378ac3e3870a03a38e897794af8fedc", "d4d60f587ecdd44731062395ae971fa2", "7299593902d655626c032c586dfc3268", "ce5428992c555ec05ccefc41527f3f22"]}, "['Q2', '2024']": {"answer": "659063b0402f7e46b315e1c84c3ae4d9 --> third quarter is expected to be another use of cash.\n\n659063b0402f7e46b315e1c84c3ae4d9 --> On the free cash flow outlook for the year, we are now expecting a larger use of cash than previously forecasted.", "citations": ["659063b0402f7e46b315e1c84c3ae4d9"]}, "['Q4', '2020']": {"answer": "df2dc74c44942d82adad514d5a25b15e --> Our goal is to achieve positive free cash flow by 2022.\n\nda464ed0129746b42c24d8c948a95436 --> The changes to the 777X program timeline will result in some cash flow headwinds in 2021 and 2022, but we expect cash flow to improve as we get closer to EIS and begin deliveries in late-2023.\n\nda464ed0129746b42c24d8c948a95436 --> We anticipate the program to turn cash flow positive approximately one to two years after starting initial deliveries.\n\n041c02f8d4d5db7600827d5e4e8eb736 --> We continue to expect 2021 operating cash to be much improved from 2020, driven mainly by inventory burn-down associated with 737 and 787 programs.\n\n041c02f8d4d5db7600827d5e4e8eb736 --> We continue to expect 2021 to still be a use of cash and to be cash flow positive in 2022.\n\n041c02f8d4d5db7600827d5e4e8eb736 --> We expect cash improvements from 2021 to 2022 to be driven by continued improvement on the 737 program due to lower customer considerations and higher delivery payments as well as commercial services.\n\n15ef02f395e1982d795a63b7ea23a496 --> But, by far, those are the two single drivers to the cash flow positive particularly in 2022 and beyond.", "citations": ["df2dc74c44942d82adad514d5a25b15e", "da464ed0129746b42c24d8c948a95436", "041c02f8d4d5db7600827d5e4e8eb736", "15ef02f395e1982d795a63b7ea23a496"]}, "['Q1', '2022']": {"answer": "c0807f981b6cbbfd33b3adc9e7f1e27e --> We will have positive free cash flow over the course of 2022 and meaningful improvement in 2023.\n\nf0e66d9c0d6eb12fbbfee32d9366787d --> The trajectory throughout the rest of the year remains intact and we continue to expect to generate positive free cash flow for the year.\n\nfb8717d33635f2392cf14df18d7d8eb4 --> On cash, we still expect to generate positive free cash flow this year.\n\nfb8717d33635f2392cf14df18d7d8eb4 --> We remain confident that our free cash flow will improve in the second quarter and will make meaningful – and will meaningfully accelerate in the back half of the year as we achieve the key delivery milestones that I outlined.\n\nfb8717d33635f2392cf14df18d7d8eb4 --> As we look beyond this year, we expect 2023 cash flow will be materially higher than 2022 and we look forward to sharing more details on our plan in the fall.\n\ne2e395c8f11d4ffac79f49d80eeb7336 --> As we manage the company for cash flow, we're adjusting our 777-9 production rate including a temporary pause through 2023.\n\nea9cccf178aa5737c5247ee8b7ca7226 --> Brian J. West, Chief Financial Officer & Executive Vice President, Finance, The Boeing Co. [In terms of the cash flow for the year, look, 2Q will be better than 1Q, and it's probably pretty obvious but in the second half, we'll accelerate so I'm not going to put a discrete number on 2Q, it'll be better, but the full year, we will generate cash flow and everything is pretty much lined up as we talked about last quarter.]\n\n50229da9bcd06f9be810920ed1c4554e --> We still believe that we'll be cash flow positive in the year.", "citations": ["c0807f981b6cbbfd33b3adc9e7f1e27e", "f0e66d9c0d6eb12fbbfee32d9366787d", "fb8717d33635f2392cf14df18d7d8eb4", "e2e395c8f11d4ffac79f49d80eeb7336", "ea9cccf178aa5737c5247ee8b7ca7226", "50229da9bcd06f9be810920ed1c4554e"]}, "['Q1', '2024']": {"answer": "05dc6e8addcc7e3c70cfea1477105aca --> Our goal is to achieve a free cash flow of $10 billion by the end of 2025.\n\nee59558f80f401aad27d79187e77813c --> Longer term, we remain confident in our ability to achieve $10 billion of free cash flow. However, given our continued focus on safety, quality and stability, we continue to expect that this goal will take us longer than we originally planned and later in the 2025/2026 window, primarily tied to the 737 and 787 production delivery ramps of 50 per month and 10 per month, respectively.\n\n781b9acec2312c7d9eb2bebc311d424a --> $10 billion free cash flow\n\n7c2f04eeb67461452f8869193732ec01 --> We want to continue our practice to stay well ahead of our near-term maturities. And by near term, I mean, roughly the next 12 months. And to that end, any supplemental funding that I talked about would do two things. First of all, it would restore our cash balance to the historical level that you point out, that $10 billion-ish.", "citations": ["05dc6e8addcc7e3c70cfea1477105aca", "ee59558f80f401aad27d79187e77813c", "781b9acec2312c7d9eb2bebc311d424a", "7c2f04eeb67461452f8869193732ec01"]}, "['Q1', '2021']": {"answer": "a16219e0b2ae71ad988a40ddb799ad05 --> We still expect that peak use of cash for 777X program was in 2020, and that cash flow will improve as we get closer to EIS and begin deliveries in late 2023.\n\na16219e0b2ae71ad988a40ddb799ad05 --> We anticipate the program to turn cash-flow-positive approximately one to two years after the first delivery.\n\n843a982d450f16f07a480533e5500253 --> We continue to expect 2021 operating cash flow to be much improved from 2020, driven mainly by inventory burn-down associated with 737 and 787 programs.\n\n843a982d450f16f07a480533e5500253 --> We expect the first quarter was the most challenging quarter from a cash perspective, and we expect the trend to improve for the remainder of the year as we ramp up 787 and 737 deliveries in subsequent periods.\n\n843a982d450f16f07a480533e5500253 --> We continue to expect 2021 to be a use of cash.\n\n843a982d450f16f07a480533e5500253 --> We expect that continued improvement on the 737 MAX program due to lower customer considerations and higher delivery payments as well as recovery in Commercial Services will enable us to turn positive cash flow in 2022.", "citations": ["a16219e0b2ae71ad988a40ddb799ad05", "843a982d450f16f07a480533e5500253"]}, "['Q3', '2023']": {"answer": "a59063f09d01073e26c8b0f77df30285 --> Our target is to achieve a free cash flow of $10 billion by the end of 2025.\n\nbfbc000c94d6f4962861e84a57fcfc6e --> BGS will still be generating mid-teen margins executing on its high cash conversion, capital efficient disciplined growth model.\n\nd9e4426e50079d359fdf7080b2059ae4 --> The overall financial outlook for 2023 is unchanged from what we've previously shared including $3 billion to $5 billion of free cash flow generation although the updated 737 deliveries now point more toward the low end of the free cash flow range.\n\n8f48c68a35e72683d1c92070f6eca8c3 --> Now, as we move forward, that range of $3 billion, call it, $3-ish-billion, $4-ish-billion of R&D, that's going to modestly go up over the next couple years, but it's not going to do anything to disrupt our free cash flow target.\n\n95c3b00f19fc904acb673d6558623c22 --> In terms of your question the fourth quarter, of course, any kind of deliveries and cash flow are going to be factored into our look for the quarter and going forward. So that's all baked in.", "citations": ["a59063f09d01073e26c8b0f77df30285", "bfbc000c94d6f4962861e84a57fcfc6e", "d9e4426e50079d359fdf7080b2059ae4", "8f48c68a35e72683d1c92070f6eca8c3", "95c3b00f19fc904acb673d6558623c22"]}, "['Q4', '2022']": {"answer": "0d1afacfafc4244c36f144aae3c1deea --> We'll reaffirm our guidance and with this progress, which we feel good about both the financial and the operational outlook that we shared with you in November, and that includes the cash flow, the delivery ranges that we set for 2023 as well as for the 2025 and 2026 timeframe.\n\n658e20be69eac1ddb462258f6223a1da --> You reiterated obviously the long-term free cash flow target to $10 billion in mid-decade and $3 billion to $5 billion in 2023.\n\n076429b948e2e3cc5764b655c779aeb4 --> Our financial outlook for 2023 is unchanged from what we shared in November. Operating cash flow in total will be between $4.5 billion and $6.5 billion.\n\n076429b948e2e3cc5764b655c779aeb4 --> We'll reinvest about $1.5 billion in CapEx for a net free cash flow of $3 billion to $5 billion in 2023.\n\n076429b948e2e3cc5764b655c779aeb4 --> BDS, we expect to be a usage of between $0.5 billion and $1 billion of cash. BGS will generate between $2.5 billion and $3 billion. And BCA will generate between $2.5 billion and $3.5 billion.\n\ncf5a8b7b2faaa2a4c68969578c3a4b0f --> On the first quarter specifically, EPS will be an improvement over 4Q 2022 but remain in a loss position, and cash will still be a usage in the first quarter although an improvement from the first quarter of 2022.", "citations": ["0d1afacfafc4244c36f144aae3c1deea", "658e20be69eac1ddb462258f6223a1da", "076429b948e2e3cc5764b655c779aeb4", "cf5a8b7b2faaa2a4c68969578c3a4b0f"]}, "['Q2', '2021']": {"answer": "1e579bd5daa2260dc267328b2465ef27 --> On cash flow, we still expect full year 2021 to be a use of cash.\n\n1e579bd5daa2260dc267328b2465ef27 --> We still expect to turn cash flow positive in 2022.\n\n5683fd6ef9ad56663deb9862bd88471e --> We anticipate the program will turn cash flow positive approximately one to two years after first delivery.\n\n5683fd6ef9ad56663deb9862bd88471e --> We still expect that the peak use of cash for the 777X program occurred in 2020 and that cash flow will improve as we get closer to EIS and begin deliveries in late 2023.\n\n3d78e3dfe5d6fe3c1b8194dae2340da4 --> 2022 we expect to be positive cash flow.\n\nb2d94a1c51ee062d9d386194503c1ee6 --> We're predicting or expecting cash flow to be positive in 2022.", "citations": ["1e579bd5daa2260dc267328b2465ef27", "5683fd6ef9ad56663deb9862bd88471e", "3d78e3dfe5d6fe3c1b8194dae2340da4", "b2d94a1c51ee062d9d386194503c1ee6"]}, "['Q2', '2022']": {"answer": "1eaee59e9cb583ca44c0ba3ff1fdc4a1 --> we can suffer our way through that and will, and it should not impact the cash flow positive posture that we've taken for the year.\n\nd206dc822014aa21dc0d5537e71c9f81 --> We are still committed to be cash flow positive for the calendar year 2022.\n\n6adbe4c1e0e0e35e8677f26acd3a496d --> This keeps us on track to generate positive free cash flow for the year and higher cash flows in 2023.\n\n6adbe4c1e0e0e35e8677f26acd3a496d --> We also expect cash flow benefits from order activity and favorable receipt timing over the next two quarters.\n\n79f61d9a0914d4fb7269809f8bb9aca1 --> When you look to this year and are looking at positive free cash flow for the year\n\na1814ab8408bf0ad787b710395483c71 --> As we look to 2023, we still expect cash flow will be higher than 2022 and we plan to share more details in November.\n\na1814ab8408bf0ad787b710395483c71 --> We still expect to generate positive free cash flow this year and the key drivers of second half improvement are higher 737 and 787 delivery volume, orders of advance payments, BDS receipts, as well as favorable expenditure timing.\n\nece779098c9ab485c228135ea7877a1b --> So the low-400s we think the balance of the year will satisfy the cash flow requirements to do their fair share of that total picture.", "citations": ["1eaee59e9cb583ca44c0ba3ff1fdc4a1", "d206dc822014aa21dc0d5537e71c9f81", "6adbe4c1e0e0e35e8677f26acd3a496d", "79f61d9a0914d4fb7269809f8bb9aca1", "a1814ab8408bf0ad787b710395483c71", "ece779098c9ab485c228135ea7877a1b"]}, "['Q3', '2021']": {"answer": "6254b13e89c8d7ad1c4668f2f89c2f15 --> We still expect full year 2021 to be a use of cash and to turn cash flow positive in 2022.", "citations": ["6254b13e89c8d7ad1c4668f2f89c2f15"]}, "['Q4', '2021']": {"answer": "4ee665934e941e9a958f9c2fbb43b0c0 --> Our goal is to achieve positive cash flow in 2022.\n\nd5e97586d6f937ae75c089fb33448d9e --> We generated positive free cash flow in the fourth quarter and believe free cash flow will continue to materially improve this year and into 2023.\n\nb15a58bcd0d26e2eace6201af66af7e3 --> As we look to the future, we expect 2023 cash flow will be materially higher than 2022.\n\n244147de376b83c370dd68b895ee1e7e --> In terms of the $3.5 billion, that'll play out over longer period of time, particularly as we have discussions with customers. Some of that might be accelerated in the near term, but overall, it's going to take us time for that cash flow to go out. It'll take years.\n\n244147de376b83c370dd68b895ee1e7e --> In terms of the abnormal, again, that cash flow will likely go out over the next two years as most of that will be behind us as we get out of 2023.\n\naae4067175417a4d4e1d47f8ab883381 --> We still expect to generate positive free cash flow in the year.\n\naae4067175417a4d4e1d47f8ab883381 --> We still anticipate a significant burn-down of our advances balance this year which we expect to be more front-end loaded in line with customer discussions.\n\naae4067175417a4d4e1d47f8ab883381 --> First quarter cash flow could look similar to the usage we saw in 1Q 2021.\n\nf4d4469b9299911b59f2cf1e0622c39c --> As we exit the year, we're going to be moving to a much more normalized state and then have a meaningful acceleration of cash flow in 2023.", "citations": ["4ee665934e941e9a958f9c2fbb43b0c0", "d5e97586d6f937ae75c089fb33448d9e", "b15a58bcd0d26e2eace6201af66af7e3", "244147de376b83c370dd68b895ee1e7e", "aae4067175417a4d4e1d47f8ab883381", "f4d4469b9299911b59f2cf1e0622c39c"]}, "['Q2', '2023']": {"answer": "ab89accea73ea26f2bdf940e1d539619 --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [Relative to our expectations shared at the last earnings call, the strong order activity in the quarter drove over $2 billion of favorable advanced payment timing. Keep in mind, most of this was expected to occur in the third quarter.]\n\n294066a415eb8b46d3ae3174d7f66b88 --> We are confident in $10 billion of free cash flow in 2025-2026.\n\n2549c9b4b5c6b06201e3387341b4eba1 --> The 2023 overall financial outlook is unchanged from what we've previously shared, including $3 billion to $5 billion of free cash flow generation.\n\n2549c9b4b5c6b06201e3387341b4eba1 --> And given the strong results in 2Q cash flow, 3Q will be lower sequentially, still positive, and likely in the hundreds of millions of dollars.\n\n865e66cd52aa1f33e138e391541a439a --> The BCA forecast for operating cash flow this year is $2.5 billion to $3.5 billion.", "citations": ["ab89accea73ea26f2bdf940e1d539619", "294066a415eb8b46d3ae3174d7f66b88", "2549c9b4b5c6b06201e3387341b4eba1", "865e66cd52aa1f33e138e391541a439a"]}}}, {"topic": "Debt management strategy", "data": {"['Q3', '2024']": {"answer": "d783af299b516ab59449b257510d5fad --> We have a plan to comprehensively address the balance sheet in the near term that could include an offering of equity and equity-linked securities.", "citations": ["d783af299b516ab59449b257510d5fad"]}, "['Q3', '2022']": {"answer": "b2180171fc07e1227428aca8c00ce92c --> We plan to reduce our debt by $10 billion over the next three years.", "citations": ["b2180171fc07e1227428aca8c00ce92c"]}, "['Q4', '2023']": {"answer": "c31cec36d1ba30b7ced82a923863d488 --> Over the next few days, we'll pay down $4 billion of the $5 billion of maturities coming due this year from our available cash on hand.", "citations": ["c31cec36d1ba30b7ced82a923863d488"]}, "['Q1', '2024']": {"answer": "05dc6e8addcc7e3c70cfea1477105aca --> We aim to reduce our debt by $5 billion over the next two years.\n\nee59558f80f401aad27d79187e77813c --> As you saw yesterday, we agreed to advance Spirit $425 million, virtually all of which will be repaid in the third quarter.", "citations": ["05dc6e8addcc7e3c70cfea1477105aca", "ee59558f80f401aad27d79187e77813c"]}, "['Q1', '2021']": {"answer": "3d0ce27053ce220b348f8df2959297e3 --> As part of our ongoing prudent liquidity actions, we refinanced $9.8 billion of our delayed draw term loan that was due in early 2022 and expanded our revolving credit facility by $5.3 billion.", "citations": ["3d0ce27053ce220b348f8df2959297e3"]}, "['Q3', '2023']": {"answer": "bfbc000c94d6f4962861e84a57fcfc6e --> And all of this will underwrite our continued strong liquidity position and enable us to further de-lever the balance sheet early next year.", "citations": ["bfbc000c94d6f4962861e84a57fcfc6e"]}, "['Q2', '2021']": {"answer": "b32824ed5f0246766d833b30c9ab66f4 --> We continue to expect advanced payment burn-down to be a headwind for the rest of this year and into next.\n\nb32824ed5f0246766d833b30c9ab66f4 --> We expect to have lower total debt at the end of the year due to the pay-down of maturing bonds and potential early pay-down of our delayed draw term loan.", "citations": ["b32824ed5f0246766d833b30c9ab66f4"]}, "['Q3', '2021']": {"answer": "c592389c9965d6e5651075ba85ab830b --> We expect to have lower total debt at the end of the year due to the pay-down of maturing bonds and early pay-down of the remaining $4 billion delayed draw term loan.", "citations": ["c592389c9965d6e5651075ba85ab830b"]}, "['Q4', '2021']": {"answer": "03a99aaca671075ef2b143f414d9e414 --> We expect the majority of the remaining $2.9 billion liability to be liquidated this year with less than 10% of the total estimate left to be negotiated.", "citations": ["03a99aaca671075ef2b143f414d9e414"]}}}, {"topic": "Revenue growth analysis", "data": {"['Q1', '2023']": {"answer": "7b705cf605b6dcecc610e20d219190bc --> we expect core EPS will be roughly in line with 1Q 2023 performance absent the Tanker charge, as the 737 delivery impacts would be largely offset by higher wide-body deliveries.\n\n0ba74360d0b073f60cd08716fcfa3c80 --> Brian J. West, CFO [By the time we get to 2025/2026, we still see a path to get BCA back to the double-digit margins that you all recognize.]\n\n0ba74360d0b073f60cd08716fcfa3c80 --> Brian J. West, CFO [2Q will also be negative, but as we move into the back half of the year, the margins will improve.]\n\n1aa522857c68f666d7ccd3149771a820 --> we fully expect by the 2025/2026 timeframe to have 787 margins that are higher than they were back in 2018\n\nc1d2a37f644014687dce2278fa5f8446 --> So all that's contemplated and we've still got high conviction in the low-end of that range. High-end might be a little pressured, but we're committed to delivering that commitment of $3 billion to $5 billion.\n\n6e1b163afc808dc541ac8ea4099732d1 --> We're set up very well to deliver a mid-single-digit revenue growth business with mid-teens margins and a high cash flow conversion over the next several years.", "citations": ["7b705cf605b6dcecc610e20d219190bc", "0ba74360d0b073f60cd08716fcfa3c80", "1aa522857c68f666d7ccd3149771a820", "c1d2a37f644014687dce2278fa5f8446", "6e1b163afc808dc541ac8ea4099732d1"]}, "['Q3', '2022']": {"answer": "06821151154e2a18b8209da7dbd377e4 --> This third quarter performance puts us on track to be positive for both the second half and the full year of 2022.\n\n5a45ecf6bcfd4b8283b313a302301ba4 --> I suspect it won't be till we get to the sort of end of next year before we can really make sizable rate increases with respect to that constraint.", "citations": ["06821151154e2a18b8209da7dbd377e4", "5a45ecf6bcfd4b8283b313a302301ba4"]}, "['Q4', '2023']": {"answer": "25e974b1fb04e58b1284bc5a7487e38c --> Our game plan to get BDS back to high-single digit margins by the 2025/2026 timeframe remains unchanged.", "citations": ["25e974b1fb04e58b1284bc5a7487e38c"]}, "['Q2', '2024']": {"answer": "4d1a6c2216258d31092f303bb9b06765 --> As a terrific franchise that's setup for years to come, the team is focused on profitable, capital efficient, high IP offerings, and we still expect it to grow at solid mid-single-digit revenue levels and throw off mid-teen margins with very high free cash flow conversion.", "citations": ["4d1a6c2216258d31092f303bb9b06765"]}, "['Q4', '2020']": {"answer": "85945fb7e8d516f30ad910563839aefa --> Based on what we know, we expect to see 2021 revenue improve from 2020. This will be driven mainly by higher 737 and 787 deliveries as we plan to unwind inventory and deliver from the production lines.\n\n58d9d6fa2d3a507c98ae634b65165c17 --> We expect BDS to generate low to single-digit growth in 2021 revenue compared to 2020.\n\n58d9d6fa2d3a507c98ae634b65165c17 --> We expect BGS revenue to be relatively stable in 2021 versus 2020.", "citations": ["85945fb7e8d516f30ad910563839aefa", "58d9d6fa2d3a507c98ae634b65165c17"]}, "['Q1', '2022']": {"answer": "b68f17fd687ac69f4a058267ad99c0b0 --> We still anticipate total company revenue to increase this year, the growth will be primarily driven by higher Commercial Airplane deliveries, on the 37 and 87 programs and solid growth in our services business as the commercial market continues to improve.\n\nb68f17fd687ac69f4a058267ad99c0b0 --> We're forecasting a modest decrease in revenue at BDS this year versus 2021 however we expect 2023 to return to stable levels.", "citations": ["b68f17fd687ac69f4a058267ad99c0b0"]}, "['Q1', '2024']": {"answer": "935356fc0b5a25eba842aec1e721c59a --> Our game plan to get BDS back to high-single digit margins by the 2025/2026 timeframe remains intact.\n\nf3476fc60802429ea9da2f6d8ae88e19 --> [Inferred as Senior Management] So, by and large, we still feel confident that we'll work our way through it and that will result in a BDS margin level as we get to the 2025/2026 timeframe that we believe is going to be in the high-single digits.", "citations": ["935356fc0b5a25eba842aec1e721c59a", "f3476fc60802429ea9da2f6d8ae88e19"]}, "['Q3', '2023']": {"answer": "99f073dc8bd33dc829eee369bff0a66f --> We are on track to meet the financial goals we shared for this year and for the 2025-2026 timeframe, a timeframe I refer to as stability.\n\n99f073dc8bd33dc829eee369bff0a66f --> Based on our performance year-to-date, we still plan to be in the guidance range for the year as well as the $10 billion target by 2025 and 2026.\n\nae50f56d30c50e6520e4862748433528 --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [Let me start with the quantum in the 2025-2026 timeframe. It's $10 billion. And we continue to have line of sight to hitting that target.]\n\nf6aad16bd566fb2e0c932f25bdae940c --> In 2024, we expect margins to be positive.\n\nf6aad16bd566fb2e0c932f25bdae940c --> By 2025-2026, we still have a view where they will be double-digit margins as they have been historically.", "citations": ["99f073dc8bd33dc829eee369bff0a66f", "ae50f56d30c50e6520e4862748433528", "f6aad16bd566fb2e0c932f25bdae940c"]}, "['Q4', '2022']": {"answer": "7fe7d57668d9423d75659046c7bb6bd1 --> BGS in terms of their revenue, they finished the quarter at a pretty got spot, pretty clean basis and if you just kind of think about that as how you would extrapolate into 2023 by quarter it gives you a pretty good view of where we see that growth coming for, so it will grow, margin will be just fine, right within that mid-teen levels that we've enjoyed, so we feel pretty good about the prospects for the service business, very stable, continue to grow, no surprises.", "citations": ["7fe7d57668d9423d75659046c7bb6bd1"]}, "['Q2', '2022']": {"answer": "197dc5972c93d304f6c533e9b5088d9b --> As far as the rest of the year is concerned, we still anticipate 2022 total company revenue to be higher than last year, primarily driven by higher commercial airplane deliveries on the 737 and 787 programs and growth in our services business partially offset by lower defense revenue.\n\na1814ab8408bf0ad787b710395483c71 --> While we forecast BGS revenue to continue to grow next year, the growth rate will be tempered as we are nearly back to pre-pandemic levels.\n\n5208704235423371f107a55571d1a6ee --> When we look at the whole balance to go and the things we're watching, we feel comfortable in that low-400 number.", "citations": ["197dc5972c93d304f6c533e9b5088d9b", "a1814ab8408bf0ad787b710395483c71", "5208704235423371f107a55571d1a6ee"]}, "['Q3', '2021']": {"answer": "6254b13e89c8d7ad1c4668f2f89c2f15 --> While we anticipate a meaningful burndown next year, we expect the balance will normalize by the end of 2022.", "citations": ["6254b13e89c8d7ad1c4668f2f89c2f15"]}, "['Q4', '2021']": {"answer": "aae4067175417a4d4e1d47f8ab883381 --> From a phasing standpoint, we anticipate the first quarter to be our lowest quarter of the year for deliveries, revenue, earnings, and cash flow.", "citations": ["aae4067175417a4d4e1d47f8ab883381"]}, "['Q2', '2023']": {"answer": "223ce8841048565250fbde569fb28ebd --> We're confident in the $3 billion to $5 billion target for the year.\n\n9b7df8d63bb66a6493471b28603aab31 --> We're confident and we're focused on the path to high single-digit margins in 2025-2026.\n\nddfdef69abadcca2a0ba740273677331 --> by the time we get through 2024, and we're focused on that 2025-2026 timeframe, as we've said, BCA margins will look a lot like they did before in that low double-digit area.\n\n51e32c0e5e09d976087bfae52cc65baa --> We still have high expectations of that business, and we want them to be doing margins that are in the teens.\n\n51e32c0e5e09d976087bfae52cc65baa --> But when I say come back a little bit, we still feel like our long-term view of that business should be in the mid-teens, and from time-to-time, it'll be a little better and we'll keep pushing the business to be just as good as they can be, but I don't expect it to step back dramatically.\n\n2549c9b4b5c6b06201e3387341b4eba1 --> On the third quarter specifically, we expect BCA margins to improve sequentially, but remain negative and we're not anticipating much in terms of BDS profitability.", "citations": ["223ce8841048565250fbde569fb28ebd", "9b7df8d63bb66a6493471b28603aab31", "ddfdef69abadcca2a0ba740273677331", "51e32c0e5e09d976087bfae52cc65baa", "2549c9b4b5c6b06201e3387341b4eba1"]}}}, {"topic": "Cost management strategies", "data": {"['Q3', '2024']": {"answer": "a2cee4d0db5209e2ec2a885b30c693ad --> The magnitude of these losses expanded as we close the books, primarily reflecting higher estimated production costs on the T-7A program, mainly on contracts in 2026 and beyond and an updated assessment of impacts on the KC-46A program associated with the IAM work stoppage and the decision to conclude production on the 767 Freighter.", "citations": ["a2cee4d0db5209e2ec2a885b30c693ad"]}, "['Q1', '2023']": {"answer": "0ba74360d0b073f60cd08716fcfa3c80 --> Brian J. West, CFO [First quarter BCA margins would be lower than fourth quarter.]\n\nf345bc1f206491e11dde9083d9071d59 --> We are targeting a 10% reduction in operational costs over the next two years.", "citations": ["0ba74360d0b073f60cd08716fcfa3c80", "f345bc1f206491e11dde9083d9071d59"]}, "['Q3', '2022']": {"answer": "69943013620bf4d4d2a779e43c523cd0 --> We still expect to record about $1.5 billion of these costs through 2023, while 777-9 production remains paused.\n\n19d31ac6399ba3db72aa4790e4a9d140 --> We still anticipate a total of about $2 billion, the most being incurred by the end of 2023.", "citations": ["69943013620bf4d4d2a779e43c523cd0", "19d31ac6399ba3db72aa4790e4a9d140"]}, "['Q4', '2023']": {"answer": "d4d60f587ecdd44731062395ae971fa2 --> We are targeting a 20% reduction in production costs by the end of 2024.\n\na2906508e84824fbbc22808419acc5ed --> We expect margin trajectories to get better over time, particularly as we focus on this 25% of the portfolio that is very specific and there's a lot of actions – or activity around it. But we will get better. They will eventually get to the point where we're putting positives on the board. What I'm most interested is the team that's got to execute over the next between now and 2025/2026 in order to get these margins back in the high-single digit range.", "citations": ["d4d60f587ecdd44731062395ae971fa2", "a2906508e84824fbbc22808419acc5ed"]}, "['Q4', '2020']": {"answer": "0d0fc9cc56cfc8493371ec7236b0b908 --> We recently announced that we will be providing most of our employees a one-time stock grant that will vest in three years as we recover and grow the business.\n\nbbfb2a7c946081785be0a4c53a7c3d80 --> As a result of these updated program assumptions, we booked a $6.5 billion pre-tax charge in the quarter, a significant component of which is driven by a reduction in the program's initial accounting quantity.\n\na1d0ee61f60a0ff507f760bc0e827128 --> We expect the remainder of this cost to be expensed as incurred largely in 2021.\n\n856c99346aa97f626fedd546feed4072 --> We intend to get cost advantages something in that $5 billion range, these will accrue to our airplanes, and we are talking about 2023.", "citations": ["0d0fc9cc56cfc8493371ec7236b0b908", "bbfb2a7c946081785be0a4c53a7c3d80", "a1d0ee61f60a0ff507f760bc0e827128", "856c99346aa97f626fedd546feed4072"]}, "['Q1', '2022']": {"answer": "b351d545f567609c15cae20ca2f97581 --> We did record $312 million of abnormal costs in line with expectations and we still anticipate a total of approximately $2 billion of abnormal, with most being incurred by the end of 2023.\n\ne2e395c8f11d4ffac79f49d80eeb7336 --> We anticipate that that 777-9 pause will result in approximately $1.5 billion of abnormal cost beginning in the second quarter of this year and continuing until production resumes.", "citations": ["b351d545f567609c15cae20ca2f97581", "e2e395c8f11d4ffac79f49d80eeb7336"]}, "['Q1', '2021']": {"answer": "6fd85067613cb9924c4851ca0812c4a1 --> We expect the remainder of these costs to be expenses incurred largely in 2021.", "citations": ["6fd85067613cb9924c4851ca0812c4a1"]}, "['Q3', '2023']": {"answer": "794f9be275b36c12735de4d72eaa02de --> The total estimate is now $3 billion, up a bit, and we still expect to be largely done by year-end.\n\n862678af56f6d7188552ca53ca4189c4 --> The total estimate is unchanged at $1 billion, and we expect to be done this quarter.\n\nd9e4426e50079d359fdf7080b2059ae4 --> On the tax expense side, we still expect full year tax expense of approximately $250 million.", "citations": ["794f9be275b36c12735de4d72eaa02de", "862678af56f6d7188552ca53ca4189c4", "d9e4426e50079d359fdf7080b2059ae4"]}, "['Q2', '2022']": {"answer": "ace1de6f6054945e6cf105dec5375451 --> We recorded $283 million of 787 abnormal costs, in line with expectations, and we still anticipate a total of about $2 billion, with most being incurred by the end of 2023.\n\n8a171774dadaaaedc3b03fb7d39dec7f --> We still expect to record $1.5 billion of these costs through 2023, while 777-9 production remains paused.", "citations": ["ace1de6f6054945e6cf105dec5375451", "8a171774dadaaaedc3b03fb7d39dec7f"]}, "['Q3', '2021']": {"answer": "dc56034df6efbb2824b03c61b87bd7e6 --> We currently anticipate total 787 abnormal cost to be approximately $1 billion.", "citations": ["dc56034df6efbb2824b03c61b87bd7e6"]}, "['Q4', '2021']": {"answer": "314e03ace5bd392685a6d64f5508c2ba --> We now anticipate 787 abnormal costs will be approximately $2 billion with most being incurred by the end of 2023.", "citations": ["314e03ace5bd392685a6d64f5508c2ba"]}, "['Q2', '2023']": {"answer": "f7b83cef1e26e7c919bf63384936d95c --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [In terms of where we're headed, as we think about the back-half of the year, we will still have some negativity, although sequentially better, in the third quarter, and then as we exit the year and moving over into the first quarter of next year, those margins will move positive.]\n\nf7b83cef1e26e7c919bf63384936d95c --> Brian J. West, Chief Financial Officer & Executive Vice President-Finance, The Boeing Co. [all of that give us confidence that we will get these margins positive and it will likely be towards the end of the year, early next year, and the team is laser-like focused on meeting those expectations.]\n\n5a549b1834f0c2569033f6731d14ad37 --> We booked $314 million of abnormal costs in the quarter, in-line with expectations, and there's no change to the total estimate of $2.8 billion which is largely done by year-end.\n\n5a549b1834f0c2569033f6731d14ad37 --> Abnormal costs were $136 million as expected and we've lowered our total estimate from $1.5 billion to $1 billion, which reflects plans to resume production later this year, rather than early 2024.\n\nf272cf20128751a6a246a59f0239ece6 --> We're not going to have modest profitability in the quarter. I think we said that we're not expecting much at all from the BDS portfolio just to be clear because these things aren't going to solve themselves in the near-term.", "citations": ["f7b83cef1e26e7c919bf63384936d95c", "5a549b1834f0c2569033f6731d14ad37", "f272cf20128751a6a246a59f0239ece6"]}}}]}, {"theme": "Market Demand and Expansion", "topics": [{"topic": "International market penetration", "data": {"['Q1', '2021']": {"answer": "9e316206b85996eb6a0f274546f9cb85 --> China represents 25% of the global growth in our industry over the next decade.", "citations": ["9e316206b85996eb6a0f274546f9cb85"]}, "['Q3', '2021']": {"answer": "ed560488719277677b85d895805ec19f --> This assumes we resume delivery to our customers in China during the first quarter of 2022.", "citations": ["ed560488719277677b85d895805ec19f"]}, "['Q4', '2021']": {"answer": "d5e97586d6f937ae75c089fb33448d9e --> We're proceeding to get 737 MAX airplanes ready to deliver in China as early as the first quarter and follow the lead of our customers and regulators on next steps.", "citations": ["d5e97586d6f937ae75c089fb33448d9e"]}}}, {"topic": "Competitive positioning", "data": {"['Q3', '2021']": {"answer": "ccc0b521da04e8013e45ea9d9ac758dd --> Recent changes to government policies could accelerate this to 70% by year-end.", "citations": ["ccc0b521da04e8013e45ea9d9ac758dd"]}}}, {"topic": "Commercial aircraft demand", "data": {"['Q3', '2022']": {"answer": "b2180171fc07e1227428aca8c00ce92c --> We are targeting a return to pre-pandemic levels of commercial deliveries by 2025.\n\ne5f899df17f66b27b52acbd83803210e --> We still see overall passenger traffic returning to 2019 levels in the 2023 to 2024 timeframe.\n\n96bebbc32578be0ae14e3937ed857f45 --> So we are going to continue. We're going to – we have begun and we're going to continue to remarket these airplanes as we move forward.", "citations": ["b2180171fc07e1227428aca8c00ce92c", "e5f899df17f66b27b52acbd83803210e", "96bebbc32578be0ae14e3937ed857f45"]}, "['Q2', '2024']": {"answer": "5460e28d2a03afa99c4ba900adfff492 --> As noted in the Commercial Market Outlook published this month, we continue to see robust demand and the fundamentals are there for the next 20 years, where we expect the global fleet to almost double as nearly 44,000 new airplanes are delivered, with about half of those for replacement demand.", "citations": ["5460e28d2a03afa99c4ba900adfff492"]}, "['Q4', '2020']": {"answer": "a5647c46ee112224099bbe1ef9154e6e --> We expect it will take around three years for travel to return to the 2019 levels and a few years beyond that to return to our long-term growth trends.\n\n853ced81e2912b150350005e95d43475 --> We continue to anticipate it will take multiple years to reach our previous demand levels.", "citations": ["a5647c46ee112224099bbe1ef9154e6e", "853ced81e2912b150350005e95d43475"]}, "['Q1', '2022']": {"answer": "b8341ba966629df70375d4a665cf0718 --> We still see overall passenger traffic returning to 2019 levels in the 2023/2024 timeframe.\n\ne2e395c8f11d4ffac79f49d80eeb7336 --> Additionally given the robust market for freighters, we're leveraging this production pause on the 777-9 to add 777 Freighter aircraft in 2023 to 2026 timeframe.\n\nb74fcbf7f9a7ee280e54b32299b66c89 --> We hate that it's that high, but the flip side of that is that we'll be able to meet some pretty robust demand that's out there in the marketplace and that, again, will likely liquidate over the course of between this year and next, and that has not changed.", "citations": ["b8341ba966629df70375d4a665cf0718", "e2e395c8f11d4ffac79f49d80eeb7336", "b74fcbf7f9a7ee280e54b32299b66c89"]}, "['Q1', '2024']": {"answer": "05dc6e8addcc7e3c70cfea1477105aca --> We expect to deliver between 400 and 450 commercial airplanes in 2024.", "citations": ["05dc6e8addcc7e3c70cfea1477105aca"]}, "['Q1', '2021']": {"answer": "9e316206b85996eb6a0f274546f9cb85 --> We continue to anticipate it will take multiple years to reach previous demand levels, and the recovery trajectory may be uneven.\n\n87891e7d6afd74d9d519db560d465dbc --> We expect passenger traffic to return to 2019 levels in 2023 to 2024.", "citations": ["9e316206b85996eb6a0f274546f9cb85", "87891e7d6afd74d9d519db560d465dbc"]}, "['Q3', '2023']": {"answer": "a59063f09d01073e26c8b0f77df30285 --> We expect to deliver between 400 and 450 commercial airplanes in 2024.\n\nd5c485aac930695ad665efde1032171b --> Over the next 10 years, the value of the markets we serve across commercial, defense, space, and services is estimated at $10.7 trillion according to our most recent Boeing Market Outlook.", "citations": ["a59063f09d01073e26c8b0f77df30285", "d5c485aac930695ad665efde1032171b"]}, "['Q2', '2021']": {"answer": "aed7d45ef46eee4398f791403e283592 --> The US domestic market is showing remarkable recovery with summer bookings consistent with 2019 levels according to several airlines.\n\nf4a9e685587b6e20575420d3a23a4c58 --> We expect passenger traffic to return to 2019 levels in 2023 to 2024 and a few years beyond that to return to long term trend growth.", "citations": ["aed7d45ef46eee4398f791403e283592", "f4a9e685587b6e20575420d3a23a4c58"]}, "['Q2', '2022']": {"answer": "8076ed99e0e8301fcdbf1171fd9499d7 --> We still see overall passenger traffic returning to 2019 levels in the 2023 to 2024 timeframe.\n\n8076ed99e0e8301fcdbf1171fd9499d7 --> We recently released our 2022 commercial market outlook which forecasts a total addressable market valued at more than $3.3 trillion over the next decade and demand for nearly 20,000 airplanes.\n\n8076ed99e0e8301fcdbf1171fd9499d7 --> More specifically, we anticipate demand for more than 14,000 narrowbodies or over 120 per month on average over the next 10 years.\n\n8076ed99e0e8301fcdbf1171fd9499d7 --> From a 20-year perspective, we project demand for more than 41,000 new airplanes including 940 dedicated freighters.\n\n8076ed99e0e8301fcdbf1171fd9499d7 --> Over the next 10 years, we see a $3.3 trillion service market that aligns well with our broad customer-focused portfolio of offerings.\n\nace1de6f6054945e6cf105dec5375451 --> Given this uncertainty with our customers in China, we now expect more deliveries of airplanes from inventory to shift into 2024.\n\n8646dea7ebff35e131486393a57eff12 --> They might be on the leading edge of that demand curve. But it's not going to happen in the next six months and it's not going to — it will take us probably a year to get to where that demand begins to manifest into real orders.", "citations": ["8076ed99e0e8301fcdbf1171fd9499d7", "ace1de6f6054945e6cf105dec5375451", "8646dea7ebff35e131486393a57eff12"]}, "['Q3', '2021']": {"answer": "9077fc521812b621a3000b3b03dd1477 --> Last month, we released our 2021 Boeing market outlook, which forecasts a total market value of $9 trillion over the next decade.\n\n3ae8e93820e8bb200afdce4bc1884844 --> So far this year, we have sold more than 550 737s across each of the models, from 737 MAX 7 to 737 MAX 10, reflecting the value of versatility and\n\n56e0241e45de0e15a90cd7524166da4c --> guidance\n\n56e0241e45de0e15a90cd7524166da4c --> guidance\n\ne6d8f02ee00708f41eeef1527ddfab2e --> Through 2040, we project demand for about 43,500 new airplanes, an increase of about 500 planes over last year's forecast.\n\ne6d8f02ee00708f41eeef1527ddfab2e --> We project the global freighter fleet in 2040 will be 70% larger than the pre-pandemic fleet.\n\ned95f5857a13b07dcc329125637e8025 --> I think the demand is going be quite robust. And I think as we get to the second half of next year, that will begin to play out for all of us.", "citations": ["9077fc521812b621a3000b3b03dd1477", "3ae8e93820e8bb200afdce4bc1884844", "56e0241e45de0e15a90cd7524166da4c", "e6d8f02ee00708f41eeef1527ddfab2e", "ed95f5857a13b07dcc329125637e8025"]}, "['Q4', '2021']": {"answer": "b08364863b4e80edd9df229954382987 --> Our projections for the three-phase commercial market recovery remain unchanged, and we still assume passenger traffic will return to 2019 levels in the 2023 to 2024 timeframe.\n\nb08364863b4e80edd9df229954382987 --> We continue to project average traffic growth of mid-single digits over the long term.", "citations": ["b08364863b4e80edd9df229954382987"]}, "['Q2', '2023']": {"answer": "ddfdef69abadcca2a0ba740273677331 --> We just announced going to 38 airplanes.", "citations": ["ddfdef69abadcca2a0ba740273677331"]}}}, {"topic": "Strategic alliances", "data": {}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New aircraft models", "data": {"['Q3', '2022']": {"answer": "69943013620bf4d4d2a779e43c523cd0 --> We still anticipate delivery of the first 777-9 airplane in 2025 and continue to coordinate with the FAA to prioritize resources across our development programs.", "citations": ["69943013620bf4d4d2a779e43c523cd0"]}, "['Q4', '2023']": {"answer": "326b755a39b42fafd1d15a1cf158e52f --> Yeah. And on the MAX 7, the work at hand, we will design an engineering solution. We're applying the resources. Our view that that could be within a year.", "citations": ["326b755a39b42fafd1d15a1cf158e52f"]}, "['Q2', '2024']": {"answer": "df2647cca277b0d1c6d0f5fb0a9ef3d4 --> Now, we also know that it will turn positive about a year after EIS as deliveries begin to ramp, and that'll play out in a very normal way that most development programs play out.", "citations": ["df2647cca277b0d1c6d0f5fb0a9ef3d4"]}, "['Q4', '2020']": {"answer": "1d8d789f7fba836e03c614ebabc1f005 --> We expect first delivery of the 777X to now occur in late 2023.", "citations": ["1d8d789f7fba836e03c614ebabc1f005"]}, "['Q1', '2022']": {"answer": "4f3ab6abb6bfc84d080c7e23624a0ba9 --> I'd like to make a comment with respect to the decision we made on the 777X and the extension of its introduction until 2025.\n\n63ff3b0057f2dcf62050715d8da63d55 --> Part of our 777X move-out into 2025 was to incorporate exactly whatever observations that you took account of to incorporate all the learning we've had from our cert programs.", "citations": ["4f3ab6abb6bfc84d080c7e23624a0ba9", "63ff3b0057f2dcf62050715d8da63d55"]}, "['Q1', '2024']": {"answer": "2f5475b95c2a76b57d1e8d6be69b5ccd --> We continue to progress along the program timeline, and still expect first delivery in 2025.\n\nf3476fc60802429ea9da2f6d8ae88e19 --> [Inferred as Senior Management] T-7, we expect to get through the flight test program. Good progress with the customer, it's proceeding well. That's an important milestone as we exit this year.\n\nf3476fc60802429ea9da2f6d8ae88e19 --> [Inferred as Senior Management] Similarly, on MQ-25, we will get to the build, we will get to the software integration and we will be able to get through an important milestone with the customer as we exit this year.", "citations": ["2f5475b95c2a76b57d1e8d6be69b5ccd", "f3476fc60802429ea9da2f6d8ae88e19"]}, "['Q1', '2021']": {"answer": "e08d8021a60a3a96ebb57557cf0f5aa8 --> We still anticipate that the first 777X delivery will occur late in 2023.\n\na16219e0b2ae71ad988a40ddb799ad05 --> We still expect first delivery of the 777X to occur in late 2023.", "citations": ["e08d8021a60a3a96ebb57557cf0f5aa8", "a16219e0b2ae71ad988a40ddb799ad05"]}, "['Q3', '2023']": {"answer": "5591b0c9863a021e026cb22328a71ebe --> For the VC-25B, we're now maturing through the build process and the key milestones ahead are power on and first flight, both of which will essentially be behind us as we move to the 2025-2026 timeframe and represent a significant de-risking of the program.\n\n5591b0c9863a021e026cb22328a71ebe --> For commercial crew, while it has been a long road, we're preparing to execute a successful crude flight test next year and then fulfill operational launch commitments, all of which will be completed as we exit 2025-2026.\n\n5591b0c9863a021e026cb22328a71ebe --> On MQ-25, we'll get through key build and flight test milestones and transition out of the development phase as we move through the 2025-2026 timeframe.", "citations": ["5591b0c9863a021e026cb22328a71ebe"]}, "['Q4', '2022']": {"answer": "7bb52c8bbd407fa74ae88bfbf92cfce1 --> We think first delivery for the 7 will be this year and probably for the 10 the next year.", "citations": ["7bb52c8bbd407fa74ae88bfbf92cfce1"]}, "['Q2', '2021']": {"answer": "91d610d84652e5c2cfb4d41f4fe8efe3 --> We continue to expect that we will deliver the first 777X in late 2023.\n\n5683fd6ef9ad56663deb9862bd88471e --> We still expect first delivery of the 777X to occur in late 2023.", "citations": ["91d610d84652e5c2cfb4d41f4fe8efe3", "5683fd6ef9ad56663deb9862bd88471e"]}, "['Q2', '2022']": {"answer": "8a171774dadaaaedc3b03fb7d39dec7f --> We still anticipate delivery of the first 777-9 airplane in 2025 and continue to coordinate with the FAA to prioritize resources across our development programs.", "citations": ["8a171774dadaaaedc3b03fb7d39dec7f"]}, "['Q3', '2021']": {"answer": "5a1b848e40681a4c2a3b1cd6ab073a8e --> We still expect that we will deliver the first 777X in late 2023.\n\n631f0eff2a854cda432f2308debf7a6b --> We currently anticipate the first delivery of the 737 MAX 7 in early 2022 and the first delivery of the 737 MAX 10 in 2023.\n\ndc56034df6efbb2824b03c61b87bd7e6 --> The second uncrewed Orbital Flight Test now anticipated in 2022.", "citations": ["5a1b848e40681a4c2a3b1cd6ab073a8e", "631f0eff2a854cda432f2308debf7a6b", "dc56034df6efbb2824b03c61b87bd7e6"]}, "['Q4', '2021']": {"answer": "d7534a393299aea13365d2de19eb8450 --> We are still anticipating delivery of the first airplane in late 2023.", "citations": ["d7534a393299aea13365d2de19eb8450"]}, "['Q2', '2023']": {"answer": "e0e63e86cb7fd62fa9ccb4f3dd7276c2 --> The next airplane, in my view, with respect to development, has to be a meaningful change, 25%, 30% better than what flies today.", "citations": ["e0e63e86cb7fd62fa9ccb4f3dd7276c2"]}}}, {"topic": "Technological advancements", "data": {"['Q2', '2024']": {"answer": "c025b634787d4aedbd1aaaa23e186415 --> In addition, we've identified an engineering solution for the engine inlet, anti-ice system for in-production aircraft that will be implemented and certified in 2025 to support the first delivery of our 737-7 and 737-10 in the MAX family.", "citations": ["c025b634787d4aedbd1aaaa23e186415"]}, "['Q1', '2024']": {"answer": "f6687f1b71772105c30bd1ffa2054029 --> The program continues to progress towards a May 6 Crew Flight Test.", "citations": ["f6687f1b71772105c30bd1ffa2054029"]}, "['Q4', '2022']": {"answer": "ba8691da4ee5831e2282b9abb01264e9 --> in our view, the objective has to be somewhere between 25% and 30% better than it is today, and that's what we're focused on and | think we have the time to do it and the technologies to play out.", "citations": ["ba8691da4ee5831e2282b9abb01264e9"]}}}, {"topic": "Sustainable aviation technologies", "data": {}}, {"topic": "R&D investment focus", "data": {"['Q4', '2023']": {"answer": "d4d60f587ecdd44731062395ae971fa2 --> We are planning to increase our R&D spending by 5% annually over the next three years.", "citations": ["d4d60f587ecdd44731062395ae971fa2"]}, "['Q3', '2023']": {"answer": "a59063f09d01073e26c8b0f77df30285 --> We are planning to invest $2 billion in R&D over the coming year.\n\nd9e4426e50079d359fdf7080b2059ae4 --> We also expect R&D to come in slightly above our original guide tied to the higher 777X investments that I touched on earlier.", "citations": ["a59063f09d01073e26c8b0f77df30285", "d9e4426e50079d359fdf7080b2059ae4"]}, "['Q4', '2022']": {"answer": "076429b948e2e3cc5764b655c779aeb4 --> We expect R&D for 2023 to come in at about $3.2 billion versus $2.9 billion in 2022.", "citations": ["076429b948e2e3cc5764b655c779aeb4"]}}}]}, {"theme": "Regulatory and Compliance", "topics": [{"topic": "Safety certification processes", "data": {"['Q3', '2024']": {"answer": "55f000a509fc41a563d4ad78a931cb4d --> We'll continue to follow the lead of the FAA as we progress through the certification process and now expect first delivery in 2026.", "citations": ["55f000a509fc41a563d4ad78a931cb4d"]}, "['Q2', '2024']": {"answer": "cd652c99a1389d1b212bf70e4038fe89 --> We'll continue to follow the lead of the FAA as we progress through the certification process and still expect first delivery in 2025.", "citations": ["cd652c99a1389d1b212bf70e4038fe89"]}, "['Q1', '2022']": {"answer": "14a1e92f9a69f5f8a1cfabd056049a0f --> We're doing everything we can to complete the certification of the MAX 7 and MAX 10 and ensure their respective first deliveries, this year and next.\n\ne2e395c8f11d4ffac79f49d80eeb7336 --> Based on an updated assessment of the time required to meet certification requirements, we now anticipate delivery of the first 777-9 airplane in 2025.", "citations": ["14a1e92f9a69f5f8a1cfabd056049a0f", "e2e395c8f11d4ffac79f49d80eeb7336"]}, "['Q2', '2021']": {"answer": "e27bd5fdb9a1067ad1cd5e09ff591329 --> We expect that we will get that before the end of this year.\n\n07938e7724d9097319785e2b50b2bab1 --> If we get to that moment and importantly, we're not within a minute of getting certification in some way. We do have to consider real actions with respect to what the future rate ramp looks like.", "citations": ["e27bd5fdb9a1067ad1cd5e09ff591329", "07938e7724d9097319785e2b50b2bab1"]}, "['Q2', '2022']": {"answer": "1eaee59e9cb583ca44c0ba3ff1fdc4a1 --> we are working constructively with the FAA. We have our heads down. We're working towards certification by year-end on the dash-7 and the dash-10", "citations": ["1eaee59e9cb583ca44c0ba3ff1fdc4a1"]}, "['Q3', '2021']": {"answer": "631f0eff2a854cda432f2308debf7a6b --> Following the completion of the 737 MAX flight test in China during the third quarter, we continue to work toward approval by the end of the year, with a resumption of deliveries to follow in the first quarter of next year.", "citations": ["631f0eff2a854cda432f2308debf7a6b"]}}}, {"topic": "Environmental compliance measures", "data": {"['Q3', '2021']": {"answer": "0a983197cf7b68fff0ceef005257f56d --> We are implementing a requirement for US-based employees to show proof of being fully vaccinated from COVID-19 or have an approved reasonable accommodation.", "citations": ["0a983197cf7b68fff0ceef005257f56d"]}}}, {"topic": "Regulatory engagement strategies", "data": {"['Q4', '2023']": {"answer": "e61abb4fa9ef587e78adb4eaa9a17be2 --> Remember, our 2025/2026 guidance was based on achieving stability, and we have to earn that by applying resources to fix our issues and demonstrate predictability one airplane at a time, side-by-side with our regulator.", "citations": ["e61abb4fa9ef587e78adb4eaa9a17be2"]}, "['Q4', '2020']": {"answer": "31f9dbcf64adca0d87616330919d9e05 --> We assume that the remaining non-US regulatory approvals will occur during the first half of 2021.", "citations": ["31f9dbcf64adca0d87616330919d9e05"]}, "['Q1', '2021']": {"answer": "6662216893574f5ae2c92be0394cf880 --> We now assume that the remaining non-US regulatory approvals will occur this year, with approval in China most likely now in the second half of the year.", "citations": ["6662216893574f5ae2c92be0394cf880"]}, "['Q2', '2021']": {"answer": "c122d7489c3223cd7e66603925243074 --> We continue to work with global regulators and still anticipate that the remaining regulatory approvals will occur this year, including China.", "citations": ["c122d7489c3223cd7e66603925243074"]}}}, {"topic": "FAA collaboration", "data": {"['Q1', '2024']": {"answer": "14342ce7718d33c9f7efcef32f52ea82 --> We transparently engaged with the FAA and immediately went to work on a 90-day plan of quality action to drive improvements throughout our production system.\n\na53439764f4f7a2f0a4e48916104765c --> What the FAA is doing and they have been very diligent and business-like in the way they've approached this is they want a control plan and they want a control plan in 90 days that in essence monitors and measures whether our production system is in control moving forward.", "citations": ["14342ce7718d33c9f7efcef32f52ea82", "a53439764f4f7a2f0a4e48916104765c"]}, "['Q1', '2021']": {"answer": "75667aa360138e2444007137bc1edd82 --> Upon approval by the FAA, we expect the work to take a few days per airplane.", "citations": ["75667aa360138e2444007137bc1edd82"]}}}]}, {"theme": "Strategic Initiatives and Long-Term Vision", "topics": [{"topic": "Sustainability goals", "data": {"['Q1', '2023']": {"answer": "bfea1096d2c67d17d85619b90386bf30 --> We aim to achieve a return to profitability by 2025.\n\n7b705cf605b6dcecc610e20d219190bc --> we remain on track to achieve our long-term guidance including $10 billion of free cash flow in the 2025/2026 timeframe.", "citations": ["bfea1096d2c67d17d85619b90386bf30", "7b705cf605b6dcecc610e20d219190bc"]}, "['Q4', '2022']": {"answer": "cf5a8b7b2faaa2a4c68969578c3a4b0f --> 2025 to 2026 long-term guidance. Same page we showed you in November, $10 billion of free cash flow is still our objective.", "citations": ["cf5a8b7b2faaa2a4c68969578c3a4b0f"]}}}, {"topic": "Digital transformation initiatives", "data": {"['Q4', '2020']": {"answer": "f52ef8be58795e8c3683ac5a63149521 --> Our digital solutions continue to provide important capabilities to our customers, as highlighted by Frontier Airlines recent decision to sign a 10-year digital services agreement with us for their fleet.", "citations": ["f52ef8be58795e8c3683ac5a63149521"]}}}, {"topic": "Portfolio diversification", "data": {"['Q3', '2022']": {"answer": "dd32a4b3a2528cf0bb25e8f102e2ecce --> So there's no doubt that we de-risked these programs, the two big ones for the next two years.", "citations": ["dd32a4b3a2528cf0bb25e8f102e2ecce"]}, "['Q2', '2024']": {"answer": "89de67e97ebbb3572ce25541f13c04ba --> We expect the transaction to close mid-2025.", "citations": ["89de67e97ebbb3572ce25541f13c04ba"]}, "['Q1', '2024']": {"answer": "c99c6226407af32a1c8c2a604a37a9b4 --> We will likely do the change somewhere in the fourth or first quarter of next – fourth quarter this year or the first quarter of next year – we'll let that team tell us when they want to pull the trigger.", "citations": ["c99c6226407af32a1c8c2a604a37a9b4"]}}}, {"topic": "2030s product timeline", "data": {"['Q3', '2024']": {"answer": "6eb8b8107e79c34cb47aa24ece04828f --> The deal won't close till sometime next year.", "citations": ["6eb8b8107e79c34cb47aa24ece04828f"]}, "['Q1', '2023']": {"answer": "a207bc8a149e52c9dfd951741c05a467 --> [Inferred as CEO][And we still believe that 50 is the number in 2025/2026.]", "citations": ["a207bc8a149e52c9dfd951741c05a467"]}, "['Q2', '2024']": {"answer": "160a4127c098602c39e984188e3ea299 --> Inferred as management: Stepping back, the game plan to get BDS back to high single-digit margins in the medium to long term remains unchanged.", "citations": ["160a4127c098602c39e984188e3ea299"]}, "['Q3', '2023']": {"answer": "5591b0c9863a021e026cb22328a71ebe --> Fast forward to that 2025-2026 timeframe, fixed price development contracts will be substantially de-risked.\n\nf1e78948468b4a40fd0ec9d6e80842f9 --> These moves are all fundamental to accelerating the recovery by the 2025-2026 timeframe.\n\n9b351c0bec93a49b303bccb5cf3699e1 --> We're still looking forward to that stability, as Dave calls it, in the 2025-2026 timeframe and that $10 billion. That's where we're laser-like focused.", "citations": ["5591b0c9863a021e026cb22328a71ebe", "f1e78948468b4a40fd0ec9d6e80842f9", "9b351c0bec93a49b303bccb5cf3699e1"]}, "['Q4', '2022']": {"answer": "214cd823b923c39e734b1a78b41ac518 --> So for six months I think that's the course for all of us to stay focused on.\n\n526a3210cc7e8aaafa39a5c5e9b2d2b0 --> David L. Calhoun, President, Chief Executive Officer & Director [You really — Sheila, you really have to get through calendar year 2024 and then a lot of the clouds, a lot of the things that we've been wrestling with, the things that impact our margins and the lumpiness along the way, that all begins to clear as we get to the tail end of 2024 and then as we think about 2025 and on, I think that clarity will be apparent to everybody.]", "citations": ["214cd823b923c39e734b1a78b41ac518", "526a3210cc7e8aaafa39a5c5e9b2d2b0"]}, "['Q3', '2021']": {"answer": "f7710db9343c35384f23b54b702910d8 --> We are currently working toward opportunities for the second Orbital Flight Test launch in 2022, pending hardware readiness, the rocket manifest and space station availability.\n\n49830e0d0d069461be0a26a52be94adb --> David L. Calhoun, President, Chief Executive Officer & Director, The Boeing Co. [Ought to be more skewed to 2022, yeah. Yeah. It will be more skewed to 2022.]\n\n52116213417b48db9d6876888f9619a8 --> David L. Calhoun, President, Chief Executive Officer & Director, The Boeing Co. [And we have stuck to that discipline. And that was all part of the original plan and the timing for fourth quarter of 2023.]", "citations": ["f7710db9343c35384f23b54b702910d8", "49830e0d0d069461be0a26a52be94adb", "52116213417b48db9d6876888f9619a8"]}, "['Q4', '2021']": {"answer": "e18558dcd004ff735a075a925ba94d7e --> You sound pretty confident that this could be a first quarter event.", "citations": ["e18558dcd004ff735a075a925ba94d7e"]}}}]}, {"theme": "Leadership and Governance", "topics": [{"topic": "Executive introductions", "data": {}}, {"topic": "Leadership transitions", "data": {"['Q1', '2021']": {"answer": "532e8c912a8dbb9c610e0080fcdf83ba --> Over the next few months, I will be solely focused on a smooth transition of my responsibilities and then onto the next chapter of my career.", "citations": ["532e8c912a8dbb9c610e0080fcdf83ba"]}}}, {"topic": "Succession planning", "data": {}}, {"topic": "Investor relations communication", "data": {"['Q1', '2022']": {"answer": "f0e66d9c0d6eb12fbbfee32d9366787d --> This fall, we plan to host an Investor Day to share our more detailed expectations for the rest of the year and beyond.", "citations": ["f0e66d9c0d6eb12fbbfee32d9366787d"]}}}]}, {"theme": "Customer Relations and Engagement", "topics": [{"topic": "Customer satisfaction metrics"}, {"topic": "Airline partnerships"}, {"topic": "Long-term customer contracts"}, {"topic": "Feedback mechanisms"}]}, {"theme": "Defense and Aerospace Opportunities", "topics": [{"topic": "Defense sector contracts", "data": {"['Q4', '2023']": {"answer": "a2906508e84824fbbc22808419acc5ed --> You really got to put 2 points on top of that, which is what we account for in our Global Services division for the Defense side. So it's really looking more like a double-digit Defense external view that we are aiming to get towards, because we think that's a pretty decent business.", "citations": ["a2906508e84824fbbc22808419acc5ed"]}, "['Q4', '2020']": {"answer": "df2dc74c44942d82adad514d5a25b15e --> We are targeting a 20% increase in defense sector revenue by 2023.", "citations": ["df2dc74c44942d82adad514d5a25b15e"]}, "['Q1', '2022']": {"answer": "64acc60d0d8a3588e6710a077e81676a --> The present FY 2023 budget request reflects the important role our products and services had in ensuring our national security, including significantly increased funding for the F-15EX in support for our other critical products and services that support national security.", "citations": ["64acc60d0d8a3588e6710a077e81676a"]}, "['Q3', '2023']": {"answer": "a59063f09d01073e26c8b0f77df30285 --> We anticipate a 5% increase in defense segment revenue next year.", "citations": ["a59063f09d01073e26c8b0f77df30285"]}, "['Q2', '2022']": {"answer": "a1814ab8408bf0ad787b710395483c71 --> The demand outlook for the defense business remains steady and we expect 2023 revenue to be better than 2022 as the business stabilizes.", "citations": ["a1814ab8408bf0ad787b710395483c71"]}, "['Q2', '2023']": {"answer": "70a877b4de848e1d6811455184fb3439 --> Our Defense margins have to get better next year, period, full stop. | won't guess in terms of at what level, but they got to get better as we go on the trajectory to that 2025-2026 timeframe.", "citations": ["70a877b4de848e1d6811455184fb3439"]}}}, {"topic": "International defense partnerships", "data": {}}, {"topic": "Space segment growth", "data": {"['Q4', '2021']": {"answer": "5f793562aad90db019145c3c00240ac4 --> On the Commercial Crew Program, as previously shared, we and NASA anticipate the second uncrewed orbital flight test to occur in May.", "citations": ["5f793562aad90db019145c3c00240ac4"]}}}, {"topic": "Capability enhancement initiatives", "data": {}}]}, {"theme": "Sustainability and Environmental Initiatives", "topics": [{"topic": "Emission reduction technologies", "data": {"['Q4', '2020']": {"answer": "016e31740760dc11a18d696fa09369f4 --> We expect this trend to continue as our customers focus on retiring their oldest and least efficient airplanes and replacing them with new airplanes that will be as much as 25% to 40% more fuel efficient and better for the environment.", "citations": ["016e31740760dc11a18d696fa09369f4"]}, "['Q1', '2021']": {"answer": "50f3667de314562ffe74c51d0b0e0dcc --> We anticipate this trend will continue as our customers focus on retiring their oldest and least efficient airplanes and replacing them with new airplanes that will be as much as 25% to 40% more fuel-efficient with commensurate emission improvements.", "citations": ["50f3667de314562ffe74c51d0b0e0dcc"]}, "['Q2', '2021']": {"answer": "161968cf22cf393340424e9fc3b086da --> We anticipate this trend will continue as our customers focus on replacing the oldest, least efficient airplanes with new airplanes that will be as much as 25% to 40% more fuel efficient with commensurate reductions in emission.", "citations": ["161968cf22cf393340424e9fc3b086da"]}, "['Q3', '2021']": {"answer": "ccc0b521da04e8013e45ea9d9ac758dd --> The new airplanes we deliver will be as much as 25% to 40% more fuel efficient with commensurate reductions in emissions compared to the airplanes they replace.", "citations": ["ccc0b521da04e8013e45ea9d9ac758dd"]}, "['Q4', '2021']": {"answer": "4ee665934e941e9a958f9c2fbb43b0c0 --> We are committed to reducing our carbon emissions by 50% by 2030.", "citations": ["4ee665934e941e9a958f9c2fbb43b0c0"]}}}, {"topic": "Sustainable aviation fuels commitment", "data": {"['Q4', '2020']": {"answer": "0d0fc9cc56cfc8493371ec7236b0b908 --> Additionally, we've committed that our commercial airplanes will be capable and certified to fly on 100% sustainable aviation fuels by 2030.\n\n2ae72d7ee8e6d6697e716dd40418c7d8 --> The advent of sustainable fuel, already, already we're capable of living with that sustainable fuel. I believe that's going to be the 15-year answer to 2050 guidelines and approaches, because we've all worked with it, experimented with it, we know it works, and now we've got to develop a supply line for it. But I believe it's the only answer between now and 2050.", "citations": ["0d0fc9cc56cfc8493371ec7236b0b908", "2ae72d7ee8e6d6697e716dd40418c7d8"]}, "['Q1', '2021']": {"answer": "6b09cfa4f7707273052d9f231f938d85 --> and planning to release our first-ever global equity, diversity, and inclusion report and our first integrated sustainability report later this year.", "citations": ["6b09cfa4f7707273052d9f231f938d85"]}, "['Q2', '2021']": {"answer": "a8aaee360110d5f89a0b595d3dcfccb7 --> As part of this commitment, we will invest in SkyNRG Americas' first dedicated US production facility for SAF to help establish SAF supply for airports and airline customers largely on the West Coast.", "citations": ["a8aaee360110d5f89a0b595d3dcfccb7"]}, "['Q3', '2021']": {"answer": "91dba387934789f89d6c00792862c635 --> Boeing recently joined a virtual White House event on sustainable aviation, reiterating our commitment to have our commercial airplanes capable of running on 100% sustainable aviation fuels by 2030 and our partnership with SkyNRG to expand the global supply of sustainable aviation fuel.", "citations": ["91dba387934789f89d6c00792862c635"]}}}, {"topic": "ecoDemonstrator program", "data": {}}, {"topic": "Renewable energy expansion", "data": {}}]}]