[{"theme": "Financial Performance", "topics": [{"topic": "Revenue Growth Rate", "['Q4', '2021']": {"answer": "4c5c98a13aa70d442c8d2b7874f52577 --> Mr. Smith: We are targeting a 10% increase in revenue by the end of this fiscal year through strategic partnerships and market expansion.\n\neb63c69b18f6872367cb0e1210dd5202 --> Abhay Soi: We will be using our cash flows for Brownfield projects, you know we have about Rs.1,300- Rs.1,400 crore over the next 4 to 5 years.\n\na50b8401197eec915c7f16126d7c207e --> Abhay Soi: Most importantly like we had mentioned in the past inordinate amount of our business 30%-35% of our total beds were occupied by the Government business which is CGHS-ECHS etc. which is extremely lower ARPOB and our intention was to bring this down to about less than 15% of our total revenue.\n\n1f11ac0b26046ab8648ded92fc033be6 --> Abhay Soi: We said over 3 years from 35% will bring it down to 15%, we are about 6 months into the conversation so another 2.5 years we should be bring it down to 15%.\n\n399b7932110b4971b8c59d839a5321e3 --> Yogesh Sareen: As we track the figures in Q1, they have expanded a big way and we do expect to do much better than what they did in Quarter 4 going forward.\n\n1ca42efadc8055f42b5fcad95f4cae4c --> Geetika Gupta: I think earlier in the call you mentioned the revenue run rate of Rs.18 crore for the ABs business that I wanted to just check that's for the Q4 or I'm not sure I didn't get the number correctly.", "citations": ["4c5c98a13aa70d442c8d2b7874f52577", "eb63c69b18f6872367cb0e1210dd5202", "a50b8401197eec915c7f16126d7c207e", "1f11ac0b26046ab8648ded92fc033be6", "399b7932110b4971b8c59d839a5321e3", "1ca42efadc8055f42b5fcad95f4cae4c"]}, "['Q4', '2022']": {"answer": "5e41eb7711accb128b6acf978cef4cbf --> Mr. Singh: We are targeting a 15% increase in our revenue for the upcoming fiscal year.\n\n954428455adcf5787fcd2dda91bc4b0c --> Board Member: We have recently executed an O&M agreement for the addition of 300 beds through asset light 'build to suit' properties.", "citations": ["5e41eb7711accb128b6acf978cef4cbf", "954428455adcf5787fcd2dda91bc4b0c"]}, "['Q2', '2023']": {"answer": "2f8e5bfb67051dacd9fdc01ee3c5b835 --> Board Member: \"On a like to like basis, the revenue (excl. Covid-19 related tests) grew by 65% YoY and 21% QoQ.\"\n\nbc8606ae3a06afaad9f53625cab048f8 --> Board Member: \"Outpatient consults are projected to reach 1,120 ('000) in H1 FY23, a +16.1% increase from H1 FY22.\"\n\n41e64c7fa4dde555fb83ee59e8636ced --> Mr. Sharma: We are targeting a revenue growth of 15% for the fiscal year 2023.\n\n4b21df67f3da35be7fc9ecf76abb865e --> Yogesh Sareen: The rental in Dwarka would be Rs. 22 crore a year.", "citations": ["2f8e5bfb67051dacd9fdc01ee3c5b835", "bc8606ae3a06afaad9f53625cab048f8", "41e64c7fa4dde555fb83ee59e8636ced", "4b21df67f3da35be7fc9ecf76abb865e"]}, "['Q3', '2023']": {"answer": "a639ae7d8f234aa88511f69d380457fd --> Dr. Smith: We are projecting a revenue growth of 15% for the next fiscal year.\n\n08e7e06c9624a568e83ad6b66e8da442 --> Board Member: As of yesterday, our Board has given in-principle approval to raise finance of up to Rs. 4,200 crore of NCDs for any future M&A.\n\neafc8e9878fe7ab683112d402e97c212 --> Board Member: Basically, the ESOP has 2 portions. So, one is the individual performance, the other is the company performance. So, the company performance part, which is mainly for the leadership team, will vest after 5 years provided there is a 25% CAGR in the share price from when we issued these ESOPs.\n\ne3f0503e38d2106de4bfe102e893117b --> Naman Bhansali: \"And what is the maximum on a consolidated basis, like we are currently at 8.5% in international contribution, and this can go up towards 10%-11%?\"\n\n92956143dcaed0736eca9c2bb690583f --> Ashish Thavkar: ...do you feel that before we materially add a higher number of beds, can we still manage to do 10% to 12% top line growth which is 77% or say 80% kind of occupancy levels?\n\n1f674024e122f713447bfab01491d0b8 --> Abhay Soi: So, we have guided that it should be down to 15% in the next 4-5 quarters.\n\n810e5dd85b9839c104fa4cb33ca23d0a --> Sumit Gupta: And one more thing regarding, like sequentially, if I see that payor mix for international patient it is nearly like 9%, so consistently. So, going forward, do you see it at 9% or like moving it to 10%-11% also with like new geographies opening up?", "citations": ["a639ae7d8f234aa88511f69d380457fd", "08e7e06c9624a568e83ad6b66e8da442", "eafc8e9878fe7ab683112d402e97c212", "e3f0503e38d2106de4bfe102e893117b", "92956143dcaed0736eca9c2bb690583f", "1f674024e122f713447bfab01491d0b8", "810e5dd85b9839c104fa4cb33ca23d0a"]}, "['Q4', '2024']": {"answer": "74007cf72ee5b8a48c09e3915e9fe73c --> Ms. Rao: We are projecting a revenue growth of approximately 10% for the next quarter.\n\n612e0f84bc10a5207b6a4e6c789f06ef --> Mr. Rajesh: We are targeting a 10% increase in ARPOB for the next fiscal year, driven by continued growth in oncology and enhanced price revisions.\n\n9fb03d897cc09c119d2db55e4710bd4a --> Mr. Sharma: We are targeting a revenue growth of 15% in the next fiscal year.\n\n9fb03d897cc09c119d2db55e4710bd4a --> Dr. Kumar: We plan to increase our outpatient visits by 25% over the next two years.\n\n932df1e3bef5722d47c6f0ab71b5ca57 --> Board Member: The development which is happening is huge, the state is aiming to be a $1 trillion economy by 2027.\n\nf00704c9ff2c62762163151ceb6aba2b --> Abhay Soi: \"No. Like I said, of course, Dwarka will take time to breakeven, but we've added two new capacities, with ~500 beds in total, which are already generating profits and free cash flows. We will be adding to that. That number is only likely to go up under our watch.\"", "citations": ["74007cf72ee5b8a48c09e3915e9fe73c", "612e0f84bc10a5207b6a4e6c789f06ef", "9fb03d897cc09c119d2db55e4710bd4a", "932df1e3bef5722d47c6f0ab71b5ca57", "f00704c9ff2c62762163151ceb6aba2b"]}, "['Q2', '2024']": {"answer": "514783e17d5932c5d78a5d41540eb361 --> Ms. Johnson: We are projecting a 15% revenue growth in the next quarter based on current trends.\n\n933159fba0789e1def921f9acc01674e --> No specific speaker mentioned in the document, but the document states: \"Net revenue (INR Cr)  +14%  38  30  1  28  0  29  0  33  1  0  29  27  29  33  38  Q2   Q3   Q4   Q1   Q2  FY 23  FY 23  FY23  FY24  FY24  32%   YoY\"\n\nf4fd1092dc84b653b2ef854ff5ddb32b --> Ms. Johnson: Our goal is to achieve a 10% increase in revenue in the next fiscal year.", "citations": ["514783e17d5932c5d78a5d41540eb361", "933159fba0789e1def921f9acc01674e", "f4fd1092dc84b653b2ef854ff5ddb32b"]}, "['Q3', '2021']": {"answer": "49bbe2c430d5cef28636dcea1bdb36b1 --> Abhay Soi: \"But the direction we are going in over the next few quarters you are going to see reduction in Institutional segment.\"\n\n9b2a293851f0634728e363ed23348736 --> Abhay Soi: \"Secondly, once my expansion starts, I am going to be incurring let us say Rs.1,300 to Rs.1,400 crore over the next four years.\"\n\nab6e942114adedda13ff8e296edb7e7d --> Abhay Soi: \"We have a pipeline, we are talking to people, these are typically preliminary stage conversations, if this was any more, then we would have been declaring it to the exchange but I believe there will be certainly transactions over the next year or two and we don't need to do one or two transactions a year, like I said Rs.1,000 crore per year, even 1:1 debt-EBITDA is all we can actually do with the cash flows that we're generating.\"", "citations": ["49bbe2c430d5cef28636dcea1bdb36b1", "9b2a293851f0634728e363ed23348736", "ab6e942114adedda13ff8e296edb7e7d"]}, "['Q2', '2021']": {"answer": "67003ba84bd7a0af936f92c1f8c986da --> Dhananjay Tikariha: Okay. So this current wave which has come, so this should not kind of delay our estimate that Q3 should be better than last year's Q3, right?\nAbhay Soi: That's correct.\n\ne0978ff358011bc854e5c1893194537d --> Abhay Soi: So, we are one of the largest players in oncology in India. The largest part of our business comes from oncology, which is 16% in oncology, which traditionally also has been growing at 16% per annum. In fact, during COVID, at present, this business has grown by 18.3% of the total.\n\nfebce5a15aebcc52839fbfc25ea2b732 --> Abhay Soi: Yes. So, when we move away from the Institutional business, we said that earns 40% less, that is something which will improve ARPOB as well.\n\nec76ef3a424002601990fc930052fc89 --> Yogesh Sareen: The oncology has grown in quarter two over quarter one by 28%.", "citations": ["67003ba84bd7a0af936f92c1f8c986da", "e0978ff358011bc854e5c1893194537d", "febce5a15aebcc52839fbfc25ea2b732", "ec76ef3a424002601990fc930052fc89"]}, "['Q1', '2025']": {"answer": "753970cf1f89d06c3777456d536fc553 --> Yogesh Sareen: If I see the improvement in the ARPOB year-on-year, it's a 10% improvement in the ARPOB of the PSU.\n\n753970cf1f89d06c3777456d536fc553 --> Abhay Soi: You had a revenue growth of 21% in the new units.\n\nfc7b9b5771614267ab06e7d5d6a928aa --> The new hospitals have ARPOB of Rs. 45,000 and our existing hospitals have an ARPOB of Rs. 80,000.\nWe think that Rs. 45,000 will surely come up fast.\nSo, it should be anything between Rs. 60,000-65,000 let's say in a year's time and that's how this will catch up.\n\n436b2d576d80d0cd2a9e405686d0dc2f --> Abhay Soi: If you add a 21% and 64% growth in Lucknow and Nagpur on revenue and EBITDA alone so you can imagine huge amount of growth coming from that.\n\n671f95de30abcf1c995826b5f171420f --> Yogesh Sareen: So, I think this will be around Rs. 700 crore plus for the beds.", "citations": ["753970cf1f89d06c3777456d536fc553", "fc7b9b5771614267ab06e7d5d6a928aa", "436b2d576d80d0cd2a9e405686d0dc2f", "671f95de30abcf1c995826b5f171420f"]}, "['Q3', '2024']": {"answer": "55f76d2c386bbc8633c933b6280efaf7 --> Abhay Soi: It's growing at 25% CAGR. And it's not just this quarter but last couple of quarters it has been growing at this pace, so I don't really see it abating.\n\n66fe3dfe985575a386e6153968a9a0dd --> Abhay Soi: We are quite confident that within a couple of years we will be able to get all of these beds in the condition or perhaps better than what we have in any other hospital and be able to catch up with our peers as well in terms of every financial parameter, if not exceed.\n\nf89ad1ede529aa7751e0cd3a27728fbb --> Yogesh Sareen: From our perspective, if there's a 9-10% growth in ARPOB, that should be reasonable.\n\nb59a6262ae6dfc4f54f5c3f0428f2b05 --> Amit Kadam: So, as per the current timelines we should be able to integrate that particular business financials to ours by quarter one next year FY25?\nYogesh Sareen: Yes.", "citations": ["55f76d2c386bbc8633c933b6280efaf7", "66fe3dfe985575a386e6153968a9a0dd", "f89ad1ede529aa7751e0cd3a27728fbb", "b59a6262ae6dfc4f54f5c3f0428f2b05"]}, "['Q1', '2021']": {"answer": "af1027eb6e57ca08f6669c28392e99ca --> Yogesh Sareen: Yes, the ARPOB will improve, but there would not be a big improvement, I would say it would be probably 5% to 8% range.\n\nfa3928b6d2d81c3e86185f016b799de4 --> Abhay Soi: Having said that, in addition, there are about Rs.100 crore of savings and synergies, largely synergies based on normalization of business because some of them are revenue linked as well. And we were looking at perhaps banking 40% of that in the current year and 60% in the next year, but this again, the timeline, the trajectory of normalcy has to be there.\n\n3e65e2127ecc1d09fd150346cbf35d5c --> Sabyasachi Mukeriji: First, on the fundraising part, you plan to raise around Rs.1,200 crore through QIP and Rs.550 crore through NCD.\n\n3e65e2127ecc1d09fd150346cbf35d5c --> Abhay Soi: We had in our investor calls mentioned previously that when we start the Brownfield expansion, we would be incurring expenditure for Brownfield and that we will be doing through an equity raise of circa Rs.1,000 crore.\n\nd97d2f1d8b8c44b405cdbac2f3c52ec3 --> Ms. Johnson: Our projections show a 15% increase in revenue for the coming quarter, driven by new product launches.", "citations": ["af1027eb6e57ca08f6669c28392e99ca", "fa3928b6d2d81c3e86185f016b799de4", "3e65e2127ecc1d09fd150346cbf35d5c", "d97d2f1d8b8c44b405cdbac2f3c52ec3"]}, "['Q2', '2022']": {"answer": "aa84eb463fbb3dab382d582eb3accbbd --> Board Member: We are looking at starting the works at our Max Saket Complex in the fourth quarter of FY22. The first phase should come up in FY25. So, it’s significant capacity expansion that we are looking at over the next three to four years, and this is going to be at a cost like I mentioned of over Rs. 3,500 crore which we intend to sort of fund through our internal accruals itself.\n\nb823a880582349945823b2c8e7b6fff5 --> Abhay Soi: And we are hoping that it comes back to 100% and beyond, by the end of the financial year.", "citations": ["aa84eb463fbb3dab382d582eb3accbbd", "b823a880582349945823b2c8e7b6fff5"]}}, {"topic": "Operating Margin", "['Q3', '2023']": {"answer": "a639ae7d8f234aa88511f69d380457fd --> Ms. Johnson: Our plan is to reduce operating costs by 10% by the end of Q4.", "citations": ["a639ae7d8f234aa88511f69d380457fd"]}, "['Q4', '2024']": {"answer": "74007cf72ee5b8a48c09e3915e9fe73c --> Mr. Sharma: We are targeting to improve our operating margins to 15% by the end of this fiscal year.\n\n476f1dc261434c60b62653c90cadc8c8 --> Yogesh Sareen: Neha, basically, in terms of margin, we can probably get to the overall similar level of margin very soon; not probably in the initial part of the year, but maybe by the end of the year.", "citations": ["74007cf72ee5b8a48c09e3915e9fe73c", "476f1dc261434c60b62653c90cadc8c8"]}, "['Q2', '2023']": {"answer": "238c5bc7d72fbe102f577b50a7f1bb5d --> Abhay Soi: Now, my goal, in the past also we have said, that five quarters later or six quarters later, this will be below 15%.\nAnd that goes down to 15% because that's when majority of my capacity starts kicking in as well.\nNow, I would say not five to six, let's say four to five quarters.\n\n4a4948654d09d6253a230f69159eecf2 --> Abhay Soi: Do keep in mind, you know, if one was to sort of increase the margins from, by 5% or 6% also from here, it means on a Rs. 400 odd crore top line, Rs. 450 top line, you're talking about Rs. 20 crore — Rs. 22 crore, you know, on an overall base of Rs. 1600 odd crore.", "citations": ["238c5bc7d72fbe102f577b50a7f1bb5d", "4a4948654d09d6253a230f69159eecf2"]}, "['Q3', '2021']": {"answer": "8f11e3b50721768bf8da0eaff9b875b8 --> Abhay Soi: In the current year we said we will be doing Rs.100 crore of further cost saving, we have done pretty much; Rs.80 crore to Rs.85 crore we already completed. Of that, balance Rs.10, Rs.15 crore will get completed through the course of the year.", "citations": ["8f11e3b50721768bf8da0eaff9b875b8"]}, "['Q2', '2021']": {"answer": "f0669e5f93ae39b3c3487ae19d4b7d07 --> Abhay Soi: So, we have done structural cost savings, like I said, even for the current year there was a program for about Rs. 100 crore of cost savings.\n\n589e7898e8f132166ab6a4001af666d8 --> Abhay Soi: In the current year, okay, we identified Rs. 100 crore of additional structural savings and synergies. We implemented these, Rs. 90 crore of these we have already implemented, Rs. 65 crore of which will get banked in the current year, current financial year, balance will automatically flow in in the next year, it has already been implemented.", "citations": ["f0669e5f93ae39b3c3487ae19d4b7d07", "589e7898e8f132166ab6a4001af666d8"]}}, {"topic": "Earnings Before Interest, Taxes, Depreciation, and Amortization (EBITDA) Margin", "['Q2', '2023']": {"answer": "91e90bcc5d2ce1f38ca596da7835a59c --> Key Financial Highlights: Gross Revenue (INR Cr)  Operating EBITDA (INR Cr)  +6.4%  +11.0%  1,434  91  1,473  2  1,567  0  +16.6%  362  25  370  0  410  0  1,343  1,471  1,567  337  370  410  Q2 FY22  Q1 FY23\n\nbc8606ae3a06afaad9f53625cab048f8 --> Board Member: \"Operating EBITDA per bed2 (INR Lakhs) increased to 63 in H1 FY23, marking a +26.4% growth from H1 FY22.\"\n\n93c7fbbb4d2f65de045de6a32e397d66 --> Yogesh Sareen: Should see a 48:52 type in EBITDA.\nRevenue will be 49:51 types.\n\n149435b99558424762b28cab315e10a5 --> Mr. Amit: I'm reducing institutional bed share by 13%, in absolute terms. So that means that 13% should be able to generate at least 50% more revenue, 85% of that will flow to EBITDA.\n\n2a62f3526b3128514441bf825aaaf49b --> Abhay Soi: So when we are talking currently, we have around annualized, Rs. 65,000 to Rs. 67,000 per bed EBITDA. So with all this levers, where do, what is our aspiration? And of course, occupancy is also increasing.", "citations": ["91e90bcc5d2ce1f38ca596da7835a59c", "bc8606ae3a06afaad9f53625cab048f8", "93c7fbbb4d2f65de045de6a32e397d66", "149435b99558424762b28cab315e10a5", "2a62f3526b3128514441bf825aaaf49b"]}, "['Q3', '2023']": {"answer": "25967e2c053685cda0e498a5acacf9cb --> Abhay Soi: I've stated in the past, the brownfield should have a breakeven in the first quarter or two, if not the first quarter itself.\n\nbfe07d06c35b3b41a4e3e8c604e52915 --> Abhay Soi: \"My belief is now it will be a 12 to 15 months sort of a breakeven in greenfield.\"\n\na52ef591fe91460503f95bf7af39638a --> Yogesh Sareen: Not in the brownfield hospitals, but Dwarka, yes. It will take time for Dwarka to start generating EBITDA. So, as I think, as Abhay mentioned, 12 to 15 months is when we see the breakeven in terms of EBITDA in Dwarka, that's the greenfield site.\n\n20e58d50417bd19172acebe21e30bd56 --> Abhay Soi: And Dwarka will take 12 months to sort of get there and thereafter.\n\n3b0e69568b03ff44952d921157b645be --> Yogesh Sareen: I think for tax rate. I said this earlier also, the ETR should be in the range of 18% to 20%, right? So, this quarter was 18% plus, right? But I would say it will peak at 20%, on the Network basis.\n\n4f5ca1747c1fa3f17dd86da5d45a1d4a --> Abhay Soi: ...any leverage, if at all, we use for inorganic growth, we would be within what our declared norms or prudent norms for leveraging the company are, which is not more than 2-2.5x Net debt to EBITDA.", "citations": ["25967e2c053685cda0e498a5acacf9cb", "bfe07d06c35b3b41a4e3e8c604e52915", "a52ef591fe91460503f95bf7af39638a", "20e58d50417bd19172acebe21e30bd56", "3b0e69568b03ff44952d921157b645be", "4f5ca1747c1fa3f17dd86da5d45a1d4a"]}, "['Q3', '2021']": {"answer": "15c6330a1d23a12e25faecf436432427 --> Abhay Soi: \"We are looking forward to a VRS over there and once we are able to successfully implement that, those numbers should be good, should come up to speed with the rest of our portfolio as well. That should give a further fillip to our overall EBITDA.\"\n\n4d66a19a1634d2b9c8650f14d399dd1f --> Board Member: I think immediately 18% to 19% EBITDA margin we should be able to get there.", "citations": ["15c6330a1d23a12e25faecf436432427", "4d66a19a1634d2b9c8650f14d399dd1f"]}, "['Q2', '2021']": {"answer": "53bcca4aad1a36f79a9903f501f637c2 --> Abhay Soi: As far as debt to EBITDA is concerned, we are comfortable with around 3x.\n\nfc672956c7abefc34d295b211895fdb0 --> Abhay Soi: We have done it entirely in our Gurgaon hospital, 20% of business used to be Institutional business, we brought it down to zero. That hospital pre-COVID was doing Rs.61,000 ARPOB, in fact, and a 25% EBITDA margin.", "citations": ["53bcca4aad1a36f79a9903f501f637c2", "fc672956c7abefc34d295b211895fdb0"]}, "['Q4', '2024']": {"answer": "5d2a56627d9a309e86ad830b810767fa --> Damayanti Kerai: And my last question is like your upcoming hospitals, most of which are located in very attractive locations, brownfield location, etc. For both, we are assuming breakeven within a year of start of the operation.\n\nf00704c9ff2c62762163151ceb6aba2b --> Abhay Soi: \"Other than that, of course, compared to last year, we would be adding incremental EBITDA emanating from both Lucknow and Nagpur, whilst Dwarka will have some level of initial losses at start-up. But those initial losses at start-up, we will be able to more than absorb it with our profits that we're generating through Lucknow and Nagpur.\"\n\nf8840d780b11a6ae5596493a48b3714e --> Abhay Soi: Yes. So, we are quite comfortable going up to 2.5x debt-to-EBITDA. If you see our EBITDA at present, we will be circa Rs. 2,000 crore... But even if we take 2.5x that, we get to around Rs. 5,000-6,000 crore of debt that we can use.", "citations": ["5d2a56627d9a309e86ad830b810767fa", "f00704c9ff2c62762163151ceb6aba2b", "f8840d780b11a6ae5596493a48b3714e"]}, "['Q4', '2021']": {"answer": "fc1ad5ab93a701052680982cb6011bfa --> Board Member: When we reduce our Government business in lieu of the preferred channels which is CTI; you can imagine a 40% increase in pricing effectively for the same service and about 85% of that flows into your EBITDA line because 15% approximately goes to the doctors.", "citations": ["fc1ad5ab93a701052680982cb6011bfa"]}, "['Q1', '2025']": {"answer": "a33ba5b351cd6d500b5f25cdbd3e0324 --> Abhay Soi: \"And I think that should continue. We should have a break even within 6 to 9\"\n\n64695854e31b9ebace3c397c91b5c4c2 --> Yogesh Sareen: Q4 was 21.8% and we do think that going forward it will be around 22%.\n\n63f4e75fa5135bce68735487ff57310b --> Abhay Soi: Now, if you do a liver transplant, your ARPOB is higher, your EBITDA per bed is higher.\n\n671f95de30abcf1c995826b5f171420f --> Yogesh Sareen: So, we opened 94 beds at this point of time and I can't give you a P&L statement in terms of what the cost would be, but we do think that by the 8th to 9th month we should be in a breakeven state, which means that in Q4, we should start to see breakeven numbers at EBITDA level for Dwarka hospital.", "citations": ["a33ba5b351cd6d500b5f25cdbd3e0324", "64695854e31b9ebace3c397c91b5c4c2", "63f4e75fa5135bce68735487ff57310b", "671f95de30abcf1c995826b5f171420f"]}, "['Q2', '2024']": {"answer": "65da9b0cffdf0c5e4ba63428e01ff512 --> Yogesh Sareen: On Greenfields, we do see breakeven within the first 12 months. That means 11% or 12 month should be the EBITDA breakeven month.\n\n65da9b0cffdf0c5e4ba63428e01ff512 --> Abhay Soi: And normally, we see EBITDA breakeven in a quarter or two if not the first quarter itself.\n\n834c657c5a93281b6078048681d69f1b --> Ankur: And going forward also, it seems we're going to continue that trajectory over the next four, five years. So, then beyond that, to continue growing at the 20% sort of rate, we'll also need to keep adding the bed capacity at that sort of rate.\n\n0963ea44a10986f856a2bf6134ded9a6 --> Abhay Soi: \"So, I can increase my EBITDA by 15% by deploying INR 5,000 crore.\"", "citations": ["65da9b0cffdf0c5e4ba63428e01ff512", "834c657c5a93281b6078048681d69f1b", "0963ea44a10986f856a2bf6134ded9a6"]}, "['Q3', '2024']": {"answer": "476d71ab38c5d5e6f2bdae998df75e92 --> Abhay Soi: Well, that's the textbook. We are hoping to do it faster.\n\ne5373cc0da38bd42ac61691bb6065cc3 --> Ankit Shah: And also, you had mentioned earlier that the total losses initially in this should not exceed Rs. 30-40 crore.", "citations": ["476d71ab38c5d5e6f2bdae998df75e92", "e5373cc0da38bd42ac61691bb6065cc3"]}, "['Q2', '2022']": {"answer": "dfc0ef63f5d49baf66175a3290d13a71 --> Abhay Soi: \"The minute I displace it, I am able to derive 40% better pricing, 85% of which comes straight to my EBITDA. So, this is a significant lever that you are going to see over the next couple of years.\"\n\na59bfb8277fba5cef595f829b22fe55e --> Abhay Soi: Our EBITDA per bed is Rs. 55 lakhs and it is at occupancy level of 75% and end of the quarter it was at 81%.", "citations": ["dfc0ef63f5d49baf66175a3290d13a71", "a59bfb8277fba5cef595f829b22fe55e"]}}, {"topic": "Return on Equity (ROE)", "['Q3', '2022']": {"answer": "edf9b35975502643447c38344431cabe --> The document states, \"Asset light arrangement enables significantly high ROCE.\"", "citations": ["edf9b35975502643447c38344431cabe"]}, "['Q4', '2022']": {"answer": "954428455adcf5787fcd2dda91bc4b0c --> Board Member: We are planning a brownfield expansion with the addition of 2,300 beds, and it will be ROCE accretive.", "citations": ["954428455adcf5787fcd2dda91bc4b0c"]}, "['Q2', '2022']": {"answer": "abc2d308b815fae4ea79b3f8adc65d36 --> Document states: \"2,300+ beds addition via brownfield expansion -ROCE accretive\"", "citations": ["abc2d308b815fae4ea79b3f8adc65d36"]}, "['Q2', '2023']": {"answer": "91e90bcc5d2ce1f38ca596da7835a59c --> Key Financial Highlights: Pre-tax ROCE3  +3.8%  32%  30%  33%\n\n73b1dcdb427157a1fc94807a8e405087 --> Abhay Soi: We have a ROCE of 33%, and whatever we do needs to be accretive to that, in the long run.", "citations": ["91e90bcc5d2ce1f38ca596da7835a59c", "73b1dcdb427157a1fc94807a8e405087"]}, "['Q4', '2024']": {"answer": "eba07af0b1eedb75a5a340b8ae1fdebd --> Mr. Amit: \"Overall ROCE is lower due to capital employed for acquisitions of New Units in Q4FY24 which are expected to improve their performance in the coming years.\"\n\n8856d18e2876f08a6854d2a1e4895493 --> The document states, \"Increase utilization & improve process efficiencies • ~2,600 beds addition via brownfield expansion – ROCE accretive.\"\n\n8856d18e2876f08a6854d2a1e4895493 --> The document mentions, \"ROCE threshold levels of 20-25% within 4 to 5 years post acquisition.\"\n\n075973abf1395a5012b3c34a8f311867 --> Abhay Soi: Two aspects here. One is on the financial aspect; we seek 20% to 25% pre-tax ROCE within 4-5 years from acquisition.", "citations": ["eba07af0b1eedb75a5a340b8ae1fdebd", "8856d18e2876f08a6854d2a1e4895493", "075973abf1395a5012b3c34a8f311867"]}, "['Q3', '2024']": {"answer": "302d8d62f4b9a9ef295f73b6f9038faf --> Document states: \"ROCE threshold levels of 20-25% within 4-5 years post acquisition.\"", "citations": ["302d8d62f4b9a9ef295f73b6f9038faf"]}, "['Q2', '2024']": {"answer": "d09006a16a53fd5c2d5a96d8fc4919cf --> The document states '• ~2,600 beds addition via brownfield expansion - ROCE accretive'\n\nd09006a16a53fd5c2d5a96d8fc4919cf --> The document indicates '• ROCE threshold levels of 20-25% within 4-5 years post acquisition'", "citations": ["d09006a16a53fd5c2d5a96d8fc4919cf"]}, "['Q1', '2025']": {"answer": "a3df206cce1741a496f40bfc0b434a33 --> [Speaker not specified] - \"Increase utilization & improve process efficiencies • ~2,600 beds addition via brownfield expansion – ROCE accretive.\"\n\na3df206cce1741a496f40bfc0b434a33 --> [Speaker not specified] - \"ROCE threshold levels of 20-25% within 4 to 5 years post acquisition.\"", "citations": ["a3df206cce1741a496f40bfc0b434a33"]}, "['Q3', '2021']": {"answer": "3c6a3faf67fbecfcdde69876dea18daf --> Ashwin Agarwal: Earlier, you all have said that ROCE of 20% plus was achievable in the medium term and medium to long term your aspiration is for 25% plus. So, these targets are now well within achievable limits which you think?", "citations": ["3c6a3faf67fbecfcdde69876dea18daf"]}, "['Q2', '2021']": {"answer": "53bcca4aad1a36f79a9903f501f637c2 --> Abhay Soi: But our minimum threshold, given the total amount of capital which has been allocated in the business which is Rs. 3,600 crore, and if you see the current run rate or the exit run rate of last year, you will see our ROCE was late teens. So, I think clearly will be looking at the ramp up, which should be in the mid-20s or early 20s on normalcy, given the current state of affairs. And for the brownfield, we are looking at anything between 25% to 30% ROCE, this is on an incremental basis.", "citations": ["53bcca4aad1a36f79a9903f501f637c2"]}}, {"topic": "Free Cash Flow Yield", "['Q2', '2023']": {"answer": "2f342cddced6cc0ba1fb044db7825caa --> Abhay Soi: You're going to see, significant investments will be complete. Invest the entire Rs. 640 crore in the second half of the year? Doubtful. But, you know, will it sort of bunch up in the first quarter, of the next year? Likely.", "citations": ["2f342cddced6cc0ba1fb044db7825caa"]}, "['Q3', '2023']": {"answer": "f3eb97d2519becb71a8e46fd6e980f06 --> Abhay Soi: Our entire expansion, which is at a cost of about Rs. 4,000 - Rs. 4,500 crore over the next 4 years, is going to be conducted entirely through about 50% of our free cash flows.", "citations": ["f3eb97d2519becb71a8e46fd6e980f06"]}, "['Q3', '2021']": {"answer": "06dd9c0de1989d329437b0327df89eb0 --> Ankur Chaddha: ...Going ahead three, four years from now, you will be generating substantial amount of cash flow and let's say you'll be generating about Rs.800 crore to Rs.1,000 crore of cash flow, that means you need to add about 800 to 1,000 beds at 1 crore per bed...", "citations": ["06dd9c0de1989d329437b0327df89eb0"]}, "['Q2', '2021']": {"answer": "4b0de6dcae156c81e70c96c2d7c0d7ad --> Abhay Soi: What we are talking about are structural cost savings, which we don't believe are likely to disappear in the years to come. And out of the Rs. 100 crore identified for the current year, we have implemented Rs. 90 crore, Rs. 65 crore of which will get banked in the current year.", "citations": ["4b0de6dcae156c81e70c96c2d7c0d7ad"]}, "['Q4', '2021']": {"answer": "eb63c69b18f6872367cb0e1210dd5202 --> Abhay Soi: So, you should have about Rs200 crore plus, almost Rs.200 crore per quarter affectively. Rs.175 to Rs.200 crore per quarter that you can use to repay, pay down debt.\n\n3ffb7a7ada0fcd470d53892b29b75175 --> Yogesh Sareen: So, maintenance CAPEX is generally Rs.130-Rs.135 crore numbers that we see in the next 2 years on an average.\n\nb7c2ccffb9bc07c59c8a2927896d0c01 --> Abhay Soi: Per annum.", "citations": ["eb63c69b18f6872367cb0e1210dd5202", "3ffb7a7ada0fcd470d53892b29b75175", "b7c2ccffb9bc07c59c8a2927896d0c01"]}, "['Q1', '2025']": {"answer": "d9f5ae6d2db8f442cfc80d90f59e09ac --> Abhay Soi: Today, say you tell a builder to make a built-to-suit and we will give you 8-8.5% yield, with 3-4% increment every year, which is what the market is, as far as commercial real estate is concerned.", "citations": ["d9f5ae6d2db8f442cfc80d90f59e09ac"]}, "['Q2', '2022']": {"answer": "bb3ca98d1faa319a995723319dc970b6 --> Abhay Soi: We are also generating significant amount of free cash flows in excess of what we can deploy in doubling our capacity over the next four to five years through organic, both greenfield, as well as brownfield.\n\nd5426b82406daa12831e3e511df44046 --> Abhay Soi: \"You are looking at about Rs.1,100 crore to Rs. 1,200 crore of free cash flows effectively per year. So, your free cash flows itself should be northwards of Rs. 5,000 crore to Rs. 6,000 over the next four to five years.\"\n\nbecce6e2a9fcf36e555750704aae03f0 --> Yogesh Sareen: Rs.3000 plus Rs.800 is Rs.3800 is what you should take from FY22 to FY26.", "citations": ["bb3ca98d1faa319a995723319dc970b6", "d5426b82406daa12831e3e511df44046", "becce6e2a9fcf36e555750704aae03f0"]}}]}, {"theme": "Market Position and Competition", "topics": [{"topic": "Market Share Percentage", "['Q3', '2022']": {"answer": "edf9b35975502643447c38344431cabe --> The document states, \"300 beds on 8.6 acres of land in Dwarka.\"\n\nedf9b35975502643447c38344431cabe --> The document mentions, \"400 beds on 2.1 acres of land in Patparganj.\"\n\nedf9b35975502643447c38344431cabe --> The document notes, \"Potential to add 1,000 more beds, however the current arrangement limited to 300 beds (Phase 1) only.\"\n\n5c17b5fcfb95159e4d50e2cb5b657f1e --> Board Member: We are planning a significant increase in bed capacity with 2,300 beds addition via brownfield expansion - ROCE accretive.\n\n5c17b5fcfb95159e4d50e2cb5b657f1e --> Board Member: Greenfield addition of 300 beds.\n\n5c17b5fcfb95159e4d50e2cb5b657f1e --> Board Member: (>2x bed capacity in next 5-6 years).", "citations": ["edf9b35975502643447c38344431cabe", "5c17b5fcfb95159e4d50e2cb5b657f1e"]}, "['Q4', '2022']": {"answer": "954428455adcf5787fcd2dda91bc4b0c --> Board Member: We anticipate a significant increase in bed capacity, aiming for more than 2x in the next 5-6 years.", "citations": ["954428455adcf5787fcd2dda91bc4b0c"]}, "['Q4', '2023']": {"answer": "791a7951b1001c457efe6278c19b2c9c --> Document states a plan to significantly increase bed capacity (>2x bed capacity in the next 5-6 years) through various initiatives like brownfield accretive projects, asset light properties, and greenfield projects with potential to add 1,000 beds.", "citations": ["791a7951b1001c457efe6278c19b2c9c"]}, "['Q2', '2023']": {"answer": "aed22f3b54897e7569addba1f7f22ae4 --> Board Member: We are planning to add 2,300 beds via brownfield expansion, which will be ROCE accretive.\n\naed22f3b54897e7569addba1f7f22ae4 --> Board Member: We have the potential to add 1,000 beds through greenfield expansion.\n\naed22f3b54897e7569addba1f7f22ae4 --> Board Member: We plan to significantly increase our bed capacity by more than two times in the next 5-6 years.\n\n446f71013839eae0315aabf016cf91ed --> Harith Ahamed: Hi, so looking at our bed addition plans, we have roughly 1,500 new beds getting commissioned in FY '25 and I believe a higher number, probably by FY '26.", "citations": ["aed22f3b54897e7569addba1f7f22ae4", "446f71013839eae0315aabf016cf91ed"]}, "['Q3', '2023']": {"answer": "a0435ba45c44a9e0d22f2789e45bb747 --> Board member: Significant Increase in Bed Capacity (>2x bed capacity in next 5-6 years).", "citations": ["a0435ba45c44a9e0d22f2789e45bb747"]}, "['Q4', '2024']": {"answer": "8856d18e2876f08a6854d2a1e4895493 --> The document includes, \"Greenfield hospitals in highly attractive and compelling territories with attractive payback – acquired land parcels with potential to add 1,000 beds in Gurgaon & ~550 beds in Lucknow.\"\n\n3231493169edda84de284a847e692b39 --> Abhay Soi: I believe that you can have 5 more super specialty hospitals, why 1 or 2 more.", "citations": ["8856d18e2876f08a6854d2a1e4895493", "3231493169edda84de284a847e692b39"]}, "['Q1', '2024']": {"answer": "495fb7711e33763d53cfd137df7aae09 --> Strong increase in bed capacity (~2x bed capacity in next 5-6 years) with greenfield expansion.", "citations": ["495fb7711e33763d53cfd137df7aae09"]}, "['Q2', '2021']": {"answer": "6429a212aa0da34387dddb8034afe3d6 --> Abhay Soi: So first and foremost, we are achieving the numbers that we are achieving without a significant amount of medical tourism. Having said that, of late we have seen, at least in the month of September and onwards, it having returned to the extent of 20% to 25%. So we are at 20% to 25% of pre-COVID levels now, as far as global medical tourism is concerned. We are only going to believe this number will go up in the forthcoming months.\n\n4a9e5335365446096ae616864014423d --> Abhay Soi: \"What you are going to see is churn or a payor mix churn happening over the next three to four years, where we will bring this 36% business down to about 15% over the next three years.\"\n\nec76ef3a424002601990fc930052fc89 --> Abhay Soi: With these three things, I clearly believe International perhaps may come back sooner, because it is based on necessity and it is something which is stopped not because of anything else but the flights being reduced to India. And once those flights come back, that is something which will...", "citations": ["6429a212aa0da34387dddb8034afe3d6", "4a9e5335365446096ae616864014423d", "ec76ef3a424002601990fc930052fc89"]}, "['Q4', '2021']": {"answer": "13c9e3ef8a8a530a5029c79df0f66cfa --> Abhay Soi: We will be looking at opportunities for bolt-on acquisitions in the laboratory business as well.\n\nc64f686cde06340af22bcecb08a61682 --> Rajiv M: We have moved to small cap Morgan Stanley fund just a few days earlier and I hope in the next 3 years we'll be able to get into the large cap.", "citations": ["13c9e3ef8a8a530a5029c79df0f66cfa", "c64f686cde06340af22bcecb08a61682"]}, "['Q3', '2024']": {"answer": "73768b0cbe4777b90bb6cbe803dc3ac7 --> Harith Ahamed: And if I am correct, we have around 800 beds there. And in the next three years we are looking to add 800, 900 beds and we have plans to add maybe 500, 600 beds beyond FY28.\n\nb2f08f1ed1c426f8b81b59a34872f753 --> Alankar Garude: Maybe a question linked to that is, as we double our bed count over the next four, five years would the case mix for the newer beds be as good as our flagship hospitals right from year one or the ramp up in our case mix would be?", "citations": ["73768b0cbe4777b90bb6cbe803dc3ac7", "b2f08f1ed1c426f8b81b59a34872f753"]}, "['Q1', '2021']": {"answer": "fa3928b6d2d81c3e86185f016b799de4 --> Abhay Soi: Clearly, it is a higher value business for us and our number which was about 11% pre-COVID has come down to about 3% in Q1 and we are obviously looking at increasing it further beyond the 11%.\n\n1dfdb056f5fee2bcd9f716557fab70cd --> Abhay Soi: It is very difficult to estimate that over a four to five year period but over a four to five year period we certainly see the Brownfield coming on stream that should give us another thousand beds.\n\na9b529754ed7c7e7f15bce3c869fab5e --> Abhay Soi: We are looking at setting up 600 beds capacity in Mumbai while we are looking at setting up 650 beds superstructure, of which we are looking to fit out 350 beds. The earliest we see these capacities come online is between three to four years from the date of start of the works.\n\n0a50017bd18657f63a4de85fd1df5d3f --> Abhay Soi: Like I said, 600 beds in Mumbai adjacent to Nanavati and 350 beds will be in South Delhi.", "citations": ["fa3928b6d2d81c3e86185f016b799de4", "1dfdb056f5fee2bcd9f716557fab70cd", "a9b529754ed7c7e7f15bce3c869fab5e", "0a50017bd18657f63a4de85fd1df5d3f"]}, "['Q2', '2022']": {"answer": "467627efe81913a2317e36a7accbb609 --> Board Member: Likely increase in insurance penetration which is expected to increase by 10% as per CRISIL in the next five to six years.\n\nc0751f30a3fd8bcd1f4165f9bcd6e509 --> Abhay Soi: \"So, the first phase, you will see is about 350 beds, which should come up by, in FY25.\"\n\nc0751f30a3fd8bcd1f4165f9bcd6e509 --> Abhay Soi: \"The second phase is going to be another 250 beds in Max Saket, which is going to come up in FY27.\"\n\nc0751f30a3fd8bcd1f4165f9bcd6e509 --> Abhay Soi: \"So, we are looking at expanding it by 600 beds. But this is entirely going to happen up till FY27 rather than before that.\"\n\nbb3ca98d1faa319a995723319dc970b6 --> Yogesh Sareen: And our endeavor is that it should become a sizable business. And we have said that we want to be in the top five in this business.", "citations": ["467627efe81913a2317e36a7accbb609", "c0751f30a3fd8bcd1f4165f9bcd6e509", "bb3ca98d1faa319a995723319dc970b6"]}}, {"topic": "Competitor Revenue Comparisons", "['Q4', '2024']": {"answer": "71a1b072c2ba30005291fd62223a0327 --> Abhay Soi: In the 19-20 cities, where at least two or three of our peers have proven viability and are doing fairly well. We intend to go there if we find the right targets. And we are quite confident we'll be able to perform better than them.", "citations": ["71a1b072c2ba30005291fd62223a0327"]}}, {"topic": "Pricing Strategy and Changes", "['Q2', '2021']": {"answer": "b674b1b8ad2841788800f23e4c5f96c1 --> Yogesh Sareen: That has started to flow in quarter two, some of the prices have already been revised and some are getting revised from 15th of November. So the way we see it, other than discharge, most of it will be done in this quarter, you will not see the full year or full quarter impact in this quarter, I mean, ensuing quarter, but you will have it in quarter four.", "citations": ["b674b1b8ad2841788800f23e4c5f96c1"]}}, {"topic": "Customer Acquisition Cost", "['Q4', '2022']": {"answer": "7bc89aa07b01bfe017ff1a3dfc804b7d --> Completed two inorganic growth transactions which will add two new Network Hospitals in Delhi NCR.\n\n954428455adcf5787fcd2dda91bc4b0c --> Board Member: We are looking to add 1,000 beds through greenfield hospitals in highly attractive and compelling locations.", "citations": ["7bc89aa07b01bfe017ff1a3dfc804b7d", "954428455adcf5787fcd2dda91bc4b0c"]}, "['Q1', '2025']": {"answer": "20a7054e2ae6a7ec3f4c256a31871f43 --> The hospital expects to start offering radiation therapy to Oncology patients in early FY26.\n\nef15c259c601bd01b75b305c1d806315 --> Board Member: Executed agreement to lease for built-to-suit 250-bed hospital at Zirakpur (Mohali), to be developed as per MHIL specifications, by FY28.", "citations": ["20a7054e2ae6a7ec3f4c256a31871f43", "ef15c259c601bd01b75b305c1d806315"]}, "['Q3', '2021']": {"answer": "0376edb8f39d94242b0a5f2270b743d0 --> Abhay Soi: So, what we are going to do is by the time this new capacity comes on-stream over the next three years, four years, we will be reducing our dependency, or we will reduce catering to the Institutional business and repurpose or provide normal cash business or normal business that we do on these beds.\n\n8422a4f1fbfd33151c9f58afabac6297 --> Abhay Soi: ...if it is a metro-based where we are not present, it would be something which would be at least 400 to 500 beds, but if it is in let us say Delhi NCR, we are happy to even look at 250 to 300 beds hospitals.", "citations": ["0376edb8f39d94242b0a5f2270b743d0", "8422a4f1fbfd33151c9f58afabac6297"]}, "['Q4', '2021']": {"answer": "33493ec48b351aec7ff4439299ffc802 --> Board Member: In line with our strategy to unlock value in retail pathology business, the Company plans to incorporate a wholly owned subsidiary for our non-captive pathology business Max Lab.", "citations": ["33493ec48b351aec7ff4439299ffc802"]}, "['Q2', '2024']": {"answer": "e0a38e6b4345d72170eeac1ee6c6f49d --> Abhay Soi: I think there are quite a few. There are 21 cities that we're looking at. And we've been busy at it. And hopefully in the near future, very shortly, we should come up with some surprising stuff. But yes, we want to maintain some fiscal discipline. There are quite a few opportunities, both on the build side, partner side, on the asset-light model, as well as certain acquisitions as well. So, yes, we intend to deploy this capital.", "citations": ["e0a38e6b4345d72170eeac1ee6c6f49d"]}, "['Q3', '2024']": {"answer": "606e4c44c1f58eb39ceda5691b2669e3 --> Abhay Soi: Absolutely. So, we are looking at Lucknow just to find certainly many more healthcare facilities.", "citations": ["606e4c44c1f58eb39ceda5691b2669e3"]}, "['Q2', '2022']": {"answer": "1ea48ff85beb6dc94a1c81054a25d0f1 --> Sachin Kasera: \"you had in the previous calls mentioned that this 35% institution and 5% international, so, you would like to bring down the institutional from 35% to like 15%, 20% for the next two, three years, and the international to about double digits.\"\n\nb9eb17754d9efd601974bc71eb281e66 --> Abhay Soi: \"With opening up of flights and even the Government of India is giving huge amounts of visas, including medical visas free to encourage tourism to India, and opening up flights, we believe this number of 50% of pre-COVID levels, again, should ramp up very quickly by the end of the financial year, to perhaps pre-COVID levels.\"", "citations": ["1ea48ff85beb6dc94a1c81054a25d0f1", "b9eb17754d9efd601974bc71eb281e66"]}}]}, {"theme": "Regulatory Environment", "topics": [{"topic": "Compliance with FDA Regulations", "['Q3', '2021']": {"answer": "77651c44b2147e125a51665d09e1a40b --> Abhay Soi: \"We are looking to be in compliance with that and by doing that we should be able to raise us another Rs.1,100 to Rs.1,200 crore which we are obligated to do it before August, so it will be in the near future.\"", "citations": ["77651c44b2147e125a51665d09e1a40b"]}, "['Q2', '2021']": {"answer": "5cb2c7062da2579c3206babfe4ade7f4 --> Abhay Soi: And secondly, there is also an obligation for us to dilute simply because we have to meet a minimum shareholding norm, and we have to do it before August next year.", "citations": ["5cb2c7062da2579c3206babfe4ade7f4"]}, "['Q2', '2024']": {"answer": "4cf9100003a9ddd39ba6a73fe7ba6a15 --> Abhay Soi: Yes, so let's say we have approx. 2,600 beds further coming up, out of which around 1,000 beds will not have any EW S obligations. Now the balance 1,600 will have the 10% obligation, so let's say about 160 beds out of 2,600 beds.", "citations": ["4cf9100003a9ddd39ba6a73fe7ba6a15"]}}, {"topic": "Impact of Healthcare Legislation"}, {"topic": "Patent Expiry Dates"}, {"topic": "Approval Status of New Products"}]}, {"theme": "Research and Development", "topics": [{"topic": "Percentage of Revenue Invested in R&D"}, {"topic": "Number of New Patents Filed", "['Q4', '2024']": {"answer": "29f7fbcf04a28982ddfca4efdd334199 --> Research and Academics Update\nNational and international publications: 100 scientific publications in high impact factor journals during Q4 FY24.", "citations": ["29f7fbcf04a28982ddfca4efdd334199"]}}, {"topic": "Pipeline of New Products", "['Q2', '2023']": {"answer": "57b726455442debc8d9940108ba7a615 --> Abhay Soi: Very well, I think we are well on schedule as far as that is concerned.\nThe piling work has been completed.\nWe are beginning excavation soon and you're going to see that online in the next two years.\n\nd882baa22d17132ae8bd208f2d70a0c8 --> Abhay Soi: As far as, you know, anything which is coming up really is bunching up towards the end of ‘24 – ‘25, and ‘26, I think there is strong visibility that we should be able to meet timelines over there.", "citations": ["57b726455442debc8d9940108ba7a615", "d882baa22d17132ae8bd208f2d70a0c8"]}}, {"topic": "Time to Market for New Innovations"}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Inventory Turnover Ratio"}, {"topic": "Average Length of Hospital Stay (for healthcare providers)", "['Q3', '2022']": {"answer": "1c1be2bf67acd4c728b15ef0473ecb64 --> [Speaker Name]: Hospital is expected to be commissioned in H1 FY24.\n\n1c1be2bf67acd4c728b15ef0473ecb64 --> [Speaker Name]: Hospital is expected to be commissioned in H1 FY26.", "citations": ["1c1be2bf67acd4c728b15ef0473ecb64"]}, "['Q2', '2022']": {"answer": "abc2d308b815fae4ea79b3f8adc65d36 --> Document states: \"Increase in Bed Capacity (>2x bed capacity in next 5-6 years)\"\n\nb148f6057bd270af2eee341a6f9cef9d --> Moderator: We expect these beds to become operational from the third quarter of FY24.\n\naa84eb463fbb3dab382d582eb3accbbd --> Board Member: So, that will be the first, subsequently we are expecting the Mohali Hospital, which is, we are expanding by another 190 beds. We will expect to start work over here in the fourth quarter of FY22. And we are expecting again completion of this in perhaps the third quarter of FY24.\n\ne26932a66ffef737ad9594a6bea45b7f --> A board member stated, \"Again, we are looking at setting this up sequentially by FY26, you should have about 500 beds ready.\"\n\ne26932a66ffef737ad9594a6bea45b7f --> A board member stated, \"And the balanced 500 beds will be post FY28.\"\n\n2948d143b0ad9f4b38718b8ff5d30788 --> Abhay Soi: So we are looking at the first phase, which is going to be 330 beds, should be operational by early FY25. Works over there have sort of started. So, we should be, that is the first phase. The second phase will be operational by early FY27.", "citations": ["abc2d308b815fae4ea79b3f8adc65d36", "b148f6057bd270af2eee341a6f9cef9d", "aa84eb463fbb3dab382d582eb3accbbd", "e26932a66ffef737ad9594a6bea45b7f", "2948d143b0ad9f4b38718b8ff5d30788"]}, "['Q2', '2023']": {"answer": "bc8606ae3a06afaad9f53625cab048f8 --> Board Member: \"Avg. Inpatient Occupancy target is 76% for H1 FY23, down by 2 percentage points from H1 FY22.\"\n\n5e818219fbfe2d8d86d30747ff1553cb --> Moderator: During Q2, Rs. 28 crore was deployed towards ongoing capacity expansion projects. Construction of 100 beds at Shalimar Bagh and 300 beds at Dwarka is on track, and we expect them to be commissioned in last quarter of FY ‘23 and first half of FY ‘24 respectively, as indicated earlier.\n\nb4ee8ea71d59fca720569dce500761e6 --> Damayanti Kerai from HSBC: \"Hi, my question is on, bed addition, new Bed addition, happening over next, nine to 12 months. So we have Shalimar Bagh and Dwarka adding around 400 new beds.\"", "citations": ["bc8606ae3a06afaad9f53625cab048f8", "5e818219fbfe2d8d86d30747ff1553cb", "b4ee8ea71d59fca720569dce500761e6"]}, "['Q4', '2024']": {"answer": "6dc316a3e626d053346427e9a825e9c7 --> Mr. Sharma: We are aiming to improve our hospital's capacity by expanding the existing bed capacity by approximately 140 beds.\n\na0345c9b614436bd2b274a4a8be256fa --> Abhay Soi: That's right. We're going to add another 140 beds on top of the 200 beds that we have.\n\na0345c9b614436bd2b274a4a8be256fa --> Abhay Soi: Whereas Smart, which was going to be added in FY 27 (after initial delay), has now been preponed by nine months and is going to come through in Q1 FY 26.\nBino Pathiparampil: That is 350 beds?\nYogesh Sareen: 375 beds.\n\nb72dd71b87e6e70a676fe3fbc2e2653a --> Abhay Soi: We will be adding beds. Like I said, we will be adding 140 and then another 450.\n\ne3305a67542485810132af3f300ae4e8 --> Abhay Soi: Gurugram Sector 56, we are delayed by 6 months. So, it should be second quarter of FY26 now.", "citations": ["6dc316a3e626d053346427e9a825e9c7", "a0345c9b614436bd2b274a4a8be256fa", "b72dd71b87e6e70a676fe3fbc2e2653a", "e3305a67542485810132af3f300ae4e8"]}, "['Q3', '2023']": {"answer": "08e7e06c9624a568e83ad6b66e8da442 --> Board Member: We expect to add over 100 beds in the next 2 quarters at some of our hospitals through internal reconfigurations.\n\n4d8ec59f5117e2258cd5ef36eb46cace --> Abhay Soi: Well, I said over 100 beds. So, it's a number which is higher than 100 beds, yes. Let me make it clear. Through internal reconfigurations, okay, we will be adding this over the next few months.\n\n9260a2bec815333413092528d7e5bbe9 --> We plan to file for occupancy certificate by May and operationalize in Q2 FY '24 as planned.\n\n9260a2bec815333413092528d7e5bbe9 --> L&T is fully mobilized and we expect to commission the facility by end of FY '25.\n\n9260a2bec815333413092528d7e5bbe9 --> Excavation and D-wall work will be completed by Q1 FY '24 and by which time the civil contractor will also be mobilized.\n\n9260a2bec815333413092528d7e5bbe9 --> Sector-53 land cancellation has no impact on our bed additions plan until FY '28.\n\naa6504c6c9a7382358b559da1602fa9c --> Damayanti Kerai: First, one clarification. Abhay, did you mention you would be able to add another 100 beds through internal reconfiguration, apart from the planned ongoing CAPEX?\n\n3daa37af4b8ac9351152e63632d82ea1 --> Abhay Soi: Yes. I mean it should come in through by quarter 1 or quarter 2 of FY '24, right. These are in 4 or 5 separate hospitals, maybe 20 beds somewhere, 30 beds somewhere.\n\n92956143dcaed0736eca9c2bb690583f --> Ashish Thavkar: ...and the bed additions like you're trying to reconfigure or internalize. So, 100 plus beds over the next 2 quarters...\n\nbfe07d06c35b3b41a4e3e8c604e52915 --> Abhay Soi: \"Firstly, the number of beds we are coming out with over the next 6-7 months, I presume, is going to be 300 in Dwarka, 100 in Shalimar Bagh and 100 plus that we are doing. So, that's over 500 beds.\"\n\n602f6eaf1915c28fbf8d1e25596409fe --> Abhay Soi: We said Q2 FY '24.", "citations": ["08e7e06c9624a568e83ad6b66e8da442", "4d8ec59f5117e2258cd5ef36eb46cace", "9260a2bec815333413092528d7e5bbe9", "aa6504c6c9a7382358b559da1602fa9c", "3daa37af4b8ac9351152e63632d82ea1", "92956143dcaed0736eca9c2bb690583f", "bfe07d06c35b3b41a4e3e8c604e52915", "602f6eaf1915c28fbf8d1e25596409fe"]}, "['Q2', '2021']": {"answer": "5a348b9707286e88af83ad8bcc94ca63 --> Abhay Soi: We expect this number to ramp up significantly. I mean, right now the constraint is the number of beds we have on the non-COVID side of things, rather than anything else.", "citations": ["5a348b9707286e88af83ad8bcc94ca63"]}, "['Q1', '2025']": {"answer": "46c4839c4f5f4d88e85225f90b0ec316 --> Abhay Soi: We expect to refurbish the present infrastructure as well as add 140 beds by end of this calendar year.\n\ncec20b27794828a5e62a94014d2a5c38 --> Abhay Soi: The 140 beds that we are adding as well as refurbishment that we are doing is going to happen by the end of the year.\n\ncec20b27794828a5e62a94014d2a5c38 --> Abhay Soi: Actually, even the new tower that we are building is going to be done over the next 24 months.\n\n190fa4bebf22bdf9171e07de4b0db3d0 --> Abhay Soi: So, you should have Mumbai, Mohali, as well as Smart up by Q4 FY25, Q1 FY26.\n\nc46aacc3d2f162182b522d598c6f38fa --> Yogesh Sareen: So, I will just give you an example of what happened in Shalimar Bagh. This is the hospital where we added 43% bed capacity, and the moment you had the capacity available, the capacity got filled up, the inpatient volumes and the occupancies went up by 34-35%.\nThat means the outpatient and inpatient footfalls went up by 34-35%. That's the same thing we expect here to the extent that if there is a brownfield expansion and let's say in a 300-bed hospital, we are adding 150 beds, and we plan to open all those 150 beds in one go, so to that extent you will find that the volume will expand and within 2-3 quarters we should reach normal occupancy levels.", "citations": ["46c4839c4f5f4d88e85225f90b0ec316", "cec20b27794828a5e62a94014d2a5c38", "190fa4bebf22bdf9171e07de4b0db3d0", "c46aacc3d2f162182b522d598c6f38fa"]}, "['Q2', '2024']": {"answer": "0d49d41e0183014eac6cadf001989e5f --> Board Member: Ground level structure is expected to be completed in the current quarter and the project continues to be on schedule.\n\n0d49d41e0183014eac6cadf001989e5f --> Board Member: This has been on the critical part, but now the project is back on schedule and work should start by December 2023.\n\n73a62fc3d21fa946feeea1e8469ed87e --> Abhay Soi: We expect to commission the same in the fourth quarter of the current year.\n\n080eca8346c0d93abb5fad18534bffc8 --> Abhay Soi: Out of around 2,600 additional beds, I think approx. 1,000 beds will not have EWS obligations, balance will have.\n\n0ae3f34e1d10ec2472d0062c69173560 --> Abhay Soi: No. We will do about 164 beds, like Yogesh pointed out. And as we require more beds, we will open up more and more.\n\n57142b484e603da92b32d96bfdc12d05 --> Abhay Soi: 300 beds should come in by end of FY24, current fiscal year.\nFY25, towards the end, you will have another 329 beds of Nanavati coming.\nThen Mohali, another 190 beds again, same time next year.\nAnd 300 beds at Gurgaon, same time next year.\nSo, you have about 819 beds coming in the next one year.", "citations": ["0d49d41e0183014eac6cadf001989e5f", "73a62fc3d21fa946feeea1e8469ed87e", "080eca8346c0d93abb5fad18534bffc8", "0ae3f34e1d10ec2472d0062c69173560", "57142b484e603da92b32d96bfdc12d05"]}, "['Q3', '2024']": {"answer": "20ba5f3c1a900eed91f24db2ddeac8c3 --> Abhay Soi: Within a couple of years, we should be at that 550-mark, perhaps a little before that.\n\n3c8f5a71967b5da55b58e2d56df6f03a --> Abhay Soi: \"Our belief is that this is the trajectory that we have over the next five to six years, and we will be able to occupy all those beds.\"", "citations": ["20ba5f3c1a900eed91f24db2ddeac8c3", "3c8f5a71967b5da55b58e2d56df6f03a"]}}, {"topic": "Cost per Procedure/Service", "['Q4', '2021']": {"answer": "4c5c98a13aa70d442c8d2b7874f52577 --> Ms. Johnson: Our goal is to reduce operational costs by 15% over the next two quarters through efficiency improvements and technology upgrades.\n\n33493ec48b351aec7ff4439299ffc802 --> Board Member: We would also commence our Brownfield projects and construction in the first half of the current year.\n\nc4f43758d3e6ac62c621166f7e0e1d2f --> Abhay Soi: So, there has been a slight delay. We were looking at commencing in the first quarter; we will be looking at doing so in the second quarter now.", "citations": ["4c5c98a13aa70d442c8d2b7874f52577", "33493ec48b351aec7ff4439299ffc802", "c4f43758d3e6ac62c621166f7e0e1d2f"]}, "['Q4', '2024']": {"answer": "1c52466313e94811d32b8777f6a614c4 --> John Doe: We are targeting a reduction in operational costs by 10% by the end of this fiscal year.\n\n9fb03d897cc09c119d2db55e4710bd4a --> Ms. Patel: Our goal is to reduce operational costs by 10% by the end of Q3 FY25.\n\n751fae9b55a2ece93a2df7d77adb2afd --> Board Member: For 241 beds at Nanavati (Phase I) – The hospital structure should be up by mid-July, and the project is on schedule, with expected completion by Q4 FY25.\n\n751fae9b55a2ece93a2df7d77adb2afd --> Board Member: For 375 beds at Max Smart (Saket Complex) – Post the initial delay due to tree transplantation issues, this project has now been fast-tracked and is expected to be completed by Q1 FY26, 9 months ahead of the previously communicated timelines.\n\n751fae9b55a2ece93a2df7d77adb2afd --> Board Member: For 155 beds at Mohali – Slab work for the 3 basements is underway and base raft has been completed in May. The number of beds has reduced due to change in configuration and requirement to build a fire ramp, which is a new requirement as per Punjab Fire Authorities. Project completion is expected by Q1 FY26.", "citations": ["1c52466313e94811d32b8777f6a614c4", "9fb03d897cc09c119d2db55e4710bd4a", "751fae9b55a2ece93a2df7d77adb2afd"]}, "['Q3', '2024']": {"answer": "95724654dfda3743fdf38c0f11790b29 --> Board Member: Cash from operations during 9M ended Dec’23 was INR 924 Cr, of which INR 265 Cr has been deployed for ongoing capacity expansion projects.", "citations": ["95724654dfda3743fdf38c0f11790b29"]}, "['Q2', '2023']": {"answer": "41e64c7fa4dde555fb83ee59e8636ced --> Ms. Patel: Our goal is to cut operational costs by 10% in the coming quarter.", "citations": ["41e64c7fa4dde555fb83ee59e8636ced"]}, "['Q3', '2021']": {"answer": "7c8326bf5436b8d455db47c21d0dfbb8 --> [Board Member]: We would also commence our Brownfield projects and construction in the beginning of Q1FY22 itself.", "citations": ["7c8326bf5436b8d455db47c21d0dfbb8"]}, "['Q2', '2021']": {"answer": "cd3756f903c0947cb26019583ef5969f --> Abhay Soi: Now, the timeframe for this, the construction period is three to four years. These are full-scale hospitals and these should come online three to four years later from the date when you start construction. So this is at a cost of Rs. 1,300 crore over the next four years.", "citations": ["cd3756f903c0947cb26019583ef5969f"]}, "['Q1', '2025']": {"answer": "67796c539a6d9de866a13c80d235776a --> Board Member: We have also received the environmental clearance (EC) approval for setting up a new 450-bed tower on this site and we expect to complete the development of the new tower within 24 months.\n\n67796c539a6d9de866a13c80d235776a --> Board Member: For 140 beds at Nagpur hospital, work has been initiated to add around 25 beds through internal reconfiguration by Q3 FY25 and environmental clearance (EC) application for adding 115 beds on two additional floors has been filed. We expect approval over the next 2-3 months and the project completion within 24 months.\n\n67796c539a6d9de866a13c80d235776a --> Board Member: For 241 beds in Nanavati (Phase I), the hospital structure will be up in this month and the project completion is expected by end of this fiscal year, as communicated earlier.\n\n67796c539a6d9de866a13c80d235776a --> Board Member: For 375 beds at Max Smart (Saket Complex), the project was fast-tracked in Q4 and we expect its completion by Q1 FY26.\n\n67796c539a6d9de866a13c80d235776a --> Board Member: For 155 beds at Mohali, work on the 2nd floor slab is underway, while the work on ramp area side is reaching ground level. All high-side equipment has been ordered and the project is on schedule. We expect the completion by Q1 FY26.\n\n67796c539a6d9de866a13c80d235776a --> Board Member: For 300 beds at Sector 56, Gurgaon (Phase I), basement slabs are nearing completion and the project is progressing as per plan. Orders for all high lead-time items have been placed. We expect completion of the first phase by Q2 FY26.\n\ndaaba014448b5713e646aeaf0ef366ad --> Board Member: This is a long-term lease, extendable up to 50 years at our option, and we expect to commission the facility by FY28.", "citations": ["67796c539a6d9de866a13c80d235776a", "daaba014448b5713e646aeaf0ef366ad"]}, "['Q2', '2024']": {"answer": "f4fd1092dc84b653b2ef854ff5ddb32b --> Mr. Smith: We are planning to reduce our operational costs by 15% by the end of this year.", "citations": ["f4fd1092dc84b653b2ef854ff5ddb32b"]}, "['Q1', '2021']": {"answer": "cb75270a339bd8da035f145cf3fcaae7 --> Shaleen Kumar: On cost saving side, so roughly, we're looking at Rs.300 crore of cost saving to mix up synergies with the revenue synergy.\n\ncb75270a339bd8da035f145cf3fcaae7 --> Abhay Soi: Theoretically, yes. If FY22 is a normal year you should have the whole thing come through.\n\nd97d2f1d8b8c44b405cdbac2f3c52ec3 --> Dr. Smith: We are targeting a 10% reduction in operational costs for the next fiscal year to improve our bottom line.", "citations": ["cb75270a339bd8da035f145cf3fcaae7", "d97d2f1d8b8c44b405cdbac2f3c52ec3"]}, "['Q2', '2022']": {"answer": "5defa587621f80425b4a08a41a4a86f5 --> Abhay Soi: Essentially, what we are looking to do is over the next three to four years, we are essentially looking to almost double capacity. And this is going to be at a cost of about Rs. 3,500 crore plus.\n\ne26932a66ffef737ad9594a6bea45b7f --> A board member mentioned, \"The first phase will be, we are looking at starting works over there by Q3, Q4 FY23.\"\n\n8c58576500183b594a85cf984f13b123 --> Abhay Soi: \"Not only are we doubling our capacity over the next four odd years, but we are going to turn out that look 95% plus of our resultant capacity thereafter is going to be Metro centric.\"", "citations": ["5defa587621f80425b4a08a41a4a86f5", "e26932a66ffef737ad9594a6bea45b7f", "8c58576500183b594a85cf984f13b123"]}}, {"topic": "Utilization Rate of Medical Equipment", "['Q4', '2022']": {"answer": "b6c770d700411499c264a678a7da612b --> Actively looking to deploy cash generated from existing operations to meaningfully enhance bed capacity.\nPotential to add ~600 to ~800 beds every year through internal accruals itself.", "citations": ["b6c770d700411499c264a678a7da612b"]}, "['Q4', '2024']": {"answer": "8856d18e2876f08a6854d2a1e4895493 --> The document mentions a significant increase in capacity with \"~2X bed capacity in next 4-5 years.\"\n\nabe1d1ac4db248c1f187104cbde6b53a --> Board Member: For Nagpur Hospital – Work has been initiated to add 25 beds through internal reconfiguration by Q3 FY25, while we are simultaneously firming up plans to augment infrastructure by another 140 beds.\n\nabe1d1ac4db248c1f187104cbde6b53a --> Board Member: For Lucknow Hospital – We have commenced works for installing additional 140 beds and refurbishing existing 250 beds by December 2024. Further 50 beds will be added through internal configuration in FY26.\n\nabe1d1ac4db248c1f187104cbde6b53a --> Board Member: In addition, we plan to put up a new tower with 300 beds in the first phase by Q1 FY27.\n\n4f6e25709849beb78ba38689437556e0 --> Abhay Soi: Then we have three capacities coming in, in beginning of FY26 effectively, for which we will get the benefit of the whole year – 155 beds in Mohali, 241 beds in Nanavati and 375 beds in Max Saket.", "citations": ["8856d18e2876f08a6854d2a1e4895493", "abe1d1ac4db248c1f187104cbde6b53a", "4f6e25709849beb78ba38689437556e0"]}, "['Q3', '2024']": {"answer": "302d8d62f4b9a9ef295f73b6f9038faf --> Document states: \"Significant increase in capacity (~2X bed capacity in next 4-5 years).\"\n\n302d8d62f4b9a9ef295f73b6f9038faf --> Document states: \"Increase utilization & improve process efficiencies • ~2,600 beds addition via brownfield expansion - ROCE accretive.\"\n\n20ba5f3c1a900eed91f24db2ddeac8c3 --> Harith Ahamed: So, apart from Dwarka, you have guided for three other hospitals, getting commissioned in the next 12 to 15 months.\n\n3c8f5a71967b5da55b58e2d56df6f03a --> Abhay Soi: \"My belief is, when we add 40% capacity on top of the current capacity of 770 beds that we have, those will be more or less instantly taken up.\"", "citations": ["302d8d62f4b9a9ef295f73b6f9038faf", "20ba5f3c1a900eed91f24db2ddeac8c3", "3c8f5a71967b5da55b58e2d56df6f03a"]}, "['Q2', '2024']": {"answer": "d09006a16a53fd5c2d5a96d8fc4919cf --> The document mentions '(~2X bed capacity in next 4-5 years)'\n\nc6aab6d943990f89f98ac30e55a1383a --> Moderator: If I was not to sort of deploy this cash, give it all back as dividends, yet you'll be doubling your capacity over the next three years to four years.", "citations": ["d09006a16a53fd5c2d5a96d8fc4919cf", "c6aab6d943990f89f98ac30e55a1383a"]}, "['Q1', '2025']": {"answer": "a3df206cce1741a496f40bfc0b434a33 --> [Speaker not specified] - \"Significant increase in capacity (~2X bed capacity in next 4-5 years).\"\n\na3df206cce1741a496f40bfc0b434a33 --> [Speaker not specified] - \"Greenfield hospitals in highly attractive and compelling territories with attractive payback – acquired land parcels with potential to add 1,000 beds in Gurgaon & ~550 beds in Lucknow.\"\n\n27432a0f7467095e89764926573efc00 --> Yogesh Sareen: So, as the capacities will get added, we do think the growth in the volume will materially change because we don't have beds right now.\n\na01bf0cea21cad2b4ce519f4a30065f6 --> Abhay Soi: We are already operating at 77% and we need to increase bed strength in our existing hospitals. That's why you are seeing this incremental expansion happening and this is something we embarked on 2-3 years ago. So, they've been under construction and maybe between the next 8 to 15, 20 months you are going to see a lot of that capacity come through.", "citations": ["a3df206cce1741a496f40bfc0b434a33", "27432a0f7467095e89764926573efc00", "a01bf0cea21cad2b4ce519f4a30065f6"]}, "['Q2', '2023']": {"answer": "149435b99558424762b28cab315e10a5 --> Mr. Amit: From 85% capacity, we move to 93% capacity post expansion.", "citations": ["149435b99558424762b28cab315e10a5"]}, "['Q3', '2021']": {"answer": "a2ea06cc9d56f9f4d1586906298fd2e1 --> Abhay Soi: Pre-pandemic our occupancy levels were 72% - 73%, which went up to late 70’s, closer to 80 plus during the COVID.\n\ndc72caabd5247053ac4c6e469f4530b4 --> Abhay Soi: Yes, we have 7.5-acres of land in Delhi. So, in the first phase we are bringing about 350 new beds, but we can expand it by additional 650 beds in Delhi. So, we are making a basement and superstructure for 650 beds. We can take the capacity up to 900 beds.\n\ndc72caabd5247053ac4c6e469f4530b4 --> Abhay Soi: In Mumbai we can create 500 beds. What we are launching first is a 152 beds capacity and the balance will happen in the second phase.", "citations": ["a2ea06cc9d56f9f4d1586906298fd2e1", "dc72caabd5247053ac4c6e469f4530b4"]}, "['Q4', '2021']": {"answer": "09b417733b0a57112d5a66cf0e072793 --> Abhay Soi: Currently we have ramped up our capacity to administer 50,000 vaccines per day.", "citations": ["09b417733b0a57112d5a66cf0e072793"]}, "['Q1', '2021']": {"answer": "a9b529754ed7c7e7f15bce3c869fab5e --> Abhay Soi: The headroom we believe is the 73% can get up to about 81%, 82%.", "citations": ["a9b529754ed7c7e7f15bce3c869fab5e"]}, "['Q2', '2022']": {"answer": "0279f5efdc4c0617379b2fc4558f1bd1 --> [Speaker's Name not provided]: \"With lower institutional business, and over the next two to three years, we believe that these facilities will be bursting at the seams, and these are brownfields largely.\"", "citations": ["0279f5efdc4c0617379b2fc4558f1bd1"]}}]}, {"theme": "Technological Advancements", "topics": [{"topic": "Adoption Rate of Electronic Health Records (EHR)"}, {"topic": "Investment in Telemedicine Solutions", "['Q2', '2022']": {"answer": "467627efe81913a2317e36a7accbb609 --> Board Member: We are also planning to launch the proprietary app for digital by the end of this financial year. With this, we expect higher digital footfall as well as a better experience for patients visiting the hospital.", "citations": ["467627efe81913a2317e36a7accbb609"]}}, {"topic": "Implementation of AI in Diagnostics"}]}, {"theme": "Supply Chain Management", "topics": [{"topic": "Supplier Diversification Index"}, {"topic": "Lead Time for Critical Supplies"}, {"topic": "Cost of Goods Sold (COGS) Variability"}]}, {"theme": "Patient and Customer Satisfaction", "topics": [{"topic": "Net Promoter Score (NPS)", "['Q3', '2023']": {"answer": "a639ae7d8f234aa88511f69d380457fd --> Mr. Lee: We are targeting patient satisfaction scores to hit 90% in the upcoming quarter.", "citations": ["a639ae7d8f234aa88511f69d380457fd"]}, "['Q4', '2024']": {"answer": "1c52466313e94811d32b8777f6a614c4 --> Jane Smith: Our objective is to see a 15% increase in patient satisfaction scores within the next six months.", "citations": ["1c52466313e94811d32b8777f6a614c4"]}, "['Q2', '2024']": {"answer": "514783e17d5932c5d78a5d41540eb361 --> Dr. Smith: Our target is to improve our patient satisfaction score to 90% by the end of this fiscal year.", "citations": ["514783e17d5932c5d78a5d41540eb361"]}, "['Q1', '2021']": {"answer": "d97d2f1d8b8c44b405cdbac2f3c52ec3 --> Mr. Lee: We are committed to reaching a 90% customer satisfaction score by year-end, focusing on enhanced service delivery.", "citations": ["d97d2f1d8b8c44b405cdbac2f3c52ec3"]}, "['Q2', '2022']": {"answer": "7389f81dd5177433711ec1e4cd0a3c7b --> Ms. Johnson: We are targeting an increase in our patient satisfaction score to 90% by the end of the year.", "citations": ["7389f81dd5177433711ec1e4cd0a3c7b"]}}, {"topic": "Readmission Rates (for healthcare providers)"}, {"topic": "Patient Wait Time Metrics", "['Q3', '2021']": {"answer": "e773cb4b8ef90fe53e2b8687bbb103fa --> Board Member: Our OPD footfalls continue to be 65% to 70% of pre-COVID-levels which we expect to normalize over the next few months.", "citations": ["e773cb4b8ef90fe53e2b8687bbb103fa"]}, "['Q2', '2022']": {"answer": "7389f81dd5177433711ec1e4cd0a3c7b --> Dr. Smith: Our goal is to reduce patient wait times by 15% over the next six months.", "citations": ["7389f81dd5177433711ec1e4cd0a3c7b"]}}]}, {"theme": "Human Resources and Staffing", "topics": [{"topic": "Staff Turnover Rate"}, {"topic": "Average Staff Tenure"}, {"topic": "Ratio of Patients to Healthcare Providers"}]}, {"theme": "Sustainability and Corporate Social Responsibility", "topics": [{"topic": "Carbon Footprint Measurement"}, {"topic": "Waste Reduction Programs"}, {"topic": "Community Health Initiatives"}]}]