[{"theme": "Revenue Growth and Financials", "topics": [{"topic": "Organic growth drivers", "data": {"['Q4', '2021']": {"answer": "f95083e6be5a4076526263ed15ef6d09 --> And for the year, we expect revenue to be $5.64 billion, plus or minus $80 million, EBITDA at $1.3 billion, plus or minus $35 million, EBITDA margin of 23%, plus 30 basis\n\n5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [Revenue to be up approximately 13% versus 2021, driven by Commercial Aerospace, Commercial Transportation and the IGT market.]\n\n9950caed5da25c8c95ae1795684c1bac --> We are expecting some working capital build and should we hit our marks in terms of receivables and payables, then Iʼd be quite excited to use increased working capital in the back-end of the year, because that would mean a very healthy exit rate and great momentum going into 2022.\n\n81de6d8ec42c02e2ba99403c0e1f2aee --> I am thinking on the Commercial Aero side, maybe something like a 30% increase in our aftermarket revenues, 30% plus.\n\n73afda65053578876cb5aa11340374d6 --> going to have a 30%-plus improvement in 2022 for spares, both the narrow-body and wide-body.\n\nec67a595e0ff497760338e7e7e670894 --> But the answer is we have converted, we have done what we should do and delivered, and are looking forward to the volume improvement, which will happen, itʼs a strong thing that will happen during 2022 at some point.\n\naa5c04ad84328ab2ffc50f506b8a901c --> John Plant [Inferred as CEO] \"in Defense and Aerospace, we -- I think the mark we called out in 2019 was about $400 million and thatʼs close to $500 million these days.\"", "citations": ["f95083e6be5a4076526263ed15ef6d09", "5396972701b7c980933044b4cd3e13fc", "9950caed5da25c8c95ae1795684c1bac", "81de6d8ec42c02e2ba99403c0e1f2aee", "73afda65053578876cb5aa11340374d6", "ec67a595e0ff497760338e7e7e670894", "aa5c04ad84328ab2ffc50f506b8a901c"]}, "['Q4', '2022']": {"answer": "1db480ec197327c1c7d93c99ef40fd9b --> 2023 is expected to have strong growth and free cash flow generation.\n\n1db480ec197327c1c7d93c99ef40fd9b --> We look forward to above-trend growth in 2023, 2024 and 2025, and that will be reflected in additional profits and cash coming from the business.\n\n748da12cc4eb286a074a1aa88b10c03f --> If anything, at the moment, I would expect as we move from Q1 into Q2 and Q3, actually, our engine business will probably show a higher rate of commercial revenue growth because I think the engine manufacturers have a job of catch-up from 22 to accomplish as well as look forward to future rate increases.\n\n748da12cc4eb286a074a1aa88b10c03f --> So at this stage, a very rough assumption against 17%, I wouldn't be surprised to see it's a little bit higher, maybe 20% in our engine business and a little bit lower elsewhere.\n\ncb450c6ad72ad68e48891a9bcfd08914 --> In 2023, I think you can expect a similar number in terms of price increase.", "citations": ["1db480ec197327c1c7d93c99ef40fd9b", "748da12cc4eb286a074a1aa88b10c03f", "cb450c6ad72ad68e48891a9bcfd08914"]}, "['Q1', '2023']": {"answer": "e548bfb72b1a2e505ff20fdcfb2c109f --> We expect revenue to grow by 10% in the next fiscal year.\n\n786ce04092893b5913539111bb5839a8 --> The $20 million was the increase in the fourth quarter '22 volume. And the way to think about 2023 is you take that $20 million multiply by 4 and then add on to that, about a 25% plus or minus growth for 2023.\n\n786ce04092893b5913539111bb5839a8 --> And currently, I think you just take that '23 number and you probably add another 25% to 30% in for 2024.\n\n6d20282f1e5e129aa1c10b15a7dd862d --> We look at the growth rates that we're talking about. And we know that we're going to grow again in 2024, and we know we're going to grow again in 2025.", "citations": ["e548bfb72b1a2e505ff20fdcfb2c109f", "786ce04092893b5913539111bb5839a8", "6d20282f1e5e129aa1c10b15a7dd862d"]}, "['Q3', '2021']": {"answer": "fb32f4728874feb503e1ee65fafb689a --> As expected, Howmet transitioned to revenue growth in the third quarter, and we expect year-over-year revenue growth will continue into the fourth quarter and to 2022, with a growth of approximately 12% in commercial aerospace and total revenue growth in the fourth quarter of approximately 6%.\n\nfb32f4728874feb503e1ee65fafb689a --> We expect modest sequential growth in Q4 for Engineered Structures despite continued delays with the 787. Fastening Systems is expected to show growth in the first half of 2022.\n\n107cbffe4dfc79807cac946c90fa3b37 --> that's provided for in that 12% to 15% volume increase that I talked about in revenues as an initial thought for 2022.\n\naea4c3f605728c986e2223efea6fbe08 --> Second half revenue to be up approximately 8% versus the first half driven by Commercial Aerospace, Commercial Transportation and ITT;\n\naea4c3f605728c986e2223efea6fbe08 --> An early approximate total revenue guide would be for an increase in annual revenues of 12% to 15%, led by recovery in Commercial Aerospace.\n\naea4c3f605728c986e2223efea6fbe08 --> The fourth quarter for our revenue outlook is $30 million higher than the third quarter.\n\n9e6f24cbe2d74410df0d684cbfa0c06b --> I think best guess for next year is that normalized the sort of level that we've talked about in the past. So let's use the word 35% plus or minus, and apply that to the volume side of the – whatever the volume is.\n\ndd23f4e5d32cb91de6cf89bb033cae7a --> John Plant, CEO [Price increases, my statement is, I think that 2022 will be – will be positive, not as big as 2021. That's not in terms of a difference in percentage but more in terms of just the base for renewal.]", "citations": ["fb32f4728874feb503e1ee65fafb689a", "107cbffe4dfc79807cac946c90fa3b37", "aea4c3f605728c986e2223efea6fbe08", "9e6f24cbe2d74410df0d684cbfa0c06b", "dd23f4e5d32cb91de6cf89bb033cae7a"]}, "['Q3', '2023']": {"answer": "52b304407a818cbd57d3ab9e4bcfd6d6 --> Looking forward into 2024, we envisage growth to be in the 7% range plus or minus a percentage point.\n\nddef66167ee2b89291dd4b74892be1f6 --> I think that will continuing to improve again in the fourth quarter and into next year.", "citations": ["52b304407a818cbd57d3ab9e4bcfd6d6", "ddef66167ee2b89291dd4b74892be1f6"]}, "['Q4', '2023']": {"answer": "7d1da043cb11cb6055f1765d3c84c947 --> But what you can expect is that we will be moving on price once again in 2024. And you'll see when we issue our 10-K, which I believe is this evening, you'll see that trend continued in Q4. So, I expect to see continued positive contributions from pricing as we go forward. And you'll see that '23 was a healthy year and '24 should be an equally healthy year.\n\n3aa6430f3464a06795b40ad7bb982fef --> We expect Q1 revenue to be up 9% year-over-year and EBITDA up approximately 11%.\n\nabf19d7abad24cf18a1e7e93d41617c6 --> This continued growth is seen as the investments come on stream in approximately 18 months' time.\n\n5b07b4b32f181681d30cc06583b8da22 --> our assumption very clear was at 34% for the average for Boeing 737 for the year.\n\n979e10bfda43716807c7641dddb4637f --> But you can expect a 50% increase compared to 2019 levels.\n\nf67c790841450103e70a3dc2619fd7b8 --> You can see from what we've given you this morning, it's like 85% plus or minus and that provides the allowance for just in case we have not only the growth rate that we expect, but also if we get caught holding the having to hold the bag in terms of a little bit lower take the natural schedules as some of those MAX inventories are adjusted.", "citations": ["7d1da043cb11cb6055f1765d3c84c947", "3aa6430f3464a06795b40ad7bb982fef", "abf19d7abad24cf18a1e7e93d41617c6", "5b07b4b32f181681d30cc06583b8da22", "979e10bfda43716807c7641dddb4637f", "f67c790841450103e70a3dc2619fd7b8"]}, "['Q2', '2024']": {"answer": "fec5fcfefb09bbc31582b05413038833 --> These revenues will also commence during 2026, albeit at a quarter or so later than the previous discussions on this topic.\n\n95e1ff6848fa886de79ba442306643e5 --> We are pumping in a 27% increase in commercial aerospace revenues.\n\n95e1ff6848fa886de79ba442306643e5 --> Over the last three years, we've put in a 28% increase in commercial aerospace revenues followed by 24% year-to-date this year of 25%.\n\n0d4e38f30f61535fb8391a24c70abb87 --> For the year, we now expect revenues to be at $7.44 billion, plus or minus $40 million, which is an increase of $140 million from the prior guide.\n\n0d4e38f30f61535fb8391a24c70abb87 --> Free cash flow is guided to $870 million, plus or minus $30 million an increase of $70 million from the prior guide.\n\n0bf4de73ca45eabc4a55e6ac429e382a --> We've have increased the balance of year. I think it's just fractionally over 40% in Q3, and that takes account of both the seasonality plus the reduction in our Wheels business that we envisage at the moment, principally coming from Europe, but also affecting Class 8 trucks in the U.S. as well. So that's how we've put that incremental into Q3. And essentially in Q4, Wheels should be rather stronger than that to end up the year at a higher level.", "citations": ["fec5fcfefb09bbc31582b05413038833", "95e1ff6848fa886de79ba442306643e5", "0d4e38f30f61535fb8391a24c70abb87", "0bf4de73ca45eabc4a55e6ac429e382a"]}, "['Q1', '2024']": {"answer": "59268d02475edcb02e69e9ac55120aa8 --> we net all of this replanning out to an overall increase of approximately $200 million of revenue for 2024.\n\n5835ebc6ef534eb73e2df05172c52a98 --> Year-on-year instead of expecting maybe a 20%, 25% increase from, letʼs call it, 1.75 million engines to like 19.25, itʼs now more like a 1,700 number. Thatʼs more like a 10% to 15% increase year-on-year.\n\n33753cd61493ca740760bd6d90f47705 --> Yes. I mean, what weʼve guided to you in Q2 is that, in fact, revenues would be slightly higher than Q1.\n\n224401d7cb17aacc36c8fbd85274214c --> And while IGT was flat in Q1, weʼre thinking of a mid-single-digit increase for the year for IGT and industrial, thereʼs another $60 million.\n\n224401d7cb17aacc36c8fbd85274214c --> And then the big one, I think, is our assumption around spares, which is weʼve put in an increased revenue assumption of over $120 million plus on our spares lift. And that reflects, letʼs say, a further aggregate 25% lift in our spares business year-on-year and more like 35% on commercial aero.\n\nc2aa580f923e8fef6e9a6eb5e655dc46 --> What I've said previously is that we thought that we were going to be able to essentially hold and match what we did in 2023 into 2024. I think where we are today is that we're absolutely clear that we're going to – we're going to be able to hold much and maybe improve a little bit over 2023 levels on that front as well.", "citations": ["59268d02475edcb02e69e9ac55120aa8", "5835ebc6ef534eb73e2df05172c52a98", "33753cd61493ca740760bd6d90f47705", "224401d7cb17aacc36c8fbd85274214c", "c2aa580f923e8fef6e9a6eb5e655dc46"]}, "['Q2', '2023']": {"answer": "448a6ce8e672ca5e1e1229a42e666ea2 --> Our goal is to achieve a 10% increase in revenue by the end of fiscal year 2023.\n\nc3762aa0c5b6b79893dda0f3214db416 --> Regarding the year, revenues increased from $6.25 billion to $6.44 billion, a significant increase. And let's say, plus or minus $30 million, $40 million around that range. And then EBITDA has increased to $1.45 billion, plus or minus $10 million. Earnings per share is increased to $1.70, plus or minus $0.01, and free cash flow is held at $635 million, having absorbed the settlement for the Lehman Brothers claim.\n\n4b7cfab8aa7ca627daca5d4c6130418c --> Defense markets continue to be robust, and we envisage increased revenue going into 2024 as the destocking for bulkheads is completed and engine spares continue to increase significantly as shop visits increase.\n\n77cf03f5f29bc26b6e21060859ef9ab3 --> If you look at our midpoint of guidance, we believe we're going to raise the incremental to about 28% in Q3. And we are hopeful at about 34% in Q4.\n\nf5a2543ae698678ad1c0354aab121ba1 --> Also, we expect very positive free cash flow generation in the third and fourth quarters.\n\n8d8528ce979cf1610cd62fdc89e4a618 --> In terms of demand, the previous metric I've given was $20 million for Q4 last year, multiply it by four for 2023 and then add on, I think, 25%. So that took you to around about $100 million mark.\n\n8d8528ce979cf1610cd62fdc89e4a618 --> And therefore, implicit, if you did $45 million in H1, it's $55 million in H2.\n\n8d8528ce979cf1610cd62fdc89e4a618 --> Right now, I'm actually feeling a little bit more confident than that. And so instead of about a 25% lift, I can see us potentially getting to a 40% lift. Certainly, I think the demand is there. So it's going to be above $100 million, well above $100 million.\n\ncc45b8c0189d63ca0ee50f7e14c672e2 --> But I'd be upset if we're not doing at least 10% to 15% improved volume in Q3 in that business. And assuming we do that, then we'll see a large restoration of margin...", "citations": ["448a6ce8e672ca5e1e1229a42e666ea2", "c3762aa0c5b6b79893dda0f3214db416", "4b7cfab8aa7ca627daca5d4c6130418c", "77cf03f5f29bc26b6e21060859ef9ab3", "f5a2543ae698678ad1c0354aab121ba1", "8d8528ce979cf1610cd62fdc89e4a618", "cc45b8c0189d63ca0ee50f7e14c672e2"]}, "['Q1', '2021']": {"answer": "66f25b0bfc159e109d565858a241d055 --> More broadly, the focus is now turning to the beginning of the revenue recovery in the second half, commencing with commercial aerospace and the run rate of both revenues and margins as we exit 2021 and move into 2022, where we see the prospect of further leading indicator improvements.\n\n499644ac955b42ad88cbb7e13d486705 --> I think we are closer to the 120 level, so let's say, 25% below that number for the year is how we see it with, say, that inflection point coming -- a significant inflection point coming as we start Q3.\n\n0f52274f5b78972d2e4fb946381a037c --> In the second half of this year, I think we're expecting a modest lift, but not planning for anything significant in that spares business in the second half at this point, but let's say a little bit higher than that. That's clear compared to the $20 million a quarter, thinking more like that $25 million to $30 million a quarter.", "citations": ["66f25b0bfc159e109d565858a241d055", "499644ac955b42ad88cbb7e13d486705", "0f52274f5b78972d2e4fb946381a037c"]}, "['Q2', '2022']": {"answer": "59181062aab2e980d459118a3ba94cd3 --> We expect to achieve a revenue growth of 10% by the end of this year.\n\ne49a932ac1c14f0b852438a52dccaef3 --> Regarding titanium orders, we expect to execute revenue opportunities as a result of the Ukraine situation, and we have added $20 million of revenue to our fourth quarter sales.\n\nf74df014e30e5ee5681ed2ee66c6aee8 --> We started out at the beginning of the year and calling it somewhere, I think, in the region of 100 million to 150 million. And now we are saying, I just said on the remarks is that we see north of 200 million now, and so significant inflation element.\n\n72ddde4a8183e36207a0f925f01f1d87 --> We expect growth in industrial in the second half.\n\nd758cd6f398bf7f5826fb686b1d79472 --> The 2022 annual revenue midpoint is increased to $5.68 billion.\n\nd758cd6f398bf7f5826fb686b1d79472 --> For the third quarter, revenue is expected to be 1.44 billion, plus or minus 15 million.\n\nd758cd6f398bf7f5826fb686b1d79472 --> For the year, we have also tightened our guidance range and called out revenue at 5.68 billion, plus or minus 35 million.\n\n5dbb59a0827b924467d29126715823ae --> I'm hoping that what we are going to see is an improvement in overall revenues in our Wheels business in 2023 and stability and maybe even improvement into 2024 as well.\n\n5bf5e338d0dc4fd99cc4a3530b7c86ae --> But expecting bigger things to achieve, what we believe will be a 30% plus year-on-year improvement in the spares business for us.\n\n1cfe52e7ccac4980e36c8e540e9370d2 --> We are planning for further volume increases in Q3 and Q4, which basically is embedded in our guidance because we have also, as you see, lifted revenue guidance.", "citations": ["59181062aab2e980d459118a3ba94cd3", "e49a932ac1c14f0b852438a52dccaef3", "f74df014e30e5ee5681ed2ee66c6aee8", "72ddde4a8183e36207a0f925f01f1d87", "d758cd6f398bf7f5826fb686b1d79472", "5dbb59a0827b924467d29126715823ae", "5bf5e338d0dc4fd99cc4a3530b7c86ae", "1cfe52e7ccac4980e36c8e540e9370d2"]}, "['Q3', '2022']": {"answer": "ae28f0039af3cbff0b2de691bf65be6c --> we do envisage – envision that commercial aerospace revenue should be up around 20% in 2023.\n\nae28f0039af3cbff0b2de691bf65be6c --> Consolidated Howmet, including commercial aerospace and its other sectors of defense, industrial gas turbine, oil and gas and commercial transportation is expected to be up approximately 10% plus or minus 2% in revenue.\n\n7b96fe5c102122aa87b1f6d0ef239c6a --> More specifically, the guidance for Q4 is as follows: revenue, $1.47 billion, plus $30 million, minus $20 million; EBITDA $330 million, plus $6 million, minus $5 million; earnings per share of $0.38, plus or minus $0.01.\n\n7b96fe5c102122aa87b1f6d0ef239c6a --> For the full year, revenue of $5.62 billion, plus $30 million, minus $20 million; EBITDA of $1.27 billion, plus $6 million, minus $5 million; earnings per share of $1.40, plus or minus $0.01 as we've narrowed the range from previous guidance.\n\n492f19c801c210051bdbc983c2e6011f --> And having the confidence that we should be anywhere from, I would say, 10%, plus or minus 8% to 12% is a statement of confidence in that we're on trajectory and we're only just debating the angle of the recovery, either which rates above the normal for aerospace, if aerospace is normally 4% or 5%, it's more than double that rate.\n\n6b6e5e2fed758a38ccf6802196e97153 --> If you -- so if you put that wheeling as a down at the other single digit in commercial, I think you can get to the guidance range of that 8% to 12%.\n\n6362b537fed92bf148f15f5e999773f1 --> But at the moment, if we just -- just assume that we are on track to achieve that $20 million or slightly better for the fourth quarter, and it will continue to improve in 2023 and 2024.", "citations": ["ae28f0039af3cbff0b2de691bf65be6c", "7b96fe5c102122aa87b1f6d0ef239c6a", "492f19c801c210051bdbc983c2e6011f", "6b6e5e2fed758a38ccf6802196e97153", "6362b537fed92bf148f15f5e999773f1"]}, "['Q2', '2021']": {"answer": "0e241a825cd6cd45f5e8c86b74b9f978 --> The expectation that Howmet will transition into revenue growth in the third quarter continues with growth of approximately 15% in commercial aerospace and total revenue growth of approximately 9%.\n\n92e83c2e050c04a474324216c52a5e4c --> let's pick under 23 into 24 then my expectation is that all other things being equal will be at a rate of revenue above 2019. And basically with the content increases that we have or are built in plus any net benefits on price is that on a like-for-like basis, we'd probably be closer to the $7.5 billion to $8 billion on the equivalent production of aircraft.\n\nf54774194ad79afd5890d675ab19677c --> Second half revenue to be up approximately 12% versus the first half driven by commercial aerospace, defense and IGT.\n\n0e00ecc6f4c01a40a60db429f4d8b82d --> We are planning and scheduling that we will have an increased second half in airfoil aftermarket going through our customers of [Indiscernible] and Pratt & Whitney. So while the percentage, I think is it's certain - I can't make that one. But certainly well into the double digits in percentage increase.", "citations": ["0e241a825cd6cd45f5e8c86b74b9f978", "92e83c2e050c04a474324216c52a5e4c", "f54774194ad79afd5890d675ab19677c", "0e00ecc6f4c01a40a60db429f4d8b82d"]}, "['Q3', '2024']": {"answer": "d0b630cd6c2421974eeb648669859510 --> In 2025, we envisioned commercial aerospace growth to be about 12%, plus or minus and leading to the total revenue growth for the company of about 7.5%, plus or minus.\n\n6afa48bcdaaa06b71d4bb62b6144596c --> Demand continues to be strong across all of our engines markets with strong engine spares volumes, which are expected to reach a record with $1.25 billion of revenue in 2024.\n\n06f147f60cf8dc09981c05bc8dea211f --> we've just said let's think of a more realistic number and feel as though a 12% increase year-on-year is quite doable.\n\n07613b447564f09f7de4021a52b2eca2 --> And going forward, my thought, is over the next two, three, or four years, that that level of aftermarket content of our revenues will go to be in excess of 20%.\n\n58a97b372189beb1d29e686673aa5be9 --> Our output is up from 2023 by 40%.\n\n06f43fe19cfb1c4d4976f984c6126759 --> Leading to that longer-term trend of increasing engine, spares and total spares for the company as a percent of our revenues.", "citations": ["d0b630cd6c2421974eeb648669859510", "6afa48bcdaaa06b71d4bb62b6144596c", "06f147f60cf8dc09981c05bc8dea211f", "07613b447564f09f7de4021a52b2eca2", "58a97b372189beb1d29e686673aa5be9", "06f43fe19cfb1c4d4976f984c6126759"]}, "['Q1', '2022']": {"answer": "c32ccc13bda13c6a9f013006f86a63db --> Consistent with our expected revenue growth, we are now hiring in every segment except for Engineered Structures, which is expected to commence in the second half of the year.\n\n0330befffd28c39e23c46198dd7ab253 --> The Q2 outlook for revenue is expected to be approximately 45 million higher than in Q1, with margins of approximately 22.5% to 23%.\n\nf6d7cf91430ba3640afcd3477961d3a6 --> I think we are going to see a minimum of a 15% volume lift as we go into next\n\ndf52ced9a69debc0e4e3ef132c2c81a2 --> And that takes effect and took effect on the 1 of January as signaled to you.", "citations": ["c32ccc13bda13c6a9f013006f86a63db", "0330befffd28c39e23c46198dd7ab253", "f6d7cf91430ba3640afcd3477961d3a6", "df52ced9a69debc0e4e3ef132c2c81a2"]}}}, {"topic": "Margin expansion efforts", "data": {"['Q4', '2021']": {"answer": "5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [The 2022 revenue guidance includes more than $125 million of material pass-through impacted margins by at least 50 basis points.]\n\n650d4294d8d5fd9e103a388ed31a53e2 --> We have given you a range where we will take this and deliver, and hopefully, deliver improved margins in 2023, just in the same way as we deliver the improved margins in 2022 -- in 2021.", "citations": ["5396972701b7c980933044b4cd3e13fc", "650d4294d8d5fd9e103a388ed31a53e2"]}, "['Q1', '2023']": {"answer": "9a4530e6ac37510d5f579e20391c73c2 --> I do think that we will see some margin rate improvement in the second half of the year.\n\nbcda1b99c5a689039335c787e719b1b6 --> What I know is that I'll be somewhat disappointed if we're not earning a margin rate in 2024 above our current Q1 level and we don't expect it to be like that.", "citations": ["9a4530e6ac37510d5f579e20391c73c2", "bcda1b99c5a689039335c787e719b1b6"]}, "['Q3', '2021']": {"answer": "aea4c3f605728c986e2223efea6fbe08 --> Q4 sequential segment incremental operating margins, we expect to be in the order of 28%.", "citations": ["aea4c3f605728c986e2223efea6fbe08"]}, "['Q3', '2023']": {"answer": "f5fa9da0fc73237e5340a41e958182b6 --> Adjusting for year-over-year inflationary cost pass-through of approximately $15 million EBITDA margin was 23.3% in the flow-through of segment incremental revenue to EBITDA was at approximately 28% year-over-year which is right in line with our guidance.", "citations": ["f5fa9da0fc73237e5340a41e958182b6"]}, "['Q4', '2023']": {"answer": "8dc61f727bc0ace58147cc778e50b335 --> John Plant [We saw our margin flow-through for 2024 at 28% plus or minus compared to our Q4 of 31%.]", "citations": ["8dc61f727bc0ace58147cc778e50b335"]}, "['Q2', '2024']": {"answer": "3081360d100a80ab31ad95da44c85735 --> Revised guidance implies an incremental margin in the 40% to 45% range for the current year.", "citations": ["3081360d100a80ab31ad95da44c85735"]}, "['Q2', '2023']": {"answer": "448a6ce8e672ca5e1e1229a42e666ea2 --> We expect to improve our EBITDA margin by 2 percentage points in the next quarter.\n\n957247f80e1a65667efc84edb4278669 --> John Plant [And again, if everything that we see as potentially could happen by way of volume, wide-body mix, then our structures margins, and I have commented that I do see moving towards the high teens the -- as you move to the middle or second part of the decade, everything is there for us to do.]\n\nbb4955c05994d0bd527fd2573b77a770 --> And so then we begin to print optimal margins and cash flow and hopefully just continue to then improve as a further rate increase in 2025 and 2026.", "citations": ["448a6ce8e672ca5e1e1229a42e666ea2", "957247f80e1a65667efc84edb4278669", "bb4955c05994d0bd527fd2573b77a770"]}, "['Q2', '2022']": {"answer": "d758cd6f398bf7f5826fb686b1d79472 --> EBITDA at 1.29 million, plus 9 million, minus 14 million.\n\nc04b05b95e05c3124d3110337756e37b --> Assuming it stays there and of course, none of us know exactly what is going to happen, but if it stays there, then certainly, when our price resets occur on the first of January, then if it stays where it is, then you will see, for example, our Wheels business gain margin expansion as those prices are reset.", "citations": ["d758cd6f398bf7f5826fb686b1d79472", "c04b05b95e05c3124d3110337756e37b"]}, "['Q3', '2022']": {"answer": "19bc5c6d509a1b0cd934ec02d0257812 --> The new prices going into effect on the 1st of January will result in a revenue decline, which doesn't affect the EBITDA dollars, and therefore, there is a margin rate improvement from that.", "citations": ["19bc5c6d509a1b0cd934ec02d0257812"]}, "['Q2', '2021']": {"answer": "3bab446c1a4cc03cdb0a0d647f870fad --> The margin results overcame both the effects of the low revenue and the cost of many additional employees to meet the increasing production demand coming in the third quarter.\n\n40d38a706cac9f6f21c86a554d596808 --> For the second half, we expect extra costs. However, year-over-year incremental margins are expected to be over 50%.\n\nf54774194ad79afd5890d675ab19677c --> Second half year-over-year incremental margins of over 50% compared to the prior year.\n\n0d079df092ddbbc4de17e05ebef59630 --> The way we've called out the second half is that we see, margins improving.", "citations": ["3bab446c1a4cc03cdb0a0d647f870fad", "40d38a706cac9f6f21c86a554d596808", "f54774194ad79afd5890d675ab19677c", "0d079df092ddbbc4de17e05ebef59630"]}}}, {"topic": "Revenue diversification", "data": {"['Q4', '2022']": {"answer": "1cc742734fa168cdb5e08cc3e3bdab5f --> John Plant [For wheels, as an aggregate next year, my best assumption at this point in time is a $50 million to $60 million revenue decline and with the volume element of that being in the second half.]\n\n748da12cc4eb286a074a1aa88b10c03f --> And then I think we haven't covered is the titanium that level obviously factor into 2023, as we go through it again, increasing as we go through the year.", "citations": ["1cc742734fa168cdb5e08cc3e3bdab5f", "748da12cc4eb286a074a1aa88b10c03f"]}, "['Q3', '2023']": {"answer": "52b304407a818cbd57d3ab9e4bcfd6d6 --> The headline sales number for 2024 is likely to be approximately $7 billion.", "citations": ["52b304407a818cbd57d3ab9e4bcfd6d6"]}, "['Q4', '2023']": {"answer": "4a8c31b7b675de49d465b463e8ae0d9b --> And indeed, we are probably now 90% agreed for the price structures for 2024.\n\n5b07b4b32f181681d30cc06583b8da22 --> in 2025, as an example, we expect the spares business for F35 to be as big as the OE business has been in recent years.\n\n979e10bfda43716807c7641dddb4637f --> So today, you can assume that our spares business for '23 is getting about, let's say, the $1 billion mark, and we expect it to be -- that is -- therefore, an increased percentage of our revenues.", "citations": ["4a8c31b7b675de49d465b463e8ae0d9b", "5b07b4b32f181681d30cc06583b8da22", "979e10bfda43716807c7641dddb4637f"]}, "['Q1', '2024']": {"answer": "2c0a52ec4d3fcb980d6fcb1ee06031d6 --> We've increased the guide by $200 million of revenue at midpoint and the margin rate from 23% to 24%.", "citations": ["2c0a52ec4d3fcb980d6fcb1ee06031d6"]}, "['Q2', '2023']": {"answer": "4b7cfab8aa7ca627daca5d4c6130418c --> This seasonal effect -- the seasonal offset it seemed to be approximately $50 million of revenue between Q2 and Q3.", "citations": ["4b7cfab8aa7ca627daca5d4c6130418c"]}, "['Q3', '2022']": {"answer": "7b96fe5c102122aa87b1f6d0ef239c6a --> Free cash flow of $560 million, plus $20 million, minus $40 million, and this is driven -- this reduction compared to prior guidance is driven by the higher year-end inventory carried into 2023 for the continued commercial growth -- aerospace growth in the first quarter.", "citations": ["7b96fe5c102122aa87b1f6d0ef239c6a"]}, "['Q2', '2021']": {"answer": "40d38a706cac9f6f21c86a554d596808 --> The third quarter outlook for revenue to be approximately $100 million higher in the second quarter with margins somewhere between 22.3% and 23.1%.", "citations": ["40d38a706cac9f6f21c86a554d596808"]}, "['Q3', '2024']": {"answer": "07613b447564f09f7de4021a52b2eca2 --> we expect our spares revenue this year to be about $1.25 billion now, which is a further increase on the last quoting number, which is about $1.1 billion that we gave, I think on our August call.\n\n46bece8f12a54b986ee65a00ecfb1e31 --> Ken Giacobbe [CFO][I'd look at it as commercial aero probably around $550 million plus or minus this year. And then on the defense and IGT, right around $700 million, plus or minus, right?]", "citations": ["07613b447564f09f7de4021a52b2eca2", "46bece8f12a54b986ee65a00ecfb1e31"]}, "['Q1', '2022']": {"answer": "df52ced9a69debc0e4e3ef132c2c81a2 --> And again, I think I told you that we would be resetting prices in that segment every six-months.", "citations": ["df52ced9a69debc0e4e3ef132c2c81a2"]}}}, {"topic": "Profit margin analysis", "data": {"['Q4', '2021']": {"answer": "650d4294d8d5fd9e103a388ed31a53e2 --> And 2021, as you know, was a 200-plus-basis-point improvement over 2020 and we have guided you to, I think, 23% midpoint, which would be an increase over 2021.\n\ne71dcbfd8513753632f191a4f1ef2127 --> And if you look at the guide for the first quarter, itʼs not really -- if you then go through it closely, and you will say, well, part of our revenue, letʼs say, maybe half is material pass-through, so thereʼs not much volume. And -- but when you adjust for that material, you will see that margin is right on top of where we exited the second half of 2021.", "citations": ["650d4294d8d5fd9e103a388ed31a53e2", "e71dcbfd8513753632f191a4f1ef2127"]}, "['Q1', '2023']": {"answer": "e548bfb72b1a2e505ff20fdcfb2c109f --> Our target is to achieve a 15% operating margin by the end of 2024.", "citations": ["e548bfb72b1a2e505ff20fdcfb2c109f"]}, "['Q3', '2023']": {"answer": "52b304407a818cbd57d3ab9e4bcfd6d6 --> Regarding the full year 2023, revenues increased by about $100 million from $6.44 billion to $6.54 billion plus or minus $15 million. EBITDA has increased by a further $40 million to $1.485 billion plus or minus $5 million. Earnings per share has increased by $0.07 to $1.77 plus or minus $0.01. Free cash flow is at $635 million plus or minus $35 million.", "citations": ["52b304407a818cbd57d3ab9e4bcfd6d6"]}, "['Q2', '2024']": {"answer": "b958b5afc9faa8291657f6295419e91b --> The conversion of net income is maintained at the prior guide of approximately 85%.\n\n0d4e38f30f61535fb8391a24c70abb87 --> EBITDA is guided to $1.865 billion, plus or minus $10 million, which is an increase of $115 million from the prior guide.\n\ncf4ca331633567c939b735e88854ca56 --> we're guiding at about 25% EBITDA margin in the second half as well.", "citations": ["b958b5afc9faa8291657f6295419e91b", "0d4e38f30f61535fb8391a24c70abb87", "cf4ca331633567c939b735e88854ca56"]}, "['Q1', '2024']": {"answer": "47ef1b557e7222d455ffdc5b85417f92 --> You can see weʼve guided to a 24% EBITDA margin.", "citations": ["47ef1b557e7222d455ffdc5b85417f92"]}, "['Q2', '2023']": {"answer": "a77c4ba58a6d6ef621eda45c9c49adc5 --> In terms of margins, 35% plus or minus 5% was appropriate for when we were talking that clearly in -- I think it was in 2021 to 2022. And I'll say heading that way, maybe it's more like a 30% plus or minus for 2023.", "citations": ["a77c4ba58a6d6ef621eda45c9c49adc5"]}, "['Q1', '2021']": {"answer": "259d76fd00e631a6edf5129760b33370 --> My expectation is that these costs plus cost of recommencing mothball plants and equipment will hold EBITDA margins at around the 22% level until further stabilization is reached.", "citations": ["259d76fd00e631a6edf5129760b33370"]}, "['Q2', '2021']": {"answer": "40d38a706cac9f6f21c86a554d596808 --> Consolidated EBITDA margins for the second half are expected to be 22.6% to 23.2% setting a platform for a healthy 2022.", "citations": ["40d38a706cac9f6f21c86a554d596808"]}}}, {"topic": "Earnings per share trends", "data": {"['Q4', '2021']": {"answer": "f95083e6be5a4076526263ed15ef6d09 --> In terms of specific numbers, we expect the following, the guidance for Q1 revenue at $1.3 billion, plus or minus $20 million, EBITDA of $295 million, plus or minus $9 million, EBITDA margin of 22.7%, plus or minus 30 basis points, and EPS of $0.29, plus or minus $0.01.\n\n5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [EPS to increase to $1.37, plus or minus $0.06, and cash flow to be $625 million, plus or minus $50 million.]\n\n5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [Adjusted EBITDA is expected to be up 15% versus last year, adjusted earnings per share to be up approximately 36% versus 2021.]\n\n15291b490d3429101bea8e7cdfdcf1de --> Lastly, work performed and the tax rate showed improvement with the rate reduced by 250 basis points to 25%.\n\n0ba3619e41ffe362f860fcb5fe1eaf79 --> Well, the last quarter, I gave you 35%, plus or minus 5% approx and we are well within that.\n\nbd18749b6d402bb8c80159d9b433a6d1 --> The Q4 number will be issued as we issue today in a week or so time.\n\n7aa9f39e87f7f1ac13c3c04f3c164b33 --> when we exit 2022, we are going to also have improved leverage once again of a similar order of magnitude of turns compared to 2021.", "citations": ["f95083e6be5a4076526263ed15ef6d09", "5396972701b7c980933044b4cd3e13fc", "15291b490d3429101bea8e7cdfdcf1de", "0ba3619e41ffe362f860fcb5fe1eaf79", "bd18749b6d402bb8c80159d9b433a6d1", "7aa9f39e87f7f1ac13c3c04f3c164b33"]}, "['Q4', '2022']": {"answer": "aba7fcc23f57ee8d086da1b60e631294 --> We expect non-service pension and OPEB expense to increase approximately $20 million year-over-year to approximately $40 million.\n\naba7fcc23f57ee8d086da1b60e631294 --> The increase will unfavorably impact year-over-year earnings per share by approximately $0.04 per share.\n\n87b0efdf6b49b84858ebf7a731e43dba --> Revenue, we see at $1.5 billion, plus or minus $25 million, EBITDA of $335 million, plus or minus $10 million, EPS of $0.37, plus or minus $0.02.\n\n87b0efdf6b49b84858ebf7a731e43dba --> For the year, revenue of $6.1 billion, plus or minus $100 million, EBITDA of $1.375 billion, plus or minus $40 million and EPS of $1.60, plus or minus $0.07.\n\ne9c899c3b45cb19e5fea4a01b6a3d4e2 --> But I think it's part of -- as we move into looking at 2024, 2025, if it turns out to be the more optimistic scenarios that we've talked about of both narrow-body rate and wide-body rate, then I think for us to be in that ZIP code of just below inflation will serve us well, and it will be a source of cash and just let it through the next couple of years at that sort of level.", "citations": ["aba7fcc23f57ee8d086da1b60e631294", "87b0efdf6b49b84858ebf7a731e43dba", "e9c899c3b45cb19e5fea4a01b6a3d4e2"]}, "['Q1', '2023']": {"answer": "c3f09d4c2d3ea2adec9bd8ad1215f385 --> Free cash flow was negative $41 million, driven by the higher revenues and will now be followed by three successive quarters of substantial cash inflow.\n\n68e7b9a32f4d1aaf4c4483b200bfed72 --> We now see revenue of $1.61 billion, plus or minus $10 million, EBITDA of $362 million, plus or minus $3 million and earnings per share of $0.42 plus or minus $0.01.\n\n68e7b9a32f4d1aaf4c4483b200bfed72 --> For the year, we see revenue of $6.25 billion, plus $75 million minus $50 million, EBITDA of 1.415 [ph], plus 20 minus $15 million. Earnings per share of $1.67 at midpoint, plus $0.03 minus $0.02. And free cash flow increased by $20 million to $635 million, plus or minus $35 million.\n\n7cfd429eacec53018bfbd4ff4f524adf --> John Plant [Inferred as CEO] - \"Q2, we see very similar to Q1.\"\n\n49cc2e6d26c9cdb655f8bbdae85e37a8 --> And adjusting for them is a metal and non-metal inflation flow-through, it's 25%. And if you reverse engineer from our guide for the year, you'll see that it's around about 29%. And so if you got a 29% for the year and you start off at 25%, that then implies just by the math is that the second half, we anticipate to be over 30%.\n\n68d4cdcd300d4ba212135df84bff8fcd --> And now we're up at the 95%-98%. So essentially, 2023 is complete, and everything is in line with what I've previously said in terms of a similar order of magnitude in terms of further pricing that we talked about for '22.", "citations": ["c3f09d4c2d3ea2adec9bd8ad1215f385", "68e7b9a32f4d1aaf4c4483b200bfed72", "7cfd429eacec53018bfbd4ff4f524adf", "49cc2e6d26c9cdb655f8bbdae85e37a8", "68d4cdcd300d4ba212135df84bff8fcd"]}, "['Q3', '2021']": {"answer": "fb32f4728874feb503e1ee65fafb689a --> In terms of guidance for Q4, I'll just call out the midpoints, as you can read the slide: Revenue of $1.315 billion; EBITDA, $300 million; EBITDA margin, 22.8%; earnings per share of $0.29.\n\nfb32f4728874feb503e1ee65fafb689a --> And for the year, we expect revenue to be $5 billion, plus or minus; EBITDA at $1.135 billion; EBITDA margin at 22.7%; earnings per share increased to $1 per share; and cash flow of $450 million.\n\n4a25feb31818e275da0196b85a811ca8 --> Margins of approximately 23%, which sets a platform for a healthy 2022. Adjusted earnings per share guidance was increased reflecting lower interest costs.", "citations": ["fb32f4728874feb503e1ee65fafb689a", "4a25feb31818e275da0196b85a811ca8"]}, "['Q3', '2023']": {"answer": "1cb5da81dc9a0e3ef59e766d18009998 --> Our full year guide of $1.77 earnings per share is an increase of 26% year-over-year.\n\n52b304407a818cbd57d3ab9e4bcfd6d6 --> Moving specifically to the fourth quarter of 2023. We see revenue about $1.635 billion plus or minus $15 million, EBITDA $375 million plus or minus $5 million, earnings per share at $0.45 plus or minus $0.01.", "citations": ["1cb5da81dc9a0e3ef59e766d18009998", "52b304407a818cbd57d3ab9e4bcfd6d6"]}, "['Q4', '2023']": {"answer": "3aa6430f3464a06795b40ad7bb982fef --> For Q1 of 2024, we expect revenues of $1.74 billion, plus or minus $10 million, EBITDA of $400 million, plus or minus $5 million and earnings per share of $0.51 plus or minus $0.1.\n\n3aa6430f3464a06795b40ad7bb982fef --> Regarding the full year 2024, we see revenue at $7.1 billion plus or minus $100 million; EBITDA of $1.635 billion plus or minus $35 million; and earnings per share of $2.15 plus or minus $0.05.\n\n979e10bfda43716807c7641dddb4637f --> And now that's fully grown back to $400 million, but with the run rate -- you see in the third and fourth quarters and then strengthening each quarter is that, that is now at a run rate above $400 million.\n\nf67c790841450103e70a3dc2619fd7b8 --> We've just taken that cautious view, prepared that against -- for example, against the conversion of straight 90% of net income, which is a long-term guide.", "citations": ["3aa6430f3464a06795b40ad7bb982fef", "979e10bfda43716807c7641dddb4637f", "f67c790841450103e70a3dc2619fd7b8"]}, "['Q2', '2024']": {"answer": "b958b5afc9faa8291657f6295419e91b --> Despite the additional capital expenditure, the free cash flow guide has been increased by $70 million, having taken account of this expenditure and also the increase for working capital in the revenue guide.\n\n0d4e38f30f61535fb8391a24c70abb87 --> In Q3, we expect revenues of $1.855 billion, plus or minus $10 million, EBITDA of $465 million, plus or minus $5 million, and earnings per share of $0.64 plus or minus $0.01.\n\n0d4e38f30f61535fb8391a24c70abb87 --> Earnings per share increased to $2.55, plus or minus $0.02, an increase of 39% year-over-year.", "citations": ["b958b5afc9faa8291657f6295419e91b", "0d4e38f30f61535fb8391a24c70abb87"]}, "['Q1', '2024']": {"answer": "2c0a52ec4d3fcb980d6fcb1ee06031d6 --> We've increased cash flow just under $100 million.\n\nc232eb30282ba1bedfcc82be2ac15967 --> In terms of specific numbers in Q2, we expect revenue to be $1.835 billion, plus or minus $10 million, EBITDA $440 million, plus or minus $5 million, earnings per share of $0.58, plus or minus $0.01.\n\nc232eb30282ba1bedfcc82be2ac15967 --> For the year, we see revenues around $7.3 billion, plus or minus $75 million. EBITDA of $1.75 billion, plus or minus $30 million, earnings per share of $2.35, plus or minus $0.04 and free cash flow of $800 million, plus or minus $50 million.\n\n3fa0c46fd8ed83ec266d570bfaa48ea2 --> I think the midpoint of that guide now is around $300 million, it could be $290 million, but $300 million, give or take, I think, in that region. So maybe just below $300 million. And I think that we're going to spend all of that this year.", "citations": ["2c0a52ec4d3fcb980d6fcb1ee06031d6", "c232eb30282ba1bedfcc82be2ac15967", "3fa0c46fd8ed83ec266d570bfaa48ea2"]}, "['Q2', '2023']": {"answer": "c3762aa0c5b6b79893dda0f3214db416 --> Regarding Q3, revenue is expected to be $1.9 billion, plus or minus $10 million; EBITDA, $360 million, plus or minus $5 million; earnings per share of $0.42 plus or minus $0.01.\n\nf5a2543ae698678ad1c0354aab121ba1 --> Guidance has been increased and we expect year-over-year improvement in annual revenue, EBITDA and earnings per share as stated.", "citations": ["c3762aa0c5b6b79893dda0f3214db416", "f5a2543ae698678ad1c0354aab121ba1"]}, "['Q1', '2021']": {"answer": "d929dbde8e71dc1532d9a97ff76138e3 --> Specifically, the guidance for Q2: sales at $1.2 billion, plus or minus $30 million; EBITDA of $265 million, plus or minus $5 million; EBITDA margin of 22.1%, plus or minus 10 basis points; and earnings per share of $0.20, plus or minus $0.01.\n\nd929dbde8e71dc1532d9a97ff76138e3 --> And for the year, sales of $5.1 billion, plus $100 million, minus $50 million; EBITDA line increases -- the EBITDA baseline increases by $50 million to $1.15 billion, with a range of plus $50 million to minus $25 million; EBITDA margin baseline has now increased to 22.5%, plus 60 basis points and minus 20 basis points in terms of a range. The earnings per share baseline increases to $0.95, a significant increase over prior guidance and with a range of plus $0.07 to minus $0.04. And the cash flow baseline increased to $425 million, plus or minus $30 million.\n\n59acbff21af8cf054a0c566af591f480 --> So I think I just can't get to like just over 22% for the second quarter", "citations": ["d929dbde8e71dc1532d9a97ff76138e3", "59acbff21af8cf054a0c566af591f480"]}, "['Q2', '2022']": {"answer": "6461f35ed7cafd7422c68e293d7443bc --> Kenneth Giacobbe [So we said for Q3 EBITDA, 326 million. It is minus 6 million on the down to 320 million, up 5 million for the high side in Q3.]\n\n6461f35ed7cafd7422c68e293d7443bc --> Kenneth Giacobbe [And then the earnings per share, I just want to clarify, we have it on the slide there. $1.41 is the mid or down $0.03 on the low and up $0.01 on the high, but just want to clarify.]\n\nd758cd6f398bf7f5826fb686b1d79472 --> EBITDA, 326 million, plus 5 million, minus 4 million; EBITDA margin, 22.6%, plus or minus 10 basis points; and earnings per share, $0.36, plus or minus $0.01.\n\nd758cd6f398bf7f5826fb686b1d79472 --> EBITDA margin of 22.7%; and earnings per share of $1.41, plus or minus $0.02.\n\n1cfe52e7ccac4980e36c8e540e9370d2 --> We have just guided you to like another 100 million sort of average improvement.", "citations": ["6461f35ed7cafd7422c68e293d7443bc", "d758cd6f398bf7f5826fb686b1d79472", "1cfe52e7ccac4980e36c8e540e9370d2"]}, "['Q3', '2022']": {"answer": "7b96fe5c102122aa87b1f6d0ef239c6a --> This results in an annual guide of $5.62 billion due to a small offset in other business areas beyond engine and earnings per share of $0.38 in the fourth quarter, which again is another sequential increase as we've shown in each quarter of 2022.", "citations": ["7b96fe5c102122aa87b1f6d0ef239c6a"]}, "['Q2', '2021']": {"answer": "f54774194ad79afd5890d675ab19677c --> For the third quarter, revenue of $1.3 billion, plus or minus $20 million, EBITDA of $295 million, plus or minus $10 million, EBITDA margin of 22.7%, plus or minus 40 basis points and earnings for share of $0.25, plus a minus $0.02.\n\nf54774194ad79afd5890d675ab19677c --> For the year, we expect revenue to be $5.1 billion, plus or minus 50%. EBITDA baseline to increase to $1.17 billion, plus or minus -- plus 15%, minus 25%. EBITDA margin to increase to 22.9%, plus 10 basis points and minus -- to minus 20 basis points. Earnings per share increase to $0.99, plus or minus $0.03, cash flow baseline increased to $450 million, plus or minus $35 million.", "citations": ["f54774194ad79afd5890d675ab19677c"]}, "['Q3', '2024']": {"answer": "6c7701fc7c70de6b0393f6bd6e5213d9 --> The specific numbers are as follows; revenue of $1.87 billion, plus or minus $20 million; EBITDA of $488 million, plus or minus $10 million; earnings per share of $0.71, plus or minus $0.01.\n\n6c7701fc7c70de6b0393f6bd6e5213d9 --> And for the year, revenue of $7.41 billion, plus or minus $20 million; EBITDA of $1.895 billion, plus or minus $10 million; earnings per share of $2.66, plus or minus $0.01; and free cash flow of $920 million, plus $20 million, minus $30 million.", "citations": ["6c7701fc7c70de6b0393f6bd6e5213d9"]}, "['Q1', '2022']": {"answer": "9d587c9195a64fd77d53f0b1f7ae19eb --> John Plant [Currently, we have not built any sales into our guidance for the year, but expect to update you in August when we provide our Q2 earnings.]\n\nd7ff3853708c85ffca51967f16d58bd8 --> Revenue is expected in Q2 to be 1.37 billion, plus or minus 20 million; EBITDA of 310 million plus or minus eight million; EBITDA margin of 22.6%, plus 30 basis points minus 20 basis points; and earnings per share of $0.32 plus or minus $0.01.\n\nd7ff3853708c85ffca51967f16d58bd8 --> For the year, revenue of 5.64 billion, plus or minus 80 million; EBITDA of 1.3 billion, plus or minus 35 million; EBITDA margin of 23%, plus 30 basis points minus 20. Earnings per share are expected to be in the range of $1.39, plus or minus $0.06; and free cash flow of 625 million, plus or minus 50 million.\n\n3dffb24da760b898c2981b9fa9d2b8e4 --> We are clear that 31 is the number for this year.", "citations": ["9d587c9195a64fd77d53f0b1f7ae19eb", "d7ff3853708c85ffca51967f16d58bd8", "3dffb24da760b898c2981b9fa9d2b8e4"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "Advanced materials technology", "data": {}}, {"topic": "Aerospace product enhancements", "data": {"['Q4', '2021']": {"answer": "6a6ce9e5637dda53ef4c8825ba143847 --> And my hope is that during this quarter is that or latest early second quarter is that the FAA give recertification.", "citations": ["6a6ce9e5637dda53ef4c8825ba143847"]}, "['Q3', '2023']": {"answer": "b0f2e704d0efcf97ee700c64a532df5b --> We are working on the improvements for the currently 2028 upgrade to that engine to improve its thrust and time and air.\n\n8566dad6a73533f0dcca56139aebacf8 --> I've always said that's a year away and I still think you see year away could be the back end of '24, but more likely getting to '25 and that hopefully combines with if the '25 external debuts of what the aircraft production will be including its wide-body mix then that begins to get I'd say into a good state.", "citations": ["b0f2e704d0efcf97ee700c64a532df5b", "8566dad6a73533f0dcca56139aebacf8"]}, "['Q1', '2024']": {"answer": "077f47e2d17c18e658e3d7aa6fedea40 --> We expect to see that similarly for the LEAP-1B eventually a year from now, weʼre going to see something done in the Geared Turbofan.\n\n9c40ed29d1c2e8c613ea01d1d850a7c6 --> CFM56 is expected to peak more like 2025, maybe 2026.\n\n9c40ed29d1c2e8c613ea01d1d850a7c6 --> The current version of the LEAP engine shop visits won't peak until well after 2030.\n\n41f3a70fafc9b5622a13cf3341c6679b --> In around the 2028 mark; I think weʼll see improved turbine componentry to meet the requirements where additional thrust is required.", "citations": ["077f47e2d17c18e658e3d7aa6fedea40", "9c40ed29d1c2e8c613ea01d1d850a7c6", "41f3a70fafc9b5622a13cf3341c6679b"]}, "['Q1', '2022']": {"answer": "14db44f60feb9d0fe128eac745fc69d2 --> We also expect to see further value content improvements later in 2022 when we begin to transition to the improved Pratt & Whitney geared turbofan engine having both increased thrust and fuel efficiency.", "citations": ["14db44f60feb9d0fe128eac745fc69d2"]}}}, {"topic": "New product launches", "data": {"['Q1', '2023']": {"answer": "e548bfb72b1a2e505ff20fdcfb2c109f --> We anticipate launching two new product lines by Q3 2023.", "citations": ["e548bfb72b1a2e505ff20fdcfb2c109f"]}, "['Q2', '2024']": {"answer": "65508c209a15e35cde63cd9046b48097 --> And you've read articles that some of those upgrades will be available subject to the certification requirements later in 2025. And then progressively, I'll say, launched with each of the aircraft manufacturers over the next couple of years.", "citations": ["65508c209a15e35cde63cd9046b48097"]}, "['Q1', '2024']": {"answer": "9c40ed29d1c2e8c613ea01d1d850a7c6 --> Gradual introduction of new improved robust turbine blades will be more significant as we go into 2025 and beyond.", "citations": ["9c40ed29d1c2e8c613ea01d1d850a7c6"]}, "['Q2', '2023']": {"answer": "448a6ce8e672ca5e1e1229a42e666ea2 --> We are planning to launch two new product lines in the first half of 2024.", "citations": ["448a6ce8e672ca5e1e1229a42e666ea2"]}}}, {"topic": "R&D investment focus", "data": {}}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Supply chain improvements", "data": {"['Q4', '2021']": {"answer": "099758bc22a7f15ef038cdc557601fdd --> My expectation is that, if things work out as we expect then we will probably be recruiting an additional similar number, probably, somewhere between 800 and 1,000 people during the course of 2022, and if things work out well, we will be on the upside of that, and if not, we will be on the downside, but we will keep adjusting it as we see fit during the year.", "citations": ["099758bc22a7f15ef038cdc557601fdd"]}}}, {"topic": "Cost management strategies", "data": {"['Q4', '2021']": {"answer": "5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [Incrementals adjusting for the metal between 30% and 35%, as previously stated.]", "citations": ["5396972701b7c980933044b4cd3e13fc"]}, "['Q4', '2022']": {"answer": "38d5a1f89cf5deb8985c5e995107a953 --> John Plant [Inferred as CEO] [Now, we do expect that given the actions we took, trim labor, we're on a steadier -- we are back in recruitment mode, which we do have some cause for optimism for the future. In terms of rate builds and increases, even though we've chosen to be cautious about it is that -- I see no fundamental issues, not restoring those margins to at least the first -- the rate of the first half of 2022.]", "citations": ["38d5a1f89cf5deb8985c5e995107a953"]}, "['Q1', '2023']": {"answer": "9fd290182ac8ed2ca20925efd7e68067 --> And so how we thought about is that we see essentially Q2 playing out very similar to Q1 and preparing for, I say, the improvement in build. And in doing so, we need to add to our costs. And so in Q1, as you saw from Ken's commentary, we recruited some 500 people. And we're heading probably to a similar sort of run-rate of employee addition in Q2 and all expecting that we are receiving and will be receiving the schedules to meet these potential lifted second half volumes.\n\n7cfd429eacec53018bfbd4ff4f524adf --> John Plant [Inferred as CEO] - \"Taking on cost per pair for the second half.\"", "citations": ["9fd290182ac8ed2ca20925efd7e68067", "7cfd429eacec53018bfbd4ff4f524adf"]}, "['Q2', '2023']": {"answer": "448a6ce8e672ca5e1e1229a42e666ea2 --> We aim to reduce operational costs by 5% over the next year.", "citations": ["448a6ce8e672ca5e1e1229a42e666ea2"]}, "['Q1', '2021']": {"answer": "259d76fd00e631a6edf5129760b33370 --> We are planning to bring back from furlough or recruit several hundred workers during the next 2 quarters to train and retrain to be ready for this demand, just in the same effective way that we did in the third quarter of 2020 for the commercial wheels business.\n\n2a7aa7a7bb6a51cb0a8537ba3a45bff2 --> So that's why I want to plan carefully through the next couple of quarters because we are talking a very significant increase in labor.\n\nd929dbde8e71dc1532d9a97ff76138e3 --> Price increases to be greater than 2020. Cost reduction carryover of approximately $100 million, and pension and OPEB contributions of $160 million.", "citations": ["259d76fd00e631a6edf5129760b33370", "2a7aa7a7bb6a51cb0a8537ba3a45bff2", "d929dbde8e71dc1532d9a97ff76138e3"]}, "['Q2', '2022']": {"answer": "ae0e6db09f0b227e5469c5829086c605 --> In the second half, we expect to continue to add headcount in Engines and begin recruitment in our Structures business.", "citations": ["ae0e6db09f0b227e5469c5829086c605"]}, "['Q3', '2022']": {"answer": "c9736ef094e5bb66c497aee787919b90 --> In Q4, we do not expect significant headcount additions.", "citations": ["c9736ef094e5bb66c497aee787919b90"]}, "['Q2', '2021']": {"answer": "70e3c5edad0ebad988f9c676d6dd6a57 --> year pension and OpEx expense is expected to improve approximately 50% compare to last year.\n\nec34aaa9ede3367a85f6421d369136c9 --> So, about 500 people I think we're planning for the second half. So getting towards a 1000 for the year.\n\n40d38a706cac9f6f21c86a554d596808 --> In the second half we plan to recruit another net 500 people.\n\n9d9a449340940501e8c3bc0367e2a4d5 --> Decremental margins for engines were 12% for the quarter as we hired back approximately 300 workers to prepare for the anticipated growth in the second half of this year.\n\n06cf2eb45377fe1adaf2cea26813fc6e --> And that's also gives me confidence that we can still operate for a year or so with capital expenditures being below depreciation, because the capacity is essentially already there.", "citations": ["70e3c5edad0ebad988f9c676d6dd6a57", "ec34aaa9ede3367a85f6421d369136c9", "40d38a706cac9f6f21c86a554d596808", "9d9a449340940501e8c3bc0367e2a4d5", "06cf2eb45377fe1adaf2cea26813fc6e"]}}}, {"topic": "Manufacturing optimization", "data": {"['Q2', '2024']": {"answer": "cdfb17af79c393799f646ce171c6b881 --> We continue to optimize the structures manufacturing footprint, and we expect to exit two small plants in the UK this year.", "citations": ["cdfb17af79c393799f646ce171c6b881"]}, "['Q1', '2024']": {"answer": "c2aa580f923e8fef6e9a6eb5e655dc46 --> We think that we're going to be able to maintain that productivity during the second half and then improve ourselves in Engine a bit to offset the – I'll say, the revenue volatility that we're going to get, which is basically up in aerospace, up in defense, still net up in commercial despite the Boeing [ph] assumption to put down in commercial wheels.", "citations": ["c2aa580f923e8fef6e9a6eb5e655dc46"]}, "['Q3', '2022']": {"answer": "58f4df81c95c520018a0e74cf6fdaea8 --> We're going to pause for the main in Q4 for recruitment, not totally. It will be 2 or 3 or 4 plants that will continue, but out of our complete network we are choosing to pause that at this stage until we know more and let the additional people that we've already recruited during this recovery, which is some, I'll say, 2,500 come up to rate and let that hopefully, productivity improve.", "citations": ["58f4df81c95c520018a0e74cf6fdaea8"]}, "['Q2', '2021']": {"answer": "50af2e15ad68ec3c0c23b0961aff68cf --> For the next couple of years, we have no capacity limitations apart from the ability to onboard labor and train it effectively to do all of that side of the business. In terms of hard plant and machinery, we're fully capacitized and then we have to be thinking about increasing tool capacity.", "citations": ["50af2e15ad68ec3c0c23b0961aff68cf"]}, "['Q3', '2024']": {"answer": "2d0154939c23cc74057aa5cc892c14fe --> And while we've increased in our engine business in Q3 and net zero for the company and really trying to hold that for the balance of year, while expecting that we're going to need to reaccelerate our hiring as we go into 2025 such that when we commence production, much of the new equipment we've been talking about is that the workforce will be trained so that we can keep our levels of quality and our levels of delivery performance in the -- I think, in the really good zone that they've been and able to respond to the customers' demand.", "citations": ["2d0154939c23cc74057aa5cc892c14fe"]}, "['Q1', '2022']": {"answer": "fc3fad8815b1c9ef441b65a687e8d3c1 --> We continue to recruit in Engine Products in the first quarter of this year, and now I'm going to say about another 250 heads, but again it is an approximate number.", "citations": ["fc3fad8815b1c9ef441b65a687e8d3c1"]}}}, {"topic": "Lean process improvements", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Aerospace market penetration", "data": {}}, {"topic": "Strategic partnership developments", "data": {"['Q2', '2024']": {"answer": "538f6ab7ad44a9c193e21ddbae5322bf --> we've struck agreements which lock in market share commensurate with those investment requirements for future.", "citations": ["538f6ab7ad44a9c193e21ddbae5322bf"]}}}, {"topic": "Geographic expansion initiatives", "data": {"['Q2', '2021']": {"answer": "ec34aaa9ede3367a85f6421d369136c9 --> To give you a roadmap for the second half, let's say, first, Q3 will be principally engine. And then we'll be looking to add selectively in our structures business in the fourth quarter.", "citations": ["ec34aaa9ede3367a85f6421d369136c9"]}, "['Q3', '2024']": {"answer": "d0b630cd6c2421974eeb648669859510 --> The second half of 2025 potential is principally due to North America, where it is envisioned that the early stages of truck pre-buying will occur in response to the new environmental regulations, which become effective in 2027.\n\n404e9f73b67176682b3c02ca9ac466a0 --> John Plant[And indeed, in Europe over the next few years, it's going to increase to 600 by the end of the decade.]", "citations": ["d0b630cd6c2421974eeb648669859510", "404e9f73b67176682b3c02ca9ac466a0"]}}}, {"topic": "Competitive positioning", "data": {}}]}, {"theme": "Customer Engagement and Satisfaction", "topics": [{"topic": "Client relationship management"}, {"topic": "Customer feedback integration"}, {"topic": "Aftermarket services growth"}, {"topic": "Customer satisfaction metrics"}]}, {"theme": "Capital Allocation and Financial Strategy", "topics": [{"topic": "Debt reduction strategies", "data": {"['Q4', '2021']": {"answer": "ada4ad95b5fa3a897093ddaa906d3e1e --> In 2021, we took actions to lower our annualized interest costs by approximately $70 million through a combination of paying down gross debt by approximately $845 million with cash on hand and also refinancing higher cost debt with lower cost debt.\n\n15291b490d3429101bea8e7cdfdcf1de --> Furthermore, pension and OPEB growth liabilities were reduced by $440 million, which is another huge step in the improvement in the balance sheet of the company and net liabilities by $275 million.", "citations": ["ada4ad95b5fa3a897093ddaa906d3e1e", "15291b490d3429101bea8e7cdfdcf1de"]}, "['Q4', '2022']": {"answer": "5ecc102c29b269bc1959a6562fc6e3a0 --> Our next bond maturity is in October of 2024, and the $1 billion revolver is undrawn.\n\ne271152cbd55e3bfa5a3ee3e501fafcd --> This continues our plan of reducing interest costs year-on-year. And going into 2023, it will be lower than 2022.", "citations": ["5ecc102c29b269bc1959a6562fc6e3a0", "e271152cbd55e3bfa5a3ee3e501fafcd"]}, "['Q1', '2023']": {"answer": "74badfb94970cd2ad963e780023b30bd --> We've updated the improved interest rate expense assumption for 2023 from $227 million to $222 million. This change reflects the 2023 impact of reducing debt by $150 million late in the first quarter.\n\nc3f09d4c2d3ea2adec9bd8ad1215f385 --> And this will further reduce future interest payments by $9 million annually, and hence increasing free cash flow yield.\n\n68e7b9a32f4d1aaf4c4483b200bfed72 --> Net leverage will now continue towards the 2 times net debt to EBITDA in the balance of 2023.", "citations": ["74badfb94970cd2ad963e780023b30bd", "c3f09d4c2d3ea2adec9bd8ad1215f385", "68e7b9a32f4d1aaf4c4483b200bfed72"]}, "['Q3', '2021']": {"answer": "c7685a31302d0a7651de556d43e384f5 --> The combination of debt actions in the third quarter, combined with our first half results and actions, will reduce annual interest expense by approximately $70 million.\n\n4a103c52ac8c7c9ee2a9c3a08f151dcb --> Lastly, we have lowered our annualized interest cost by $70 million through a combination of paying down debt and refinancing into lower cost debt.\n\n23e92e60d64d6f22e9699232fa964dbf --> First, in the first half of the year, we paid down approximately $835 million of debt by completing the early redemption of our 2021 and 2022 bonds with cash on hand. The annualized interest expense savings with this action is approximately $47 million.\n\n23e92e60d64d6f22e9699232fa964dbf --> Second, in the third quarter we tendered $600 million of our 6.875% notes due in 2025 and issued $700 million of 3% notes due in 2029. The annualized interest expense savings with this action is approximately $20 million.\n\ndd23f4e5d32cb91de6cf89bb033cae7a --> Ken Giacobbe, CFO [Yes. Just the way I would look at interest expense for next year, about $235 million, substantial action that we took on the debt profile this year, as we talked about on the call. So around $235 million for next year seems to be in good shape.]\n\ne8a10b7ce6be036257bb95d84ba169bf --> We intend to continue that this year, probably another $230 million of gross liability reduction in our gross liability.", "citations": ["c7685a31302d0a7651de556d43e384f5", "4a103c52ac8c7c9ee2a9c3a08f151dcb", "23e92e60d64d6f22e9699232fa964dbf", "dd23f4e5d32cb91de6cf89bb033cae7a", "e8a10b7ce6be036257bb95d84ba169bf"]}, "['Q3', '2023']": {"answer": "1cb5da81dc9a0e3ef59e766d18009998 --> Our net leverage has further improved in Q3 and is heading towards approximately two times net debt to EBITDA by year-end.", "citations": ["1cb5da81dc9a0e3ef59e766d18009998"]}, "['Q4', '2023']": {"answer": "bd35bd954e7caedb2e07a4c9ae701370 --> The combination of these actions further reduces annualized interest expense by $10 million going into 2024.\n\n77bc02aa2ea796a81d5d301ba72ddbe0 --> The combined impact of these Q4 actions is expected to reduce annualized interest expense by approximately $10 million.\n\n77bc02aa2ea796a81d5d301ba72ddbe0 --> Interest expense is expected to improve to approximately $200 million.", "citations": ["bd35bd954e7caedb2e07a4c9ae701370", "77bc02aa2ea796a81d5d301ba72ddbe0"]}, "['Q2', '2024']": {"answer": "71aa1def1cb19922d2ba1e080065601b --> The strong cash balance for an early retirement at par of the remaining $205 million of the 2024 bonds on July 1, one day after the quarter end.\n\nad8b6b4871532d39d573c1b97c3e855a --> These actions will reduce annual interest expense by $12 million annually, further improving free cash flow yield.", "citations": ["71aa1def1cb19922d2ba1e080065601b", "ad8b6b4871532d39d573c1b97c3e855a"]}, "['Q1', '2024']": {"answer": "c232eb30282ba1bedfcc82be2ac15967 --> In terms of net leverage, we're also envisaging getting closer to our minimum leverage target of towards 1.5x net debt-to-EBITDA by year-end from the 2x that we currently have at the end of Q1.", "citations": ["c232eb30282ba1bedfcc82be2ac15967"]}, "['Q2', '2023']": {"answer": "ce77c7d6de0b8676754e191f46339254 --> John Plant [Inferred as CEO] [Regarding our revolver, we amended and extended our $1 billion undrawn credit facility to 2028, while realizing lower fees and a more favorable net debt to EBITDA covenant.]\n\nd6a0a5ac5f8f72509e860e91221b8971 --> Finally, we issued a note to redeem $200 million of our 2024 debt tower with cash on hand. The redemption is expected to be complete at the end of September and will lower our annualized interest cost by approximately $10 million.\n\n29357c23e017c860ac867ebf56cabb98 --> In July, we issued a notice to redeem $200 million of our 2024 debt tower with cash on hand, which is expected to be completed by the end of September.\n\n29357c23e017c860ac867ebf56cabb98 --> Gross debt is expected to be less than $3.8 billion after the redemption in September.\n\nf5a2543ae698678ad1c0354aab121ba1 --> Regarding debt, what we mentioned the $200 million. And as we complete that with the EBITDA improvements, then we'll be improving our net debt-to-EBITDA leverage from the two and half times record that we talked about in Q2, and we'll see improvements in Q3 and Q4 and heading towards two times levered by the end of the year.", "citations": ["ce77c7d6de0b8676754e191f46339254", "d6a0a5ac5f8f72509e860e91221b8971", "29357c23e017c860ac867ebf56cabb98", "f5a2543ae698678ad1c0354aab121ba1"]}, "['Q1', '2021']": {"answer": "eabd2dcdb68e1a8f5d67c89f03e6bb09 --> Year-to-date, we have reduced debt by approximately $840 million, which reduces the 2021 interest expense by $38 million and $47 million on a run rate basis. In addition, in 2022, there will be a carryover interest savings of $10 million.\n\n1c5e1d1864a57a4d8bd7525c2d8efa3a --> Moreover, as John has mentioned, in 2022, we'll get an incremental $10 million of carryover interest savings.", "citations": ["eabd2dcdb68e1a8f5d67c89f03e6bb09", "1c5e1d1864a57a4d8bd7525c2d8efa3a"]}, "['Q2', '2022']": {"answer": "a014ff687413ea34b5df2ced05ccb329 --> Finally, net debt to EBITDA improved to three times. As John mentioned earlier, we expect net debt to EBITDA to accelerate by year-end and move towards 2.5 times.\n\n0a554c9e74b99bc67c69e4555f8afd56 --> Lastly, net leverage improved to three times and is expected to accelerate by year-end to move towards 2.5 times EBITDA.\n\nf66ec98de676cab9a63286402ade9956 --> Approaching 2.5 times net leverage by the end of the year.", "citations": ["a014ff687413ea34b5df2ced05ccb329", "0a554c9e74b99bc67c69e4555f8afd56", "f66ec98de676cab9a63286402ade9956"]}, "['Q3', '2022']": {"answer": "11bcc89c7b0575e0f4278370e59c613c --> So I'm not anticipating that our interest rate costs go up at all in the next 2 or 3 years.\n\n5250e38077af4a7dd3eb98aa33090150 --> My anticipation is that we'll show further reduction of liability in the fourth quarter to make a meaningful change in the reduction of those legacy liabilities.", "citations": ["11bcc89c7b0575e0f4278370e59c613c", "5250e38077af4a7dd3eb98aa33090150"]}, "['Q2', '2021']": {"answer": "41498f666141d4fc49a2d74048d6c3db --> These transactions reduced 2021 interest expense by approximately $28 million, and approximately $47 million on an annual run rate basis. This helps with increased 2022 free cash flow.", "citations": ["41498f666141d4fc49a2d74048d6c3db"]}, "['Q3', '2024']": {"answer": "c606336f68e7256da5ae6d145b78622d --> All combined debt actions year-to-date through the third quarter 2024 will reduce annualized interest expense by approximately $33 million.", "citations": ["c606336f68e7256da5ae6d145b78622d"]}}}, {"topic": "Share buyback program", "data": {"['Q4', '2021']": {"answer": "1e979d8b381ef3aaed807a1624f3800d --> The repurchase of shares continued in early 2022 with a further 3 million shares purchased for $100 million during the month of January.\n\n15291b490d3429101bea8e7cdfdcf1de --> Free cash flow was excellent and allowed for further share buybacks of $430 million or $13 million -- 13 million shares, while also improving the net leverage of the company and reducing gross debt by $845 million, and furthermore, reducing interest carrying costs of $70 million, thereby improving future free cash flow yield of the company.\n\n7aa9f39e87f7f1ac13c3c04f3c164b33 --> we will be buying additional shares back during the course of the year, with the cadence yet to be determined.", "citations": ["1e979d8b381ef3aaed807a1624f3800d", "15291b490d3429101bea8e7cdfdcf1de", "7aa9f39e87f7f1ac13c3c04f3c164b33"]}, "['Q1', '2023']": {"answer": "a45213f867152cf5a6854ac2e2232e33 --> These repurchases will lower our annualized interest cost by approximately $9 million.", "citations": ["a45213f867152cf5a6854ac2e2232e33"]}, "['Q3', '2021']": {"answer": "23e92e60d64d6f22e9699232fa964dbf --> Third, with cash on hand, we repurchased $100 million of our 2021 notes through an open market repurchase in Q3 and in October, which neutralized the gross debt impact of the tender and refinancing. The annualized interest expense saving with this action is approximately $5 million.", "citations": ["23e92e60d64d6f22e9699232fa964dbf"]}, "['Q4', '2023']": {"answer": "6ad8c096016dc11fb050d47933edc36f --> And you can expect further shareholder friendly actions of increased share buybacks and further dividend growth.\n\nc530d00f8edcbe14da48e4f21ffb803e --> 2024 will be a bigger year for share buybacks compared to 2023.", "citations": ["6ad8c096016dc11fb050d47933edc36f", "c530d00f8edcbe14da48e4f21ffb803e"]}, "['Q2', '2024']": {"answer": "0d4e38f30f61535fb8391a24c70abb87 --> Share buyback authorization has also been addressed by the Board and increased by $2 billion to approximately a total of $2.5 billion.", "citations": ["0d4e38f30f61535fb8391a24c70abb87"]}, "['Q1', '2024']": {"answer": "c232eb30282ba1bedfcc82be2ac15967 --> The majority of the other uses of free cash flow in terms of capital allocation will be share buyback in 2024, while still preserving the ability to pay down the stuff of the 2024 bond of $200 million should we decide to do so.", "citations": ["c232eb30282ba1bedfcc82be2ac15967"]}, "['Q2', '2022']": {"answer": "29a4df93b90376c84b91510dfeb1c8f9 --> John Plant [Inferred as CEO][Consistent stock buyback really almost every quarter over the last couple of years.]", "citations": ["29a4df93b90376c84b91510dfeb1c8f9"]}}}, {"topic": "Dividend distribution", "data": {"['Q4', '2022']": {"answer": "8d2e68facb37feb2f113eb809e9ec21b --> We expect to increase dividends to approximately $68 million in 2023.", "citations": ["8d2e68facb37feb2f113eb809e9ec21b"]}, "['Q3', '2023']": {"answer": "2b3ea25bf4033e1eb5d5284a1a7e2da2 --> John Plant [Lastly, we also announced a 25% increase in the dividend on top of last year's 50% increase.]\n\nc130577800378013be771fe4bc4e4d37 --> The quarterly stock dividend will be increased by 25% in the fourth quarter to $0.05 per share.", "citations": ["2b3ea25bf4033e1eb5d5284a1a7e2da2", "c130577800378013be771fe4bc4e4d37"]}, "['Q2', '2024']": {"answer": "0d4e38f30f61535fb8391a24c70abb87 --> We will increase the common stock dividend starting with the August payment to $0.08 per share.\n\n0d4e38f30f61535fb8391a24c70abb87 --> For 2025, common stock dividends are expected to be in the 15% of net income, excluding special items, plus or minus 5%.", "citations": ["0d4e38f30f61535fb8391a24c70abb87"]}, "['Q1', '2024']": {"answer": "2c0a52ec4d3fcb980d6fcb1ee06031d6 --> We also noted that we expect to raise the dividend by 40% in the second half of the year.\n\nc232eb30282ba1bedfcc82be2ac15967 --> Therefore, we expect to increase our dividend payout in the second half of the year, starting with the payment in August pending Board approval. Specifically, the expected dividend increase is $0.02 per share to a total of $0.07 per share, which is a 40% increase.", "citations": ["2c0a52ec4d3fcb980d6fcb1ee06031d6", "c232eb30282ba1bedfcc82be2ac15967"]}, "['Q2', '2023']": {"answer": "f5a2543ae698678ad1c0354aab121ba1 --> And then finally, we expect to increase the quarterly common dividend by 25% from $0.04 a share to $0.05 a share in the fourth quarter of 2023.", "citations": ["f5a2543ae698678ad1c0354aab121ba1"]}, "['Q1', '2021']": {"answer": "edc48afcbf8626a39e7f2f4bcba9ecc1 --> We plan to reinstate the quarterly dividend of $0.02 per share of common stock in the third quarter of 2021, pending the final Board approval.", "citations": ["edc48afcbf8626a39e7f2f4bcba9ecc1"]}, "['Q2', '2022']": {"answer": "ae0e6db09f0b227e5469c5829086c605 --> Finally, the Howmet annual dividend of $0.08 per share or $0.02 per quarter is planned to be doubled to $0.04 per share per quarter, with the first higher payment made in November of this year.", "citations": ["ae0e6db09f0b227e5469c5829086c605"]}, "['Q3', '2022']": {"answer": "aa86ac473e8ba307229f78558a731d8d --> The quarterly dividend was doubled to $0.04 per share per quarter with the first higher payment to be made in November of 2022.", "citations": ["aa86ac473e8ba307229f78558a731d8d"]}, "['Q2', '2021']": {"answer": "f54774194ad79afd5890d675ab19677c --> Lastly, as in last month, we have reinstated the quarterly dividend of $0.02 per common stock starting in the third quarter.", "citations": ["f54774194ad79afd5890d675ab19677c"]}, "['Q3', '2024']": {"answer": "d2b26f6de5466a0896f156fb6d2fcba2 --> The plan is to increase the common stock dividend in 2025 by 25% from $0.08 to $0.10 with the first payment in 2025, subject to final Board approval.", "citations": ["d2b26f6de5466a0896f156fb6d2fcba2"]}}}, {"topic": "Cash balance management", "data": {"['Q4', '2021']": {"answer": "86420e4ce3d80d368aa5fd0f2e06e01c --> As a result of restructuring our accounts receivable securitization program in Q3 2021, cash receipts from sold receivables will be zero going forward and the entire impact from the sale of accounts receivables will be in cash from operations.\n\n86420e4ce3d80d368aa5fd0f2e06e01c --> Therefore, starting with Q4 of 2021 and beyond, the definition of free cash flow will be simplified and be cash from operations less CapEx.\n\n5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [CapEx should be in the range of $220 million to $250 million and that continues to be less than depreciation and amortization, resulting in a net source of cash.]\n\n5396972701b7c980933044b4cd3e13fc --> John Plant, CEO [Adjusted free cash flow compared to net income is approximately 110%.]\n\n9950caed5da25c8c95ae1795684c1bac --> We expect, as I guided, the pension contributions to be lower in 2022 than previous year.", "citations": ["86420e4ce3d80d368aa5fd0f2e06e01c", "5396972701b7c980933044b4cd3e13fc", "9950caed5da25c8c95ae1795684c1bac"]}, "['Q4', '2022']": {"answer": "aba7fcc23f57ee8d086da1b60e631294 --> Pension and OPEB cash contributions are expected to be flat with 2022 and approximately $56 million for the year.\n\naba7fcc23f57ee8d086da1b60e631294 --> CapEx should be in the range of $230 million to $260 million.\n\n6aeb3aaa89c14d8c68d0ee85df4b593c --> Our free cash flow guide is $615 million, plus or minus $35 million.", "citations": ["aba7fcc23f57ee8d086da1b60e631294", "6aeb3aaa89c14d8c68d0ee85df4b593c"]}, "['Q1', '2023']": {"answer": "e548bfb72b1a2e505ff20fdcfb2c109f --> Capital expenditures are expected to be around $200 million for the current year.", "citations": ["e548bfb72b1a2e505ff20fdcfb2c109f"]}, "['Q3', '2021']": {"answer": "e8a10b7ce6be036257bb95d84ba169bf --> So we anticipate, as we mentioned, to be lower than $120 million.", "citations": ["e8a10b7ce6be036257bb95d84ba169bf"]}, "['Q3', '2023']": {"answer": "1472dbd32c4ee4bd0a375218dcfccd0f --> Ken Giacobbe [CFO][So as we exit this year, I think we've given everybody the walk in the assumptions tab of the deck to kind of walk through it. But that would indicate a working capital burn this year roughly about $190 million plus or minus.]\n\n1472dbd32c4ee4bd0a375218dcfccd0f --> Ken Giacobbe [CFO][Next year we've got another growth projection here. So I anticipate there'll be working capital burn again next year in 2024, probably be better than this year as we work down inventory in the business but it's again going to be dependent on where we are in the cycle.]\n\ne86b023b9386af9d721939b5b07d9b3a --> Next year based on asset returns, the market has been a little tougher. I'd say probably another $15 million plus or minus $5 million on either side of that.", "citations": ["1472dbd32c4ee4bd0a375218dcfccd0f", "e86b023b9386af9d721939b5b07d9b3a"]}, "['Q4', '2023']": {"answer": "7e606bfd3863818eeb5132fef5d41724 --> We expect miscellaneous other expenses, which are below the line to be in the range of $5 million of income to $15 million of expense for the year.\n\ndfcf037dad310e957b53971be3d3b438 --> As we have done every year since separation, we continue to drive free cash flow conversion of net income to our long-term target of 90%.\n\n77bc02aa2ea796a81d5d301ba72ddbe0 --> The operational tax rate is expected to continue to improve to a range of 21% to 22%.\n\n77bc02aa2ea796a81d5d301ba72ddbe0 --> Pension and OPEB expense as well as contributions are expected to increase modestly by approximately $15 million year-over-year.\n\n3aa6430f3464a06795b40ad7bb982fef --> Free cash flow, we see a $735 million plus or minus $35 million and CapEx of $290 million plus or minus $15 million.\n\nabf19d7abad24cf18a1e7e93d41617c6 --> This does not change our long-term commitment to deliver average free cash flow conversion of 90% of net income.", "citations": ["7e606bfd3863818eeb5132fef5d41724", "dfcf037dad310e957b53971be3d3b438", "77bc02aa2ea796a81d5d301ba72ddbe0", "3aa6430f3464a06795b40ad7bb982fef", "abf19d7abad24cf18a1e7e93d41617c6"]}, "['Q2', '2024']": {"answer": "71aa1def1cb19922d2ba1e080065601b --> You'll also note later in the – the increase in the capital expenditures in 2024 of a $30 million level. This takes the level towards $320 million for the year.\n\nb958b5afc9faa8291657f6295419e91b --> First, the capital expenditure required for 2024 has been increased by a further $30 million to the midpoint of $320 million.", "citations": ["71aa1def1cb19922d2ba1e080065601b", "b958b5afc9faa8291657f6295419e91b"]}, "['Q1', '2024']": {"answer": "2a28ba53e28e37e0e87875b5092ac0b1 --> Additionally, with the recent upgrades, we have established a $1 billion commercial paper program, which further strengthens our liquidity.\n\n3fa0c46fd8ed83ec266d570bfaa48ea2 --> And so you can assume that the investment is a lot more than the $100 million increase that I talked about, and let's assume it's something getting close to the $200 million, which if you think about that plus all of the additional facilitization and hiring, it's a big bill.", "citations": ["2a28ba53e28e37e0e87875b5092ac0b1", "3fa0c46fd8ed83ec266d570bfaa48ea2"]}, "['Q2', '2023']": {"answer": "ce77c7d6de0b8676754e191f46339254 --> John Plant [Inferred as CEO] [Lastly, another notable item was the commercial settlement of Lehman claim, $40 million, which is $25 million less than previously reserved, with a cash settlement we paid in July 2023 and a further settlement in July 2024.]\n\n4b7dc945e36f44b8c27c8d92afa6c06c --> We continue to expect strong positive free cash flow in the second half of 2023.", "citations": ["ce77c7d6de0b8676754e191f46339254", "4b7dc945e36f44b8c27c8d92afa6c06c"]}, "['Q1', '2021']": {"answer": "eabd2dcdb68e1a8f5d67c89f03e6bb09 --> This will be followed by cash generation in quarters 2, 3 and 4.\n\nedc48afcbf8626a39e7f2f4bcba9ecc1 --> CapEx is expected to be in the range of $200 million to $220 million.\n\nedc48afcbf8626a39e7f2f4bcba9ecc1 --> Adjusted free cash flow conversion is about 100% of net income.", "citations": ["eabd2dcdb68e1a8f5d67c89f03e6bb09", "edc48afcbf8626a39e7f2f4bcba9ecc1"]}, "['Q2', '2022']": {"answer": "59181062aab2e980d459118a3ba94cd3 --> Our capital expenditure for the next quarter will be approximately $50 million.\n\nd758cd6f398bf7f5826fb686b1d79472 --> Free cash flow, 650 million, plus or minus 25 million, an increase of 25 million from prior guidance.\n\nd758cd6f398bf7f5826fb686b1d79472 --> Free cash flow conversion of net income is expected to be approximately 110%.", "citations": ["59181062aab2e980d459118a3ba94cd3", "d758cd6f398bf7f5826fb686b1d79472"]}, "['Q3', '2022']": {"answer": "afbafba595bb233acec042841f45443f --> Lastly, in the appendix, we've updated assumptions, including an improvement in the annual operational tax rate to approximately 23.5%, which translates into a Q4 operational tax rate of approximately 22%.\n\n4e49071018e4a350496a8f9feb694a9c --> We continue to expect annual cash contributions to be approximately $60 million versus expense of $20 million.\n\n4dace87b19074d8c9504bc729d3f8ab0 --> Ken Giacobbe [We anticipate cash contributions next year will probably be the same, if not less, based on all the work that we've done over the years.]", "citations": ["afbafba595bb233acec042841f45443f", "4e49071018e4a350496a8f9feb694a9c", "4dace87b19074d8c9504bc729d3f8ab0"]}, "['Q2', '2021']": {"answer": "41498f666141d4fc49a2d74048d6c3db --> We expect continued cash generation in the third and fourth quarters.", "citations": ["41498f666141d4fc49a2d74048d6c3db"]}, "['Q1', '2022']": {"answer": "74bc38cc4d7a237b87ba762ee75cd5fb --> Annual cash contributions are estimated to be approximately 60 million versus expense of 20 million.\n\n74bc38cc4d7a237b87ba762ee75cd5fb --> Comparing to the Europe separation in 2020, annual cash contributions were approximately 240 million and are expected to improve to 60 million this year, a substantial improvement.\n\nd7ff3853708c85ffca51967f16d58bd8 --> Implicit in these numbers is capital expenditure of approximately 235 million and an improved tax rate of approximately 24.5%.\n\ncf10514d396db996b9bc62b3e5f7e441 --> Each quarter should generate positive free cash flow Q2 to Q4. As we exit the year, we have projected that we will have midpoint of around $625 million of free cash flow embedded in that number, it is around a $50 million burn associated with working capital.\n\ncf10514d396db996b9bc62b3e5f7e441 --> Right now, it is about a $50 million cash burn as we exit the year, $625 million of free cash flow, and that is a free cash flow conversion of net income of over 100%.", "citations": ["74bc38cc4d7a237b87ba762ee75cd5fb", "d7ff3853708c85ffca51967f16d58bd8", "cf10514d396db996b9bc62b3e5f7e441"]}}}]}, {"theme": "Supply Chain and Production Management", "topics": [{"topic": "Inventory management strategies", "data": {"['Q1', '2023']": {"answer": "06f2e2fbd205018bf8524b00be7ad6b3 --> The last part of the F-35 injury inventory correction regarding bulkheads that resulted from the prior underbuild of the F-35 fighters in 2020 and 2021 should be dissipated over the next two to three quarters.", "citations": ["06f2e2fbd205018bf8524b00be7ad6b3"]}, "['Q3', '2021']": {"answer": "1067d02cbd25518960d924d12a0069c5 --> previously, we'd said that the destocking – and in particular, the washout through the wide-body we would like to be complete by the end of the year, and we start to see improvements in the first quarter of next year.", "citations": ["1067d02cbd25518960d924d12a0069c5"]}, "['Q2', '2024']": {"answer": "a3c45211b2d445d9132d67f668edf590 --> In the case of Fasteners, again, we note that Boeing are not building 787 that they stated rates, that they wanted to have in their skyline. And so in the same way as we've done with the 737 in using Fasteners, which are on a Min/Max system rather than, I'll say, directly schedule part is that we've taken those inventory levels down to the minimum such that we're in accordance with our contract with Boeing, but not seeking to put inventories above that level, such that we get caught with in, but you take out later in the year or next year should that happen.", "citations": ["a3c45211b2d445d9132d67f668edf590"]}, "['Q1', '2021']": {"answer": "ada5cde073007824ab5e537dccccae84 --> We plan to liquidate trapped inventory during the balance of 2021.\n\n574867314e41b9f7224039e8fb38bd75 --> And the only business which is going to lag for, again, a couple of quarters behind that is going to be our fastener business where I think we're going to be close on, balanced all inventories up by the -- maybe by the end of the third quarter, could stray into Q4.", "citations": ["ada5cde073007824ab5e537dccccae84", "574867314e41b9f7224039e8fb38bd75"]}, "['Q3', '2022']": {"answer": "cf7522b5dfdf2f12eb956bca3f0a68cc --> we're going to carry about $70 million of additional inventory, which will hit our cash balance at the end of the year.", "citations": ["cf7522b5dfdf2f12eb956bca3f0a68cc"]}, "['Q2', '2021']": {"answer": "a0c44bf86ed5fcb256d1d0fe8ee52af9 --> We'll be carrying I think something but now less than about 50 million of trapped inventory in our system which will liquidate during 2022.\n\n6e3d84b81354358daa20a0c209a71952 --> Our thought is that basically our narrow-body by the end of this year there is no - - there's no inventory left in the system and we have to be in an inventory bill situation and it's only isolated pockets.", "citations": ["a0c44bf86ed5fcb256d1d0fe8ee52af9", "6e3d84b81354358daa20a0c209a71952"]}}}, {"topic": "Supplier performance issues", "data": {}}, {"topic": "Production rate guidance", "data": {"['Q4', '2021']": {"answer": "7f23dd28d695cfce0d2606270e233eea --> John Plant [Inferred as CEO][Aircraft production is going to increase in 2022 and increase in 2023, with a focus on burning off inventory overhang in early 2022, leading to further volume improvements in 2023.]\n\n81de6d8ec42c02e2ba99403c0e1f2aee --> And in terms of, David, the exit rate on the 737 in Q4, we were at about 17 aircraft. And as we look into 2022 consistent with what we said last quarter, probably, low 20s in the first half and low 30s in the second half.\n\n6a6ce9e5637dda53ef4c8825ba143847 --> And so, as it gets recertified production, we will get a lift from the letʼs assume that those penny numbers are being done currently and we are going to see rates of five in the second half of this year, five per month that is.", "citations": ["7f23dd28d695cfce0d2606270e233eea", "81de6d8ec42c02e2ba99403c0e1f2aee", "6a6ce9e5637dda53ef4c8825ba143847"]}, "['Q4', '2022']": {"answer": "dff3579eda2dae93ec0a5889f32fe16e --> Boeing reiterated their outlook of 50 per month for 2025 plus 2026.\n\n31f6a3df3bb8d25395e67097142e7a2c --> John Plant [Inferred as CEO] [Should it reach those heavy rates of 38 and 42 as an example, or if Airbus are in the 57, 58? Provided we know that they're heading that way, and we've got about six months lead time, we'll be in good shape to meet it.]\n\n0116c2ae482a211d698bd47504791f74 --> And so what can we rely upon and we felt as though those numbers, which I know are cautious. I know that they're below what many other people have and calling out 30 for a 737 or 53, 54 for an A320, those maybe seem to be low. And if you take 30 for a 787, that might also deem to be extremely low compared to what may be the outcome even though we know that very few were built in the in the fourth quarter.\n\ncb450c6ad72ad68e48891a9bcfd08914 --> Our LTA cadence is pretty well set. We've already been in to now into the 2024s and so on because we are probably 85% to 90% complete already for 2023.\n\n8f58edaf9433f0a6a76f7c460ccb7a5a --> And so when Boeing talked about the rate 10 787s, is it 2026? I think that's definitely really very realistic and similarly taking Airbus up into that same sort of A350 that number.", "citations": ["dff3579eda2dae93ec0a5889f32fe16e", "31f6a3df3bb8d25395e67097142e7a2c", "0116c2ae482a211d698bd47504791f74", "cb450c6ad72ad68e48891a9bcfd08914", "8f58edaf9433f0a6a76f7c460ccb7a5a"]}, "['Q1', '2023']": {"answer": "786ce04092893b5913539111bb5839a8 --> So we've laid in for additional sponge requirements and are seeking really to ramp up our production in our titanium furnaces during the balance of 2023.\n\n3f4f8e1d0a035b070d9b5259291de96e --> They much depends upon the path. And so where we are accessing base metal, it will be, let's say, more in that let's say, six to nine months. But if it's alloy metal, you're now talking about really 15 to 20 months of laying in order requirements to anticipate.\n\ncd72e32202a0b5d1fd209bf610b713f5 --> They're expecting first pass off some qualification for those machine parts in May of this year.", "citations": ["786ce04092893b5913539111bb5839a8", "3f4f8e1d0a035b070d9b5259291de96e", "cd72e32202a0b5d1fd209bf610b713f5"]}, "['Q3', '2021']": {"answer": "4a25feb31818e275da0196b85a811ca8 --> I'm going to stick with my 14 with the expectation uplift in the first quarter next year.", "citations": ["4a25feb31818e275da0196b85a811ca8"]}, "['Q3', '2023']": {"answer": "c31553ca99a32c544eef1171e691d845 --> 787 at the moment we're a little bit below rate and fully expecting that to move up to grade seven next year.", "citations": ["c31553ca99a32c544eef1171e691d845"]}, "['Q4', '2023']": {"answer": "abf19d7abad24cf18a1e7e93d41617c6 --> We based our guidance on Boeing 737 MAX production of 34 aircraft per month and six 787 aircraft per month.\n\nabf19d7abad24cf18a1e7e93d41617c6 --> In the case of the A320 we're anticipating the build rate increasing in 2025 to approximately 60 to 65 aircraft a month and that will require us to do some prebuilds or parts in 2024.", "citations": ["abf19d7abad24cf18a1e7e93d41617c6"]}, "['Q2', '2024']": {"answer": "f88cdc2a9f74df64911d719fdbc0c67b --> We've tried to derisk this to a large extent in our guidance. And notably, update our assumed 737 build rate to 22 aircraft per month in 2024 versus the previous view of 20 per month.\n\nf88cdc2a9f74df64911d719fdbc0c67b --> Indeed, further production capacity will be added by Howmet into the IGT market in 2025 to support this increased demand.\n\n95e1ff6848fa886de79ba442306643e5 --> We have significantly increased our production of turbine blade and hot section... we've probably put a 40% increase through in terms of production.\n\n9c462c32b2cf57991aa91b05faf410c2 --> John Plant [We did feel bold enough to go from our previous assumption of 22 production, 20 production to a 22 rate albeit probably still significantly below where the majority are expecting that to be.]\n\n545e532c41cd8c86e3a8d67fafc2b10d --> John Plant [We'll bring that capacity on and we'll see the fruits of that in 2026.]\n\n39ccc17e31111e0bee05d0ba68df1027 --> John Plant [Inferred as CEO] \"And that's slated to go to, I think, is it 12 a month by 2027, which would be great because that will be above the previous rate.\"\n\n39ccc17e31111e0bee05d0ba68df1027 --> John Plant [Inferred as CEO] \"On 787, the only ambitious number I've heard is rate 10, which was slightly plus 2025, 2026, but then the thing is being modified now to 2026.\"\n\n39ccc17e31111e0bee05d0ba68df1027 --> John Plant [Inferred as CEO] \"And it would be great to get back to five and then seven next year.\"", "citations": ["f88cdc2a9f74df64911d719fdbc0c67b", "95e1ff6848fa886de79ba442306643e5", "9c462c32b2cf57991aa91b05faf410c2", "545e532c41cd8c86e3a8d67fafc2b10d", "39ccc17e31111e0bee05d0ba68df1027"]}, "['Q1', '2024']": {"answer": "59268d02475edcb02e69e9ac55120aa8 --> And we've concluded that a further reduction in build to approximately 20 aircraft per month average for the year is a more secure assumption than that previously reported of 34 aircraft per month.\n\n43fc354b2dc8d05c8187f18d5c1a86a8 --> We cut our assumption from six aircraft per month down to five.\n\n43fc354b2dc8d05c8187f18d5c1a86a8 --> We just assumed five for the year.\n\n9b67b38fd2a8d49b16b62b826a260033 --> Howmet Aerospace plans to deliver no more than the absolute minimum level as per their contract with Boeing.\n\n5fc64523f74f858d42536e55e7c44491 --> Our assumptions have been going to rate seven, at the back end of this year, ahead of where we'd assumed at six thatʼs where we thought it was going to go. And then probably with a higher rate sometime in 2025, on their March to 10 aircraft per month, which I noticed now changed from 2025 to 2026.\n\n5fc64523f74f858d42536e55e7c44491 --> But nevertheless, we are thinking that will be – there will be an increase above rate five as we go into 2025 and trying to build that into – that's why we said we'd only move from six per month down to five in 2024.\n\n4540eb30b4e3a578aae3e16d6ae105ce --> Preparation for a further rate increase in 2025 for the Airbus A350.\n\n33753cd61493ca740760bd6d90f47705 --> So again, itʼs a different number in the U.S., maybe a 10% truck build reduction weʼre thinking of in North America and maybe something a little bit higher in Europe...\n\n04ca39a76184d84cb77e2d5883afa38f --> So should Boeing produce rate 38. I'm very clear that we'll be at rate 38 with them.\n\n04ca39a76184d84cb77e2d5883afa38f --> And should GE reinstate the planned increase to the 19, 25 level of LEAP engines, which is obviously part of indicating to the 1b that we'll be able to meet rate – what the – again, on labor, you can see while we've increased the overall guidance, and therefore, our labor recruitment will be fairly robust is that we have enough flexibility to be able to cope with those rate assumptions.", "citations": ["59268d02475edcb02e69e9ac55120aa8", "43fc354b2dc8d05c8187f18d5c1a86a8", "9b67b38fd2a8d49b16b62b826a260033", "5fc64523f74f858d42536e55e7c44491", "4540eb30b4e3a578aae3e16d6ae105ce", "33753cd61493ca740760bd6d90f47705", "04ca39a76184d84cb77e2d5883afa38f"]}, "['Q2', '2023']": {"answer": "c2a331ff34a9df281d4f117701d7798a --> Naturally, our plan is to achieve production rate increases and burn down the increased backlog as we move into the second half.\n\nc3762aa0c5b6b79893dda0f3214db416 --> We have lifted our 737 MAX assumption from 30 per month and nudged it into the 30s, but not anywhere near the rate 38 for the second half.\n\nf67bc36fedb3c89b460062e15380c416 --> John Plant [Inferred as CEO][But as you know, on 737, originally, it's going to be Jan 1st, then May 1st and July 1st. And we just want to be cautious. That's why I say all we've done is just nudging into the early 30s and see where it goes and be ready, capable of supplying, but not willing to be clear we're not going to put rate 38 until it's achieved.]\n\n957247f80e1a65667efc84edb4278669 --> John Plant [And similarly for the A350, that's going to go up to at least 9 a month, I think, to meet market demand.]", "citations": ["c2a331ff34a9df281d4f117701d7798a", "c3762aa0c5b6b79893dda0f3214db416", "f67bc36fedb3c89b460062e15380c416", "957247f80e1a65667efc84edb4278669"]}, "['Q1', '2021']": {"answer": "259d76fd00e631a6edf5129760b33370 --> We see at the end of the second quarter as to be an inflection point to the beginnings of production increases for Howmet in the second half of the year, with the exact precise timing yet to be determined.\n\n97768dc66c3d55da79d4a28999b67489 --> I'd say maybe a 2-quarter delay for that segment is what I see as the most likely scenario. So that's why I said I think that fasteners will be a quarter or 2 behind what we're seeing elsewhere.\n\n499644ac955b42ad88cbb7e13d486705 --> we think that it's going to continue in line with Boeing's build rate, which is currently at 7, rising to 14 in the late summer and then into the, I think, 22 per month range as we start 2022 and then up to 30 a month.\n\nada5cde073007824ab5e537dccccae84 --> Lead times are expected to significantly increase in 6 months, necessitating order placements.\n\n574867314e41b9f7224039e8fb38bd75 --> So we begin to see our structures business in the second half where we're planning for increased production.\n\nacd580fe3dee651e88ed0e3eee38678e --> So production works will be taken on. We're preparing, let's say, go to waxing and I say, prep the slurry tanks and then de-mothballing our casting machines and lines so that all of that occurs. So we can take the production on as we go into Q3 and Q4.", "citations": ["259d76fd00e631a6edf5129760b33370", "97768dc66c3d55da79d4a28999b67489", "499644ac955b42ad88cbb7e13d486705", "ada5cde073007824ab5e537dccccae84", "574867314e41b9f7224039e8fb38bd75", "acd580fe3dee651e88ed0e3eee38678e"]}, "['Q2', '2022']": {"answer": "e49a932ac1c14f0b852438a52dccaef3 --> The narrow-body aircraft production increases will continue and we expect Airbus to continue to lead with second half A320 production rates in the mid-50s per month.\n\ne49a932ac1c14f0b852438a52dccaef3 --> Boeing should lift the 737 MAX production to approximately 30 a month in the second half.\n\ne49a932ac1c14f0b852438a52dccaef3 --> The forecast for 787 production in 2022 is cut again from 25 aircraft I talked about in the last quarter's earnings call to 15 as our best estimate.\n\n6ecf2264d11b4eebe2a0e9965afe5f77 --> John Plant [We have trimmed -- inside our guidance, we have trimmed our assumption by 5,000 or 10,000 trucks in North America as an example for this year because of a more conservative assumption regarding parts availability.]\n\n1cfe52e7ccac4980e36c8e540e9370d2 --> We have taken the assumption of 787 down to the 15 for the year from the 25.\n\n0ae8d4871710e209ddf19ae73f031f84 --> I doubt we will try to replicate that again in the second half. There may be some but nothing at the scale of the first half, and trying to plan a steady level of production throughput improvements from the hiring we have done as we exit this year into 2023.", "citations": ["e49a932ac1c14f0b852438a52dccaef3", "6ecf2264d11b4eebe2a0e9965afe5f77", "1cfe52e7ccac4980e36c8e540e9370d2", "0ae8d4871710e209ddf19ae73f031f84"]}, "['Q3', '2022']": {"answer": "c152aee0cc9c056562484e45d59e00ed --> And in the case of Boeing, we were fully planning on the 31 a month and had anticipated that those according to, let's say, verbal communication, not any scheduled commitments, originally, were planned to rise during the first quarter of 2023.\n\n30a105dda443749b6bdecd64cde5c5fe --> We do have skylines showing clear improvements on the 787 build during the course of next year. And I think from memory, it's probably the back end of the year at around about 5 aircraft per month.\n\n9f9695ed368058a1fb1e9c4e8a1a1ff6 --> My guesstimate has been something like on a volume basis that we could be, let's say, I just -- can you give an example of the thought at the moment is on the year, maybe 300,000 or 400,000 wheels down in volume.\n\n58f4df81c95c520018a0e74cf6fdaea8 --> We will commence recruitment again in larger numbers in January as we expect the build rate to increase in January.", "citations": ["c152aee0cc9c056562484e45d59e00ed", "30a105dda443749b6bdecd64cde5c5fe", "9f9695ed368058a1fb1e9c4e8a1a1ff6", "58f4df81c95c520018a0e74cf6fdaea8"]}, "['Q2', '2021']": {"answer": "92e83c2e050c04a474324216c52a5e4c --> I expect that during 2022 and into 2023 we're going to see benefits above rate, because inventory just has to be put back into the system to guarantee these levels of aircraft production.\n\neb44b1892ad8e506d932c8709ae30380 --> Airbus is moving to -- is it 47 in January and then 55 by the middle of the year.\n\neb44b1892ad8e506d932c8709ae30380 --> Boeing is still planning to raise production to I think just over 30. Let's go to 31 in January of 2022.\n\neb44b1892ad8e506d932c8709ae30380 --> If it's right that by the middle of or maybe the end of 2023 we're up in the mid 60s for airbus.\n\n9aaba2de3c05176e1c3f216927033e5d --> And clearly I think for some of our product range that we will see those lead times go out to beyond six months to nine and twelve months or certainly as we move into 2022.", "citations": ["92e83c2e050c04a474324216c52a5e4c", "eb44b1892ad8e506d932c8709ae30380", "9aaba2de3c05176e1c3f216927033e5d"]}, "['Q3', '2024']": {"answer": "06f43fe19cfb1c4d4976f984c6126759 --> We expect both the increase in engine production next year to be robust and also the increase in spares requirements, which are also going to be robust.", "citations": ["06f43fe19cfb1c4d4976f984c6126759"]}, "['Q1', '2022']": {"answer": "d7ff3853708c85ffca51967f16d58bd8 --> We also note by the middle of 2023, the Airbus A320, 321 rate of 65 per month will require Howmet to be at this rate as we transition into 2023, which is another pickup from the mid-50s rate in the middle of 2022.\n\nf2741653404267a8f01d6e5ea555afe5 --> We have heard that those deliveries are going to commence by the end of the second quarter and so we have revised our guidance and also future outlook in accordance with the Skyline issued by Boeing.\n\nf2741653404267a8f01d6e5ea555afe5 --> And essentially, that has taken down the total number of 787 aircraft produced this year from, I think, 35 down to 24 or 25, something like that, and taking that revenue hit, but as you see, maintained our guide for the year.\n\nfc3db15abc597640e694fe2669dd6725 --> I expect that we will begin to see, and in fact, we are expecting to see some spot business occur in the second half of this year, where the customers haven't scheduled on us, or maybe it will occur because we may have a supply ability whereas others may not given our investments into the two new engine plants that we made during the 2019 year going into early 2020.\n\nb98a579c234f7d60937b16716d911945 --> Our thoughts about it is that assuming that 737 MAX deliveries do occur into China in the second half, which is an important step that we are still wanting to see, is that when that occurs and the inventories of MAX aircraft reduce the Boeing is that then I will have some confidence in the rate may tick above 31.", "citations": ["d7ff3853708c85ffca51967f16d58bd8", "f2741653404267a8f01d6e5ea555afe5", "fc3db15abc597640e694fe2669dd6725", "b98a579c234f7d60937b16716d911945"]}}}, {"topic": "Supply chain resilience", "data": {"['Q4', '2021']": {"answer": "246ad098ca8b453035b79d0f74ea0ea2 --> John Plant, CEO [Commercial Transportation for our Wheels business will be up and I think the supply chain constraints ease that we are going to see a fairly healthy second half of the year in that business and a really great 2023.]", "citations": ["246ad098ca8b453035b79d0f74ea0ea2"]}, "['Q3', '2021']": {"answer": "175cdc128e3efb9c000327e720f02e59 --> we do anticipate some of these supply chain constraints will be affecting the commercial truck business to move away certainly by the second half of the year.", "citations": ["175cdc128e3efb9c000327e720f02e59"]}, "['Q2', '2022']": {"answer": "160d90e0ee21584d199f999e76e49c07 --> But the fundamental picture is one where our supply situation in 2023, we expect, will be better and improved compared to 2022.", "citations": ["160d90e0ee21584d199f999e76e49c07"]}}}]}, {"theme": "Environmental, Social, and Governance (ESG) Initiatives", "topics": [{"topic": "Emissions reduction targets", "data": {"['Q1', '2023']": {"answer": "6c345101d44b5e14e744c9d2a3f3d7f3 --> We progressed against our 2024 greenhouse gas emission goal by achieving a 20% reduction in total greenhouse gas emissions through 2022 from the 2019 baseline approaching already the 2024 goal of a 21.5% reduction.\n\ne294f356edbb95ade9fbd11412463a88 --> The required emissions performance targets for trucks in 2024, especially in the U.S., will apply with no ability to have a stimulated prebuild.\n\ne548bfb72b1a2e505ff20fdcfb2c109f --> We are planning to reduce our carbon emissions by 20% over the next five years.", "citations": ["6c345101d44b5e14e744c9d2a3f3d7f3", "e294f356edbb95ade9fbd11412463a88", "e548bfb72b1a2e505ff20fdcfb2c109f"]}, "['Q1', '2024']": {"answer": "d7e9535329ddb38008c56103471600c7 --> In 2023, we continue to progress against our 2024 greenhouse gas emissions goal by achieving a 20% reduction in total greenhouse gas emissions from 2023 compared to 2019, which is our baseline year. We are tracking well to our 2024 goals of a 21.5% reduction.\n\nd7e9535329ddb38008c56103471600c7 --> Additionally, in the report, we reflect 2027 goals for Howmet, which shows the continued progress on our baseline year of 2019, with a full 33% reduction in greenhouse gas emissions.", "citations": ["d7e9535329ddb38008c56103471600c7"]}, "['Q2', '2022']": {"answer": "59181062aab2e980d459118a3ba94cd3 --> We aim to reduce our carbon emissions by 20% over the next five years.", "citations": ["59181062aab2e980d459118a3ba94cd3"]}, "['Q1', '2022']": {"answer": "05a35a459681fe013cfce1f55cbd2f1d --> John Plant [We have funded approximately 100 projects, which are expected to reduce Howmet's Scope 1 and Scope 2 greenhouse gas emissions by 21.5% by 2024 compared to our 2019 baseline.]\n\ncefd8b273931571213cc6d935856e179 --> My expectation is that those volume changes for those - because of those emissions requirements are going to be very healthy to the share of aluminum wheels and its penetration against steel over the next -- all the years up to 2030 because of these changes.", "citations": ["05a35a459681fe013cfce1f55cbd2f1d", "cefd8b273931571213cc6d935856e179"]}}}, {"topic": "Diversity and inclusion efforts", "data": {}}, {"topic": "Energy consumption management", "data": {}}, {"topic": "Sustainability reporting", "data": {}}]}, {"theme": "Market Demand and Sector Performance", "topics": [{"topic": "Commercial aerospace trends", "data": {"['Q4', '2022']": {"answer": "73a74844a23ec2e9adf7bfebbda2ffcd --> For example, underpinning the full year 2023 guidance, our assumed monthly build rates are approximately 30 per month for the Boeing 737 MAX, 53 to 54 for Airbus A320, A321. Additionally, we have assumed approximately 30 Boeing 787 builds for the year and 65 to 70 Airbus A350 build for the year. Within these outline numbers, we expect to see strength improving in the second half. These build assumptions underpin our assumed 17% Commercial Aerospace growth for the year.\n\na2a18143d243bd28bb0f6378eb3221b9 --> Clearly -- for example, if Airbus got a hit rate 65 for A320s in mid-2024s that's still the current number.", "citations": ["73a74844a23ec2e9adf7bfebbda2ffcd", "a2a18143d243bd28bb0f6378eb3221b9"]}, "['Q1', '2023']": {"answer": "e294f356edbb95ade9fbd11412463a88 --> Given the backlog and steady truck ordering in both North America and Europe, it should mean that any demand drop indicated after spring is now pushed out for at least one quarter or so...\n\ned2dacbfb3bd90a5dfe2cd46117b5352 --> John Plant [We do see that wide-body mix beginning to improve in the second half and then improve again in 2024, both for the requirements of Airbus for the A350 anticipated increases and further increases in 787.]\n\n333920aa5025130133068e29703fa076 --> And this year, we see that commercial aero segment, which used to be $400 million, probably back to at least 75% of its pre-COVID pandemic levels. And so not that part of the -- or that half of the spares is not yet back to where it was, but growing rapidly with 30% and 40% compounding, and I expect that 25% depending we won't say how to turn it but 75% could be 80% of the 19 level by the end of the year that what was $400 million.", "citations": ["e294f356edbb95ade9fbd11412463a88", "ed2dacbfb3bd90a5dfe2cd46117b5352", "333920aa5025130133068e29703fa076"]}, "['Q3', '2021']": {"answer": "44777982e600e2316144f0d72716f80f --> when you consider the overall uncertainty in the industry regarding liquidation of inventories and in particular, the – in wide-body, and the fact that it will probably be flat for a further 12 months\n\n1067d02cbd25518960d924d12a0069c5 --> I'm going to say it's more like a Q2 effect.\n\ndd23f4e5d32cb91de6cf89bb033cae7a --> John Plant, CEO [Our thought is that, that continues on the talking, generally Commercial Aerospace and the air foils that will continue to show further growth in 2022. Within the overall Commercial Aerospace, clearly, business jet is doing quite well. And we say at that moment, that segment, is healthy. And we expect to see improvements in narrow-body as we move through the next few quarters to quite a healthy level in 2022.]\n\nb16311ed31f4fe51f126a17a18ac5a00 --> John Plant [Inferred as CEO][2022 will be a lower year than 2021 by a significant demand.]", "citations": ["44777982e600e2316144f0d72716f80f", "1067d02cbd25518960d924d12a0069c5", "dd23f4e5d32cb91de6cf89bb033cae7a", "b16311ed31f4fe51f126a17a18ac5a00"]}, "['Q3', '2023']": {"answer": "2ad2d0a8f0acdae2624016c9b3cf0d62 --> And going forward into next year what I see is a volume increase for commercial aircraft production also fractional improvement in mix because of the wide-body going to next year in particular in your assumptions on what the final wide-body production will be in composite aircraft essentially on wide-body transitioning from metal to composite aircraft through the course of the year.", "citations": ["2ad2d0a8f0acdae2624016c9b3cf0d62"]}, "['Q4', '2023']": {"answer": "739adecd89a0997f9063c7cfcda820e0 --> Demand for new aircraft is expected to be sustained due to the need for aircraft with substantially improved fuel efficiency and also to the commitments made by airlines of improvement towards carbon neutrality with two stages of 2030 and then 2050.\n\n739adecd89a0997f9063c7cfcda820e0 --> Commercial aerospace spares are also growing not only due to the number of aircraft in service, but also in the case of narrow-body due to the increased service shop visit requirements of the newer fuel efficient engines. This is a long-term trend over the next decade and one which we look forward to.\n\n27fcada0fa6312c64485825be15f7b86 --> But indeed, that market of commercial transportation, we expect to resume growth in '25 and '26 and then that continued with, I think, strong continued demand from\n\n22048a6c8880906cc69ec1a6b47e79f9 --> I'll say, growth of that segment has been reduced a little bit, both in the actual for 2023 and slightly lower build as the initial demands have dropped from. I'll say, a year ago, we saw a '24 was going to be looking at 2,200 engines then went to 2000 and I know it's in the range of, I think, something like 1,875 to 1,950, something like that.\n\n979e10bfda43716807c7641dddb4637f --> And we do expect demand to be picking up in the second half of 2024 and then further strong demand -- a very strong demand going in '25 and '26.", "citations": ["739adecd89a0997f9063c7cfcda820e0", "27fcada0fa6312c64485825be15f7b86", "22048a6c8880906cc69ec1a6b47e79f9", "979e10bfda43716807c7641dddb4637f"]}, "['Q2', '2024']": {"answer": "f88cdc2a9f74df64911d719fdbc0c67b --> Spares for commercial aerospace, defense and IGT to continue to grow in aggregate at a pace of approximately 17% year-to-date, with further rate increase expected in the balance of the year.", "citations": ["f88cdc2a9f74df64911d719fdbc0c67b"]}, "['Q1', '2024']": {"answer": "41f3a70fafc9b5622a13cf3341c6679b --> I see commercial aerospace sales going up in 2025, 2026 and 2027.\n\n41f3a70fafc9b5622a13cf3341c6679b --> Assuming that Lockheed delivers, let's call it, about 150 aircraft a year, which looks like doing 150 every year for probably the next 10 years.", "citations": ["41f3a70fafc9b5622a13cf3341c6679b"]}, "['Q2', '2023']": {"answer": "a20e6bb9d69f69a9f1d70b487c486e46 --> Ken Giacobbe [Spares for commercial aerospace continued to increase sequentially and are now trending to be approximately 95% of 2019 levels at year-end.]\n\n4b7cfab8aa7ca627daca5d4c6130418c --> My final markets comment is regarding spares, where we see spares of commercial aircraft closing in on 95% of the 2019 levels by year-end and approximately 130% of the defense and IGT market at 2019 levels. This puts aggregate spares for this year in excess of 2019 levels with higher rates to come as we see the rates increasing as we close out the year.\n\n957247f80e1a65667efc84edb4278669 --> John Plant [Assuming that Boeing had a from rate 3% to 4% to 4% to 5% and then I think, higher than that in 2024 and assuming they get close to the 10 or maybe by then, we'll be feeling a lot more optimistic because I think fundamental demand is above rate 10.]", "citations": ["a20e6bb9d69f69a9f1d70b487c486e46", "4b7cfab8aa7ca627daca5d4c6130418c", "957247f80e1a65667efc84edb4278669"]}, "['Q1', '2021']": {"answer": "c4aff2a101bce973816b2f75848389c0 --> John Plant [Inferred as CEO][Commercial aerospace, I think, year-on-year, we're going to see that segment up 15% to 20% in the third quarter compared to second.]\n\n499644ac955b42ad88cbb7e13d486705 --> that's all built into what we think would be that 20% increase in commercial aero in the -- commencing in the third quarter.\n\nd929dbde8e71dc1532d9a97ff76138e3 --> We noted that second half revenue is expected to be up 12% for the total company, driven by the increases in commercial aerospace, defense and IGT.\n\nc972f58442c7308c8428a750ac9086d9 --> John Plant, CEO [Certainly, in terms of what we see over the next 12, 18 months is that the narrow-body engines, so think LEAP-1A, LEAP-1B and then obviously, some of the aftermarket service business coming back, particularly for the CFM engines. So what we see begin to fill in the back end of the year to 2022.]", "citations": ["c4aff2a101bce973816b2f75848389c0", "499644ac955b42ad88cbb7e13d486705", "d929dbde8e71dc1532d9a97ff76138e3", "c972f58442c7308c8428a750ac9086d9"]}, "['Q2', '2022']": {"answer": "a410a7b31af7c49dde35d700c7636bc9 --> I have some optimism, but really choose to say the improvement particularly for wide-body will be more of a 2023 feature and also for our commercial truck business.", "citations": ["a410a7b31af7c49dde35d700c7636bc9"]}, "['Q3', '2022']": {"answer": "7b96fe5c102122aa87b1f6d0ef239c6a --> Momentum does continue into 2023 with commercial aerospace expected to perform above normal growth rates in 2023, 2024 and also 2025 before reverting to a more normal 4% per year growth for Aerospace.", "citations": ["7b96fe5c102122aa87b1f6d0ef239c6a"]}, "['Q2', '2021']": {"answer": "0e241a825cd6cd45f5e8c86b74b9f978 --> The sequence for our businesses is that we expect increases in the engine business notably starting in the third quarter, followed by structures in the fourth quarter and fasteners starting in the first quarter of 2022.\n\n0e00ecc6f4c01a40a60db429f4d8b82d --> But the commercial aerospace business has been very, very muted certainly in Q1, small increase in Q2 and we're seeing higher percentage increases. But it don't become material in dollar terms until 2022.", "citations": ["0e241a825cd6cd45f5e8c86b74b9f978", "0e00ecc6f4c01a40a60db429f4d8b82d"]}, "['Q3', '2024']": {"answer": "6c7701fc7c70de6b0393f6bd6e5213d9 --> We envision commercial aerospace growth to be about 12% with total growth to be in the 7.5%, plus or minus 1%, with stronger growth in the second half of the year versus the first half.\n\nc85f31c0da6869413995c32ab68d0e57 --> John Plant [The peak demand for CFM56 and V2500 is now expected to be pushed out to 2026, 2027, or possibly beyond.]", "citations": ["6c7701fc7c70de6b0393f6bd6e5213d9", "c85f31c0da6869413995c32ab68d0e57"]}, "['Q1', '2022']": {"answer": "9d587c9195a64fd77d53f0b1f7ae19eb --> John Plant [Specifically regarding inquiries, we have been responsive to many RFQs, of which we expect to update you later in the year. Our thought is it is more likely to be a fourth quarter item and then increasingly a pickup of sales into 2023.]", "citations": ["9d587c9195a64fd77d53f0b1f7ae19eb"]}}}, {"topic": "Defense sector opportunities", "data": {"['Q4', '2021']": {"answer": "246ad098ca8b453035b79d0f74ea0ea2 --> John Plant, CEO [The weak point at the moment would be Defense for us. I think itʼs going to be flat to slightly down for the year and with most of that playing out in the first half of 2022.]", "citations": ["246ad098ca8b453035b79d0f74ea0ea2"]}, "['Q4', '2022']": {"answer": "73a74844a23ec2e9adf7bfebbda2ffcd --> In Defense, we expect to see low-single-digit increases in 2023 with less overhang to the F-35 structures inventory. Demand for the F-35 is strong and high builds are now expected throughout the remainder of the decade. This is further supported by both increased engine spares demand and upgrades of engines associated with the 2028 Block 4 requirements.", "citations": ["73a74844a23ec2e9adf7bfebbda2ffcd"]}, "['Q3', '2023']": {"answer": "aab7c0376698e91dfecb018a7c9c19ff --> Moving on commercial aerospace to the defense market. This market is also showing strength with the start of the gradual buildup of engine spares over the next two to three years to support the F-35 program for which the fleet now stands at 975 aircraft and growing.", "citations": ["aab7c0376698e91dfecb018a7c9c19ff"]}, "['Q2', '2024']": {"answer": "f88cdc2a9f74df64911d719fdbc0c67b --> In the case of defense, the outlook continues to be a double-digit increase for the year.", "citations": ["f88cdc2a9f74df64911d719fdbc0c67b"]}, "['Q1', '2024']": {"answer": "41f3a70fafc9b5622a13cf3341c6679b --> I think by the time we get to 2025, we could be seeing spares revenues almost as much as the current OE demand for F-35 turbine blades.", "citations": ["41f3a70fafc9b5622a13cf3341c6679b"]}, "['Q2', '2023']": {"answer": "4b7cfab8aa7ca627daca5d4c6130418c --> The F-35 backlog continues to increase to approximately 420 aircraft with recent orders of 126 aircraft for the US government joint Kroger office, plus 25% for Israel, and a further 25 aircraft for the Czech Republic.\n\nbe2ee73a0d2096c3d681ad0661b560f9 --> We'll begin to see spares increases for F-35 as an example, as we go through into 2024 and 2025.", "citations": ["4b7cfab8aa7ca627daca5d4c6130418c", "be2ee73a0d2096c3d681ad0661b560f9"]}, "['Q3', '2024']": {"answer": "d0b630cd6c2421974eeb648669859510 --> For 2025, defense aerospace growth continues to be solid and is forecasted at mid-single-digits with both F-35 spares and legacy aircraft production, all contributing.", "citations": ["d0b630cd6c2421974eeb648669859510"]}}}, {"topic": "Industrial market dynamics", "data": {"['Q4', '2023']": {"answer": "3aa6430f3464a06795b40ad7bb982fef --> The market where we're cautious is that of commercial transportation, where we see potential for up to a 10% reduction in revenue as we move through 2024.", "citations": ["3aa6430f3464a06795b40ad7bb982fef"]}, "['Q2', '2024']": {"answer": "f88cdc2a9f74df64911d719fdbc0c67b --> Commercial truck builds are beginning to abate and the long predicted slowdown, particularly in Europe, has started and will lay on the second half at maybe a 10% reduction in addition to the more normal European summer vacation seasonality.", "citations": ["f88cdc2a9f74df64911d719fdbc0c67b"]}, "['Q1', '2021']": {"answer": "9fc4c37d6cb22b7b040c529a43eb3d76 --> And you've seen class 8 truck and trailer orders at levels now, which essentially secure the backlog for the balance of 2021 and most of the way through 2022 at the moment.\n\n9fc4c37d6cb22b7b040c529a43eb3d76 --> So you're looking out into the second quarter of 2022.\n\n43d84039d461033017579c2f142e260d --> And then in general, industrial is also strengthening, as we see through the balance of 2021, again, in the second half.\n\n55b76ccc5353feb3bdae81687fb76df5 --> I think we're going to see significant demand increases for our fastener business in 2022.", "citations": ["9fc4c37d6cb22b7b040c529a43eb3d76", "43d84039d461033017579c2f142e260d", "55b76ccc5353feb3bdae81687fb76df5"]}, "['Q3', '2024']": {"answer": "d0b630cd6c2421974eeb648669859510 --> The outlook for commercial truck wheels continues to be muted in the fourth quarter of this year and the first two quarters of 2025, with the prospect of some pickup in the second half of the year.", "citations": ["d0b630cd6c2421974eeb648669859510"]}, "['Q1', '2022']": {"answer": "69002881890bd4a761a1014898fbe43c --> So my expectation is -- I will just give like a North American number, I think we are going to see some trucks level, it is like 300,000 trucks maybe as we go into next year or slightly more.", "citations": ["69002881890bd4a761a1014898fbe43c"]}}}, {"topic": "Oil and gas sector outlook", "data": {"['Q1', '2021']": {"answer": "43d84039d461033017579c2f142e260d --> But we -- our thought process is that maybe in the fourth quarter or certainly by the first quarter of next year, we think in the oil and gas begins to show an improvement for us.", "citations": ["43d84039d461033017579c2f142e260d"]}, "['Q3', '2024']": {"answer": "d0b630cd6c2421974eeb648669859510 --> IGT to grow at mid-single-digits, with oil and gas a little bit higher.", "citations": ["d0b630cd6c2421974eeb648669859510"]}}}]}, {"theme": "Operational Challenges and Risk Management", "topics": [{"topic": "Supply chain disruptions", "data": {"['Q1', '2023']": {"answer": "e294f356edbb95ade9fbd11412463a88 --> We remain cautious about commercial aircraft build in the second half until we see clear evidence of consistent production rate increases...", "citations": ["e294f356edbb95ade9fbd11412463a88"]}, "['Q3', '2021']": {"answer": "80a80833f113b522c9eafebc7f8c377f --> I think we probably will be towards the end of Q1. And we want to take a cautious view on all of that.", "citations": ["80a80833f113b522c9eafebc7f8c377f"]}, "['Q3', '2023']": {"answer": "ddef66167ee2b89291dd4b74892be1f6 --> Where the moment the date on hand is well out of order in terms of, where it needs to be and is not yet improving at all, but we'll begin to improve I believe as we go through 2024.\n\ncec1e6a3cf0e7a10638a5af36657e316 --> Our assumption is that by Q1 next year by another couple of months at UAW dispute the Mac truck will be resolved and therefore they'll be back.\n\n63fd9cf85b83f01ce54629a5e5e37186 --> So this contamination issue clearly that requires inspection that might take, I don't know, so many days, let's call it, 20, 30, 40 days or an off wing to achieve that inspection.", "citations": ["ddef66167ee2b89291dd4b74892be1f6", "cec1e6a3cf0e7a10638a5af36657e316", "63fd9cf85b83f01ce54629a5e5e37186"]}, "['Q2', '2022']": {"answer": "a410a7b31af7c49dde35d700c7636bc9 --> And therefore, we chose to take down our view of 787 for the second half, given the fact that it has been delayed from last year to Q1 to Q2.", "citations": ["a410a7b31af7c49dde35d700c7636bc9"]}}}, {"topic": "Commodity price volatility", "data": {"['Q4', '2022']": {"answer": "87b0efdf6b49b84858ebf7a731e43dba --> We expect the combination of material, inflationary costs to be in the range of $70 million to $100 million for the year.", "citations": ["87b0efdf6b49b84858ebf7a731e43dba"]}, "['Q1', '2021']": {"answer": "276a0149819443ea8ddbd153d3ac598f --> John Plant [Labor inflation for significant parts of our businesses is set for the next 2 to 4 years depending upon the various labor agreements in place.]", "citations": ["276a0149819443ea8ddbd153d3ac598f"]}}}, {"topic": "Regulatory compliance measures", "data": {}}, {"topic": "Geopolitical impacts analysis", "data": {}}]}]