[{"theme": "Loan Portfolio Management", "topics": [{"topic": "Loan disbursement growth", "data": {"['Q2', '2025']": {"answer": "bc21d579684a71279daf4fd05aca132e --> We were able to match the deposit growth in tune with the credit growth, the current cost, whatever that has been observed, should continue for the second half of the year also by and large.\n\n02d36f49d73c5325bdd8648c454b5730 --> We will go with secured as planned for Q4 beginning. There is no change on LAP, home loans and affordable and micro LAP. The technology is ready and we just need feet on street.", "citations": ["bc21d579684a71279daf4fd05aca132e", "02d36f49d73c5325bdd8648c454b5730"]}, "['Q3', '2024']": {"answer": "89750bd082ac6213f5afaacb05044b81 --> So we have already started giving it for less than INR3 crores. So in the next few weeks, it will be increasing to INR5 crores, and then, it will be increased up to INR7.5 crores, which is given as the threshold of the retail by the regulator.\n\nd9e2ecfa811ee8061b1ae9ff8f703955 --> N. Kamakodi [Inferred as CEO][So, in the next one month or so if everything works well, we will be in a position to give the in-principle sanction for all the facilities less than INR5 crores.]", "citations": ["89750bd082ac6213f5afaacb05044b81", "d9e2ecfa811ee8061b1ae9ff8f703955"]}, "['Q4', '2023']": {"answer": "162b1ba4fbef2772cec5f36db08656ba --> The approval proportion should progressively increase in the next few quarters.\n\nfde3fa437f889d9e43c45133c455cab5 --> Rohan Mandora [Target of 12% to 15% loan growth for FY2024]\n\n662c46c8e5cf85b50a04df3e94ecb31b --> Yes which will be back ended.", "citations": ["162b1ba4fbef2772cec5f36db08656ba", "fde3fa437f889d9e43c45133c455cab5", "662c46c8e5cf85b50a04df3e94ecb31b"]}, "['Q1', '2024']": {"answer": "1dfe77a62bdceb450cab454593770b01 --> See, basically, as I discussed in the last quarter con call, initially, we are starting with our existing customer base and to make the part quicker and give better approval rates and things like that. So it will first start with the MSME lending, less than INR 5 Crs. Parallelly, it will process the renewal which will give a lot of free space in our processing capacity.\n\n125747b35794533dfd5ce9ae15af6385 --> But for improving the retail loans like housing loan and other segments, we need to go for the verticalization, for which we have started the action. But to have them in place and have a meaningful incremental, it will take a few quarters, if not a few years.\n\n595cfeea431139b04a2ad0c5f1b863d8 --> We aim to increase our loan book by 15% in the next fiscal year.\n\n94f2dca76491e213370c364a9a1f6ae8 --> Going forward, my expectation is that it should be close to 15 % is what we are expecting in that newer portfolio of the co-lending. When we use the capacity created by the NBFCs and other fronts, this should come close to about 7 to 10 % of our overall loan book maybe 5 years down the line.\n\n94f2dca76491e213370c364a9a1f6ae8 --> Under the retail, our regular MSME, commercial trading, gold loan etc., can have a growth rate of about 10% to 11% and incrementally about 25 % of the growth rate will be constituted by these new lines of activities. Together, they should be constituting about 12 to 15 % in our overall book in a 4- to 5-year timeframe.\n\n5fc1bfbaeb2f0d100b3abc4bfec6fbe2 --> We have guided for a loan growth of 12 to 14 %.", "citations": ["1dfe77a62bdceb450cab454593770b01", "125747b35794533dfd5ce9ae15af6385", "595cfeea431139b04a2ad0c5f1b863d8", "94f2dca76491e213370c364a9a1f6ae8", "5fc1bfbaeb2f0d100b3abc4bfec6fbe2"]}, "['Q2', '2024']": {"answer": "b8458838010f190185d2c7371c3a111d --> Still it stands and we are working for that.\n\n606c5bbf09f6397000ca241e8dd32da8 --> For the MSME loans less than Rs.3 Crores the soft launch of the product is already on and maybe for next 10 to 15 days it will be used for select branches. After any bugs if at all anything is there, after correction maybe the second half of November it should be made available to all the branches.", "citations": ["b8458838010f190185d2c7371c3a111d", "606c5bbf09f6397000ca241e8dd32da8"]}, "['Q1', '2025']": {"answer": "2faf819c2f1bd8d14d13bdd639a1dd97 --> So, now, we started with less than Rs. 3 crores then we extended it to Rs. 5 crores. And currently, as per the RBI's definition of regulatory retail portfolio is Rs. 7.5 crore. So, from all the proposals less than Rs. 7.5 crore goes through this digital software now.\n\n49042cf612385e4423aa000c6331c528 --> We should start our pilot disbursals by September second week to third week.", "citations": ["2faf819c2f1bd8d14d13bdd639a1dd97", "49042cf612385e4423aa000c6331c528"]}, "['Q4', '2024']": {"answer": "4e18492fcd66926b2a91d90c6a6a95e4 --> We expect to achieve a loan growth of 15% in the upcoming fiscal year.\n\n7aa023b97ef0a6b1aac242b4e33aec98 --> Yes, and we are in the process of taking it to INR7.5 crores which is the RBI limit for the retail lending.\n\ne4e6d1eb438304387371003c7b2f7620 --> we made an internal calculation and evaluation we could see about INR7,000 crores of the products like housing loan or LAP or other vehicle loans our own customers have taken from the other financial institutions which will be the first segment which we tap.", "citations": ["4e18492fcd66926b2a91d90c6a6a95e4", "7aa023b97ef0a6b1aac242b4e33aec98", "e4e6d1eb438304387371003c7b2f7620"]}}}, {"topic": "Non-performing asset (NPA) strategies", "data": {"['Q3', '2023']": {"answer": "747f0bdaf1732cbb4bede0d581bf9e47 --> But what is clear is that if the repayment of SpiceJet is going as per whatever it has happened, it is expected to close the entire outstanding by June and the entire amount will be available for appropriation.", "citations": ["747f0bdaf1732cbb4bede0d581bf9e47"]}, "['Q4', '2023']": {"answer": "cc013cf740f9a86065a678794d200adf --> As far as we do not expect that for us the reason being they had given a repayment schedule and they have repaid up to almost 75% of the overall outstanding and there is only one installment left which they have to cover it by June 30, 2023 so that is where the things currently stand as of now for us.", "citations": ["cc013cf740f9a86065a678794d200adf"]}}}, {"topic": "Sectoral loan distribution", "data": {"['Q2', '2025']": {"answer": "12a55dedd68be64b9f1ab20f06f3a122 --> N. Kamakodi [Our entire start in the retail is going to be on the secured retail lending portfolio per se. And, let's say, 4 to 5 years down the line, it will be about 4 to 5 % of the portfolio, the focus will be mainly on the secured lending space.]", "citations": ["12a55dedd68be64b9f1ab20f06f3a122"]}, "['Q1', '2024']": {"answer": "94f2dca76491e213370c364a9a1f6ae8 --> The 85 % will be from my existing portfolio combination, 15 % will be from the new areas. In that 15 %, about -- around 8 to 10 % will be from the co-lending and other areas. And about 5 to 7 % will be from the increased retail and other area which we are building our internal strength.", "citations": ["94f2dca76491e213370c364a9a1f6ae8"]}, "['Q1', '2025']": {"answer": "7170ac5d02e60a4fb75d72b110155fb4 --> Our first priority is to go ahead with the MSME lending, then followed by the secured retail portfolio like housing loan and car loan. And this particular unsecured thing for existing customers we have started, but this unsecured thing may show some amount of next level improvement over a period of time, maybe in the next period of 3-5 years as explained.\n\nd93635ef3e4341fd9e5b5290ea8b8642 --> Puneet - \"by FY26 to get to book mix of secured and unsecured.\"", "citations": ["7170ac5d02e60a4fb75d72b110155fb4", "d93635ef3e4341fd9e5b5290ea8b8642"]}}}, {"topic": "Credit risk management", "data": {}}]}, {"theme": "Risk Management and Compliance", "topics": [{"topic": "Credit risk assessment", "data": {"['Q3', '2024']": {"answer": "d9e2ecfa811ee8061b1ae9ff8f703955 --> N. Kamakodi [Inferred as CEO][And there may be 80, 90 % of the cases in the next 48 hours.]\n\nd9e2ecfa811ee8061b1ae9ff8f703955 --> N. Kamakodi [Inferred as CEO][It will give a decision whether the proposal can be accepted as it is or which needs a manual check-in or which should not be accepted at all - is expected to continuously reduce the probability of default of the portfolio, which will take like a few quarters for that to stabilize.]\n\n616118a1c8566d6ea683dd28f207acd9 --> N. Kamakodi [Inferred as CEO][Parallelly, you will be having about maybe 15 % to 20 % sampling that is continuously monitored to ensure that the system is not leaving any factor. So on an ongoing basis, if you look into INR5 crores to INR7 crores, the degradation will be helping us with this decision. But I won't say that the entire outcome will be purely based on the 100 % automated. So it will be a combination of both -- it will reduce the manual decision making to a greater extent to whenever the proposal is more than INR5 crores and less than INR7.5 crores.]", "citations": ["d9e2ecfa811ee8061b1ae9ff8f703955", "616118a1c8566d6ea683dd28f207acd9"]}, "['Q2', '2024']": {"answer": "14ea94076789f79d7e6424e71baed055 --> the credit cost would be like lower at lower levels like for the second half just as how we have seen in for Q2.", "citations": ["14ea94076789f79d7e6424e71baed055"]}, "['Q1', '2025']": {"answer": "d5a55e85665ffc7b80a5761e806b622d --> And in this cycle, maybe for at least another not less than six to seven quarters or so, there is every possibility that current favorable credit cost environment may prolong.", "citations": ["d5a55e85665ffc7b80a5761e806b622d"]}}}, {"topic": "Provisioning strategies", "data": {}}, {"topic": "Regulatory compliance updates", "data": {"['Q3', '2023']": {"answer": "b0781d0b2e5532dfa4dfd90e910c942f --> We are actually working for it. There is a process so we have to complete the paperwork which has to be audited, which has to be then given to the regulator for inspection. So we hope it should be completed before the current year and we have to wait and see. We are working with that deadline only.", "citations": ["b0781d0b2e5532dfa4dfd90e910c942f"]}, "['Q2', '2024']": {"answer": "b1c1c6500717c01c1f58e8a1cbabbba1 --> Our plan is, keeping in mind the upper limit given by the regulation, onboarding them who should work with us for the remaining period so that there is a smooth hand over and takeover when the term ends.", "citations": ["b1c1c6500717c01c1f58e8a1cbabbba1"]}}}, {"topic": "Risk mitigation policies", "data": {}}]}, {"theme": "Digital Transformation", "topics": [{"topic": "Mobile banking enhancements", "data": {}}, {"topic": "Digital lending expansion", "data": {"['Q3', '2024']": {"answer": "bb2cdc7ca88ad9c0f71a47ebf6edf313 --> We are working to accelerate proper implementation of the digital lending process initiated with the help BCG and we have already rolled out first to face of the automated loan underwriting process. It may take a few quarters to show benefits in our bottom line.\n\n22e29f38a22d39952e28ae8e08c89325 --> So, we are introducing these digital lending processes for all the exposures less than INR7.5 crores, in those segments which are breadwinners currently.", "citations": ["bb2cdc7ca88ad9c0f71a47ebf6edf313", "22e29f38a22d39952e28ae8e08c89325"]}, "['Q1', '2024']": {"answer": "5bddcc6d63d775c3df93afaf4893eaa6 --> Taking into consideration all these things and also the expected digital lending to come on track, we should be able to, get to the double digit and close to 12 to 14 % as what we have promised during the second quarter.\n\n31bb87de75ff8981c0a93828e27c6000 --> We expect that benefit of digitalized lending process, will get transferred into the growth in the second half of the FY’24.\n\n125747b35794533dfd5ce9ae15af6385 --> our expectation is that when we want to grow by a double-digit growth of 12 to 14 % for year as a whole, the arrival of digital lending process will improve our task going forward and it will just get us to the double-digit growth.\n\n23d63169db91130387d57f05a4fdfbec --> And number two, the digitization and the digital lending is available during my second half for the MSME. It should reduce my TAT and improve my capacity utilization.", "citations": ["5bddcc6d63d775c3df93afaf4893eaa6", "31bb87de75ff8981c0a93828e27c6000", "125747b35794533dfd5ce9ae15af6385", "23d63169db91130387d57f05a4fdfbec"]}, "['Q2', '2024']": {"answer": "4d5afcfd686e60061d34b420b4486930 --> The soft launch of digital lending products have started which is expected to help us achieving improved credit growth in the second half as we discussed in the earlier concalls to achieve double digit credit growth for the whole year.\n\nd7858391fbef4b196f5fe7689017c652 --> Our growth will be skewed in the second half. Already we have about 2% to 3% quarterly growth in this Q2 and one of the major thing what we need is the introduction of the digital lending process for which the soft launching has already started.", "citations": ["4d5afcfd686e60061d34b420b4486930", "d7858391fbef4b196f5fe7689017c652"]}, "['Q1', '2025']": {"answer": "12c8900f05e2cf98f59254f133605b7d --> Post MSME, digital lending model will be expanded to secure retail lending such as housing, micro-LAP in 1QFY25.\n\nd3bb86395029cc38eda69d52e202cb84 --> We will see the benefits of digital lending process in the coming quarters. Since we are taking the cost upfront, our cost to income ratio will be slightly higher than the current year and once full benefits of the digital lending and other initiatives transfer into growth, the cost to income ratio will start to come down.\n\n732bf102dfe17d39ae583b784a6c2cce --> The fees paid to BCG for the digital lending implementation was over by Q1 FY ‘25 and the cost of the new avenues of retail business will take at least 6 quarters to get adjusted with the increased business volume.", "citations": ["12c8900f05e2cf98f59254f133605b7d", "d3bb86395029cc38eda69d52e202cb84", "732bf102dfe17d39ae583b784a6c2cce"]}, "['Q4', '2024']": {"answer": "cdc09d74dea740425da99bbdeb1bd13e --> The digital lending process was going as per the schedule, which will help us in achieving improved credit growth in the coming quarters.\n\ne9cb14672e04be72dfc78725c55ca59f --> The digital lending implementation for MSME is reaching the last leg and should be through before the mid-June. Along with the MSME, digital lending model is being expanded to secured retail lending such as housing, LAP, micro LAPl. Currently, we are doing that, and they should be completed before the end of Q1.", "citations": ["cdc09d74dea740425da99bbdeb1bd13e", "e9cb14672e04be72dfc78725c55ca59f"]}}}, {"topic": "Cybersecurity measures", "data": {}}, {"topic": "Technology adoption initiatives", "data": {"['Q3', '2024']": {"answer": "d9e2ecfa811ee8061b1ae9ff8f703955 --> N. Kamakodi [Inferred as CEO][Now we have started our project of enhancing this to Rs.5crores. The testing has already started.]\n\n22e29f38a22d39952e28ae8e08c89325 --> As we have told in the last con call, over the next five years, we may have some amount of unsecured portfolio for which things have to start in a small way where you need the automation.", "citations": ["d9e2ecfa811ee8061b1ae9ff8f703955", "22e29f38a22d39952e28ae8e08c89325"]}, "['Q1', '2024']": {"answer": "79f66d8d55a9ebdf7488b2cdee3221a0 --> In that, what is going to basically happen is that the digitization, along with the introduction of the scorecards and things like that, the TAT which we take currently about not less than 1 week to 15 days, it could be reduced to even 24 hours to 22 hours for soft approval.\n\n737e3fc52009b89a5883d6f6ae1c76ae --> The major change will be in the TAT. So like I said, this improvement in the process through digitization can reduce the soft approval rate from the current level of about 1 week or 2 weeks to 1 or 2 days.\n\nd85ca2cbcf9fd1d9b575ccc4c4528c95 --> Our expectation is that we should be getting back to that 50 % plus when digitization gets completed. Until that point of time, we will be seeing a step-by-step improvement from 30 to 35%, 35 to 40% and things like that.", "citations": ["79f66d8d55a9ebdf7488b2cdee3221a0", "737e3fc52009b89a5883d6f6ae1c76ae", "d85ca2cbcf9fd1d9b575ccc4c4528c95"]}, "['Q2', '2024']": {"answer": "67087f92a8c44d4a39d4f5121b54b6c8 --> We expect this digitization and introduction of the LOS should also improve our efficiency in managing the things and we should have the double digit growth of advances mainly from the second half as we have seen in the earlier years.", "citations": ["67087f92a8c44d4a39d4f5121b54b6c8"]}}}]}, {"theme": "Capital Adequacy and Financial Metrics", "topics": [{"topic": "Tier 1 capital ratio", "data": {"['Q3', '2023']": {"answer": "c819e0ca08c959ceb4142848a502c031 --> We do foresee that after moving to ECL regime, we may require maybe a total of maybe around INR 200 crores maximum, which will be adjusted against CET-1 capital and which will be spread over a period of five years as per the transitional arrangement given by the RBI.\n\ncfdd7ec47dbc3d91f439c455080d36eb --> Final installment is scheduled to be received by June 2023.", "citations": ["c819e0ca08c959ceb4142848a502c031", "cfdd7ec47dbc3d91f439c455080d36eb"]}, "['Q2', '2024']": {"answer": "606c5bbf09f6397000ca241e8dd32da8 --> It is as usual. It is close to about 200% is what we are maintaining which will be available in the website soon.", "citations": ["606c5bbf09f6397000ca241e8dd32da8"]}, "['Q4', '2024']": {"answer": "64010b6e53f1c4ce32a61f923ce0dd00 --> And you did mention that you're looking at about 5 to 10 basis points plus minus.", "citations": ["64010b6e53f1c4ce32a61f923ce0dd00"]}}}, {"topic": "Profit margin trends", "data": {"['Q3', '2023']": {"answer": "f1cb22fbdaf176ecc35ce4165b084fcc --> Starting from the Q4 financial year '22, we have been achieving quarterly PAT of INR 200-plus crores on a continuous basis.", "citations": ["f1cb22fbdaf176ecc35ce4165b084fcc"]}, "['Q2', '2025']": {"answer": "502a2005570ecaa2b657af93a6c4e0b6 --> It will break even in the second year and the profitability and accretion to the ROA will start coming only from the third year.", "citations": ["502a2005570ecaa2b657af93a6c4e0b6"]}, "['Q3', '2024']": {"answer": "392ee0e26ddb757affdc6f4087e2dcc6 --> To sum up, we should be achieving the 4-digit PAT for financial year '24 for the first time.\n\n9d2cde0f30f02abddf229713b001b260 --> We expect we should be closing financial year '24 with a decent PAT growth, substantial reduction in NPA, improved coverage ratio and ROA close to our long-term average of 1.5%.\n\n42a40fdfaf9f1872a37433c84b9fd11b --> We hope to cross 4-digit PAT figure for financial year '24.\n\n8341a295205992f21a2bd04f3f54b25f --> We are able to march towards probably a 4-digit profitability figure for the current year, perhaps for the first time in our history.", "citations": ["392ee0e26ddb757affdc6f4087e2dcc6", "9d2cde0f30f02abddf229713b001b260", "42a40fdfaf9f1872a37433c84b9fd11b", "8341a295205992f21a2bd04f3f54b25f"]}, "['Q4', '2023']": {"answer": "cafb0b530507c74c1d2468addabbfb5e --> Our margin will be around this range for the current year, with 10 to 15 basis points lower than the Q4 average of 3.65%.\n\ncafb0b530507c74c1d2468addabbfb5e --> Full year margins will be closer to what you saw in Q4 of FY2023, plus or minus 10 basis points.", "citations": ["cafb0b530507c74c1d2468addabbfb5e"]}, "['Q1', '2024']": {"answer": "adb4044cdbf50a458e9771f1689838fe --> Our expectation for current FY will be between 42 to 44 %.\n\n79f66d8d55a9ebdf7488b2cdee3221a0 --> No. We said 12 to 14 % in the last con call. We are still working towards achieving that towards the end of the current year.", "citations": ["adb4044cdbf50a458e9771f1689838fe", "79f66d8d55a9ebdf7488b2cdee3221a0"]}, "['Q2', '2024']": {"answer": "4d5afcfd686e60061d34b420b4486930 --> Despite headwinds in the growth we should be closing the FY2024 with the four digit PAT.\n\n636f7ac0ac293be5586a744e4767cdcc --> We closed the first half FY2024 with a profit after tax of Rs.508 Crores and hope to cross four digit profit after tax figure for the whole year FY2024 for the first time.", "citations": ["4d5afcfd686e60061d34b420b4486930", "636f7ac0ac293be5586a744e4767cdcc"]}, "['Q1', '2025']": {"answer": "d93635ef3e4341fd9e5b5290ea8b8642 --> N. Kamakodi [Inferred as CEO] - \"next FY, we will be breaking even, and it will be adding to profit kitty only beyond that.\"", "citations": ["d93635ef3e4341fd9e5b5290ea8b8642"]}, "['Q4', '2024']": {"answer": "cdc09d74dea740425da99bbdeb1bd13e --> We expect that we should be closing the financial year '24 with a decent PAT growth, substantial reduction in the net NPA, improved coverage ratio and ROA close to our long-term average of 1.50 %.\n\ncdc09d74dea740425da99bbdeb1bd13e --> We should be achieving our 4-digit PAT growth PAT for our financial year '24 for the first time.\n\nd62b9276731f56fc4181e578e10fbea3 --> Board has recommended a dividend of 150 % including 50 % special dividend for 120th year.\n\ne737588ed367c338fbe59e0376726586 --> Sorry just to sort of clarify for the full year our ROA 1.52%. So you are saying that for the financial year FY '25 it should only improve from this level despite the higher cost-to-income ratio. Is that correct?\n\nf0e66ccd7bc671f5d308caa689f95d8c --> So the financial '24-25 we should be finishing somewhere in between the final quarter figure of 51% and the full year figure.", "citations": ["cdc09d74dea740425da99bbdeb1bd13e", "d62b9276731f56fc4181e578e10fbea3", "e737588ed367c338fbe59e0376726586", "f0e66ccd7bc671f5d308caa689f95d8c"]}}}, {"topic": "Return on equity (ROE) enhancement", "data": {"['Q3', '2023']": {"answer": "2266ef3c7822fce154fd2f1f2bdaa649 --> The RoA we said it will be reaching 1.5%. So even though the quarterly RoA is lower, nine months RoA is 1.5% as declared in the past.\n\n6de59666490941ebe0eefbe1197ffa48 --> RoA also to stay around the current level that is 1.5% for the financial year.", "citations": ["2266ef3c7822fce154fd2f1f2bdaa649", "6de59666490941ebe0eefbe1197ffa48"]}, "['Q2', '2025']": {"answer": "a638b57c489c6e5fb1fdbe6d3b17603e --> Our ROA back at our long-term average of 1.5% and it should continue.", "citations": ["a638b57c489c6e5fb1fdbe6d3b17603e"]}, "['Q3', '2024']": {"answer": "316f6601f0b2b026e2f239ad12b41cd4 --> My focus will be, in the next 4 to 8 quarters, to reach growth rate of around 16 % to 17 % so that you increase your return on equity around that level.\n\na7f0a5dcd2ce9c88e972f2345f36fdbe --> Our effort will be to slightly exceed that and have profitability metrics and return on equity and the deposit growth rate.", "citations": ["316f6601f0b2b026e2f239ad12b41cd4", "a7f0a5dcd2ce9c88e972f2345f36fdbe"]}, "['Q4', '2023']": {"answer": "1fe7491780b45ea5d2c423310b683a0a --> We hope to close FY 24 also with the ROA of 1.50%.\n\n694366460668663b193cb9d7d9daa8e7 --> Rohan Mandora Guiding for a 1.5% kind of a ROA for FY2024", "citations": ["1fe7491780b45ea5d2c423310b683a0a", "694366460668663b193cb9d7d9daa8e7"]}, "['Q1', '2025']": {"answer": "a0a03de75eb2dd6d85158a7312671fab --> We have restored our ROA to our long term average of 1.5% and it will continue.\n\n75ebb6716f91b3903ab07481a3d050bc --> ROA is expected to remain at our current level of 1.5% plus.\n\n0096e0dac44c621652891c20592bebc2 --> Puneet [We are talking about maintaining the 1.5% ROA for at least another 4-5 quarters.]\n\n145b8d1fbc67c99bd83253aa1e42df7d --> About two quarters back or so, we got back to that 1.5% trajectory. So, as I told, some amount of upfront expenditure we are taking and some increase in the cost is there.\n\nd5a55e85665ffc7b80a5761e806b622d --> We expect once we start seeing the delivery or productivity from the new growth engines which we are trying to add, definitely, there could be expansion in the ROA beyond 1.5% whatever we are there.", "citations": ["a0a03de75eb2dd6d85158a7312671fab", "75ebb6716f91b3903ab07481a3d050bc", "0096e0dac44c621652891c20592bebc2", "145b8d1fbc67c99bd83253aa1e42df7d", "d5a55e85665ffc7b80a5761e806b622d"]}}}, {"topic": "Cost-to-income ratio management", "data": {"['Q2', '2025']": {"answer": "5794dac0eb9788d711268bff74ad5e51 --> We should start seeing the cost-to-income ratio, moderating between 48 to 50 % going forward and then showing a continuous decline.", "citations": ["5794dac0eb9788d711268bff74ad5e51"]}, "['Q4', '2023']": {"answer": "42a03506b26f6b18aa01376ef800be7d --> We expect that coverage ratio also to improve – with TW over 70% and without TW over 50% in a few quarters.\n\n42a03506b26f6b18aa01376ef800be7d --> In the absence of treasury profit the CIR will stay in the range of 42 % - 45% in the next financial year.\n\n65e2372f3a9f208c6c3a28cf23f300c5 --> For FY2023, there could be a dip in the margin as compared to last year and there could be a chance of cost to income ratio which is around 38% to 39% could increase to 40% to 41%.", "citations": ["42a03506b26f6b18aa01376ef800be7d", "65e2372f3a9f208c6c3a28cf23f300c5"]}, "['Q2', '2024']": {"answer": "a6b63e69d4b47f9493d7755091639cde --> In the absence of treasury profit opportunities in the increasing interest rate scenario, the cost to income ratio will be in the range of 42% to 45%.", "citations": ["a6b63e69d4b47f9493d7755091639cde"]}, "['Q4', '2024']": {"answer": "c824a46ab1425d60e4ecde0ceb27201d --> Our cost-to-income ratio will be slightly higher, like now. And we should start seeing them coming down as we see the full benefits of the digital lending and also other initiatives that transfer growth to income and the cost-to-income ratio will also start coming down as we move forward into the future quarters.\n\ne03d07ba470bf487a1d7e429774c0755 --> Our focus is to see the overall cost-to-income ratio for the financial year '24-25 at between 47% to 51%.\n\n7567072be941acca2bbf72f9d3ad1b7b --> For the year 2024-25, the cost-to-income ratio has to be somewhere between 47% and 51%.", "citations": ["c824a46ab1425d60e4ecde0ceb27201d", "e03d07ba470bf487a1d7e429774c0755", "7567072be941acca2bbf72f9d3ad1b7b"]}}}]}, {"theme": "Growth Strategy and Market Positioning", "topics": [{"topic": "Competitive positioning", "data": {}}, {"topic": "Regional market focus", "data": {"['Q1', '2024']": {"answer": "e595a316942f4d8474860d611c36d29b --> We plan to expand into two new markets by the end of next year.\n\n595cfeea431139b04a2ad0c5f1b863d8 --> We expect to open 20 new branches across the country over the next 18 months.", "citations": ["e595a316942f4d8474860d611c36d29b", "595cfeea431139b04a2ad0c5f1b863d8"]}, "['Q4', '2024']": {"answer": "4e18492fcd66926b2a91d90c6a6a95e4 --> We are planning to open 20 new branches by the end of the calendar year.\n\ne9cb14672e04be72dfc78725c55ca59f --> We are planning to open about 50 to 75 branches during the current financial year.", "citations": ["4e18492fcd66926b2a91d90c6a6a95e4", "e9cb14672e04be72dfc78725c55ca59f"]}}}, {"topic": "Long-term growth strategies", "data": {"['Q3', '2023']": {"answer": "1d9f746b9fceda7cf329ac9b679ddf8e --> In the earlier concalls we said on growth parameter, we will try to push the growth pedal and achieve 15% to 18% credit growth for the financial year '23.\n\ne9aca98ab99edc54a408e30e8b0d1233 --> But overall, things should be coming to the pre-COVID level in financial year '23-'24 and things should moderate below pre-COVID level by '24-'25.\n\n6de59666490941ebe0eefbe1197ffa48 --> vision coverage ratio improved to 67 percentage and maybe we are looking to take it to the plus as quick as possible over the next couple of quarters or so.\n\n6603b9048fb4b6e9c29800e2dc78d2f6 --> Prakhar Agarwal [In FY '24 as well we will probably move step towards our earlier pre-COVID run rate of around 2%.]\n\n8674e8b51a1481ec899f910b8142cb30 --> So honestly speaking, looks like the pattern is that we should be having the similar growth or even slightly more during the next financial year is what we are expecting.", "citations": ["1d9f746b9fceda7cf329ac9b679ddf8e", "e9aca98ab99edc54a408e30e8b0d1233", "6de59666490941ebe0eefbe1197ffa48", "6603b9048fb4b6e9c29800e2dc78d2f6", "8674e8b51a1481ec899f910b8142cb30"]}, "['Q2', '2025']": {"answer": "e745e23721a97c11f65e86f3a9f98441 --> And we are taking all our steps to ensure that we touch the industrial growth rate and probably, a small growth over and above that before the year-end is what we are trying to expect.\n\n989ab23ce91e34aaba517ea0dce18ee6 --> So by the beginning of the fourth quarter, we should be having the executive team for that policies. And also the grass root level people, everything will be ready by the, beginning of the fourth quarter.\n\n989ab23ce91e34aaba517ea0dce18ee6 --> some amount of minor initial progress will be seen in the fourth quarter, but actual line-up of growth you will be seeing in the next year.\n\n54f551d7f8773742d1a6c35cc5e54d95 --> We restarted in January 2024 and reached a double-digit growth for June 2024.\n\n67796f119a2e80bfdb52dfc3e470fd6d --> N. Kamakodi [Yes, it would be about 2 to 3 % in the financial year 25, '26. So we gave you that we should be having about 7, 8 % in the next 3-, 4-year time frame. It could be around 2% -- 2-odd % for these sort of other initiatives to support us.]", "citations": ["e745e23721a97c11f65e86f3a9f98441", "989ab23ce91e34aaba517ea0dce18ee6", "54f551d7f8773742d1a6c35cc5e54d95", "67796f119a2e80bfdb52dfc3e470fd6d"]}, "['Q3', '2024']": {"answer": "a2b075ea1d9c4c6294f1bc8b61136d2e --> Guidance for FY'24 has been maintained at 12% to 14%.\n\nbb2cdc7ca88ad9c0f71a47ebf6edf313 --> We are aiming at 12 to 15 percentage growth for financial year '24 and the growth skewed towards year-end.\n\n392ee0e26ddb757affdc6f4087e2dcc6 --> By the financial year-end financial year 2024, we are planning to open our 800 branch.\n\n10b45af7fa05a57654cf18d8b854213d --> No, I don't think we will be able to cross double digit. Hopefully, we should be getting closer to the double digit.\n\nd786cc7a90b66a952d81624138b55a58 --> The company clarified that we are sticking back to the original guidance. So if in December, it was being said that 12% to 14% is the original to which we are sticking…\n\nadf4f5dc474eba37fbe304871bf62fe3 --> We expected 12 to 14 percentage, and then we had to moderate it to, let's say, double digit.\n\n9d86cc70a7254c4fd89e669cd905e469 --> We will have the deposit growth matching the credit growth.\n\n6535e68c207fad6027cce730149d7480 --> It will go up to June.", "citations": ["a2b075ea1d9c4c6294f1bc8b61136d2e", "bb2cdc7ca88ad9c0f71a47ebf6edf313", "392ee0e26ddb757affdc6f4087e2dcc6", "10b45af7fa05a57654cf18d8b854213d", "d786cc7a90b66a952d81624138b55a58", "adf4f5dc474eba37fbe304871bf62fe3", "9d86cc70a7254c4fd89e669cd905e469", "6535e68c207fad6027cce730149d7480"]}, "['Q4', '2023']": {"answer": "6244a27743988cd10205ea4f96d8ecc7 --> Succession planning will start in about one to one and half years time.\n\n162b1ba4fbef2772cec5f36db08656ba --> We are aiming for 12% to 15% growth for the current year which should be skewed towards year end.\n\n1fe7491780b45ea5d2c423310b683a0a --> This year also we expect 12% - 15% growth in annual profit in tune with business growth and improved recovery.\n\n694366460668663b193cb9d7d9daa8e7 --> Rohan Mandora Guided no growth in profitability for 1H vis-à-vis the last year 1H\n\n64ffa8fc34f024b1da246609111d6e7d --> We are starting that process and it will take one or two quarters to settle.\n\n65e2372f3a9f208c6c3a28cf23f300c5 --> We are projecting a 12% to 14% growth, discounting Q1 as usual you may not be having big growth.\n\n4a52906414c025bd17cbed2ff49d9de4 --> All these things should be getting completed in the next couple of quarters.\n\n898ddf50cf834f43d33778d1f39f20b4 --> At this point of time, our expectations are also almost closer to this.", "citations": ["6244a27743988cd10205ea4f96d8ecc7", "162b1ba4fbef2772cec5f36db08656ba", "1fe7491780b45ea5d2c423310b683a0a", "694366460668663b193cb9d7d9daa8e7", "64ffa8fc34f024b1da246609111d6e7d", "65e2372f3a9f208c6c3a28cf23f300c5", "4a52906414c025bd17cbed2ff49d9de4", "898ddf50cf834f43d33778d1f39f20b4"]}, "['Q1', '2024']": {"answer": "7da30616d908d38d0d45b45c0eb80591 --> We are working hard to achieve the FY '24 double-digit advance growth between 12 to 14 %, PAT growth, and etcetera.\n\n5bddcc6d63d775c3df93afaf4893eaa6 --> Board had its meeting held today, formed a subcommittee for a smooth succession planning. As you all know, my current tenure will get completed on 30th April 2026. The committee is assigned with the task of finding a successor and ensure a smooth transfer of responsibility when the tenure ends in 2026, considering the fact that there has to be an overlapping period between the successor and myself, which will be a slow and steady process happening over a period of time.\n\n31bb87de75ff8981c0a93828e27c6000 --> As announced earlier, we are aiming for double-digit or at least 12 to 15 % whatever we had announced earlier, which would be skewed towards the year-end.\n\n3bfff87b19fa939023e0b92e90bd8384 --> We have not gone into the retail lending and also on the services lending or NBFC lending in the past. Now I think we have to get into those segments and also to take it to the double-digit growth rate for the current year, for which we have started making our initiatives.\n\n3bfff87b19fa939023e0b92e90bd8384 --> So for which we need typically the acceleration of about INR1,000 Crs to INR1,200 Crs every month to have my average growth rate going forward.\n\ne595a316942f4d8474860d611c36d29b --> We expect to increase our revenue by 10% in the next fiscal year.\n\n83722d659096d6aa31fee19753e78f15 --> Our expectations for the current year is, our current level with maybe plus or minus 10 basis points, we should be able to move forward.\n\n72a120b45641b1a6c337cd484459d969 --> Our planning is that you will need not less than 6 months to 1 year to identify a successor. And he needs to be with us for not less than 1 year for a smoother transition.\n\n99ffaa01af2b4f42aea644acb38d9ecc --> Our existing business mix of MSME, trading, agriculture and gold loan put together, they will be taking us closer to the double-digit growth.\n\n99ffaa01af2b4f42aea644acb38d9ecc --> This should be our core growth comprising of our MSME, commercial trading, gold loan and things like that should get us close to the double digit. And the balance, 4, 5 %, should be coming from the areas of whatever I explained now.\n\ne87360389858e89f3f8017ce0743decc --> This year, our expectation is that we should be getting back to that 2.5 to 3 %...\n\n5fc1bfbaeb2f0d100b3abc4bfec6fbe2 --> It will start from the third quarter.", "citations": ["7da30616d908d38d0d45b45c0eb80591", "5bddcc6d63d775c3df93afaf4893eaa6", "31bb87de75ff8981c0a93828e27c6000", "3bfff87b19fa939023e0b92e90bd8384", "e595a316942f4d8474860d611c36d29b", "83722d659096d6aa31fee19753e78f15", "72a120b45641b1a6c337cd484459d969", "99ffaa01af2b4f42aea644acb38d9ecc", "e87360389858e89f3f8017ce0743decc", "5fc1bfbaeb2f0d100b3abc4bfec6fbe2"]}, "['Q2', '2024']": {"answer": "a6b63e69d4b47f9493d7755091639cde --> For the FY2023-FY2024 we are aiming for 12% to 15% growth which should be skewed towards the yearend.\n\n7f0a1ded0b97e051238bcb7c95e76db8 --> One by one they will be giving so overall everything should be set up and running fully when we probably meet during the Q3 concall. Maybe one or two on the soft launch and everything should be on full launch when we speak during the Q3 results is the expectation.\n\n7f0a1ded0b97e051238bcb7c95e76db8 --> When we meet for the Q3 results somewhere in the end of January at least 50% to 60% of the products should be into full production throttle and the remaining one third maybe in the soft launch or they should have also started giving results.", "citations": ["a6b63e69d4b47f9493d7755091639cde", "7f0a1ded0b97e051238bcb7c95e76db8"]}, "['Q1', '2025']": {"answer": "70a0078bc0b165c13d0d821c5513ad04 --> So, it will be reaching breakeven only next year and probably adding to the profit kitty by next, like say, beyond that.\n\n732bf102dfe17d39ae583b784a6c2cce --> Next year there will be breakeven and after that only we will be having profit getting added because of these initiatives.\n\n80ad4ad6d760ad335fa8574b93da6008 --> It will give us some experience to look into this maybe over the period of next 5 years to come.\n\n145b8d1fbc67c99bd83253aa1e42df7d --> Yes, that is what. Already we have reached that and we are working to ensure the growth rate further accelerates from where we are.\n\n6f59d8c5349cc9eee5dd61c96c8663b9 --> Expansion of that portfolio is what Vijay Anandh explained which will start to show some light at the end of the tunnel after we start in the September month Q3 and Q4, some amount of growth you will be seeing over there.\n\n49042cf612385e4423aa000c6331c528 --> We are looking for a pilot launch by September.", "citations": ["70a0078bc0b165c13d0d821c5513ad04", "732bf102dfe17d39ae583b784a6c2cce", "80ad4ad6d760ad335fa8574b93da6008", "145b8d1fbc67c99bd83253aa1e42df7d", "6f59d8c5349cc9eee5dd61c96c8663b9", "49042cf612385e4423aa000c6331c528"]}, "['Q4', '2024']": {"answer": "fc28e622a8845adfce1d3b86b9de345d --> We wanted to put everything and wanted to achieve the figure of 12 to 15 % in the financial year, '24, '25 itself.\n\n7aa023b97ef0a6b1aac242b4e33aec98 --> We should be seeing the growth phase fixing in the financial year '24, '25 as we move forward.\n\nf67a8ed1e8b396cee032c7095ff71fec --> R. Vijay Anandh [We will start our booking from Q2.]\n\nf67a8ed1e8b396cee032c7095ff71fec --> R. Vijay Anandh [We are looking at end of Q2 for launching.]\n\nf67a8ed1e8b396cee032c7095ff71fec --> R. Vijay Anandh [Yes, we should start booking from September.]", "citations": ["fc28e622a8845adfce1d3b86b9de345d", "7aa023b97ef0a6b1aac242b4e33aec98", "f67a8ed1e8b396cee032c7095ff71fec"]}}}, {"topic": "Market share trends", "data": {}}]}, {"theme": "Asset Quality and Recovery", "topics": [{"topic": "NPA recovery focus", "data": {"['Q3', '2023']": {"answer": "d08443e1e7557716ed4c7d7ce973a6c5 --> [Inferred as CFO] So the net effect on the NPA to be marked by the bank comes to INR 186 crores as said above and out of INR 186 crores, account worth of INR 47 crores got upgraded as standard during Q3 FY '23.\n\nd08443e1e7557716ed4c7d7ce973a6c5 --> [Inferred as CFO] For borrowers less than INR 1 crores 218 accounts, 1 account was marked NPA during H1 financial year '23 and 55 accounts were closed till date amounting to about INR 9 crores.\n\n56a3b95a865e66d71dbbb13ee49e3083 --> N. Kamakodi [PCR target to reach 50% without technical write-off by 2024, and possibly even before.]\n\n747f0bdaf1732cbb4bede0d581bf9e47 --> So you expect this account to be completely nil by June next year, if I'm not wrong? So by then, all the INR 75 crores reversal will happen and thus the impact on P&L will be relatively lesser by that quarter.", "citations": ["d08443e1e7557716ed4c7d7ce973a6c5", "56a3b95a865e66d71dbbb13ee49e3083", "747f0bdaf1732cbb4bede0d581bf9e47"]}, "['Q2', '2025']": {"answer": "4b18f3a8f4f78f7b4f2945bab4012138 --> We will reach between 1-1.25 % in net NPA by year-end is our current visibility.", "citations": ["4b18f3a8f4f78f7b4f2945bab4012138"]}, "['Q4', '2023']": {"answer": "87bf37750ff0f99b8f4f77d0929dd880 --> improvement like whatever we have seen between FY2022 and FY2023 and that is giving me enough confidence to say that both in terms of PAT growth and ROA we should be in a position to handle it for the whole year but we will be having issues in the first half because we had Rs.500 Crores profit after tax last year which was supported by treasure profit and also lumpy recovery from the NCLT cases which are not available in the first half of this year. So in first half growth in the PAT may not be good but the year as a whole we are able to have visibility to see growth both in terms of PAT and also having a lower NPA and ROA crossing our historical average.", "citations": ["87bf37750ff0f99b8f4f77d0929dd880"]}, "['Q1', '2024']": {"answer": "a2196d64c58540885da4c7836996a3a8 --> We should be closing FY '24 with a decent PAT growth, substantial reduction in net NPA, improved coverage ratio and ROA close to our long-term average of 1.5.\n\n50539d5ee43f1f19eed3b4ee4a9dd943 --> N. Kamakodi [Inferred as CEO] expects net NPA to come below 2%, closer to the pre-COVID level of 1.75% to 1.80% for the year as a whole.\n\nf6570b590d507c8d5f833b5e63957c2b --> We have not given any credit for INR 98 Crs in the first quarter, which we will be having it in the second quarter.\n\n595cfeea431139b04a2ad0c5f1b863d8 --> Our target is to reduce non-performing assets to below 2% by the end of this year.\n\n5d5551f9c6e2b90b9c36924474943b8d --> Our expectation is that out of this INR 1,400 Crs 40, 50 % should be recoverable.", "citations": ["a2196d64c58540885da4c7836996a3a8", "50539d5ee43f1f19eed3b4ee4a9dd943", "f6570b590d507c8d5f833b5e63957c2b", "595cfeea431139b04a2ad0c5f1b863d8", "5d5551f9c6e2b90b9c36924474943b8d"]}, "['Q2', '2024']": {"answer": "a6b63e69d4b47f9493d7755091639cde --> We hope to close the FY2024 with ROA of 1.5% for which NPA recovery will be a major contributing factor.\n\ndb950844e78484e7f386e1770e5cdac6 --> We expect we should be getting back to between 1% and 1.5% net NPA as we move forward.\n\neeb0dfd488be47fe0cb554e81b938957 --> We will reduce our net NPA to get it closer to the pre COVID level and you can do your math accordingly.\n\n53cd4fedb796275974babf9b00323207 --> Our internal target is to get our net NPA to pre COVID level first and then to achieve our comfort zone between 1% to 1.5% over the next few quarters.\n\n14ea94076789f79d7e6424e71baed055 --> this scenario will continue for another couple of years when you will have the amount of NPA available for recovery.", "citations": ["a6b63e69d4b47f9493d7755091639cde", "db950844e78484e7f386e1770e5cdac6", "eeb0dfd488be47fe0cb554e81b938957", "53cd4fedb796275974babf9b00323207", "14ea94076789f79d7e6424e71baed055"]}, "['Q4', '2024']": {"answer": "fc28e622a8845adfce1d3b86b9de345d --> Going by this trend, our current expectations on our closing year net NPA -- towards the end of the current year, we should be having between maybe around 1 to 1.25 % plus or minus.", "citations": ["fc28e622a8845adfce1d3b86b9de345d"]}}}, {"topic": "Slippage ratio reduction", "data": {"['Q3', '2023']": {"answer": "b8d9263d4c70c044bdf1414a8c7dcf5c --> The expected overall slippages we expected that to be in the range of around 2.5% for the current year.\n\nd08443e1e7557716ed4c7d7ce973a6c5 --> [Inferred as CFO] Hence out of INR 439 crores slippage for Q3 financial year '23, INR 140 crores is basically because of the divergence.\n\ne9aca98ab99edc54a408e30e8b0d1233 --> So we expect the overall slippage for the current year should be between maybe 2.5% to 2.8%.\n\ne9aca98ab99edc54a408e30e8b0d1233 --> It should be coming to the 2% to 2.5% going forward.\n\n05ea99506174306d016498e4d37f9de3 --> We expect the overall slippages for the current year, for financial year '23 will be in the level of 2.5% to 2.8%.\n\n05ea99506174306d016498e4d37f9de3 --> So for next year, it should be below 2.5 percentage and probably moving towards the pre-COVID level in stages.\n\naddd898aad49373324b12534e2038487 --> And we have clearly told that we should be having around 2.5% for the current year. Apart from that divergence mark, the overall numbers are coming to our expectations.\n\naddd898aad49373324b12534e2038487 --> So as we have given in the past, going forward then it has to get reduced to 2% to 2.5% and then below 2%. As per our expectation, we should be getting closer to the pre-COVID level then below 2%. As per our expectation, we should be getting closer to the pre slippages towards the second half of the slippages towards the second half of the next year, after which it should stabilize.", "citations": ["b8d9263d4c70c044bdf1414a8c7dcf5c", "d08443e1e7557716ed4c7d7ce973a6c5", "e9aca98ab99edc54a408e30e8b0d1233", "05ea99506174306d016498e4d37f9de3", "addd898aad49373324b12534e2038487"]}, "['Q2', '2025']": {"answer": "c675a8a50bfec1962d73bb6205a92173 --> We conveyed that expected slippage in the financial year '25 would be about INR800 crores during Q4 financial year '24 con call. We are on track.", "citations": ["c675a8a50bfec1962d73bb6205a92173"]}, "['Q3', '2024']": {"answer": "9d2cde0f30f02abddf229713b001b260 --> Our recoveries more than the slippages, we expect the same to continue for remaining quarters, and our slippages will be back to the pre-COVID level.\n\n084cc3b0b6c45c281b31515c80dd3e66 --> N. Kamakodi [Yes. As of now, as we told in the earlier con-calls, we get a benefit of about not less than about INR200 crores compared to the previous year in credit cost because of the lower slippages, vis-à-vis the recovery.]", "citations": ["9d2cde0f30f02abddf229713b001b260", "084cc3b0b6c45c281b31515c80dd3e66"]}, "['Q4', '2023']": {"answer": "fb856268ed6e4ac41d99973c8115b810 --> going forward for the current year we will be seeing both reduction in the slippage. More than that, there will be increase in the recovery.", "citations": ["fb856268ed6e4ac41d99973c8115b810"]}, "['Q1', '2024']": {"answer": "7da30616d908d38d0d45b45c0eb80591 --> We are saving hard to achieve, a 4-digit profit figure for the current year, for which the important drivers will be reduce the slippage going forward and the improved recovery as we have shown between FY '22 and '23.\n\n519a09120ceb3865527e7654e25f8d49 --> The spike in the slippage and the NPA will be one-off this quarter, and will get back to the normal levels, as I said above, based on the collections of about INR 98 Crs will be included in the second quarter that has happened between quarter ended date and the audit date.\n\n50539d5ee43f1f19eed3b4ee4a9dd943 --> N. Kamakodi [Inferred as CEO] expects the incremental slippage to come below INR 1,000, maybe between INR 850 to INR 1,000 this year.\n\nc0d58c426727e0bcbd6aec6d3c89c986 --> We hope this year, our total slippages for the whole year should be less than INR1,000 Crs.\n\n5fc1bfbaeb2f0d100b3abc4bfec6fbe2 --> Bulk of our expectation is about INR250 Crs to INR300 Crs reduction in the slippage.", "citations": ["7da30616d908d38d0d45b45c0eb80591", "519a09120ceb3865527e7654e25f8d49", "50539d5ee43f1f19eed3b4ee4a9dd943", "c0d58c426727e0bcbd6aec6d3c89c986", "5fc1bfbaeb2f0d100b3abc4bfec6fbe2"]}, "['Q1', '2025']": {"answer": "167a12f335dcc3e65786a5a31af6d675 --> This year we expect about maybe about Rs. 800 crores or something like that, maybe even slightly below that is what our calculations currently demonstrate.", "citations": ["167a12f335dcc3e65786a5a31af6d675"]}, "['Q4', '2024']": {"answer": "4e18492fcd66926b2a91d90c6a6a95e4 --> We aim to reduce our NPA ratio by 50 basis points in the next six months.\n\nc824a46ab1425d60e4ecde0ceb27201d --> On asset quality front, we'll be continuing with the trend of reduced slippages coupled with the improved recovery for the current financial year also.\n\nfc28e622a8845adfce1d3b86b9de345d --> We expect the similar reduction in the slippage maybe about INR700 crores to INR800 crores slippage we could be having for the current financial year.", "citations": ["4e18492fcd66926b2a91d90c6a6a95e4", "c824a46ab1425d60e4ecde0ceb27201d", "fc28e622a8845adfce1d3b86b9de345d"]}}}, {"topic": "Improved recovery strategies", "data": {"['Q4', '2023']": {"answer": "1fe7491780b45ea5d2c423310b683a0a --> Though there will be challenges in H1 FY 24 for PAT growth, it will be compensated in second half because of both business growth and improved NPA recovery.", "citations": ["1fe7491780b45ea5d2c423310b683a0a"]}, "['Q1', '2024']": {"answer": "5bddcc6d63d775c3df93afaf4893eaa6 --> So for the second quarter, there will be, some amount of dip in the profit, but it will be compensated in the H2 because of expected lower slippage and the improved recovery for the year as a whole.", "citations": ["5bddcc6d63d775c3df93afaf4893eaa6"]}, "['Q1', '2025']": {"answer": "167a12f335dcc3e65786a5a31af6d675 --> The recovery numbers are almost Rs. 1,000 crore plus, the stable numbers which we have started seeing, about Rs. 200 crores to Rs. 250 crore.", "citations": ["167a12f335dcc3e65786a5a31af6d675"]}}}, {"topic": "Asset quality monitoring", "data": {}}]}, {"theme": "Interest Income and Yield Management", "topics": [{"topic": "Net interest margin stability", "data": {"['Q3', '2023']": {"answer": "e9aca98ab99edc54a408e30e8b0d1233 --> Net interest margin currently is staying around 4%, we said it will stay around 3.85% to 4%.", "citations": ["e9aca98ab99edc54a408e30e8b0d1233"]}, "['Q3', '2024']": {"answer": "e105ea43dec86ac189e7b8ef2be5a75c --> Kunaal mentioned that NIMs would have been 3.7% for Q3 FY '24 if excluding a one-off item.", "citations": ["e105ea43dec86ac189e7b8ef2be5a75c"]}, "['Q4', '2023']": {"answer": "694366460668663b193cb9d7d9daa8e7 --> Rohan Mandora Guiding for a NIM of around 3.65% plus or minus 10 basis points for FY2024\n\n2fcb30b9a9746fe2cd1f151d149deb69 --> So considering both whatever we have passed on and also the expected increase in the cost of deposits we conveyed the expected net interest margin.", "citations": ["694366460668663b193cb9d7d9daa8e7", "2fcb30b9a9746fe2cd1f151d149deb69"]}, "['Q1', '2024']": {"answer": "c71b98e18c72c2c1a06d989dc9652a34 --> Current level, plus or minus 10 basis points.", "citations": ["c71b98e18c72c2c1a06d989dc9652a34"]}, "['Q2', '2024']": {"answer": "a6b63e69d4b47f9493d7755091639cde --> We expect the NIM pressure and expect NIM at current level plus or minus 10 basis points.\n\nd7858391fbef4b196f5fe7689017c652 --> Our overall average NIMs should be plus or minus 10 bps with the existing NIM. The same numbers we are able to see in the Q2.", "citations": ["a6b63e69d4b47f9493d7755091639cde", "d7858391fbef4b196f5fe7689017c652"]}, "['Q4', '2024']": {"answer": "4e18492fcd66926b2a91d90c6a6a95e4 --> Our target for the net interest margin is to maintain it above 3.5% for the next quarter.", "citations": ["4e18492fcd66926b2a91d90c6a6a95e4"]}}}, {"topic": "Lending yield adjustments", "data": {}}, {"topic": "Rate pass-through effects", "data": {"['Q3', '2023']": {"answer": "6603b9048fb4b6e9c29800e2dc78d2f6 --> N. Kamakodi [We are planning to go for another 25 basis point hike after the current RBI hike.]\n\n6603b9048fb4b6e9c29800e2dc78d2f6 --> N. Kamakodi [Overall transmission could be around 50% to 60% of the increased rates.]\n\ndb16aa71149e05330e9c2bd2ea5224cd --> 70%, 75% of your term deposits will be repricing within one year.", "citations": ["6603b9048fb4b6e9c29800e2dc78d2f6", "db16aa71149e05330e9c2bd2ea5224cd"]}, "['Q4', '2023']": {"answer": "dee060f00df2dd2718bd3aae4f4f96ea --> Basically what happens is that government gives about 1.5% to the bank and 3% to the borrower if they repay within one and a half years.\n\n2fcb30b9a9746fe2cd1f151d149deb69 --> Another point what you also need to see about not less than 15 to 20 basis points impact because of the lowered CD ratio.", "citations": ["dee060f00df2dd2718bd3aae4f4f96ea", "2fcb30b9a9746fe2cd1f151d149deb69"]}, "['Q2', '2024']": {"answer": "14ea94076789f79d7e6424e71baed055 --> Actually we do not expect any more hikes going forward. Even with 25% probability if something is left out maybe at the best 25 basis point. 75% probability we do not expect any rate hikes going forward.", "citations": ["14ea94076789f79d7e6424e71baed055"]}}}, {"topic": "Yield on advances trends", "data": {"['Q3', '2023']": {"answer": "56a3b95a865e66d71dbbb13ee49e3083 --> N. Kamakodi [Interest income will be normalized in Q4 with an additional INR 32 crores of interest recognized.]", "citations": ["56a3b95a865e66d71dbbb13ee49e3083"]}, "['Q2', '2025']": {"answer": "12a55dedd68be64b9f1ab20f06f3a122 --> N. Kamakodi [We may be in a position to see maybe half of portfolio or even 50, 60 % of the portfolio getting converted from the floating rate to the fixed rate, which will give stability to the yield when the decreasing interest rate cycle actually starts.]", "citations": ["12a55dedd68be64b9f1ab20f06f3a122"]}, "['Q3', '2024']": {"answer": "e27224fa5d90c0432b56e7a15c67c2e0 --> If the yield decrease in the next year, you can book a profit in the HTM up to 5%, if it crosses 5 % you have to disclose the mark-to-market. But under the new rule, you cannot make any sell beyond the 5%.\n\nd129192508b67de38910940666b6a390 --> N. Kamakodi [But as of now, it appears that all the factors are favourable for going towards that 1% plus every month, which total to 13% to 14% pa.]", "citations": ["e27224fa5d90c0432b56e7a15c67c2e0", "d129192508b67de38910940666b6a390"]}, "['Q4', '2023']": {"answer": "2fcb30b9a9746fe2cd1f151d149deb69 --> Some passing of rates has happened in this quarter for the advances so there will be some increase in the yield on advances in the current quarter.\n\n43983d3bc805489bf2eef5f6a6717f71 --> The margin decline is going to be for everybody. We are also going to have that so there is still some amount of repricing in the deposit side left. You already have a benchmark during the Q4 of about 3.65 so we have to consider the potential repricing effect. We have to consider a potential increase that could happen in the yield on advances. So there could be some changes in the CD ratio also positively. Taking all these things into consideration only we said this can be taken plus or minus 10 basis points going forward.", "citations": ["2fcb30b9a9746fe2cd1f151d149deb69", "43983d3bc805489bf2eef5f6a6717f71"]}}}]}, {"theme": "Operational Efficiency and Cost Management", "topics": [{"topic": "Cost-to-income ratio trends", "data": {"['Q2', '2025']": {"answer": "a638b57c489c6e5fb1fdbe6d3b17603e --> Since we are taking the cost upfront, our cost-to-income ratio will be slightly higher in the current year.", "citations": ["a638b57c489c6e5fb1fdbe6d3b17603e"]}, "['Q3', '2024']": {"answer": "a7f0a5dcd2ce9c88e972f2345f36fdbe --> Yes, maximum.", "citations": ["a7f0a5dcd2ce9c88e972f2345f36fdbe"]}, "['Q4', '2023']": {"answer": "1d1264f579bdb39c38f952cc481d0215 --> You are also moving to CTC based salary structure for the employees in FY2024.\n\ncc013cf740f9a86065a678794d200adf --> The cost is not significant. It will be less than 3% to 4% of the annual profit what the bank is making and it will be having any significant impact on the overall P&L.", "citations": ["1d1264f579bdb39c38f952cc481d0215", "cc013cf740f9a86065a678794d200adf"]}, "['Q1', '2024']": {"answer": "ca874d382c1aa27467241b14cb2ca528 --> So overall, our expectation is that definitely in tune with the overall headcount. There will be some amount of increase. So around 10 % average incremental, maybe 10 to 12 % incremental salary will definitely happen.\n\ne595a316942f4d8474860d611c36d29b --> We are aiming for a 15% reduction in costs over the next two years.", "citations": ["ca874d382c1aa27467241b14cb2ca528", "e595a316942f4d8474860d611c36d29b"]}, "['Q1', '2025']": {"answer": "732bf102dfe17d39ae583b784a6c2cce --> Our cost-to-income ratio will be in the same range of 48% to 51% for the next 4 to 6 quarters.", "citations": ["732bf102dfe17d39ae583b784a6c2cce"]}}}, {"topic": "Process automation initiatives", "data": {"['Q3', '2024']": {"answer": "d9e2ecfa811ee8061b1ae9ff8f703955 --> N. Kamakodi [Inferred as CEO][The decision -- if all the data input and the supporting documents given by the customers and uploaded, we will be able to give on the same day.]", "citations": ["d9e2ecfa811ee8061b1ae9ff8f703955"]}}}, {"topic": "Efficiency improvement plans", "data": {}}, {"topic": "Productivity gains forecast", "data": {}}]}, {"theme": "Customer Engagement and Experience", "topics": [{"topic": "Customer satisfaction initiatives"}, {"topic": "Loyalty programs"}, {"topic": "Branch network optimization"}, {"topic": "Digital service enhancements"}]}, {"theme": "Strategic Initiatives and Partnerships", "topics": [{"topic": "Digital transformation efforts", "data": {}}, {"topic": "New product offerings", "data": {"['Q1', '2024']": {"answer": "e595a316942f4d8474860d611c36d29b --> Our goal is to launch three new products by Q3.", "citations": ["e595a316942f4d8474860d611c36d29b"]}, "['Q1', '2025']": {"answer": "80ad4ad6d760ad335fa8574b93da6008 --> It could be a potential product maybe three years down the line or 4 years down the line.", "citations": ["80ad4ad6d760ad335fa8574b93da6008"]}, "['Q4', '2024']": {"answer": "78c2c4403ab013271b9dc6b4f076721d --> N. Kamakodi [Mr. Vijay Anandh, the approval has gone to RBI. He will join the Board immediately after getting the RBI approval.]", "citations": ["78c2c4403ab013271b9dc6b4f076721d"]}}}, {"topic": "Strategic partnerships", "data": {}}, {"topic": "Technology investment plans", "data": {}}]}]