[{"theme": "Revenue Growth and Financial Strategy", "topics": [{"topic": "Loan portfolio expansion", "data": {"['Q2', '2025']": {"answer": "530df3d5e4d5b83f2f3122856bb2afbe --> Puneet Sharma [The rural advances grew 20% YOY and deposits from Bharat Branches were up 9%; thereby aiding the PSL and profitability metrics.]\n\n6e42e669810ca5b93fc241aa17cd0316 --> In the medium term to long term we believe our advances can grow 300 – 400 bps faster than industry.\n\nc090c16fe7e74f3ebbef6b9d25b4e27d --> Arjun Chowdhry [We are expecting to see a pickup in the loan growth in this quarter and the next, but we will continue to calibrate the composition of the loan growth, particularly on the retail side in order to optimize the best return while keeping in mind what we will get as placement yields and also what we expect to see as credit losses.]\n\na17895ddad7a5aa344d9fd20263834e2 --> Puneet Sharma [Management guidance is 300 to 400 basis points in medium to long-term loan growth.]", "citations": ["530df3d5e4d5b83f2f3122856bb2afbe", "6e42e669810ca5b93fc241aa17cd0316", "c090c16fe7e74f3ebbef6b9d25b4e27d", "a17895ddad7a5aa344d9fd20263834e2"]}, "['Q3', '2024']": {"answer": "e860941d71aa8faa0746a1be815c69a5 --> We foresee the system credit growth to converge towards deposit growth of around ~13%.\n\nec3ef063333d809cdcf7c3a71d59645c --> Amitabh expects the advances growth at an industry level to be at the 12% to 13% range.\n\ndecc40c4d12c902533e0b1693481be2f --> the system wide deposits and credit growth are likely to converge at around 13%.\n\n6103d920894dba12c08ad6465dd3ec1c --> We are not moving away from our medium-term guidance of 400 to 600 basis points faster than industry credit.", "citations": ["e860941d71aa8faa0746a1be815c69a5", "ec3ef063333d809cdcf7c3a71d59645c", "decc40c4d12c902533e0b1693481be2f", "6103d920894dba12c08ad6465dd3ec1c"]}, "['Q1', '2025']": {"answer": "b2c0659699c05a54772394fd81ad6c77 --> We expect the deposit growth to remain a factor influencing growth in advances in the near term. We retain our stance of policy rates staying higher for longer and foresee the system credit growth to converge towards deposit growth of around ~13% for the fiscal.\n\na8280c86fc75aaa035105066a0e0022d --> In the medium term to long term we believe our advances can grow 300 – 400 bps faster than industry.\n\nad0ce12c0d0b4869aa4718ee563bd40d --> Munish Sharda [We earlier also called out that we have a well-calibrated risk-adjusted return on capital model, which we use to look at our businesses comprehensively and see where we need to grow, and where we'll get the right returns. So we -- on a retail asset base, if you look at Page 22, we've grown our retail asset by about 18% YOY. Our preferred segments in some areas like rural loans and SBB, which will make good returns on capital, we have grown at 26% and 24% YOY.]\n\na1d4e3d7b505f50b0c4a878db60f1e15 --> We expect to achieve a 15% growth in our loan book by the end of the fiscal year.\n\nb19fdffd53ac4ddde182d36b6dbd9c79 --> As long as deposits are available at the right price and of the right quality, we believe that the franchise has enough distribution muscle to grow 300 to 400 basis points faster than industry on the asset side.\n\n276a510687395f091f3a8e2ec0662ce4 --> What we are clearly articulating is as long as we get the right deposits at the right price, the franchise is strong enough to grow faster than market over the medium to long-term, and we feel confident that we'll be able to do that.", "citations": ["b2c0659699c05a54772394fd81ad6c77", "a8280c86fc75aaa035105066a0e0022d", "ad0ce12c0d0b4869aa4718ee563bd40d", "a1d4e3d7b505f50b0c4a878db60f1e15", "b19fdffd53ac4ddde182d36b6dbd9c79", "276a510687395f091f3a8e2ec0662ce4"]}, "['Q4', '2024']": {"answer": "c361f1322b108571f7460c80d2c97416 --> In the medium term to long terms we believe our advances can grow 300 – 400 bps faster than industry.\n\n0731859df2f64f6a4dbf44a6dd87e68c --> Puneet Sharma [We mentioned that we will grow 300 to 400 basis points faster than the industry over the medium to long term.]\n\n6443aad61aa951dd5e2f96a88694459c --> Our expectation is deposits will grow 13% next year and advances, therefore, being driven by deposit growth should be in the same range for the industry.\n\n6443aad61aa951dd5e2f96a88694459c --> The specific bank level comments we have made on this call is to say, we have the confidence in the franchise to grow 300 to 400 basis points faster than industry in the medium-to-long term.", "citations": ["c361f1322b108571f7460c80d2c97416", "0731859df2f64f6a4dbf44a6dd87e68c", "6443aad61aa951dd5e2f96a88694459c"]}, "['Q4', '2023']": {"answer": "3b772a06ff79daab7edaf42224c9edc0 --> We feel confident that our franchise will grow at 400 to 600 basis points faster than the industry in the medium to long term.\n\n9204332bf1c3cc885d44b7300d00da27 --> we can grow 400 to 600 basis points faster than the industry.\n\n1d7a0ac176bb2bbc34512c3c3c9562a0 --> We have decided to operate as one franchise, and therefore, disbursement yields should be consistent.", "citations": ["3b772a06ff79daab7edaf42224c9edc0", "9204332bf1c3cc885d44b7300d00da27", "1d7a0ac176bb2bbc34512c3c3c9562a0"]}, "['Q1', '2024']": {"answer": "69c5484cbf1ecfbbe76b100be1a8c62b --> Inferred as CEO: Axis 2.0 is now roughly 5% of the Bank’s overall business and we intend to increase contribution by 3-4x by fiscal 2027.\n\nc0cd7f15181a1ee2d24459e6e6013800 --> Puneet Sharma [I think we said we will upfront some of the Rs 2,000 crores in the early four quarters.]\n\n39a8d91ea12515aafae48031412db04a --> We will be growing our home loan book. We've already put in place initiatives to grow that book and that will be visible in Q2, Q3 onwards.", "citations": ["69c5484cbf1ecfbbe76b100be1a8c62b", "c0cd7f15181a1ee2d24459e6e6013800", "39a8d91ea12515aafae48031412db04a"]}, "['Q3', '2023']": {"answer": "60fcb9f60f92216b1f7365ff26076de2 --> Puneet Sharma [We feel confident that the franchise will grow at 500 to 600 basis points faster than industry credit growth on advances.]\n\n60fcb9f60f92216b1f7365ff26076de2 --> Puneet Sharma [We've also said previously that for the current financial year, we expect to grow at or about the industry credit growth.]\n\n0cefaa72c79b220fb6985045e2922178 --> We expect to achieve a loan growth of 15% in the next fiscal year.\n\n33e09465ffa5776d59e951d6adae4bcc --> We expect our loan book to grow by 15% in the next fiscal year.\n\n5c66bae68955c5c64f6cbade51fa753b --> We expect to grow our loan book by 15% in the next fiscal year.", "citations": ["60fcb9f60f92216b1f7365ff26076de2", "0cefaa72c79b220fb6985045e2922178", "33e09465ffa5776d59e951d6adae4bcc", "5c66bae68955c5c64f6cbade51fa753b"]}, "['Q2', '2024']": {"answer": "734855663bd56e58a432c3c8db2b893b --> [Inferred as CEO] open is now roughly 5% of the Bank’s overall business and we intend to increase contribution by 3- 4x by fiscal 2027.\n\ncfbe7f57e378017257e1c99a484a8f1b --> We expect the Banking system credit and deposit growth, both to be around the 13% mark for the current fiscal excluding the HDFC Limited merger impact. We feel confident that Axis will grow at 400 to 600 basis points faster than the next merger industry credit growth over the medium term.\n\n1ccc148ba48d622be98dffeca1279214 --> We aim to achieve a 15% growth in our loan book by the end of the fiscal year.", "citations": ["734855663bd56e58a432c3c8db2b893b", "cfbe7f57e378017257e1c99a484a8f1b", "1ccc148ba48d622be98dffeca1279214"]}}}, {"topic": "Interest income trends", "data": {"['Q2', '2025']": {"answer": "b01bc7117cc598356f0c43330595e7e1 --> My request to you is please -- and that number will reflect a 10% to 12% sequential growth. Please do not look at that number in isolation. We manage the balance sheet with an interest rate view. So please look at overnight placements plus SLR together.", "citations": ["b01bc7117cc598356f0c43330595e7e1"]}, "['Q3', '2024']": {"answer": "cd08e631d9aa2f41be1df41766f6a62e --> We have said that we will maintain the 400 to 600 basis point differential between industry and our growth rate. Do not hold us Quarter-to-Quarter. But yes, in the medium term, we believe that we can maintain it and we are not changing it.\n\ncd08e631d9aa2f41be1df41766f6a62e --> As long as the marginal cost of funding remains at where it has been for the last four to six months, we do expect our base deposit book to get repriced through quarter four of the current financial year and a spillover into quarter one of the next financial year.\n\n33d7727d9320a7065dc508b4ee524c01 --> I think we continue to maintain our guidance that in the medium term, we will continue to be able to maintain that 400 to 600 basis point differential.", "citations": ["cd08e631d9aa2f41be1df41766f6a62e", "33d7727d9320a7065dc508b4ee524c01"]}, "['Q1', '2025']": {"answer": "9a3e050616358ec01ff336535f115d39 --> Puneet Sharma [CFO][The accretion and amortization component that you're speaking of, which is accretion and amortization on discounted securities, which could not have been realized under the previous circular but can now be recognized under the current circular is amounting to roughly about INR 78 crores for us on a first quarter basis.]", "citations": ["9a3e050616358ec01ff336535f115d39"]}, "['Q4', '2024']": {"answer": "995f2b4854c8705e379511d7229d32db --> We retain our stance of policy rates staying higher for longer and foresee the system credit growth to converge towards deposit growth of around ~13% for the fiscal.\n\nc361f1322b108571f7460c80d2c97416 --> Consolidated ROA and ROE for FY24 1.84% and 19.29% respectively, an outcome of disciplined execution.\n\n388915c4ae15557836516ffa69ecd011 --> Puneet Sharma [We have previously stated that if the marginal cost of funds remains where it is today, given the current status of our book, we should finish back book repricing in Q2 of the current financial year.]\n\n0475ce02e994259abd17841a3d5a5988 --> On a full year basis, we had a roughly 95 to 97 basis points increase in cost of funds and we had a 97 basis points increase in yield on interest earning assets on a full year.", "citations": ["995f2b4854c8705e379511d7229d32db", "c361f1322b108571f7460c80d2c97416", "388915c4ae15557836516ffa69ecd011", "0475ce02e994259abd17841a3d5a5988"]}, "['Q4', '2023']": {"answer": "9204332bf1c3cc885d44b7300d00da27 --> Our projection for next year on the credit side for the system is 12% to 13% and our deposit growth is expected to remain in the same zone as well it is today.\n\n04a084c5b06062ca07c5a8c53103e81f --> Puneet Sharma [42% of my fixed rate book matures in the next 12 months. That should give you comfort that if there is an uptick, it will get captured in the market space.]", "citations": ["9204332bf1c3cc885d44b7300d00da27", "04a084c5b06062ca07c5a8c53103e81f"]}, "['Q1', '2024']": {"answer": "5dc64e0d77ca69b6ee20d4b0ad2b01b1 --> Puneet Sharma [42% of our fixed rate loans mature over the next 12 months, indicating the repricing frequency of that book.]", "citations": ["5dc64e0d77ca69b6ee20d4b0ad2b01b1"]}, "['Q3', '2023']": {"answer": "0cefaa72c79b220fb6985045e2922178 --> Our goal is to improve the net interest margin by 20 basis points by the end of this year.\n\n988523f683ee86b887327080d16f1cf6 --> Puneet Sharma [CFO][Also, to give you better clarity, the duration of the book we had previously said was 4 to 5 years. So, assuming that there is no further movement, that would be the timeframe by which the residual MTM should come back into the P&L.]\n\n3c9a92de2152bafbc9be4b7349fe9741 --> We fully appreciate and we ourselves have indicated that we expect deposits to reprice through quarter 4 of the current financial year and further in quarter 1 of the next financial year.", "citations": ["0cefaa72c79b220fb6985045e2922178", "988523f683ee86b887327080d16f1cf6", "3c9a92de2152bafbc9be4b7349fe9741"]}, "['Q2', '2024']": {"answer": "f4eb336af49ba66f98e3435603e6cc54 --> The growth trajectory of retail term deposits continued to improve with 15% year-on-year and 4% quarter-on-quarter growth on a period end basis and 13% year-on-year and 4% quarter-on-quarter on QAB basis.\n\n1ccc148ba48d622be98dffeca1279214 --> We expect our net interest margin to remain stable at around 3.5% for the next year.\n\n8cf647be598616b6f79eeab81fb7234f --> We expect deposit costs to increase further over the remaining part of the financial year but the pace of deposit cost growth will most likely moderate. Hence our NIMs will be driven largely by our ability to pass increased cost of funds through better pricing of assets or improvement in mix and other structural NIM drivers we are working on.\n\nc0f65681b0db62e93a6e38e3ab7c38e8 --> Puneet Sharma [The pace of repricing of the base book, i.e. the change in cost of funds, should slow down as we get into the subsequent quarters in the year, but we do see a few more quarters for base book to get fully repriced in this cycle.]\n\n08f236e3a4024ee29ad0bf36f76b8bc6 --> The 2.1%, we have indicated around 2.1% including Citi is what we would target on FY25 exit. If we have to review that number, we'll come back to you, but as of now, that number stands.", "citations": ["f4eb336af49ba66f98e3435603e6cc54", "1ccc148ba48d622be98dffeca1279214", "8cf647be598616b6f79eeab81fb7234f", "c0f65681b0db62e93a6e38e3ab7c38e8", "08f236e3a4024ee29ad0bf36f76b8bc6"]}}}, {"topic": "Fee-based income growth", "data": {"['Q4', '2024']": {"answer": "2b7025fdb248083eb398f8858cffb1e6 --> We expect to achieve a revenue growth of 10% by the end of the fiscal year.", "citations": ["2b7025fdb248083eb398f8858cffb1e6"]}, "['Q4', '2023']": {"answer": "0a237d09cf2408596da3f114caebd46e --> In FY24 we have a strong pipeline of demand for Neo from our customers. We expect significant uptick in adoption and subsequent monetization of this platform.", "citations": ["0a237d09cf2408596da3f114caebd46e"]}, "['Q3', '2023']": {"answer": "dc1c3f440692b884f23522ace797ab99 --> We expect to achieve a revenue growth of 10% by the end of the fiscal year.\n\n5c66bae68955c5c64f6cbade51fa753b --> Our goal is to achieve a return on equity of 18% within the next three years.", "citations": ["dc1c3f440692b884f23522ace797ab99", "5c66bae68955c5c64f6cbade51fa753b"]}}}, {"topic": "Cost management strategies", "data": {"['Q1', '2025']": {"answer": "52b1b6ce19a1359c88e127bbb20d9f3c --> Our structural guidance is 3.80% on a through-cycle basis. We have now operated at a 25-basis point cushion above through-cycle margin for a couple of quarters. We will make all efforts to ensure we retain as much of the margin as we possibly can.", "citations": ["52b1b6ce19a1359c88e127bbb20d9f3c"]}, "['Q4', '2023']": {"answer": "9253efd588f87a781358a55699802166 --> We have a guidance out there which said we would expect to get to around 2% by FY25.\n\n6462bbb4b68220da7d65d33d9ab6a5fd --> 20-plus synergy initiatives are already in play in the first quarter and the synergy benefits are obviously around 3 things. They are around deposits; they are around revenues and expenses.", "citations": ["9253efd588f87a781358a55699802166", "6462bbb4b68220da7d65d33d9ab6a5fd"]}, "['Q1', '2024']": {"answer": "2e89dbb842b1d9520c13de32ad37a41c --> The Citi business will be RoE accretive post integration.\n\nfda033124348f006ffa0924eb069b943 --> On an average, we are now looking at the branches becoming fully profitable in the ballpark of couple of years.\n\ndccc59cf5469836f82277f7f121a1691 --> What we also set out in the pro forma disclosure was an ROE number, which was 19%-plus. We do believe that, that number is deliverable post full integration and therefore, the business should be ROE accretive for us.", "citations": ["2e89dbb842b1d9520c13de32ad37a41c", "fda033124348f006ffa0924eb069b943", "dccc59cf5469836f82277f7f121a1691"]}, "['Q2', '2024']": {"answer": "1c7c84cda03efe7569d633a74a6fdf54 --> The Citi business will be ROE accretive post integration.\n\nbe114521ce2898ff6fce81c9e5d0fce6 --> Consolidated ROE for H1 FY 24 at 19.04%, improving 179 bps YOY.", "citations": ["1c7c84cda03efe7569d633a74a6fdf54", "be114521ce2898ff6fce81c9e5d0fce6"]}}}]}, {"theme": "Digital Transformation and Innovation", "topics": [{"topic": "Digital banking initiatives", "data": {"['Q4', '2024']": {"answer": "811bf85b9b1b401ec6d0ddc54845c2af --> We are now live with the first change in the migration journey for the transitioning customer base with IFSC (Indian Financial System Code) migration, enabling payments to Citi Bank accounts using Axis Bank IFSC. This has been made live in March’24.\n\nb05198a89b53bf5f067f97a41b64e403 --> In FY 25, the bank intends to take further steps to increase accessibility of its digital channels.", "citations": ["811bf85b9b1b401ec6d0ddc54845c2af", "b05198a89b53bf5f067f97a41b64e403"]}}}, {"topic": "Technology investments", "data": {"['Q3', '2024']": {"answer": "4f8d41f8372450d2dcbc51c86e7c7d91 --> [Speaker Unknown][of close to 19% as of Nov’23 with widespread adoption of our innovative technology-based product offerings.]\n\n52747fc79083b77774bd6d15d5b834ad --> We are building a pioneering “end-to-end omnichannel and digital” delivery model for the RuSu markets using the Salesforce platform. This will help us scale sustainably over the next 3 years.\n\ne860941d71aa8faa0746a1be815c69a5 --> We expect to complete data migration and system integration by the end of H1FY25.", "citations": ["4f8d41f8372450d2dcbc51c86e7c7d91", "52747fc79083b77774bd6d15d5b834ad", "e860941d71aa8faa0746a1be815c69a5"]}, "['Q4', '2024']": {"answer": "b05198a89b53bf5f067f97a41b64e403 --> Neo for Corporates is being scaled up with customer migration currently underway. The migration here will continue to scale up till Q3 while we continue to launch additional capabilities.", "citations": ["b05198a89b53bf5f067f97a41b64e403"]}}}, {"topic": "Cybersecurity measures", "data": {}}, {"topic": "Fintech partnerships", "data": {"['Q1', '2024']": {"answer": "1b412714779d6acb8d9c93d16a040931 --> Our digital co-lending platform is live with 6+ partners and we have more products and partners lined up to go live on the platform during this year.", "citations": ["1b412714779d6acb8d9c93d16a040931"]}, "['Q2', '2024']": {"answer": "0f3d3424fa8bc86df118d2dbd2090287 --> Our digital co-lending platform is live with 8+ partners and we have more products and partners lined up to go live on the platform this year.", "citations": ["0f3d3424fa8bc86df118d2dbd2090287"]}}}]}, {"theme": "Operational Efficiency and Cost Management", "topics": [{"topic": "Process automation efforts", "data": {"['Q4', '2024']": {"answer": "811bf85b9b1b401ec6d0ddc54845c2af --> We have successfully completed the migration of the CV/CE Loans portfolio in March’24 and the customers have now fully migrated from Citi systems on to the Axis systems.", "citations": ["811bf85b9b1b401ec6d0ddc54845c2af"]}, "['Q4', '2023']": {"answer": "48312be25706e2a36c483cc9939a6f3a --> Improvements planned over the next 8-9 quarters should deliver results with some inter quarter fluctuations which are normal for a business of our scale and size.", "citations": ["48312be25706e2a36c483cc9939a6f3a"]}, "['Q3', '2023']": {"answer": "43b939f1f2a9d84633c3a2dfc6530eca --> Our assessment is that improvements planned over the next 8-9 quarters should deliver results with some inter quarter fluctuations which are normal for a business of our scale and size.", "citations": ["43b939f1f2a9d84633c3a2dfc6530eca"]}}}, {"topic": "Branch network optimization", "data": {"['Q4', '2024']": {"answer": "49b17831fb01a7f0a9befbc196d942f2 --> We also scaled up the branch network as we crossed milestone of 5000 branches and opened record 475 branches in FY24.", "citations": ["49b17831fb01a7f0a9befbc196d942f2"]}}}, {"topic": "Cost reduction initiatives", "data": {"['Q1', '2025']": {"answer": "a1d4e3d7b505f50b0c4a878db60f1e15 --> Our target is to reduce operating costs by 10% over the next two years.", "citations": ["a1d4e3d7b505f50b0c4a878db60f1e15"]}, "['Q4', '2024']": {"answer": "2b7025fdb248083eb398f8858cffb1e6 --> We are planning to reduce operational costs by 5% in the coming quarter.", "citations": ["2b7025fdb248083eb398f8858cffb1e6"]}, "['Q4', '2023']": {"answer": "314e21dd3354007debd01460d82c850b --> The business teams have started implementation of 20+ synergy initiatives in Q1FY24 identified across business units as we look to drive revenue and cost benefits.", "citations": ["314e21dd3354007debd01460d82c850b"]}, "['Q1', '2024']": {"answer": "e22496dd83532cf08b8af2fbd48f18de --> Improvements planned over the next 7-8 quarters should deliver results with some inter quarter fluctuations which are normal for a business of our scale and size.\n\n2e89dbb842b1d9520c13de32ad37a41c --> The cost ratios will remain sticky till the Citi integration phase is over.", "citations": ["e22496dd83532cf08b8af2fbd48f18de", "2e89dbb842b1d9520c13de32ad37a41c"]}, "['Q3', '2023']": {"answer": "0cefaa72c79b220fb6985045e2922178 --> We aim to reduce our cost-to-income ratio to below 45% by the end of 2024.\n\n33e09465ffa5776d59e951d6adae4bcc --> We aim to reduce our cost-to-income ratio by 5% over the next two years.\n\ndc1c3f440692b884f23522ace797ab99 --> We aim to reduce operational costs by 5% in the first half of the year.", "citations": ["0cefaa72c79b220fb6985045e2922178", "33e09465ffa5776d59e951d6adae4bcc", "dc1c3f440692b884f23522ace797ab99"]}, "['Q2', '2024']": {"answer": "1c7c84cda03efe7569d633a74a6fdf54 --> The cost ratios will remain sticky till the Citi integration phase is over.", "citations": ["1c7c84cda03efe7569d633a74a6fdf54"]}}}, {"topic": "Workforce productivity programs", "data": {}}]}, {"theme": "Risk Management and Asset Quality", "topics": [{"topic": "Credit risk assessment", "data": {"['Q3', '2024']": {"answer": "3caef2e6f62815ba92f9320058510ebd --> Sumit Bali [We have been around 78%-80% secured, 20%-22% unsecured. That is what we have been saying and holding for some period of time. If it goes to 75%-25% over a period of time, that is also fine with us.]", "citations": ["3caef2e6f62815ba92f9320058510ebd"]}}}, {"topic": "Non-performing assets management", "data": {"['Q1', '2024']": {"answer": "2f049db597d936bc6cf5bf176257a1ed --> Puneet Sharma [CFO][Typically, rural NPAs is the May-November cycle. So you will see a quarter 1, quarter 3 impact of the rural cycle.]", "citations": ["2f049db597d936bc6cf5bf176257a1ed"]}, "['Q2', '2024']": {"answer": "1ccc148ba48d622be98dffeca1279214 --> Our target is to reduce non-performing assets to below 2% within the next two quarters.", "citations": ["1ccc148ba48d622be98dffeca1279214"]}}}, {"topic": "Provisioning strategies", "data": {}}, {"topic": "Regulatory compliance updates", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Geographic market penetration", "data": {"['Q2', '2025']": {"answer": "f0b24b72cb040f20ae1b5b9ac0fc08f9 --> This year, again, we are looking at opening 500 more branches.", "citations": ["f0b24b72cb040f20ae1b5b9ac0fc08f9"]}, "['Q1', '2025']": {"answer": "a1d4e3d7b505f50b0c4a878db60f1e15 --> We are planning to expand our branch network by 50 new branches in the next 12 months.", "citations": ["a1d4e3d7b505f50b0c4a878db60f1e15"]}, "['Q4', '2024']": {"answer": "2b7025fdb248083eb398f8858cffb1e6 --> Our goal is to open 50 new stores over the next two years.\n\nf6596a7ba1fc9297cd8a0c8541c9c044 --> Arjun Chowdhry [We have not slowed down on the pace of acquisition, and this is for the seventh quarter in succession we have done and in fact this quarter we did 1.24 million cards.]", "citations": ["2b7025fdb248083eb398f8858cffb1e6", "f6596a7ba1fc9297cd8a0c8541c9c044"]}, "['Q4', '2023']": {"answer": "d2082d91247a707fd9251f2caaea4ad0 --> We are, at this point in time, quite clear that we expect to add up to 500 branches this year.", "citations": ["d2082d91247a707fd9251f2caaea4ad0"]}, "['Q1', '2024']": {"answer": "49926194a6b5ba6753a542c26696859e --> Ravi Narayanan [Current financial year, we are looking at around 400 branches incrementally for the year.]", "citations": ["49926194a6b5ba6753a542c26696859e"]}, "['Q3', '2023']": {"answer": "0cefaa72c79b220fb6985045e2922178 --> We are planning to open 50 new branches across the country over the next 12 months.\n\n33e09465ffa5776d59e951d6adae4bcc --> We plan to open 50 new branches by the end of 2024.\n\ndc1c3f440692b884f23522ace797ab99 --> Our goal is to open 50 new stores next year.\n\n5c66bae68955c5c64f6cbade51fa753b --> We are planning to open 50 new branches over the next two years.", "citations": ["0cefaa72c79b220fb6985045e2922178", "33e09465ffa5776d59e951d6adae4bcc", "dc1c3f440692b884f23522ace797ab99", "5c66bae68955c5c64f6cbade51fa753b"]}, "['Q2', '2024']": {"answer": "1ccc148ba48d622be98dffeca1279214 --> We plan to open 50 new branches in the coming year.\n\nb3310255609399617a62e4533abbbac4 --> Puneet Sharma [204 branches added in the quarter]\n\nc8ece70fcca172f14eb36c91d6b53e60 --> We are looking at doing about 500 branches this fiscal and we are on the path to delivering that.\n\nc8ece70fcca172f14eb36c91d6b53e60 --> We have moved towards what we have done as 200 odd branches in the first half and we are confident we will do the 500 this year.", "citations": ["1ccc148ba48d622be98dffeca1279214", "b3310255609399617a62e4533abbbac4", "c8ece70fcca172f14eb36c91d6b53e60"]}}}, {"topic": "Strategic partnerships", "data": {}}, {"topic": "Retail and corporate banking growth", "data": {}}, {"topic": "International market entries", "data": {}}]}, {"theme": "Customer Engagement and Experience", "topics": [{"topic": "Customer satisfaction metrics"}, {"topic": "Loyalty program expansions"}, {"topic": "Service delivery improvements"}, {"topic": "Personalized banking solutions"}]}, {"theme": "Capital and Liquidity Management", "topics": [{"topic": "Capital adequacy ratio", "data": {"['Q3', '2023']": {"answer": "33e09465ffa5776d59e951d6adae4bcc --> Our target is to achieve a 20% return on equity by 2025.\n\nfa942cc9137a7406d5be158ea22940a6 --> The idea was to hit 18% ROE, and we will work very hard to stay there.", "citations": ["33e09465ffa5776d59e951d6adae4bcc", "fa942cc9137a7406d5be158ea22940a6"]}, "['Q2', '2024']": {"answer": "cca07b8c99aecb3e6fe582e6dc48123e --> Rajiv Anand [The intent is to deliver 18% ROE with this level of RWA intensity.]", "citations": ["cca07b8c99aecb3e6fe582e6dc48123e"]}}}, {"topic": "Liquidity management plans", "data": {"['Q2', '2025']": {"answer": "5c02b28360802c13461badb5f7a04b34 --> We reiterate that we do not need equity capital for either pillar. We may opportunistically evaluate issuing Tier-2 and AT-1 instruments based on market conditions.", "citations": ["5c02b28360802c13461badb5f7a04b34"]}, "['Q3', '2024']": {"answer": "e860941d71aa8faa0746a1be815c69a5 --> We expect this to continue till inflation reaches the lower bound of the range.", "citations": ["e860941d71aa8faa0746a1be815c69a5"]}, "['Q1', '2025']": {"answer": "9e876f797806fc191788b1002cb9a102 --> Puneet Sharma [The RAROC allocation and liquidity allocation is the quarterly exercise at the Bank. So we have an outlook for the year, but we plan this on a quarter-by-quarter basis, and that's how you will see us execute in this tight liquidity environment.]", "citations": ["9e876f797806fc191788b1002cb9a102"]}, "['Q4', '2023']": {"answer": "833531ee5f24a5dc2e4dabf8386e3340 --> Puneet Sharma [The Rs. 1,500 crores is post tax and we will incur that over an 18 months period.]", "citations": ["833531ee5f24a5dc2e4dabf8386e3340"]}, "['Q1', '2024']": {"answer": "e22496dd83532cf08b8af2fbd48f18de --> We have said that we expect to incur integration expenses over a period of 18 months aggregating to Rs 2,000 crores pre-tax, Rs 1,500 crores post-tax.\n\nc2f990ff9250c4b592806151955df5c2 --> We expect deposit costs to increase further over the remaining part of the financial year but the pace of deposit cost growth will most likely moderate.\n\n16863ccdac3b8e69c26ad19243335497 --> We expect deposit costs to further increase over the remaining part of the financial year. But the pace of growth of deposit cost is most likely to moderate.\n\n303f63792aa2b6c72fd8220d53ac35e9 --> Puneet Sharma [CFO][Therefore, we do not have any plans currently to raise capital for the growth outlook that we have for FY 24.]", "citations": ["e22496dd83532cf08b8af2fbd48f18de", "c2f990ff9250c4b592806151955df5c2", "16863ccdac3b8e69c26ad19243335497", "303f63792aa2b6c72fd8220d53ac35e9"]}, "['Q2', '2024']": {"answer": "be114521ce2898ff6fce81c9e5d0fce6 --> Our liability franchise is progressing with outflow rates falling by ~550 bps over the two years.\n\n88e13a49170054dbdbfc62d74297d8b6 --> Our call out remains that there will be an increase in cost of funds/cost of deposits, that pace should slow, the incremental increase to slowdown in the consequent quarters.\n\ncca07b8c99aecb3e6fe582e6dc48123e --> Puneet Sharma [The outlook will be around 2.10% would be the target as we would stand.]", "citations": ["be114521ce2898ff6fce81c9e5d0fce6", "88e13a49170054dbdbfc62d74297d8b6", "cca07b8c99aecb3e6fe582e6dc48123e"]}}}, {"topic": "CET-1 ratio dynamics", "data": {"['Q2', '2025']": {"answer": "c7123ccfbcce5b763dfb145d1a918208 --> Amitabh Chaudhry [The Bank is well capitalized with a CET 1 ratio of 14.12% with net accretion of 6 bps in Q2FY25 and 38 bps in H1FY25 period.]", "citations": ["c7123ccfbcce5b763dfb145d1a918208"]}, "['Q4', '2024']": {"answer": "68a699adbc5be47140f209c496198e7a --> The reported CET-1 ratio at March 31, 2024 of 13.74% is after fully incorporating the impact of the Rs 1,612 crores investment in Max Life funded in April 2024 and proposed dividend at the rate of 50% or Rs 1/- per share.", "citations": ["68a699adbc5be47140f209c496198e7a"]}, "['Q1', '2024']": {"answer": "303f63792aa2b6c72fd8220d53ac35e9 --> Puneet Sharma [CFO][Our current CET1 stands at 14.38%, well above our philosophical rebase level, well above what we need to protect our domestic AAA rating, sufficient headroom for us to grow at 400 basis points to 600 basis points higher than industry credit that we've indicated we would like to grow at.]", "citations": ["303f63792aa2b6c72fd8220d53ac35e9"]}, "['Q3', '2023']": {"answer": "f56cee36da5e6d80509f45438870cfa3 --> [Inferred as CFO][Based on the current capital position and RWA intensity of our existing business, the CET-1 consumption on the Citibank acquisition is estimated at ~180 bps.]", "citations": ["f56cee36da5e6d80509f45438870cfa3"]}, "['Q2', '2024']": {"answer": "be114521ce2898ff6fce81c9e5d0fce6 --> Organic business driven CET 1 accretion in the quarter of 18 bps and 54 bps for H1 FY24.", "citations": ["be114521ce2898ff6fce81c9e5d0fce6"]}}}, {"topic": "Liquidity coverage ratio optimization", "data": {"['Q2', '2025']": {"answer": "d3099f9daa0fa5e03afb59be7adba1ae --> It also places us well for the final LCR adoption in shape and form that it comes out in April.", "citations": ["d3099f9daa0fa5e03afb59be7adba1ae"]}, "['Q4', '2024']": {"answer": "2d5c6c8b67f8204a9e0d124d078acf39 --> In order to ensure like for like comparison of deposits growth with peer banks, the Bank will only report total deposits growth as part of its disclosures in FY 25, along with the LCR quality of deposit metric.", "citations": ["2d5c6c8b67f8204a9e0d124d078acf39"]}}}]}, {"theme": "Strategic Initiatives and Growth", "topics": [{"topic": "New product launches", "data": {"['Q2', '2024']": {"answer": "734855663bd56e58a432c3c8db2b893b --> [Inferred as CEO] We aim to launch this for customer usage in the coming quarter.\n\na0fc7b343e9cd3ce869b0848ca6acc61 --> Under NEO, we will also be launching in this quarter, \"Neo for Corporates\" - our platform for the large corporates.\n\ndd676b90f95adc71cb98c648ccd6ed89 --> So, by March 2024, we will take a call on where do we put them across, but our intention is not to write back any of it at this point in time.", "citations": ["734855663bd56e58a432c3c8db2b893b", "a0fc7b343e9cd3ce869b0848ca6acc61", "dd676b90f95adc71cb98c648ccd6ed89"]}}}, {"topic": "Cross-selling opportunities", "data": {}}, {"topic": "Sustainability goals", "data": {"['Q2', '2025']": {"answer": "7507844571a781fefa588273c6bdfe23 --> Rajiv Anand [I don't think at any stage, any of us have ever mentioned that this 3% outperformance that we've spoken about is something that we will deliver on a quarter- on-quarter basis. I think it is a medium-term outlook.]", "citations": ["7507844571a781fefa588273c6bdfe23"]}, "['Q3', '2024']": {"answer": "eff0f03c758cfc8491346b7f36563234 --> We expect to realize the full potential of this transformation in next 6-7 quarters.", "citations": ["eff0f03c758cfc8491346b7f36563234"]}, "['Q4', '2023']": {"answer": "3aa605c2cdef45793a2d573e3e08b0a1 --> This is a multi-year journey, and we will continue to invest here with the aim to cover the entire Bank in this Financial Year.", "citations": ["3aa605c2cdef45793a2d573e3e08b0a1"]}, "['Q3', '2023']": {"answer": "5fa58cc0126eb51511f035e7f43ee6a5 --> Puneet Sharma [The door-to-door maturity of our RIDF portfolio is 4 to 5 years, and therefore, you would have to look at that tenure for the number to get to net-zero.]", "citations": ["5fa58cc0126eb51511f035e7f43ee6a5"]}}}, {"topic": "GPS strategy execution", "data": {}}]}, {"theme": "Regulatory Compliance and Governance", "topics": [{"topic": "Basel III compliance", "data": {"['Q3', '2023']": {"answer": "5fa58cc0126eb51511f035e7f43ee6a5 --> Puneet Sharma [We expect to be PSL-compliant for FY23.]", "citations": ["5fa58cc0126eb51511f035e7f43ee6a5"]}}}, {"topic": "Governance policies", "data": {}}, {"topic": "Risk management frameworks", "data": {}}, {"topic": "Regulatory changes impact", "data": {"['Q2', '2025']": {"answer": "5c02b28360802c13461badb5f7a04b34 --> Further, we are not expecting any further tax orders relating to similar matters in the remaining part of FY 25.\n\nb37c64a3e90bd76b4593bbd86f8725c0 --> Please note that under the current RBI guideline related to investment accounting and recognition norms applicable from April 2024, MTM gains are also recognised through P&L unlike in the past where only MTM losses were recognised and gains ignored.", "citations": ["5c02b28360802c13461badb5f7a04b34", "b37c64a3e90bd76b4593bbd86f8725c0"]}}}]}, {"theme": "Strategic Partnerships and Collaborations", "topics": [{"topic": "Value chain enhancements", "data": {}}, {"topic": "Data-sharing agreements", "data": {}}, {"topic": "Multi-partner arrangements", "data": {"['Q2', '2024']": {"answer": "084664286d985e498a61ea832e5fe058 --> Therefore, as we continue to invest in partnerships as a means of growing both to get the numbers and to deliver higher customer value, we will find that the ETB-KTB mix will keep moving. We also keep an eye on that, and we'll keep calibrating that in the quarters going forward.", "citations": ["084664286d985e498a61ea832e5fe058"]}}}]}]