{
  "_id": "aurobindo_guidance_actuals_report_3",
  "company_name": "aurobindo",
  "created_at": {
    "$date": "2024-11-21T11:43:50.425Z"
  },
  "guidance_actuals": {
    "['Q2', '2025']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "The company is on track for the completion of a Phase 3 clinical study in Europe by May 2025.",
          "management_guidance": {
            "answer": "The company is on track for the completion of a Phase 3 clinical study in Europe by May 2025.",
            "citations": [
              "c019b9995aa074644361b7686ea1a2b4"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "A Phase 3 clinical study was completed in 690 metastatic breast cancer subjects and met clinical endpoints successfully. A Phase 1 PK/PD clinical study was also completed. Total R&D (including depreciation) spend for Q2 2025 was Rs. 410 Crore (5.3% of sales).",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Exceeded",
            "evaluation_reason": "While the guidance focused on a single Phase 3 study in Europe, the actual results included the successful completion of that study *and* an additional Phase 1 study, exceeding the stated expectation."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Aurobindo Pharma plans two regulatory submissions in 2025.",
          "management_guidance": {
            "answer": "Aurobindo Pharma plans two regulatory submissions in 2025.",
            "citations": [
              "257191118292dc1d76b60db2f033773b"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "In the US market, 10 ANDAs were filed, 8 products received approval, and 14 products were launched. In India, market authorization (MA) was received for Trastuzumab. 14 DMFs were filed for peptides. The number of approvals increased significantly compared to the previous period.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Exceeded",
            "evaluation_reason": "The actual results significantly surpassed the expectation of two regulatory submissions, demonstrating substantial progress across multiple regulatory pathways in both the US and India."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "The company is targeting a 10% increase in sales revenue by the end of Q4 2025. They also aim to reduce operational costs by 5% by the next fiscal year.",
          "management_guidance": {
            "answer": "The company is targeting a 10% increase in sales revenue by the end of Q4 2025. They also aim to reduce operational costs by 5% by the next fiscal year.",
            "citations": [
              "a701822e01fc2b8ae61b6d598edbfb90"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "Revenue in Q2 2025 was ₹ 7,796 Cr, showing an 8.0% year-on-year growth. Net profit was ₹ 817 Cr, with 8.6% year-on-year growth. US revenue (excluding Puerto Rico) was US$ 421 Mn, a 2.9% year-on-year increase but a 1.1% quarter-on-quarter decrease. EBITDA was ₹ 1,566 Cr, showing an 11.6% year-on-year growth. Gross profit increased by 15.1% year-on-year, and gross margin improved by 366 bps. Various other financial metrics showed growth, though not all were consistent with the initial guidance.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the Q2 revenue growth (8%) was below the target of 10% set for Q4, other metrics showed positive growth, indicating partial achievement of the broader financial objectives.  The cost reduction target is not assessable from the Q2 data."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Aurobindo Pharma expects to expand its market share by 15% within the next two years.",
          "management_guidance": {
            "answer": "Aurobindo Pharma expects to expand its market share by 15% within the next two years.",
            "citations": [
              "a701822e01fc2b8ae61b6d598edbfb90"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "There is limited specific data on market share expansion in Q2 2025. However, data points highlight strong growth in various geographic markets (Europe showing 19% year-on-year growth and Growth Markets showing 44% year-on-year growth). Their 14 biosimilars target a market opportunity of GT50 bn USD. Customer satisfaction scores improved, though the specific percentage is not consistently reported.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data does not contain information on market share expansion in Q2 2025, making it impossible to assess performance against the two-year target."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Three potential product launches are planned for the next year (2026). The company plans to add a new modality by establishing oligonucleotide synthesis capabilities by the end of 2025. A soft launch of Trastuzumab is planned for Q3, and the launch of first-in-class linaclotide (after filing in India) is expected in Q4.",
          "management_guidance": {
            "answer": "Three potential product launches are planned for the next year (2026). The company plans to add a new modality by establishing oligonucleotide synthesis capabilities by the end of 2025. A soft launch of Trastuzumab is planned for Q3, and the launch of first-in-class linaclotide (after filing in India) is expected in Q4.",
            "citations": [
              "257191118292dc1d76b60db2f033773b"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "14 products were launched during the quarter, although the specific products are not detailed. The launch of Trastuzumab in India is mentioned, but the timing relative to the Q3 guidance isn't explicitly clarified.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the 14 product launches exceed the expectation of three in 2026 (this is a future year),  there is insufficient data to evaluate the launch of Trastuzumab against the Q3 guidance or the establishment of oligonucleotide synthesis capabilities."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Aurobindo Pharma plans to expand its bioreactor capacity by adding two more 15 KL bioreactor lines to the existing 2x15 KL footprint. First supplies from a new manufacturing facility are expected in 2028, with the facility's commissioning planned for end-2025 (for qualification and engineering runs). A new manufacturing facility is to be commissioned by the end of 2025.",
          "management_guidance": {
            "answer": "Aurobindo Pharma plans to expand its bioreactor capacity by adding two more 15 KL bioreactor lines to the existing 2x15 KL footprint. First supplies from a new manufacturing facility are expected in 2028, with the facility's commissioning planned for end-2025 (for qualification and engineering runs). A new manufacturing facility is to be commissioned by the end of 2025.",
            "citations": [
              "257191118292dc1d76b60db2f033773b"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "There is no specific data provided on the completion or progress of the bioreactor expansion or new manufacturing facility commissioning in Q2 2025.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data lacks information on the progress of the bioreactor expansion or new manufacturing facility in Q2 2025, preventing an evaluation against the stated plans."
          }
        }
      ]
    },
    "['Q1', '2025']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo's R&D efforts are focused on ophthalmic products, with clinical trials underway.  Progress is described as \"pretty slow\" but there is confidence in completion.",
          "management_guidance": {
            "answer": "Completion of the Indian clinical study by the end of 2025, enabling filing in India and emerging markets by Q3-Q4 2025. Clinical study closure in June 2026, with subsequent filing with the EMA and FDA in Q2 FY26. Completion of the large European study by mid-2026, aiming for EMA and FDA filing in Q3 FY26.",
            "citations": [
              "a009f99ebbc3bbc3a8a2dffd7ee01d22",
              "e033c7a89b118e50c990db883ba90403",
              "a009f99ebbc3bbc3a8a2dffd7ee01d22"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "In Q2 2025, a Phase 1 PK/PD clinical study was completed. A Phase 3 clinical study in metastatic breast cancer subjects was completed and met clinical endpoints. Dossiers increased from 348 in March 2020 to 416 in September 2024. Approvals increased from 639 in March 2020 to 848 in September 2024. Registrations increased from 185 in March 2020 to 266 in September 2024. Total R&D (incl. depreciation) spend was Rs. 410 Crore (5.3% of sales).",
              "citations": [
                "e1f0c637eff3718592d6bc93e1eb1c4b",
                "c019b9995aa074644361b7686ea1a2b4",
                "2dc92cc68873bf6f285c7e6db6c60a5c"
              ]
            },
            "['Q1', '2025']": {
              "answer": "R&D expenditure for Q1 2025 was Rs. 339 crores (4.5% of revenue). The Denosumab trial in Europe completed patient recruitment in May. The Tocilizumab biosimilar phase three trial in India was completed. Recruitment for an oncology product was 80% complete.",
              "citations": [
                "44e21167abb8856b2d2ce953c4aff17e",
                "e033c7a89b118e50c990db883ba90403",
                "46e57a52d8cea8f855ad94aa0ecfbd01",
                "a009f99ebbc3bbc3a8a2dffd7ee01d22"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While some trials were completed in Q1 2025, the overall progress against the management's detailed timelines for clinical study completion and subsequent filings with regulatory bodies in 2025 is not reflected in the Q1 2025 actual results.  The provided data doesn't show achievement of the projected milestones."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Aurobindo is navigating regulatory hurdles, particularly with the FDA.  There's cautious optimism regarding resolving FDA-related issues.  Multiple filings are planned with the FDA and other regulatory bodies.",
          "management_guidance": {
            "answer": "Expectation to meet regulatory requirements within the current clock stop period, with approvals anticipated in two quarters. Planned FDA filing within the next four to eight weeks for one product. Planned filing for another product (India and emerging markets only) within the next three to four months. Anticipation of three to four US filings during the year, with revenue generation expected from FY26 onwards. Cautious optimism about resolving FDA issues and increasing sales momentum from Q2 FY25 onwards.",
            "citations": [
              "46e57a52d8cea8f855ad94aa0ecfbd01",
              "46e57a52d8cea8f855ad94aa0ecfbd01",
              "46e57a52d8cea8f855ad94aa0ecfbd01",
              "e7bc63d5521ec36a60711b0aa56b1fc2",
              "b6033cacac59078621b2c3d0b3e42744"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "In Q2 2025, Aurobindo filed 10 ANDAs with the USFDA and received approval for 8 products. They launched 14 products. A Marketing Authorization (MA) was received for Trastuzumab in India. 14 DMFs were filed in peptides. The number of filings in South Africa decreased from 436 (March 2020) to 348 (March 2021) due to SAHPRA backlog clearance.",
              "citations": [
                "e1f0c637eff3718592d6bc93e1eb1c4b",
                "02526114f04485a67e50227aa3504a4d",
                "257191118292dc1d76b60db2f033773b",
                "973e9f41a7034f3a2d4551d498d3ea98",
                "2dc92cc68873bf6f285c7e6db6c60a5c"
              ]
            },
            "['Q1', '2025']": {
              "answer": "As of June 30th, Aurobindo had 838 ANDAs filed with the US FDA, with 668 having final approval and 26 tentative approvals. Remediation actions related to the Eugia-3 plant impacted Q4 FY24 and Q1 FY25.",
              "citations": [
                "24336a5714cdedb21a30e4ff36ac7abe",
                "b6033cacac59078621b2c3d0b3e42744"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided Q1 2025 actual results describe the current state of ANDA filings and the impact of Eugia-3 remediation, but there's no specific Q1 2025 management guidance on FDA approvals or filings to compare it against."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "Aurobindo projects continued revenue growth, with specific targets and expectations for various regions and product lines.  EBITDA margin targets are reiterated.  There's commentary on remediation costs related to Eugia-3.",
          "management_guidance": {
            "answer": "Strong performance in the European market, on track to achieve €880 million plus for FY25. Confidence in achieving the overall internal EBITDA margin target of 21%-22% for FY25. Cautious optimism regarding regular injectable business moving up from Q2 FY25 onwards. Expectation of approximately $600 million plus in revenue for the year. Continued revenue of around 8 million per quarter for the current financial year. Expectation that remediation costs for Eugia-3 will be significantly lower in Q2 FY25 (around $2 million) compared to Q1 FY25. Gross margin maintenance at 21%-22%, with absolute margin ramp-up. Overall gross margin projected around 27-28%. Revenue impact from Eugia-3 remediation expected to end.",
            "citations": [
              "af88e0d66e55f334d5a955d3baf3c9ad",
              "af88e0d66e55f334d5a955d3baf3c9ad",
              "e6483073eeb03b07f2f62e7ad53c3333",
              "b6033cacac59078621b2c3d0b3e42744",
              "28aef6ca52968543346f2dad6fb7f503",
              "28aef6ca52968543346f2dad6fb7f503",
              "ada40290eb51b08701b95c127949037c",
              "2b3fac7ca1f47cf29adc769d622963a2",
              "25bd59ebe2d03f31250eba6feb1c25fd",
              "69d7a66ddb69637b702f161694a93042"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "In Q2 2025, revenue was ₹ 7,796 Cr (8.0% YoY growth). Net profit was ₹ 817 Cr (8.6% YoY growth). The US market experienced 4.3% YoY growth, Europe 19.0% YoY growth, and Growth Markets 44.0% YoY growth. Total Formulations increased by 11.3% YoY. Consolidated Sales (Ex-Puerto Rico) grew 9.3% YoY and 3.0% QoQ. US revenue (excluding Puerto Rico) was US$ 421 Mn (2.9% YoY increase, 1.1% QoQ decrease). EBITDA was ₹ 1,566 Cr (11.6% YoY growth). Base business revenue grew 7% QoQ. Base EBITDA margin was around 21%, with double-digit QoQ growth in absolute EBITDA. Gross Profit increased by 15.1% from Q2FY24 to Q2FY25. Gross Margin increased by 366 bps.",
              "citations": [
                "b0d0da0ae383df85b89f0b6e5c838679",
                "689010bf793af464fb0cc7a20586252d",
                "e1f0c637eff3718592d6bc93e1eb1c4b",
                "cf8e12e6f28b623f813ceedc84281dba",
                "02526114f04485a67e50227aa3504a4d",
                "4f4c4de3a512d89929dc5161a71a01b1"
              ]
            },
            "['Q1', '2025']": {
              "answer": "Revenue increased by 10% year-on-year in Q1 FY25 to Rs. 7,567 crores. US revenue was $426 million (marginally impacted by seasonality), European revenue was €221 million, and growth market revenue was $85 million. Formulation business (excluding Puerto Rico) grew 15% year-on-year to Rs. 6,475 crores. API business revenue increased 6% year-on-year to Rs. 1,092 crores. Net profit increased 61% year-on-year to Rs. 919 crores. EBITDA margin was 21.4%. Remediation costs for Eugia-3 were approximately $9 million in Q1 FY25. Gross margin was 59.4%, up from 53.9% in the previous year's Q1.",
              "citations": [
                "c45761bf69733561e65706db60884c32",
                "24336a5714cdedb21a30e4ff36ac7abe",
                "af88e0d66e55f334d5a955d3baf3c9ad",
                "44e21167abb8856b2d2ce953c4aff17e",
                "0884694f79ebe2e2715f3c1fa6033503",
                "53335a8bb0e013b70f77166c44570fb1",
                "ada40290eb51b08701b95c127949037c",
                "28aef6ca52968543346f2dad6fb7f503",
                "69d7a66ddb69637b702f161694a93042",
                "86a8f72f377eea6abceb9d3732eaa338",
                "c45761bf69733561e65706db60884c32",
                "44e21167abb8856b2d2ce953c4aff17e",
                "d08396667e0eabe20b3d1212addbc76c",
                "af88e0d66e55f334d5a955d3baf3c9ad",
                "e6483073eeb03b07f2f62e7ad53c3333",
                "0884694f79ebe2e2715f3c1fa6033503",
                "ada40290eb51b08701b95c127949037c",
                "2b3fac7ca1f47cf29adc769d622963a2",
                "25bd59ebe2d03f31250eba6feb1c25fd"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The Q1 2025 actual results show that the EBITDA margin (21.4%) met the management's guidance range (21%-22%). While full-year revenue targets are not yet achievable in Q1, the revenue growth shows progress toward those goals.  The Eugia-3 remediation costs were high, but the management guidance indicated that would decrease in Q2, so the Q1 results are not necessarily a failure to meet expectations."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Aurobindo is focusing on the commercialization of Pen-G, aiming for significant ramp-up.",
          "management_guidance": {
            "answer": "The company is on track for significant ramp-up of Pen-G commercialization from October 2024.",
            "citations": [
              "44e21167abb8856b2d2ce953c4aff17e"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "No specific Q2 2025 actual results for Pen-G commercialization are provided in the data.",
              "citations": []
            },
            "['Q1', '2025']": {
              "answer": "Pen-G sales were impacted in Q1 FY25 due to various reasons at the Pen-G plant, resulting in zero sales for three months.",
              "citations": [
                "0884694f79ebe2e2715f3c1fa6033503"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The actual results show zero sales for three months of Q1 2025, clearly falling short of the anticipated \"significant ramp-up\" from October 2024."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Aurobindo is addressing supply chain challenges, particularly concerning raw material procurement and manufacturing ramp-up for specific products.  There's mention of plans for sourcing from China.",
          "management_guidance": {
            "answer": "Expectation to produce approximately 20 batches in one month and 30 in the following month, leading to significant ramp-up from October. Plan to begin small-volume sourcing from China in November-December, with ramp-up between January and March of the next year (Q4 FY25). Full-fledged volumes are expected to start in FY26.",
            "citations": [
              "0884694f79ebe2e2715f3c1fa6033503",
              "e7bc63d5521ec36a60711b0aa56b1fc2"
            ]
          },
          "actual_results": {
            "['Q2', '2025']": {
              "answer": "No specific Q2 2025 actual results related to supply chain management are provided in the data.",
              "citations": []
            },
            "['Q1', '2025']": {
              "answer": "No specific actual results for supply chain management are provided in the data for Q1 2025. The first commercial product for BFS was shipped to China through a JV partner.",
              "citations": [
                "e7bc63d5521ec36a60711b0aa56b1fc2"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q1 2025 actual results only mention one shipment to China, which is insufficient information to assess the overall progress against the management's broader guidance on production targets and sourcing plans from China."
          }
        }
      ]
    },
    "['Q4', '2024']": {
      "themes": [
        {
          "theme": "Regulatory Approvals and Launches",
          "narrative": "Aurobindo anticipates several key regulatory approvals and product launches impacting different markets (India, US, Europe) and therapeutic areas (oncology, diabetes).  The timeline for these events spans Q4 2024 and extends into future fiscal years (FY25, FY26).  There's mention of potential delays in some filings.",
          "management_guidance": {
            "answer": "Trastuzumab launch in India is contingent on receiving a manufacturing license in FY25. Decisions on two biosimilars from the EMA are expected towards the end of Q3 or early Q4 FY25. Filing of a product with both EMA and FDA is anticipated between Q2 and Q3 of FY26. FDA filing for another product is expected by the next quarter-end. A potential delay in a filing might push it from before Q3 to Q4 2024 or Q1 FY25. Launch of a first-in-class peptide in India is expected within the next 3-4 months.",
            "citations": [
              "4ff5780333cb8867f57998ecb22d5702",
              "5c217a8e798e1ccaca460bbb5cbd08b5",
              "65d2569e6b87b2287b07a887e7f5aafd",
              "19503ab2d62e0bec08a11259fa6ea558",
              "d835e76bce72eff43e6b8bb907f56582",
              "56c80b1b2c222483b56435a24ce1efb7"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "No actual results for Q4 2024 are provided in the given data.",
              "citations": []
            },
            "['Q4', '2024']": {
              "answer": "No actual results for Q4 2024 are provided in the database.",
              "citations": []
            },
            "['Q2', '2025']": {
              "answer": "No Q4 2024 actual results are provided in the database. The provided Q2 2025 data does not directly address the specific products mentioned in the Q4 2024 guidance.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "Actual Q4 2024 results for regulatory approvals and product launches are not available in the provided data to assess whether Aurobindo met or exceeded expectations."
          }
        },
        {
          "theme": "Financial Performance and Projections",
          "narrative": "Management provides specific financial guidance for revenue growth, EBITDA margins, and operational cost reductions.  These projections span Q4 2024 and into FY25. There's also discussion of the long-term contribution of the biosimilars business to overall margins.",
          "management_guidance": {
            "answer": "A 15% revenue growth is projected for the next fiscal year (FY25). A 15% increase in revenue for the Europe Formulations Business is targeted for FY25. A quarterly run rate of approximately US$150 million is expected globally, maintaining that level. The US OSD run rate is expected to increase from $280 million to $300 million. Europe's new base revenue is expected to be above EUR 200 million in all quarters of FY25. EBITDA margin of 21-22% is targeted for FY25. A 10% reduction in operational costs is planned over the next two quarters. Biosimilars are expected to make substantial contributions to overall margins from FY29-30. A 7% boost in production capacity is targeted in the next six months.",
            "citations": [
              "3f0336ec4935b49477f8455dc4943f79",
              "1c9a2d0f43ea73390d1e4276d6439a7d",
              "4e4bf025638e96d451c59e97b6f73102",
              "a845f61bfc1d9181e29f1888c5cc74ff",
              "e79cda64e9f07f01d0e6aa75c53e9acf",
              "a2ec8ef084db343b28af57663362605b",
              "4092655e5eba42e16400e5cb570de04c",
              "5a7ed0e00277ccab627b742423b14fab",
              "d54dfaa6595f46298d42000e73757e8d"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 2025, Aurobindo reported a 10% overall revenue increase year-on-year. US formulations grew by 12% year-on-year to $426 million. European revenue reached €221 million. EBITDA margin was 21.4%. Note that these results are from Q1 2025, not Q4 2024.",
              "citations": [
                "c45761bf69733561e65706db60884c32",
                "af88e0d66e55f334d5a955d3baf3c9ad",
                "24336a5714cdedb21a30e4ff36ac7abe",
                "44e21167abb8856b2d2ce953c4aff17e"
              ]
            },
            "['Q4', '2024']": {
              "answer": "Consolidated revenue in Q4 FY24 was Rs 7,580 Crore, a 17.1% YoY increase. US revenue (excluding Puerto Rico) was US$ 432 million, a 20.4% YoY increase. EBITDA before forex and other income was Rs 1,687 Crore, representing a 22.3% margin. These results partially reflect the management guidance, though specific targets for FY25 are not yet realized.",
              "citations": [
                "1c969507f2d551f6ed57f1edb888dc2d",
                "f022eab2b5e656fe5b3526ecf8be0373",
                "32787dbea95672de6254ed7a0ac70364",
                "b4b7b4f763e4e66d4cf9f6fbaf741883",
                "ee8178da6c3090cf7db392f855ac9eac"
              ]
            },
            "['Q2', '2025']": {
              "answer": "No Q4 2024 actual results are provided in the database. However, Q2 2025 data shows revenue growth, though specific numbers aren't directly comparable to the yearly projections. The Q2 2025 data shows an 8% YoY revenue growth (b0d0da0ae383df85b89f0b6e5c838679) and an 11.6% YoY EBITDA growth (b0d0da0ae383df85b89f0b6e5c838679). Further, the US revenue increased by 2.9% YoY and decreased by 1.1% QoQ to USD 421 Mn (02526114f04485a67e50227aa3504a4d) in Q2 2025. Also, Europe business posted revenues of EUR 229 Mn (cf8e12e6f28b623f813ceedc84281dba) in Q2 2025.",
              "citations": [
                "b0d0da0ae383df85b89f0b6e5c838679",
                "02526114f04485a67e50227aa3504a4d",
                "cf8e12e6f28b623f813ceedc84281dba"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While Q4 2024 results showed strong YoY revenue and EBITDA growth exceeding some expectations,  the data doesn't provide a complete picture against the full-year FY25 projections."
          }
        },
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo's R&D activities are focused on oncology and diabetes, with ongoing clinical trials and new product development.  Timelines for filing and launch of various products are provided, spanning Q4 2024 and into future fiscal years.",
          "management_guidance": {
            "answer": "Significant improvements are expected starting FY26 due to Oncology OSDs and other filings. Clinical trial recruitment completion is targeted for October 2024, with filing in Q4 FY26. Another product launch is anticipated in FY26-27. Pen-G and 6-APA launches are expected to start in September 2024. DMF filing for a GLP-1 product is expected within the next 2-3 months.",
            "citations": [
              "5aace22658f75cdc47432c841b10dd74",
              "65d2569e6b87b2287b07a887e7f5aafd",
              "1a3a63a68331a119ed99857d0684e71d",
              "a2ec8ef084db343b28af57663362605b"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 2025, Denosumab trial recruitment in European sites was completed in May. Tocilizumab biosimilar phase three clinical trial in India was completed. Recruitment for another oncology product was approximately 80% complete. R&D expenditure was 4.5% of revenue.",
              "citations": [
                "e033c7a89b118e50c990db883ba90403",
                "46e57a52d8cea8f855ad94aa0ecfbd01",
                "a009f99ebbc3bbc3a8a2dffd7ee01d22",
                "44e21167abb8856b2d2ce953c4aff17e"
              ]
            },
            "['Q4', '2024']": {
              "answer": "Total R&D spend for Q4 2024 was Rs. 392 Crore (5.2% of sales). Phase-III recruitment completed across 40 sites in Europe for a product. Licensure clinical trials completed for three biosimilars, and three products filed. A Phase 3 clinical study completed successfully in metastatic breast cancer subjects. The provided data shows progress on several aspects of the R&D guidance, but complete fulfillment is not yet evident in Q4 2024.",
              "citations": [
                "1c969507f2d551f6ed57f1edb888dc2d",
                "018bcf074c4a92d319fc8abf84635e65",
                "65d2569e6b87b2287b07a887e7f5aafd",
                "d54dfaa6595f46298d42000e73757e8d",
                "a0af34819ab9be6b1dccfed7346a47b0"
              ]
            },
            "['Q2', '2025']": {
              "answer": "No Q4 2024 actual results are provided in the database. Q2 2025 data indicates that a Phase 1 PK/PD clinical study was completed (c019b9995aa074644361b7686ea1a2b4), and a Phase 3 clinical study in metastatic breast cancer subjects was completed successfully (c019b9995aa074644361b7686ea1a2b4). Total R&D spend for Q2 2025 was Rs. 410 Crore (5.3% of sales) (e1f0c637eff3718592d6bc93e1eb1c4b).",
              "citations": [
                "c019b9995aa074644361b7686ea1a2b4",
                "e1f0c637eff3718592d6bc93e1eb1c4b"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "Q4 2024 results show progress on several R&D initiatives, such as completed clinical trials and filings, but the data doesn't provide enough information to evaluate whether all aspects of the guidance were met."
          }
        },
        {
          "theme": "Market Expansion and Partnerships",
          "narrative": "Aurobindo is focused on expanding its market share, particularly in the US and Europe, and is pursuing strategic partnerships.  Some timelines for these expansions are provided.",
          "management_guidance": {
            "answer": "A 5% increase in market share is targeted by year-end. The definitive agreement with MSD (Singapore) is expected to close by May 31st. Ryzneuta launch in the US is expected in the second half of the current financial year. Monetization of a specific product is anticipated around 2027-2028. Major contributions from Europe and the US are anticipated around 2026-27.",
            "citations": [
              "3f0336ec4935b49477f8455dc4943f79",
              "d18e3ce1e5687882c36d32546732b065",
              "8cc36f9313c54fccf7bbb0421e64a8da",
              "b3e0074bd1e2d617460b4cb6c240210d"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "No specific Q4 2024 or Q1 2025 results directly related to market share expansion or partnership closures are provided in the data. However, the Q1 2025 data shows growth in both US and European markets (see Financial Performance section above).",
              "citations": []
            },
            "['Q4', '2024']": {
              "answer": "No specific Q4 2024 results related to market share expansion or partnership closures are available in the database.",
              "citations": []
            },
            "['Q2', '2025']": {
              "answer": "No Q4 2024 actual results are provided in the database. The Q2 2025 data does not offer direct comparable information for market share expansion or partnership closures.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data lacks information on Q4 2024 market share expansion or partnership closures, preventing an evaluation of whether expectations were met."
          }
        },
        {
          "theme": "Operational Efficiency and Capacity Expansion",
          "narrative": "Aurobindo focuses on improving operational efficiency and expanding production capacity.  Specific actions and timelines are mentioned.",
          "management_guidance": {
            "answer": "Remediation efforts related to a compliance issue are expected to last another 3-4 months. USFDA filing completion is expected within the next 3 months. Capacity at the Theranym facility is expected to be aligned and commissioned by 2026.",
            "citations": [
              "193a1666b58da939b4686bb4a0899378",
              "5c217a8e798e1ccaca460bbb5cbd08b5",
              "6be08a8492eabb34418b6fc7bd1ef6d8"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 2025, approximately $9 million was spent on remediation costs related to the Eugia-3 plant. Further remediation costs in Q2 2025 were expected to be significantly lower, around $2 million. Note that these are costs, not direct indicators of completion of remediation efforts.",
              "citations": [
                "ada40290eb51b08701b95c127949037c",
                "2b3fac7ca1f47cf29adc769d622963a2"
              ]
            },
            "['Q4', '2024']": {
              "answer": "Remediation efforts were in their fourth month, with an expectation of another 3-4 months. No information on USFDA filing completion or Theranym facility progress is provided for Q4 2024.",
              "citations": [
                "193a1666b58da939b4686bb4a0899378"
              ]
            },
            "['Q2', '2025']": {
              "answer": "No Q4 2024 actual results are provided in the database. The Q2 2025 data doesn't directly address the completion of remediation efforts, USFDA filings, or Theranym facility capacity.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The remediation efforts were ongoing as expected, but there is no data on the USFDA filing or Theranym facility progress to fully assess performance against expectations."
          }
        }
      ]
    },
    "['Q1', '2024']": {
      "themes": [
        {
          "theme": "Financial Performance & Growth Targets",
          "narrative": "Management provided significant forward-looking statements regarding financial targets for the year,  specifically focusing on revenue growth, EBITDA margins, and geographic expansion.  These targets are presented as \"endeavors\" and reflect ambitious growth plans.  There's also discussion of specific regional targets (e.g., US and Europe).  The impact of the Revlimid loss is acknowledged, with management aiming to offset this through growth in other areas.",
          "management_guidance": {
            "answer": "The company aims to achieve a revenue of 500+ million USD for the year, excluding Revlimid; target 18%+ EBITDA for the year, potentially exceeding 20%; target 18% gross margin for the year excluding Revlimid; anticipate growth faster than the market (5-8% year-on-year at constant currency); specific regional targets include increasing US sales to 100+ million USD and overall Eugia sales to 130+ million USD.",
            "citations": [
              "199a01f0094a88145335de1ee912c20e",
              "f61df7f376dac421ccce022404a9ad17",
              "63a1342683709d47d8a5da8cea143f28",
              "72da6bda45f3d5fb52a8f4c5031cac1f",
              "008316fbeed40ae7012aacbc61b50a63",
              "e03f9709a9dd9d454deb06e18dbfd3e6"
            ]
          },
          "actual_results": {
            "['Q4', '2024']": {
              "answer": "No actual results for Q1 2024 are provided in the given data. The provided data pertains to Q4 2024 results.",
              "citations": []
            },
            "['Q1', '2024']": {
              "answer": "Aurobindo reported revenue from operations at Rs 6,851 crore (a 9.9% YoY increase); US revenue was US$ 402 Mn; EBITDA before Forex and Other income was Rs 1,151 crore (a 19.3% increase YoY), with an EBITDA margin of 16.8%; Gross margin for the quarter was 53.9%.  Eugia sales in the US reached US$ 90.9 Mn, and global Eugia sales reached USD 122 million on a pro forma basis.",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "89b37769941c3ad8e1bc78b333d95086",
                "24a5a2d8396aca9fcc2f78c48991b10a",
                "20f6343eeb0ba8b2a1522741306546d6",
                "27dd9bf2ad8c123e1c57c12c2c0ca242",
                "e03f9709a9dd9d454deb06e18dbfd3e6",
                "199a01f0094a88145335de1ee912c20e",
                "008316fbeed40ae7012aacbc61b50a63"
              ]
            },
            "['Q2', '2024']": {
              "answer": "Actual Q2 2024 results show revenue growth of 25.8% year-on-year to Rs 7,219 crore (USD equivalent needs conversion based on exchange rate during that period). US revenue (excluding Puerto Rico) reached US$ 409 million. EBITDA before forex and other income was Rs 1,403 crore, representing a margin of 19.4%. Gross margin was 55.2%. Specific figures for Eugia sales in the US and overall require further data and currency conversion.",
              "citations": [
                "287c1373f0112bcb9a784d9fa093a790",
                "c743ca6105f98f653767ce82b1bd3ed3",
                "b96f332ac77fb5035bea4d923968d0e0",
                "c548d7eba466a46a69aff5be9a66c421",
                "05a9c7a9107594759da67d142e63cdb5"
              ]
            },
            "['Q3', '2024']": {
              "answer": "No actual results for Q1 2024 are provided in the given data.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While Q1 2024 EBITDA margin (16.8%) and gross margin (53.9%) fell short of the full-year targets, the revenue growth and US Eugia sales showed positive progress toward the annual goals, making it a partial fulfillment of expectations.  Further data is needed to determine full-year performance."
          }
        },
        {
          "theme": "Biosimilars and Product Launches",
          "narrative": "Management highlighted the progress of biosimilar clinical trials and upcoming product launches as key drivers of future growth.  Specific timelines and expectations for launches in various markets (India, Europe, US) were mentioned.",
          "management_guidance": {
            "answer": "Launches in several markets are expected starting next year (FY25),  with one potential oncology biosimilar launch in India this year; By 2028, they anticipate at least four oncology products in Europe and two in the US,  with a total portfolio of six to seven products in regulated markets and a similar number (possibly more) in immunology for Rest of World markets; Maintaining a track record of 20+ product launches for the Eugia business is also a stated goal.",
            "citations": [
              "2e09d35be1847ee74e35a9e5e71fcbb5",
              "6340b6a629d6835f697d891e88f9553a",
              "95c6d54bfdcfd635e92eb72318942f27"
            ]
          },
          "actual_results": {
            "['Q4', '2024']": {
              "answer": "Actual results for biosimilar launches and clinical trial progress in Q1 2024 are not available in the provided data. Q4 2024 data shows completion of Phase-III recruitment for an osteoporosis biosimilar in Europe, completion of licensure clinical trials for three biosimilars, and successful completion of a Phase 3 clinical study for a metastatic breast cancer treatment. However, these are Q4 2024 results, not Q1 2024.",
              "citations": [
                "65d2569e6b87b2287b07a887e7f5aafd",
                "d54dfaa6595f46298d42000e73757e8d",
                "a0af34819ab9be6b1dccfed7346a47b0"
              ]
            },
            "['Q1', '2024']": {
              "answer": "No specific actual results for biosimilar launches or product launches in Q1 2024 are provided in the data.  The data does mention ongoing clinical trials involving 550 children.",
              "citations": [
                "6340b6a629d6835f697d891e88f9553a"
              ]
            },
            "['Q2', '2024']": {
              "answer": "Q2 2024 data shows that BP01 and BP02 oncology biosimilars completed Phase 1 and Phase 3 clinical studies respectively. BP11 (biosimilar to Xolair) advanced to global Phase 3 clinical trials. BP13 and BP14 oncology biosimilars completed licensure trials and are in the filing phase. The number of actual launches needs further data.",
              "citations": [
                "32a4d36443ca80d04254a77f74acec8c",
                "a0426792fc5cfb4dc36602fc6727ca78"
              ]
            },
            "['Q3', '2024']": {
              "answer": "No actual results for Q1 2024 are provided in the given data.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q1 2024 data lacks specific information on biosimilar launches or product launches to assess whether management's guidance was met, exceeded, or not met."
          }
        },
        {
          "theme": "Operational Improvements and Capacity Expansion",
          "narrative": "Aurobindo mentioned ongoing investments and expansion plans, including the completion of PLI facilities by April 1st, 2024, and the addition of new plants to improve capacity utilization and efficiency, potentially linked to Penicillin G production.",
          "management_guidance": {
            "answer": "PLI facilities and investments are expected to be completed before April 1, 2024; The China plant is expected to commence operations for the European market by April 2024; Additional forward derivative plants linked to the Pen G plant are planned, with an estimated investment of 150-200 crores.",
            "citations": [
              "f61df7f376dac421ccce022404a9ad17",
              "a43f8186f543116be60784c2f62f242f"
            ]
          },
          "actual_results": {
            "['Q4', '2024']": {
              "answer": "No Q1 2024 actual results are available in the provided data. The Q4 2024 data mentions the commercialization of 4 manufacturing plants in March 2024. This might relate to the planned capacity expansion, but it's not explicitly stated.",
              "citations": [
                "1c969507f2d551f6ed57f1edb888dc2d"
              ]
            },
            "['Q1', '2024']": {
              "answer": "The provided data mentions that the China plant's European market operations commencement is expected by April 2024, but doesn't offer specific results regarding PLI facility completion or Pen G plant expansion.  The data does show a net Capex for the quarter of 95.3 million, with 34 million allocated to PLI Capex and cumulative Capex for the Pen-G PLI project reaching USD 160 million by June 30th.",
              "citations": [
                "a43f8186f543116be60784c2f62f242f",
                "20f6343eeb0ba8b2a1522741306546d6"
              ]
            },
            "['Q2', '2024']": {
              "answer": "Q2 2024 results show the China plant received EU GMP approval. Further data is needed to verify the completion of PLI facilities and the commencement of the China plant operations and the progress on additional Pen G related plants.",
              "citations": [
                "5a40db9d01b3281832af6d0e28371e72"
              ]
            },
            "['Q3', '2024']": {
              "answer": "No actual results for Q1 2024 are provided in the given data.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "While some Q1 2024 data related to capital expenditures is available, it's insufficient to determine whether the planned completion of PLI facilities and commencement of China plant operations occurred as guided."
          }
        }
      ]
    },
    "['Q3', '2024']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Several clinical trial timelines are mentioned. The completion of a Phase 3 clinical study is anticipated (a7241e367d8b7af32c2238acea35c318). Recruitment for another trial is expected to conclude by October 2024, with submissions to regulatory bodies in Q2 or Q3 of the following fiscal year (67b7d58880d2349f92becbd68c33fc0c). Another trial's completion is expected in May 2024, with subsequent filings (eba0401512a062dd133b36a436ca479d). A product launch is anticipated in July 2024, pending no unforeseen hurdles (6cb3e8248cd268a8763a346c8528ded6).",
          "management_guidance": {
            "answer": "Several clinical trial timelines are mentioned.  The completion of a Phase 3 clinical study is anticipated (a7241e367d8b7af32c2238acea35c318). Recruitment for another trial is expected to conclude by October 2024, with submissions to regulatory bodies in Q2 or Q3 of the following fiscal year (67b7d58880d2349f92becbd68c33fc0c).  Another trial's completion is expected in May 2024, with subsequent filings (eba0401512a062dd133b36a436ca479d). A product launch is anticipated in July 2024, pending no unforeseen hurdles (6cb3e8248cd268a8763a346c8528ded6).",
            "citations": [
              "a7241e367d8b7af32c2238acea35c318",
              "67b7d58880d2349f92becbd68c33fc0c",
              "eba0401512a062dd133b36a436ca479d",
              "6cb3e8248cd268a8763a346c8528ded6"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 2025, Aurobindo completed recruitment for its Denosumab trial in European sites (e033c7a89b118e50c990db883ba90403). They also completed a Phase 3 clinical trial in India for their Tocilizumab biosimilar (46e57a52d8cea8f855ad94aa0ecfbd01). Recruitment for an oncology product reached approximately 80% completion (a009f99ebbc3bbc3a8a2dffd7ee01d22).",
              "citations": [
                "e033c7a89b118e50c990db883ba90403",
                "46e57a52d8cea8f855ad94aa0ecfbd01",
                "a009f99ebbc3bbc3a8a2dffd7ee01d22"
              ]
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo reported the successful completion of a Phase 3 clinical study in 690 metastatic breast cancer subjects (a0af34819ab9be6b1dccfed7346a47b0).  Additionally, the Phase-III recruitment for their omalizumab biosimilar was completed across 40 European sites, encompassing 436 osteoporosis patients (65d2569e6b87b2287b07a887e7f5aafd).  Three biosimilars completed licensure clinical trials and were filed (d54dfaa6595f46298d42000e73757e8d).  Total R&D spend was Rs. 392 Crore (5.2% of sales) (1c969507f2d551f6ed57f1edb888dc2d, 018bcf074c4a92d319fc8abf84635e65).",
              "citations": [
                "a0af34819ab9be6b1dccfed7346a47b0",
                "65d2569e6b87b2287b07a887e7f5aafd",
                "d54dfaa6595f46298d42000e73757e8d",
                "1c969507f2d551f6ed57f1edb888dc2d",
                "018bcf074c4a92d319fc8abf84635e65"
              ]
            },
            "['Q2', '2025']": {
              "answer": "In Q2 2025, a Phase 1 PK/PD clinical study was completed (c019b9995aa074644361b7686ea1a2b4). A Phase 3 clinical study in 690 metastatic breast cancer subjects was completed and met clinical endpoints (c019b9995aa074644361b7686ea1a2b4).",
              "citations": [
                "c019b9995aa074644361b7686ea1a2b4"
              ]
            },
            "['Q3', '2024']": {
              "answer": "A Phase 3 oncology clinical study (BP02) was completed successfully in Q3 FY24 and met clinical endpoints. Another Phase 1 respiratory clinical study (BP11) was completed, with an ongoing Phase 3 study in Europe. A pneumococcal vaccine trial concluded, resulting in an SEC recommendation.",
              "citations": [
                "a7241e367d8b7af32c2238acea35c318",
                "a7241e367d8b7af32c2238acea35c318",
                "d8f38a4adbd741d850b5b612e859a4be"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The actual results for Q3 2024 show the successful completion of a Phase 3 oncology study and a Phase 1 respiratory study, aligning with the management's guidance of completing several clinical trials within the specified timeframe.  The pneumococcal vaccine trial's successful conclusion further supports meeting expectations."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Seven ANDAs were filed with the USFDA in Q3 FY24 (7aaa9cdcd119b295a52f03a9c3694b65). Efforts are underway to resolve compliance issues by March 31, 2024 (cb08119f2a8e62eb49dc70e0b189cedc).",
          "management_guidance": {
            "answer": "Seven ANDAs were filed with the USFDA in Q3 FY24 (7aaa9cdcd119b295a52f03a9c3694b65).  Efforts are underway to resolve compliance issues by March 31, 2024 (cb08119f2a8e62eb49dc70e0b189cedc).",
            "citations": [
              "7aaa9cdcd119b295a52f03a9c3694b65",
              "cb08119f2a8e62eb49dc70e0b189cedc"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "As of June 30th, 2024, Aurobindo had 838 ANDAs filed with the US FDA cumulatively, with 668 having final approval and 26 having tentative approval (24336a5714cdedb21a30e4ff36ac7abe). Remediation actions related to the Eugia-3 plant impacted Q4 FY24 and Q1 FY25 (b6033cacac59078621b2c3d0b3e42744).",
              "citations": [
                "24336a5714cdedb21a30e4ff36ac7abe",
                "b6033cacac59078621b2c3d0b3e42744"
              ]
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo filed 11 ANDAs with the USFDA (32787dbea95672de6254ed7a0ac70364) and received approval for 17 ANDAs, including 4 Specialty & Injectable products (32787dbea95672de6254ed7a0ac70364).  As of March 31st, they had 830 ANDAs filed, with 658 having final approval and 27 tentative approvals (018bcf074c4a92d319fc8abf84635e65, 299b9684666d1677242ae3fd8fa71c24).  The Auro Peptides manufacturing facility underwent a US FDA inspection with zero observations (a2ec8ef084db343b28af57663362605b).  Management noted that while some ANDAs might be delayed, proactive actions were taken to ensure compliance (d18e3ce1e5687882c36d32546732b065). Remediation efforts were ongoing, with completion expected within 3-4 months (193a1666b58da939b4686bb4a0899378).",
              "citations": [
                "32787dbea95672de6254ed7a0ac70364",
                "018bcf074c4a92d319fc8abf84635e65",
                "299b9684666d1677242ae3fd8fa71c24",
                "a2ec8ef084db343b28af57663362605b",
                "d18e3ce1e5687882c36d32546732b065",
                "193a1666b58da939b4686bb4a0899378"
              ]
            },
            "['Q2', '2025']": {
              "answer": "In Q2 2025, Aurobindo filed 10 ANDAs with the USFDA and received approval for 8 products (e1f0c637eff3718592d6bc93e1eb1c4b, 02526114f04485a67e50227aa3504a4d). They also launched 14 products (e1f0c637eff3718592d6bc93e1eb1c4b). A marketing authorization (MA) was received for Trastuzumab in India (257191118292dc1d76b60db2f033773b).",
              "citations": [
                "e1f0c637eff3718592d6bc93e1eb1c4b",
                "02526114f04485a67e50227aa3504a4d",
                "257191118292dc1d76b60db2f033773b"
              ]
            },
            "['Q3', '2024']": {
              "answer": "Seven ANDAs were filed with the USFDA in Q3 FY24. Approval was received for 16 ANDAs, including 7 specialty and injectable products. Licensure trials were completed and filings made with EMEA for two oncology products.",
              "citations": [
                "7aaa9cdcd119b295a52f03a9c3694b65",
                "7aaa9cdcd119b295a52f03a9c3694b65",
                "8dd6da125dba762f93317d2809f5ec4d",
                "a7241e367d8b7af32c2238acea35c318"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Exceeded",
            "evaluation_reason": "Aurobindo not only met the target of filing seven ANDAs but also exceeded expectations by receiving approval for 16 ANDAs and making significant progress with EMEA filings for oncology products."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "A 20% profit increase is targeted for the next quarter (ce2129d5d04ef0f519a31fdb7342b440). A 15% revenue growth projection for the biosimilar segment is anticipated in the next fiscal year (56325c615496aaf1b226b0b3b0e64dbe). Maintaining a revenue run rate of $150 million+ in the coming quarters is the objective, with a potential $20 million impact in Q4 (0309d7c17162be191ebd3c0485e8c27d, 44e13d6b36ed6fcecb0dead7b7c1b5d8). A specific quarterly run rate is also mentioned, though impacted by a clawback (a8b3670cff9244d44d87dff1b6f56123). Further revenue generation is expected from new plants, starting in Q1/Q2 FY25 (343db7b91b121d131d18b4207c9213aa). Specific revenue projections are given for a particular product, ranging from $120 million to $180 million by 2028 (df8f632b774b38a7b3ac0dde9d87b559, 0e600e3ac4954493d2ceca3752211856). Cost reduction initiatives are mentioned, aiming for a 10% decrease in operational costs over the next two quarters (56325c615496aaf1b226b0b3b0e64dbe). An EBITDA margin of 20% is the target (0bdb21fa38c8012be4088faabf7b00e8). Further growth in gross profit margin is also anticipated (7e6eb27a360cb0dde2a12c0137352a8b).",
          "management_guidance": {
            "answer": "A 20% profit increase is targeted for the next quarter (ce2129d5d04ef0f519a31fdb7342b440).  A 15% revenue growth projection for the biosimilar segment is anticipated in the next fiscal year (56325c615496aaf1b226b0b3b0e64dbe).  Maintaining a revenue run rate of $150 million+ in the coming quarters is the objective, with a potential $20 million impact in Q4 (0309d7c17162be191ebd3c0485e8c27d, 44e13d6b36ed6fcecb0dead7b7c1b5d8).  A specific quarterly run rate is also mentioned, though impacted by a clawback (a8b3670cff9244d44d87dff1b6f56123).  Further revenue generation is expected from new plants, starting in Q1/Q2 FY25 (343db7b91b121d131d18b4207c9213aa).  Specific revenue projections are given for a particular product, ranging from $120 million to $180 million by 2028 (df8f632b774b38a7b3ac0dde9d87b559, 0e600e3ac4954493d2ceca3752211856). Cost reduction initiatives are mentioned, aiming for a 10% decrease in operational costs over the next two quarters (56325c615496aaf1b226b0b3b0e64dbe).  An EBITDA margin of 20% is the target (0bdb21fa38c8012be4088faabf7b00e8).  Further growth in gross profit margin is also anticipated (7e6eb27a360cb0dde2a12c0137352a8b).",
            "citations": [
              "ce2129d5d04ef0f519a31fdb7342b440",
              "56325c615496aaf1b226b0b3b0e64dbe",
              "0309d7c17162be191ebd3c0485e8c27d",
              "44e13d6b36ed6fcecb0dead7b7c1b5d8",
              "a8b3670cff9244d44d87dff1b6f56123",
              "343db7b91b121d131d18b4207c9213aa",
              "df8f632b774b38a7b3ac0dde9d87b559",
              "0e600e3ac4954493d2ceca3752211856",
              "0bdb21fa38c8012be4088faabf7b00e8",
              "7e6eb27a360cb0dde2a12c0137352a8b"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 FY25, Aurobindo reported a 10% year-on-year increase in overall revenue (c45761bf69733561e65706db60884c32, af88e0d66e55f334d5a955d3baf3c9ad). US formulation revenue grew by 12% year-on-year to $426 million (24336a5714cdedb21a30e4ff36ac7abe, af88e0d66e55f334d5a955d3baf3c9ad). Net profit increased by 61% year-on-year to Rs. 919 crores (af88e0d66e55f334d5a955d3baf3c9ad). The EBITDA margin was 21.4%, in line with expectations (af88e0d66e55f334d5a955d3baf3c9ad). Gross margin stood at 59.4% (44e21167abb8856b2d2ce953c4aff17e). A supply chain disruption impacted Q1 revenue by approximately $15-20 million (69d7a66ddb69637b702f161694a93042).",
              "citations": [
                "c45761bf69733561e65706db60884c32",
                "af88e0d66e55f334d5a955d3baf3c9ad",
                "24336a5714cdedb21a30e4ff36ac7abe",
                "44e21167abb8856b2d2ce953c4aff17e",
                "69d7a66ddb69637b702f161694a93042"
              ]
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo's revenue from operations reached Rs 7,580 Crore, a 17.1% YoY increase (1c969507f2d551f6ed57f1edb888dc2d).  Net profit after minority interest was Rs 909 Crore (79.6% YoY growth, -2.9% QoQ decrease) (1c969507f2d551f6ed57f1edb888dc2d).  US revenue (excluding Puerto Rico) was USD 432 Mn (20.4% YoY increase, -4.2% QoQ decrease) (32787dbea95672de6254ed7a0ac70364).  EBITDA before Forex and Other income was Rs 1,687 Crore (22.3% margin) (ee8178da6c3090cf7db392f855ac9eac, 1c969507f2d551f6ed57f1edb888dc2d).  Gross profit increased by 27.6% YoY, with a 490 bps YoY improvement in gross margin (de327a1a1571af775ec6379120f97c1c).  The supply chain disruption resulted in a $20 million impact as projected (though specific citation connecting this to the actual impact is missing).",
              "citations": [
                "1c969507f2d551f6ed57f1edb888dc2d",
                "32787dbea95672de6254ed7a0ac70364",
                "ee8178da6c3090cf7db392f855ac9eac",
                "de327a1a1571af775ec6379120f97c1c"
              ]
            },
            "['Q2', '2025']": {
              "answer": "In Q2 2025, Aurobindo reported an 8% year-on-year revenue growth (7,796 Cr) and an 8.6% year-on-year net profit growth (817 Cr) (b0d0da0ae383df85b89f0b6e5c838679). The US market saw 4.3% YoY growth, Europe 19% YoY growth, and Growth Markets a 44% YoY increase (689010bf793af464fb0cc7a20586252d). Total formulations increased by 11.3% YoY (689010bf793af464fb0cc7a20586252d). Consolidated sales (excluding Puerto Rico) showed 9.3% YoY growth (689010bf793af464fb0cc7a20586252d). US revenue (excluding Puerto Rico) was $421 million (e1f0c637eff3718592d6bc93e1eb1c4b). The base business (excluding transient and long-term impacts) grew by 7% QoQ (e1f0c637eff3718592d6bc93e1eb1c4b). EBITDA was ₹ 1,566 Cr, with 11.6% YoY growth (b0d0da0ae383df85b89f0b6e5c838679). Base EBITDA margin was around 21% (e1f0c637eff3718592d6bc93e1eb1c4b).",
              "citations": [
                "b0d0da0ae383df85b89f0b6e5c838679",
                "689010bf793af464fb0cc7a20586252d",
                "e1f0c637eff3718592d6bc93e1eb1c4b"
              ]
            },
            "['Q3', '2024']": {
              "answer": "Revenue from operations was Rs 7,352 Crore, a 14.7% YoY increase. US revenue (excluding Puerto Rico) was US$ 451 Mn. Net profit after minority interest was Rs 936 Crore, with a YoY growth of 90.6% and QoQ growth of 23.7%. EBITDA before Forex and other income was Rs 1,601 Crore, reflecting a margin of 21.8%. Gross profit was 4,201 crore, a 20% increase YoY. The Eugia business achieved a quarterly revenue run rate exceeding $150 million.",
              "citations": [
                "8dd6da125dba762f93317d2809f5ec4d",
                "90b708e0b2a894eaa9a89f129480439a",
                "8dd6da125dba762f93317d2809f5ec4d",
                "90b708e0b2a894eaa9a89f129480439a",
                "8dd6da125dba762f93317d2809f5ec4d",
                "0678e018015e59fcf60b05b224a61968",
                "90b708e0b2a894eaa9a89f129480439a",
                "6645ac3479b7d846b809761157062671",
                "0309d7c17162be191ebd3c0485e8c27d",
                "44e13d6b36ed6fcecb0dead7b7c1b5d8"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Exceeded",
            "evaluation_reason": "Aurobindo significantly exceeded the projected profit increase, achieving a substantial YoY growth in net profit and surpassing the targeted EBITDA margin.  The Eugia business also exceeded the $150 million revenue run rate target."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "A second wave of product launches is anticipated in 2026/27 (bb38538c7ab73abc34f78889dad12229). News regarding manufacturing and commercial sales of certain products from a joint venture is expected in early fiscal year 2025 (fb638ea057b0e6f0170797bfd7d5f84c).",
          "management_guidance": {
            "answer": "A second wave of product launches is anticipated in 2026/27 (bb38538c7ab73abc34f78889dad12229).  News regarding manufacturing and commercial sales of certain products from a joint venture is expected in early fiscal year 2025 (fb638ea057b0e6f0170797bfd7d5f84c).",
            "citations": [
              "bb38538c7ab73abc34f78889dad12229",
              "fb638ea057b0e6f0170797bfd7d5f84c"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 FY25, Aurobindo shipped its first commercial product for BFS in China through its JV partner (e7bc63d5521ec36a60711b0aa56b1fc2).",
              "citations": [
                "e7bc63d5521ec36a60711b0aa56b1fc2"
              ]
            },
            "['Q4', '2024']": {
              "answer": "No specific actual results related to these aspects of the innovation pipeline are provided in the Q4 2024 data.  However, the launch of 7 products in Q4, including one specialty and injectable product, demonstrates progress (32787dbea95672de6254ed7a0ac70364).  The company also commercialized 4 manufacturing plants in March 2024 (1c969507f2d551f6ed57f1edb888dc2d).",
              "citations": [
                "32787dbea95672de6254ed7a0ac70364",
                "1c969507f2d551f6ed57f1edb888dc2d"
              ]
            },
            "['Q2', '2025']": {
              "answer": "In Q2 2025, Aurobindo launched 14 products (02526114f04485a67e50227aa3504a4d). There is no information available from the provided data to confirm information on the joint venture.",
              "citations": [
                "02526114f04485a67e50227aa3504a4d"
              ]
            },
            "['Q3', '2024']": {
              "answer": "No specific actual results are provided in the data for this theme in Q3 2024.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data lacks specific information on the innovation pipeline's performance in Q3 2024, making it impossible to assess whether expectations were met, exceeded, or not met."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "A supply chain disruption is acknowledged, with an estimated impact of $20 million in Q4 and a projected recovery within 1-2 months (0bdb21fa38c8012be4088faabf7b00e8, f2307ad256c544b75579d5a60f1bc19a).",
          "management_guidance": {
            "answer": "A supply chain disruption is acknowledged, with an estimated impact of $20 million in Q4 and a projected recovery within 1-2 months (0bdb21fa38c8012be4088faabf7b00e8, f2307ad256c544b75579d5a60f1bc19a).",
            "citations": [
              "0bdb21fa38c8012be4088faabf7b00e8",
              "f2307ad256c544b75579d5a60f1bc19a"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "The supply chain disruption continued to impact Q1 FY25, resulting in approximately a $15-20 million revenue impact (69d7a66ddb69637b702f161694a93042).",
              "citations": [
                "69d7a66ddb69637b702f161694a93042"
              ]
            },
            "['Q4', '2024']": {
              "answer": "The provided Q4 data does not contain specific details about the resolution of the supply chain disruption, but the $20 million impact was apparently realized.  The data does not offer a clear indication whether the 1-2 month recovery timeline was met.",
              "citations": []
            },
            "['Q2', '2025']": {
              "answer": "The provided data does not contain actual results related to the supply chain disruption's impact or recovery timeframe in Q2 2025.",
              "citations": []
            },
            "['Q3', '2024']": {
              "answer": "While a supply chain disruption was mentioned impacting Q4, there's no data in the provided actuals for its impact in Q3 2024. There is mention of backup manufacturing capacity.",
              "citations": [
                "875c6d0ff4e2f302a302af5953e6730d"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided Q3 2024 data does not contain information on the supply chain disruption's impact during that quarter, preventing an evaluation of whether expectations were met."
          }
        }
      ]
    },
    "['Q2', '2024']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo's R&D spending in Q2 2024 was lower than projected due to the completion of major clinical trials in June.  The company anticipates a return to higher spending (Rs. 350-400 crore) in Q3 2024 as new phases of clinical trials begin.  They also estimate R&D expenditure of Rs. 750-800 crore in the second half of the fiscal year.",
          "management_guidance": {
            "answer": "Q3 2024 R&D expenditure: Rs. 350-400 crore; Second half of FY24 R&D expenditure: Rs. 750-800 crore; Completion of BP08 Phase 3 clinical study: April/May 2024; Phase 3 trials for a new product: First subject dosing expected in the next quarter; Filing of three biosimilars (Pegylated filgrastim, Filgrastim, and Trastuzumab) before the end of January 2024.",
            "citations": [
              "c6ff82527158f973546133f5ac756760",
              "6e8f1ae6f4130b2c27070f22c5f968b9",
              "32a4d36443ca80d04254a77f74acec8c",
              "32a4d36443ca80d04254a77f74acec8c",
              "2e81e861cd8c86b5a00cadec292be07b"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "In Q1 2025, R&D expenditure was Rs. 339 crores (4.5% of revenue). Multiple clinical trials reached significant milestones: Denosumab trial completed patient recruitment in European sites; Tocilizumab biosimilar Phase 3 trial completed in India; and an oncology product reached 80% patient recruitment.",
              "citations": [
                "44e21167abb8856b2d2ce953c4aff17e",
                "e033c7a89b118e50c990db883ba90403",
                "46e57a52d8cea8f855ad94aa0ecfbd01",
                "a009f99ebbc3bbc3a8a2dffd7ee01d22"
              ]
            },
            "['Q4', '2024']": {
              "answer": "Actual Q4 2024 R&D expenditure was Rs. 392 Crore (5.2% of sales).  The completion of Phase 3 clinical studies for Omalizumab biosimilar (meeting PK/PD endpoints), and Trastuzumab biosimilar (completed licensure trials and filed with EMEA) are mentioned.  Also, a Phase 3 trial for a product in 690 metastatic breast cancer subjects successfully met clinical endpoints.",
              "citations": [
                "1c969507f2d551f6ed57f1edb888dc2d",
                "018bcf074c4a92d319fc8abf84635e65",
                "4ff5780333cb8867f57998ecb22d5702",
                "65d2569e6b87b2287b07a887e7f5aafd",
                "d54dfaa6595f46298d42000e73757e8d",
                "a0af34819ab9be6b1dccfed7346a47b0"
              ]
            },
            "['Q2', '2024']": {
              "answer": "R&D expenditure for Q2 2024 was Rs. 300 crore, representing 4.2% of revenue. Various clinical trials were completed (BP01, BP02) and others were ongoing (BP11).",
              "citations": [
                "b96f332ac77fb5035bea4d923968d0e0",
                "c6ff82527158f973546133f5ac756760",
                "6e8f1ae6f4130b2c27070f22c5f968b9",
                "a0426792fc5cfb4dc36602fc6727ca78",
                "32a4d36443ca80d04254a77f74acec8c"
              ]
            },
            "['Q3', '2024']": {
              "answer": "In Q3 2024, R&D expenditure was Rs. 398 crore. BP02 Oncology Phase 3 clinical study was completed successfully. BP11 Respiratory Phase 1 study completed, Phase 3 ongoing. Updates were given on the pneumococcal vaccine trial.",
              "citations": [
                "8dd6da125dba762f93317d2809f5ec4d",
                "0678e018015e59fcf60b05b224a61968",
                "a7241e367d8b7af32c2238acea35c318",
                "d8f38a4adbd741d850b5b612e859a4be",
                "0e600e3ac4954493d2ceca3752211856"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "While Q2 R&D spending was lower than the projected Q3 spending,  management clearly stated that this was due to the completion of major clinical trials and that higher spending was anticipated in subsequent quarters, aligning with their overall guidance."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Aurobindo is actively engaged in the regulatory filing process for its products.  They expect to complete filings in major markets within 8-10 weeks and anticipate an FDA filing in the next quarter, pending scientific advice.  A CHMP audit for Filgrastim and Peg filgrastim is expected in Q1 of the next year.",
          "management_guidance": {
            "answer": "Completion of regulatory filings in major markets: within the next 8-10 weeks; FDA filing: Expected in the next quarter, pending scientific advice; CHMP audit for Filgrastim and Peg filgrastim: Expected in Q1 of the next year.",
            "citations": [
              "32a4d36443ca80d04254a77f74acec8c",
              "32a4d36443ca80d04254a77f74acec8c",
              "43abb32226160a208d27ced1190c6126"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "As of June 30th, Aurobindo had 838 ANDAs filed with the US FDA, with 668 having final approval and 26 having tentative approval. Remediation actions related to the Eugia-3 plant impacted Q4 FY24 and Q1 FY25.",
              "citations": [
                "24336a5714cdedb21a30e4ff36ac7abe",
                "b6033cacac59078621b2c3d0b3e42744"
              ]
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo filed 11 ANDAs with the USFDA, received approval for 17 ANDAs (including 4 specialty & injectable products), and launched 7 products.  A Type 2 meeting on PEGylated Filgrastim was completed. Auro Peptides facility passed a US FDA inspection with zero observations.  The company had 830 ANDAs filed with the USFDA, of which 658 had final approval and 27 had tentative approval.",
              "citations": [
                "1c969507f2d551f6ed57f1edb888dc2d",
                "32787dbea95672de6254ed7a0ac70364",
                "a0af34819ab9be6b1dccfed7346a47b0",
                "299b9684666d1677242ae3fd8fa71c24",
                "ac05436de86ac98978ae1cea0c4a6c59",
                "018bcf074c4a92d319fc8abf84635e65",
                "4092655e5eba42e16400e5cb570de04c",
                "a2ec8ef084db343b28af57663362605b",
                "2acd0fd94061635bbaa623bb4a29a49d"
              ]
            },
            "['Q2', '2024']": {
              "answer": "As of September 30, 2023, Aurobindo had 817 ANDAs filed with the U.S. FDA, with 628 final approvals and 32 tentative approvals. BP13 and BP14 completed licensure trials and are in the filings phase. One product was submitted to the CHMP, with a second awaiting rapporteur assignment. The China plant received EU GMP approval.",
              "citations": [
                "32a4d36443ca80d04254a77f74acec8c",
                "b96f332ac77fb5035bea4d923968d0e0",
                "5a40db9d01b3281832af6d0e28371e72",
                "2e81e861cd8c86b5a00cadec292be07b"
              ]
            },
            "['Q3', '2024']": {
              "answer": "In Q3 2024, 7 ANDAs were filed with the USFDA and approval was received for 16 products (including 7 specialty and injectable products). BP13 and BP14 Oncology completed licensure trials and were filed with EMEA. Further information is available on filings in South Africa and FDA approval for a product was received. Filings from the Vizag plant were mentioned.",
              "citations": [
                "8dd6da125dba762f93317d2809f5ec4d",
                "7aaa9cdcd119b295a52f03a9c3694b65",
                "a7241e367d8b7af32c2238acea35c318",
                "366b4f849a360556e6cfa2d4d2093c10",
                "6cb3e8248cd268a8763a346c8528ded6",
                "875c6d0ff4e2f302a302af5953e6730d"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q2 2024 actual results provide a snapshot of the regulatory landscape but do not directly address the timeframe for completing filings in major markets or the FDA filing, making a complete evaluation impossible based solely on the provided data."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "Aurobindo expects to achieve its internal target of a 20%+ EBITDA margin for the year. The company anticipates continued growth in its generic injectable business in the US market, with a potential increase in quarterly revenue from USD 80 million to USD 90 million.  They also project USD 560 million in global revenue for Eugia Specialities in FY24.  The China plant is expected to begin revenue generation by the end of Q4 FY24 or early Q1 FY25.  ARV business quarterly sales are projected to be around USD 25 million (plus or minus five).  Strategic CapEx is expected to be in the range of USD 100-150 million for biosimilars.  The company aims for a 20% gross margin. Net cash is expected to be between $0 and $50 million by year-end.",
          "management_guidance": {
            "answer": "Achievement of 20%+ EBITDA margin target for the year; Eugia Specialities global revenue for FY24: USD 560 million; Generic injectable business revenue in the US: Potential increase from USD 80 million to USD 90 million per quarter; China plant revenue generation: End of Q4 FY24 or early Q1 FY25; ARV business quarterly sales: Approximately USD 25 million (plus or minus five); Strategic CapEx for biosimilars: USD 100-150 million; Gross margin target: 20%; Net cash by year-end: Between $0 and $50 million; Pen-G project capitalization: Q4; Biosimilar plant full commissioning: FY26 or early FY26, revenue streams in calendar year 2026 or fiscal year 2027.",
            "citations": [
              "c6961e38f19969f2d8697275a5954a4e",
              "f241652d68b79163b061a0718ef04980",
              "b96f332ac77fb5035bea4d923968d0e0",
              "a64c51053dc3689ee8c58aee0385633a",
              "5a40db9d01b3281832af6d0e28371e72",
              "34fa57dba85d409bdee007efaa569ef7",
              "88fac62c3156257db1bc1495ff37283f",
              "67e4922841d2f345467704c0e08184fe",
              "b989b03e3d75c51885199c0a06fc175e",
              "8054ebb99726faa4f7e5b095f52ed376",
              "ff85243aeefbea4e02463f8a7b19d1f3"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "Overall revenue increased by 10% year-on-year in Q1 2025 (Rs. 7,567 crores or approximately $915 million). US formulation revenue grew by 12% year-on-year to $426 million; European formulation revenue increased by 8% year-on-year to Rs. 1,982 crores (€221 million); Growth market revenue increased by 49% year-on-year to Rs. 709 crores ($85 million). ARV formulation business revenue increased by 14% year-on-year to Rs. 229 crores ($27 million). EBITDA margin was 21.4%, in line with expectations. Gross margin was 59.4%. The Pen-G plant experienced sales disruptions in Q1 2025, impacting revenue. Net profit increased by 61% year-on-year to Rs. 919 crores.",
              "citations": [
                "c45761bf69733561e65706db60884c32",
                "24336a5714cdedb21a30e4ff36ac7abe",
                "af88e0d66e55f334d5a955d3baf3c9ad",
                "44e21167abb8856b2d2ce953c4aff17e",
                "0884694f79ebe2e2715f3c1fa6033503",
                "53335a8bb0e013b70f77166c44570fb1",
                "ada40290eb51b08701b95c127949037c",
                "28aef6ca52968543346f2dad6fb7f503",
                "69d7a66ddb69637b702f161694a93042",
                "86a8f72f377eea6abceb9d3732eaa338",
                "af88e0d66e55f334d5a955d3baf3c9ad",
                "e6483073eeb03b07f2f62e7ad53c3333"
              ]
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo reported revenue from operations at Rs 7,580 Crore (17.1% YoY increase).  US revenue (excluding Puerto Rico) was USD 432 million (20.4% YoY increase, -4.2% QoQ decrease). Specialty & Injectables revenue in the US was ~USD 104 Mn (24% of total US revenue). Global Specialty & Injectables revenue was ~USD 143 Mn.  EBITDA before Forex and Other income was Rs 1,687 Crore (22.3% margin). Net profit after minority interest was Rs 909 Crore (79.6% YoY growth, -2.9% QoQ decrease). Gross margin was 59.6% for the quarter and 56.5% for the year.",
              "citations": [
                "906e6d55f2f80c752467c57792d253f6",
                "ee8178da6c3090cf7db392f855ac9eac",
                "1c969507f2d551f6ed57f1edb888dc2d",
                "941ce064a5135a87d8f2c3b694b251fa",
                "32787dbea95672de6254ed7a0ac70364",
                "de327a1a1571af775ec6379120f97c1c",
                "018bcf074c4a92d319fc8abf84635e65",
                "4ed066cb2c4145a1362ba5b207199ece",
                "f022eab2b5e656fe5b3526ecf8be0373",
                "b4b7b4f763e4e66d4cf9f6fbaf741883"
              ]
            },
            "['Q2', '2024']": {
              "answer": "Revenue from operations was Rs 7,219 crore (a 25.8% YoY increase). US revenues (excluding Puerto Rico) were USD 409 million. EBITDA (before forex and other income) was Rs 1,403 crore, representing a 19.4% margin. Gross margin was 55.2%. Net profit was Rs 752 crore. ARV business revenue was USD 30 million. Net cash at the end of June was approximately $180 million, and approximately $130 million at the time of the report, with a $50 million reduction attributed to acquisition financing.",
              "citations": [
                "287c1373f0112bcb9a784d9fa093a790",
                "4a8f7567e1da8906bfe6ca59a3f24b8b",
                "c743ca6105f98f653767ce82b1bd3ed3",
                "b96f332ac77fb5035bea4d923968d0e0",
                "c548d7eba466a46a69aff5be9a66c421",
                "34fa57dba85d409bdee007efaa569ef7",
                "b989b03e3d75c51885199c0a06fc175e"
              ]
            },
            "['Q3', '2024']": {
              "answer": "In Q3 2024, revenue from operations was Rs 7,352 Crore, a 14.7% YoY increase. US revenues (excluding Puerto Rico) were US$ 451 Mn. Net Profit after minority interest was Rs 936 Crore. EBITDA before Forex and Other income was Rs 1,601 Crore, a margin of 21.8%. Gross profit was 4,201 crore. Net profit margin was 12.7%. Eugia revenue information is available.",
              "citations": [
                "8dd6da125dba762f93317d2809f5ec4d",
                "90b708e0b2a894eaa9a89f129480439a",
                "6645ac3479b7d846b809761157062671",
                "7aaa9cdcd119b295a52f03a9c3694b65",
                "54d1593c87a68423d37ab0e23a7fa873",
                "0309d7c17162be191ebd3c0485e8c27d",
                "44e13d6b36ed6fcecb0dead7b7c1b5d8"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the ARV business exceeded expectations and net cash was significantly higher than predicted, the EBITDA margin of 19.4% fell short of the 20%+ target.  The gross margin of 55.2% was also below the stated 20% target. The data is insufficient to evaluate the Eugia revenue."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Aurobindo plans to launch 40 new products over the next 12 months.  They expect a second wave of product launches in 2026/27 for one specific product.",
          "management_guidance": {
            "answer": "Launch of 40 new products: Over the next 12 months; Second wave of launches for a specific product: 2026/27.",
            "citations": [
              "a069d52b12741fd6ad192f8baf6b7050",
              "a0426792fc5cfb4dc36602fc6727ca78"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "No Q1 2025 actual results are provided in the data for this theme.",
              "citations": []
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo launched 7 products including 1 Specialty & Injectable product.  They also commercialized 4 manufacturing plants.",
              "citations": [
                "32787dbea95672de6254ed7a0ac70364",
                "1c969507f2d551f6ed57f1edb888dc2d"
              ]
            },
            "['Q2', '2024']": {
              "answer": "No specific actual results for Q2 2024 were provided in the data.",
              "citations": []
            },
            "['Q3', '2024']": {
              "answer": "21 products were launched during the quarter, including 4 specialty and injectable products. Another source mentions 10 new product launches in the US market.",
              "citations": [
                "7aaa9cdcd119b295a52f03a9c3694b65",
                "56325c615496aaf1b226b0b3b0e64dbe"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "No Q2 2024 actual results on product launches are available to assess progress against the 40-product launch target."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Aurobindo's Pen-G and 6-APA plants are under installation and expected to be operational from Q4 FY24 or Q1 FY25.  Potential partnerships related to these plants are expected from 2027 onwards.",
          "management_guidance": {
            "answer": "Pen-G and 6-APA plant operation: Q4 FY24 or Q1 FY25; Potential partnerships related to plants: From 2027 onwards.",
            "citations": [
              "5a40db9d01b3281832af6d0e28371e72",
              "ff85243aeefbea4e02463f8a7b19d1f3"
            ]
          },
          "actual_results": {
            "['Q1', '2025']": {
              "answer": "The Pen-G plant experienced sales disruptions impacting Q1 2025 revenue.",
              "citations": [
                "0884694f79ebe2e2715f3c1fa6033503"
              ]
            },
            "['Q4', '2024']": {
              "answer": "In Q4 2024, Aurobindo was manufacturing approximately 47 billion units of formulation.",
              "citations": [
                "4092655e5eba42e16400e5cb570de04c"
              ]
            },
            "['Q2', '2024']": {
              "answer": "No specific actual results for Q2 2024 were provided in the data related to plant operations. However, there was mention of high capacity utilization for formulation.",
              "citations": [
                "0367e7704983d0bc2aeffa32153762eb",
                "88fac62c3156257db1bc1495ff37283f"
              ]
            },
            "['Q3', '2024']": {
              "answer": "Information on Vizag plant capacity and its role as a backup for Eugia III is provided. Additional information about product lines is also available.",
              "citations": [
                "875c6d0ff4e2f302a302af5953e6730d",
                "a8b3670cff9244d44d87dff1b6f56123"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data lacks specific information on the progress of the Pen-G and 6-APA plant installations during Q2 2024, preventing an evaluation of whether the timeline was met."
          }
        }
      ]
    },
    "['Q4', '2023']": {
      "themes": [
        {
          "theme": "Regulatory Approvals and Commercialization",
          "narrative": "Management extensively discussed the anticipated commercialization of ANDAs and the progress of various regulatory filings with agencies like the US FDA and the European Medicines Agency (EMA).  A significant focus was placed on the timeline for these approvals and their expected impact on revenue.",
          "management_guidance": {
            "answer": "Management anticipates the commercialization of approximately 40 ANDAs during the fiscal year, which is expected to contribute significantly to top-line revenue. A filing with the EMA is expected by September, and a filing with the US FDA by Q4 of the fiscal year. Regulatory procedures for a specific product are expected to conclude between Q2 of the current year and Q2 of the next, leading to subsequent launches in regulated markets. A specific product filing is planned for 2025, potentially two quarters ahead of a formulation patent expiration in the US. 5-6 filings are planned from a specific plant during the fiscal year, with commercialization anticipated in FY25, pending FDA audit. Regarding a specific product, the company is close to exhausting the procedural clock stop allowed by the EMEA/CHMP, with a deadline of June 20th.  Further actions depend on receiving draft GMP inspection observations.",
            "citations": [
              "f1026ecb56d52e2f1cce5da4162f041a",
              "4cef312e57fc1f2f66b75621a57abd65",
              "a0b2e9f11dd6282d1d63df5f474a33d7",
              "ad82a7c0fbaca8089c277998f95d8e98",
              "f4920e1e41cca95f29348d49e2520097",
              "5b4ef1bf44a32e50f52af06aeec52eae"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "In Q1 FY24, 19 ANDAs received final approval and 15 products were launched. As of June 30th, 2023, 613 ANDAs had final approval from the US FDA.",
              "citations": [
                "6102e4376a64b325cef12be7cb3474b8"
              ]
            },
            "['Q2', '2024']": {
              "answer": "No specific actual results for Q4 2023 are provided in the given data.",
              "citations": []
            },
            "['Q3', '2024']": {
              "answer": "No actual results for Q4 2023 are provided in the given data.",
              "citations": []
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results for the number of ANDA approvals or commercializations in Q4 2023. However, the data shows that 26 ANDAs received final approval and 10 products were launched during Q4 FY23.",
              "citations": [
                "c344259ea85b587caacf055d183d7853",
                "47d59efec09fb93a29cdd868dcb795cf",
                "0ed34299a714643e1ae85b6623b2ed8c",
                "22335da61fae6c1a8a4ca030a1525c2e",
                "ae9d6caa4638aab0d7d9bb5cfd585f09",
                "eb10e8606a8d9185efcf32796623f2e1"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the number of ANDA approvals and product launches in Q4 FY23 was substantial, the provided data does not allow for a complete assessment against all aspects of the management's guidance, particularly regarding the specific timelines for regulatory filings and launches."
          }
        },
        {
          "theme": "Financial Performance and Growth",
          "narrative": "Management provided forward-looking statements regarding revenue growth, aiming for double-digit growth driven by new product launches and commercialization of ANDAs.  Discussion also included projections for revenue targets and expectations regarding gross margins and EBITDA margins.",
          "management_guidance": {
            "answer": "Revenue is projected to reach Rs 6,500 Crore by the next quarter. A 10% revenue growth target is set for the end of the next fiscal year. Double-digit revenue growth is anticipated, supported by healthy approvals. A specific business unit is expected to achieve double-digit growth in FY25. A goal of 15% revenue increase is set for the end of the next fiscal year. Good cash generation is expected from FY25 onwards. New product launches will contribute to top-line revenue in the next 12 months. Eugia business, with a current topline of approximately Rs. 3,300 crores (USD 411 million), is expected to continue its double-digit growth journey, boosted by the addition of Revlimid. The company aims to enhance EBITDA margin to 17% in the upcoming fiscal year. Gross margins for a specific business unit are expected to be between 60% and 70%, with EBITDA levels around 25% to 35%. Regarding overall company-level gross margins, incremental improvement is anticipated, possibly reaching the midpoint between the current margin and 20% during the year.",
            "citations": [
              "c11c8187a7044e0259851c31799486d0",
              "cb967904bace866207aff8f23ab05ff3",
              "668a249df640c1a56292179be8584719",
              "f1026ecb56d52e2f1cce5da4162f041a",
              "a49b0a375037eba78242715da04a4708",
              "51e635444677656a51659fffdff9da47",
              "86ba022de33836f1e11ae1e8d881810e",
              "8bd08c6346fa1ed438fdfb0655e77175",
              "c11c8187a7044e0259851c31799486d0",
              "89c371631110a47111cd137ec7fd1908",
              "1c80322e4d75f6df0005dd397784a10a"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "Q1 FY24 revenue from operations was Rs 6,851 crore (9.9% YoY increase). EBITDA before forex and other income was Rs 1,151 crore (16.8% margin). Gross margin was 53.9%.",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "24a5a2d8396aca9fcc2f78c48991b10a",
                "c3166d5f87f3074d0aec8fc67b0d4b6e",
                "20f6343eeb0ba8b2a1522741306546d6"
              ]
            },
            "['Q2', '2024']": {
              "answer": "In Q2 FY24, revenue was Rs 7,219 crore, a 25.8% YoY increase. This surpasses the Rs 6,500 Crore projection for Q1 FY24. Further details on other metrics are available in the Q2 FY24 data, but comparing them directly to the FY24 guidance requires further calculation and context not provided.",
              "citations": [
                "c548d7eba466a46a69aff5be9a66c421",
                "287c1373f0112bcb9a784d9fa093a790",
                "c743ca6105f98f653767ce82b1bd3ed3",
                "4a8f7567e1da8906bfe6ca59a3f24b8b"
              ]
            },
            "['Q3', '2024']": {
              "answer": "In Q3 2024, revenue from operations was Rs 7,352 Crore (a 14.7% YoY increase). US revenues (excluding Puerto Rico) were US$ 451 Mn.  The EBITDA before Forex and other income was Rs 1,601 Crore, a 21.8% margin.  These results show significant growth but don't provide a complete picture against all aspects of the guidance given.",
              "citations": [
                "54d1593c87a68423d37ab0e23a7fa873",
                "8dd6da125dba762f93317d2809f5ec4d",
                "7aaa9cdcd119b295a52f03a9c3694b65",
                "6645ac3479b7d846b809761157062671",
                "90b708e0b2a894eaa9a89f129480439a",
                "0678e018015e59fcf60b05b224a61968"
              ]
            },
            "['Q4', '2023']": {
              "answer": "Revenue for Q4 FY23 reached Rs 6,473 Crore, showing an 11.4% YoY increase. US revenue was US$ 370 million. EBITDA before forex and other income was Rs 1,002.2 crore.  The Eugia business reported a topline of approximately Rs. 3,300 crores (USD 411 million).",
              "citations": [
                "c11c8187a7044e0259851c31799486d0",
                "077f2d14281d3e9e882e598552cc6568",
                "009677b9deb69c764200f9774225084f",
                "151a774290d72de5b71a1704c24acb46",
                "bfab39809aedf09cc113cb26f2bed418",
                "f9ec80ec56febbfcb9fab0891adb4a8a",
                "c344259ea85b587caacf055d183d7853",
                "22335da61fae6c1a8a4ca030a1525c2e",
                "8bd08c6346fa1ed438fdfb0655e77175"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "Q4 FY23 revenue exceeded the Rs 6,500 Crore projection for the next quarter,  demonstrating a strong performance in line with the projected double-digit growth."
          }
        },
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Management discussed plans to increase R&D spending to support new product development, particularly in the area of peptides.  Specific plans for DMF filings were also mentioned.",
          "management_guidance": {
            "answer": "A 15% increase in R&D spending is planned for the next quarter to facilitate new product development. Approximately Rs. 400 crores per quarter is likely to be spent on R&D, irrespective of turnover. A DMF filing for another GLP-1 analogue is expected by the end of the year.",
            "citations": [
              "cb967904bace866207aff8f23ab05ff3",
              "b90fcbcd138c8e30dbbf2511307be5f4",
              "eb10e8606a8d9185efcf32796623f2e1"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "Q1 FY24 R&D spend was Rs 388 crore (5.7% of revenue).",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "20f6343eeb0ba8b2a1522741306546d6"
              ]
            },
            "['Q2', '2024']": {
              "answer": "In Q2 FY24, R&D expenditure was Rs. 300 crores, representing 4.2% of revenue. This is lower than the projected Rs. 400 crores. Information on DMF filings is not available from the provided data.",
              "citations": [
                "b96f332ac77fb5035bea4d923968d0e0",
                "c6ff82527158f973546133f5ac756760",
                "6e8f1ae6f4130b2c27070f22c5f968b9"
              ]
            },
            "['Q3', '2024']": {
              "answer": "In Q3 2024, total R&D spend was Rs. 398 Crore (5.4% of revenue).",
              "citations": [
                "8dd6da125dba762f93317d2809f5ec4d",
                "0678e018015e59fcf60b05b224a61968"
              ]
            },
            "['Q4', '2023']": {
              "answer": "R&D spend in Q4 FY23 was Rs 410.7 crore (6.3% of revenue).",
              "citations": [
                "077f2d14281d3e9e882e598552cc6568",
                "b90fcbcd138c8e30dbbf2511307be5f4",
                "22335da61fae6c1a8a4ca030a1525c2e",
                "ae9d6caa4638aab0d7d9bb5cfd585f09",
                "20bd121c15ae8309e03b64d9ecf74d08",
                "a0b2e9f11dd6282d1d63df5f474a33d7"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While Q4 R&D spending (Rs 410.7 crore) was close to the projected quarterly amount (Rs 400 crore), there's no information on whether the DMF filing was completed as planned within the given data."
          }
        },
        {
          "theme": "Supply Chain and Capacity Expansion",
          "narrative": "Management highlighted the commissioning of new plants in the US and China, impacting capacity and future revenue streams.",
          "management_guidance": {
            "answer": "A portion of a US facility was commissioned in March 2023, with the balance expected to be commissioned by FY23 or FY25. The China plant is expected to be commissioned in Q1 FY25.  A plant producing Pen-G is expected to be commissioned by FY23 but with an aim to complete ahead of schedule. A biosimilar plant is expected to be commissioned by FY23.",
            "citations": [
              "ae9d6caa4638aab0d7d9bb5cfd585f09"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "The European inspection for the China plant is over.",
              "citations": [
                "a43f8186f543116be60784c2f62f242f"
              ]
            },
            "['Q2', '2024']": {
              "answer": "No specific actual results for Q4 2023 are provided in the given data for plant commissioning. The Q2 FY24 data does not contain information directly addressing the commissioning timelines of these plants.",
              "citations": []
            },
            "['Q3', '2024']": {
              "answer": "No specific actual results related to plant commissioning timelines are available in the provided Q3 2024 data.",
              "citations": []
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results on the commissioning of plants in Q4 2023. Citation (ae9d6caa4638aab0d7d9bb5cfd585f09) mentions the status of US FDA-approved FDF units, but doesn't directly address plant commissioning timelines.",
              "citations": [
                "ae9d6caa4638aab0d7d9bb5cfd585f09"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data for Q4 2023 lacks information on the actual commissioning status of the plants mentioned in the management guidance."
          }
        }
      ]
    },
    "['Q2', '2023']": {
      "themes": [
        {
          "theme": "Research and Development (R&D) Expansion and Pipeline Development",
          "narrative": "Aurobindo Pharma is significantly investing in R&D, particularly in biosimilars and injectables,  aiming for a higher R&D expenditure as a percentage of revenue.  The company anticipates multiple product launches and filings across various therapeutic areas.  Specific milestones include phase 3 initiation for an immunology program and unblinding clinical trial data for other programs, leading to subsequent filings.",
          "management_guidance": {
            "answer": "R&D expenditure is expected to increase to approximately 6% of revenue. A phase 3 first patient injection milestone for an immunology program is expected by Q4 FY23. Unblinding of clinical trial data will commence at the end of Q3 FY23, with filings starting in Q1/Q2 of the next fiscal year. EMA and FDA filings are projected by August/September 2023 and October/November 2023, respectively. The company aims to file at least 3 products per quarter, starting in May 2023. Approximately 20 product launches are anticipated in FY23, with a similar number of filings each year. The company also projects around 40 product launches in the next 12 months. Biosimilar revenue is expected to commence in Q3 or Q4 of the next fiscal year. Revenue from new products tied to partnerships is expected in late FY24 and early FY25. Over the next two years, more than 200 new products will be launched, broadening the oral solid portfolio. A new biosimilar plant, costing approximately Rs. 300 crores, is under construction.",
            "citations": [
              "d136e2c9ed4566656670e5d755152b9d",
              "c6dd3aa194268ed2dc222d0e296e1153",
              "15aa0519bfe95b028876e74a33778ab0",
              "5d64713bb441b01cbee30315c43acc91",
              "98e8a61ca881fdf3d54ef0b7575f76cc",
              "ba89bd712139b512b6845e277d08e5d0",
              "45e079605f180a0be0067c2fa49ab274",
              "cd7777f3780bcd83ca9782a7230aeb1e",
              "44f862fc084d77a6140cecbb73f0a480",
              "5d64713bb441b01cbee30315c43acc91",
              "d9e5eafdc6bb41e35b974d3e4564a8d3",
              "8a5c1571e6a7d5746cb8c04a497e53b7"
            ]
          },
          "actual_results": {
            "['Q4', '2023']": {
              "answer": "In Q4 FY23, R&D expenditure was 6.3% of revenue (Rs 410.7 crore). Information on specific milestones (phase 3 initiation, unblinding of clinical trial data, filings, product launches) in Q4 FY23 is not provided in the given data.",
              "citations": []
            },
            "['Q1', '2024']": {
              "answer": "In Q1 FY24, R&D spend was Rs 388 crore, representing 5.7% of revenue. Information on specific milestones (phase 3 initiation, unblinding of data, filings) and the number of product launches and filings during Q2 2023 is not provided in the given data for this theme.",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "20f6343eeb0ba8b2a1522741306546d6"
              ]
            },
            "['Q3', '2023']": {
              "answer": "In Q3 FY23, R&D expenditure was Rs 415.2 crore (6.5% of revenue), significantly higher than Rs. 275.6 crore (4.8%) in Q2 FY23. A substantial portion (Rs 180 crore) of the increased spending was attributed to biosimilars. Management stated that this was the highest R&D spend in any quarter to their memory. Specific details on other milestones (phase 3 initiation, unblinding of clinical trial data, filings) weren't explicitly provided in the Q3 results, though the increase in R&D spend strongly suggests progress toward these goals.",
              "citations": [
                "3aa7df684e264d92bdc09707a744a4b3",
                "292800153225282b370128952d92407d",
                "15671aa190ea0708577162b7d49a7e9d",
                "7031fc2ed6f98dfb0c702177f376a4df",
                "831e977176205e77b2567a23172178ae"
              ]
            },
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, R&D expenditure was 4.8% of revenue (Rs 276 crore). The randomization of all 690 subjects in the phase 3 efficacy trial for a biosimilar was completed. No further information on other milestones (EMA/FDA filings, product launches) was provided in the available data for Q2 2023.",
              "citations": [
                "df0de8b51be602b42be8f219e88e148b",
                "a5eca36e349844298a105cec69bd0978",
                "d136e2c9ed4566656670e5d755152b9d",
                "15aa0519bfe95b028876e74a33778ab0"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "R&D expenditure in Q2 FY23 (4.8% of revenue) fell short of the projected 6% target, and while the phase 3 trial randomization was completed, other key milestones were not achieved or reported within the Q2 2023 timeframe."
          }
        },
        {
          "theme": "Financial Performance and Growth Strategy",
          "narrative": "Aurobindo Pharma projects significant revenue growth, driven by various factors including expansion in injectables and biosimilars.  The company is also focusing on cost optimization to improve margins. Challenges exist in specific areas, such as Vasopressin, but the company expresses optimism for future growth.",
          "management_guidance": {
            "answer": "A revenue growth target of 15% is set for the end of FY23. A 10% annual revenue growth target is set for the next three years. Double-digit revenue growth is expected for injectables, even excluding Revlimid. The company aims to cut operational costs by 10% in the next quarter. EBITDA margins are projected to exceed 15% in coming quarters, driven by biosimilars, oncology, and injectables. The company expects 5-7% growth to continue.",
            "citations": [
              "c671dd5f607e061a2c404250f57bff36",
              "0282f4e224d04299de87efb0927725a2",
              "456719713b488d2b844bf4a63fd7cd1c",
              "c671dd5f607e061a2c404250f57bff36",
              "d136e2c9ed4566656670e5d755152b9d",
              "d9e5eafdc6bb41e35b974d3e4564a8d3"
            ]
          },
          "actual_results": {
            "['Q4', '2023']": {
              "answer": "In Q4 FY23, revenue growth was 11.4% YoY. EBITDA margin information for Q4 FY23 is available but specific comparison to the guidance of exceeding 15% is not directly stated.",
              "citations": []
            },
            "['Q1', '2024']": {
              "answer": "In Q1 FY24, revenue from operations increased by 9.9% year-over-year to Rs 6,851 crore. EBITDA before forex and other income was Rs 1,151 crore, resulting in a 16.8% EBITDA margin. Specific Q2 2023 results for revenue growth and EBITDA margin are unavailable in the provided data for this theme.",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "24a5a2d8396aca9fcc2f78c48991b10a",
                "c3166d5f87f3074d0aec8fc67b0d4b6e",
                "20f6343eeb0ba8b2a1522741306546d6",
                "89b37769941c3ad8e1bc78b333d95086"
              ]
            },
            "['Q3', '2023']": {
              "answer": "In Q3 FY23, revenue increased by 6.7% year-on-year and 11.6% quarter-on-quarter, reaching Rs. 6,407 crores. Formulation business grew by 9.2% YoY and 14.3% QoQ. US revenue increased by 9.3% YoY and 13.8% QoQ. EBITDA margin (before forex and other income) was 14.9%, reaching Rs 954.4 crore. While specific cost reduction figures weren't explicitly stated, management highlighted some cost savings. The actual revenue growth fell short of the 15% target for FY23, but Q3 results show strong sequential growth. Further data is needed to assess the achievement of the 10% annual target for the next three years and the EBITDA margin target.",
              "citations": [
                "610d6578c3cda808c7780112b4202d43",
                "989cb20b3fe149d725d19ce49008102c",
                "6440495b16765e2712efc6606b55752c",
                "6d8e5da59d58b78216f74a5690d9daa4",
                "e780996327088c6d566d1581453db272",
                "e9c92a987bf92b15c80c11c4b0640ca9",
                "497d13c659a135ecf9e7d0531093d3bf",
                "36e1a82d6399a4795f0bcc6b6e2cd05d",
                "292800153225282b370128952d92407d",
                "b84a8fc505397602db8d2b6c463d1583",
                "e7654fa75b6a053cb456c419f46fd592",
                "7ee66e55daaee504f0abc1ed1210d103",
                "7f627af6e37a5e81e9ba1b4bf847de1e",
                "d70924f6793762900e240aee6fc95591",
                "acddd50c64703e10890150a9e80b43c9",
                "de1124f6476d2ba21fa1ed31446de97e",
                "b5dd10050c88b00a8a286cc89070d466",
                "21fbc7aa06c94f358b741eb427394bdb",
                "3aa7df684e264d92bdc09707a744a4b3",
                "e780996327088c6d566d1581453db272",
                "989cb20b3fe149d725d19ce49008102c",
                "b84a8fc505397602db8d2b6c463d1583",
                "e7654fa75b6a053cb456c419f46fd592"
              ]
            },
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, the company registered a revenue of Rs. 5,739 crores, a decrease of 3.4% year-on-year. US revenue decreased by 11% YoY and QoQ. European revenue declined by 2.1% QoQ. The EBITDA before Forex and other income was Rs. 836.9 crores. Specific details on EBITDA margin and operational cost reduction were not directly provided in the available data, though one statement mentions an EBITDA strengthening to 13% of net sales.",
              "citations": [
                "df0de8b51be602b42be8f219e88e148b",
                "df194fb58c8fcb42f1bbc8209c711da3",
                "68e00d0135dadefeda24c37bb44d1b82",
                "5cd869d24993d46ef6e63bb8d105b45e",
                "24ebf1aae812769d60be6acf484666e3",
                "6a9f08a342c016fcc297179e74dd6ffc",
                "0282f4e224d04299de87efb0927725a2",
                "c5ef1402ac9997f5caca28b0a7b31e98",
                "a5eca36e349844298a105cec69bd0978",
                "c73e7aedeac72b7e5e57223ee2d2c36e",
                "b29c9dced56b46eb7549b63adadec405",
                "012702b2aff0aa48bfbfbd1025528d40",
                "d136e2c9ed4566656670e5d755152b9d",
                "456719713b488d2b844bf4a63fd7cd1c",
                "13cacdd696843a3bf773f032a7579dcd"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "Q2 FY23 revenue showed a significant year-on-year decrease (3.4%), falling far short of the 15% growth target for FY23 and the projected double-digit growth for injectables.  Information on EBITDA margin and cost reduction targets was insufficient to assess performance against expectations."
          }
        },
        {
          "theme": "Regulatory Approvals and Market Expansion",
          "narrative": "Aurobindo Pharma is focused on securing regulatory approvals for its products in key markets, including India, Europe, and the US.  The company is actively working to resolve regulatory compliance issues for a new facility and anticipates generating revenue from this facility by the end of FY24.  The company also anticipates gains in market share in specific segments.",
          "management_guidance": {
            "answer": "A new facility is expected to start generating revenue by the end of FY24. An immunology program trial is expected to close in Q1 FY24, with subsequent filing in Europe and the US. A 15% increase in market share in the peptides segment is projected by the end of the next fiscal year.",
            "citations": [
              "bb791c26dded1cf9b97347e5433eb7b5",
              "c6dd3aa194268ed2dc222d0e296e1153",
              "0282f4e224d04299de87efb0927725a2"
            ]
          },
          "actual_results": {
            "['Q4', '2023']": {
              "answer": "The given data does not contain actual results for Q4 FY23 related to the new facility's revenue generation, the immunology program trial completion, filings, or the peptides market share increase. However, 26 ANDAs received final approval and 10 products were launched during Q4 FY23. Additionally, 171 injectables were filed, with 126 receiving final approval and 45 under review or tentative approval.",
              "citations": []
            },
            "['Q1', '2024']": {
              "answer": "The provided data does not contain actual results for Q2 2023 regarding the new facility's revenue generation, the immunology program trial completion, or the peptide market share increase. In Q1 FY24, 19 ANDAs received final approval, and 15 products were launched. Cumulative US FDA ANDA filings totaled 814, with 613 final and 34 tentative approvals as of June 30, 2023.",
              "citations": [
                "6102e4376a64b325cef12be7cb3474b8",
                "c9c3d3d5235dfbd5b44b0b6a0bf3499c"
              ]
            },
            "['Q3', '2023']": {
              "answer": "Q3 FY23 results do not provide specific updates on the new facility's progress or revenue generation, the immunology program trial closure, or peptide market share gains. Further information is needed to assess progress on these fronts.",
              "citations": []
            },
            "['Q2', '2023']": {
              "answer": "No specific data on actual results related to regulatory approvals, facility revenue generation, or market share gains in the peptides segment were available in the provided Q2 2023 data.",
              "citations": [
                "bb791c26dded1cf9b97347e5433eb7b5",
                "c6dd3aa194268ed2dc222d0e296e1153",
                "0282f4e224d04299de87efb0927725a2"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided Q2 2023 data lacks information on the progress of the new facility, the immunology program trial, and peptide market share, preventing an assessment of performance against the stated guidance."
          }
        },
        {
          "theme": "Supply Chain Optimization and Capacity Expansion",
          "narrative": "Aurobindo Pharma is actively working on optimizing its supply chain, including increasing manufacturing capacity in India.  A new plant is under construction and is expected to be operational in FY25-26.",
          "management_guidance": {
            "answer": "A new plant is expected to be ready for commercial supplies in FY25-26. The new plant will have a production capacity of approximately 15,000 metric tonnes.",
            "citations": [
              "3907652bc9e5628a0b561c9d083684fb",
              "d136e2c9ed4566656670e5d755152b9d"
            ]
          },
          "actual_results": {
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results for Q4 FY23 regarding the new plant's progress or supply chain optimization metrics.",
              "citations": []
            },
            "['Q1', '2024']": {
              "answer": "The provided data does not offer specific Q2 2023 results concerning supply chain optimization or the new plant's progress.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "In Q3 FY23, management reported that civil works for the new plant were 75-80% complete, and purchase orders for mechanical and electrical components had been issued for over Rs. 1,500 crores. No information was provided on the timeline for completion or commercial operations. Freight costs were reduced in Q2 and Q3.",
              "citations": [
                "b5dd10050c88b00a8a286cc89070d466",
                "204fbad089f62a95280c90aeb2fd765c"
              ]
            },
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, approximately 55% of products had been moved to India. No further data was available on the new plant's progress.",
              "citations": [
                "3907652bc9e5628a0b561c9d083684fb",
                "d136e2c9ed4566656670e5d755152b9d",
                "c3c77adae4cc1bab4bf3c30d9265c608"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The Q2 2023 data shows progress in shifting production to India (55% complete), aligning with the overall supply chain optimization narrative, although no specific information is provided on the new plant's construction progress, which is expected to be completed later."
          }
        }
      ]
    },
    "['Q3', '2023']": {
      "themes": [
        {
          "theme": "Research and Development (R&D) Pipeline and Spending",
          "narrative": "Management highlighted the maturation of its Biosimilars pipeline, with three products in Phase III clinical trials.  One is nearing completion, and two others are in progress with significant recruitment already achieved.  A significant investment (USD 250 million) is planned for the Penicillin G project.",
          "management_guidance": {
            "answer": "R&D expenditure for the fiscal year is projected to be between 6% and 6.5% of revenue.  Clinical expenditure for Biosimilars is expected to continue for at least another 6-7 quarters.",
            "citations": [
              "21ba016e2cf3c1b11dff8654f981c2cb",
              "ace59337ee9ce7ecc8e4f53bd9939aff",
              "831e977176205e77b2567a23172178ae"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "R&D spend was Rs 388 crore in Q1FY24, 5.7% of revenue. There is mention of an ongoing two plus one dosing trial in about 550 children.",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "20f6343eeb0ba8b2a1522741306546d6",
                "6340b6a629d6835f697d891e88f9553a"
              ]
            },
            "['Q2', '2024']": {
              "answer": "In Q2 2024, R&D expenditure was Rs. 300 crores (approximately USD 36 million), representing 4.2% of revenue. Multiple clinical trials were ongoing, including advancement of BP11 into a global Phase 3 study and completion of Phase 1 and 3 studies for BP01 and BP02 respectively.",
              "citations": [
                "b96f332ac77fb5035bea4d923968d0e0",
                "c6ff82527158f973546133f5ac756760",
                "6e8f1ae6f4130b2c27070f22c5f968b9",
                "a0426792fc5cfb4dc36602fc6727ca78",
                "32a4d36443ca80d04254a77f74acec8c"
              ]
            },
            "['Q4', '2023']": {
              "answer": "Research & Development spend was Rs 410.7 crore in Q4FY23 (6.3% of revenue). One biosimilar clinical trial (Trastuzumab) completed the treatment phase in 690 subjects.",
              "citations": [
                "077f2d14281d3e9e882e598552cc6568",
                "b90fcbcd138c8e30dbbf2511307be5f4",
                "a0b2e9f11dd6282d1d63df5f474a33d7"
              ]
            },
            "['Q3', '2023']": {
              "answer": "R&D spend in Q3 FY23 was Rs 415.2 crore (6.5% of revenue), up from Rs 275.6 crore (4.8% of revenue) in Q2 FY23. Biosimilars contributed significantly to this increase, with expenditure rising from Rs 75 crore in the previous quarter to Rs 180 crore in Q3.",
              "citations": [
                "3aa7df684e264d92bdc09707a744a4b3",
                "292800153225282b370128952d92407d",
                "15671aa190ea0708577162b7d49a7e9d",
                "7031fc2ed6f98dfb0c702177f376a4df",
                "831e977176205e77b2567a23172178ae"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "R&D spending in Q3 FY23 reached the high end of the projected range (6.5% of revenue), and biosimilar spending increased significantly as anticipated, aligning with management's guidance for continued investment over several quarters."
          }
        },
        {
          "theme": "Regulatory Approvals and Commercialization Timeline",
          "narrative": "Management discussed the anticipated timelines for regulatory approvals and subsequent commercialization of several products.  This includes an antibody product, a PCV vaccine, and a monoclonal antibody targeting India, Emerging Markets, Europe, and the US.",
          "management_guidance": {
            "answer": "The antibody product is expected to have at least one quarter of sales in the next fiscal year, contingent on Q2 approval. The PCV vaccine's commercialization is planned for two quarters after receiving the manufacturing license (anticipated in April-May). Filing for the monoclonal antibody is slated for July in India and Emerging Markets, September with the European Medicines Agency, and December with the USFDA. The first US biosimilar approval is anticipated in 2025.",
            "citations": [
              "09c3606a1224773a2a060f72e62d3abe",
              "9efbed4e1b5b020927c5a82463296902",
              "877801658c35df8fd0c06513da367e10"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "No specific actual results for regulatory approvals or commercialization timelines are provided in the Q1 2024 data.",
              "citations": []
            },
            "['Q2', '2024']": {
              "answer": "Actual results regarding specific approvals and commercialization timelines for the antibody product, PCV vaccine, and monoclonal antibody in Q2 2024 are not explicitly provided in the data. However, data indicates some progress on the regulatory front with completed licensure trials and filings for BP13 and BP14. Additionally, a submission to the CHMP for one product and pending assignment of rapporteurs for a second are mentioned.",
              "citations": [
                "32a4d36443ca80d04254a77f74acec8c",
                "2e81e861cd8c86b5a00cadec292be07b"
              ]
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results for this theme in Q4 2023. Information on approvals and launches is available but does not directly correlate to the specific management guidance timelines.",
              "citations": [
                "c344259ea85b587caacf055d183d7853",
                "eb10e8606a8d9185efcf32796623f2e1"
              ]
            },
            "['Q3', '2023']": {
              "answer": "No specific actual results for approvals or commercialization timelines are provided in the data for Q3 2023.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided Q3 2023 data lacks information on actual regulatory approvals or commercialization progress for the mentioned products, preventing an assessment against management's guidance."
          }
        },
        {
          "theme": "Financial Performance and Growth Projections",
          "narrative": "Management provided revenue growth targets for various segments and discussed expectations for future cash flow generation.  Specific projections were made for Biosimilars, formulations, and the impact of new product launches.",
          "management_guidance": {
            "answer": "A 15% revenue increase in the Biosimilars segment is targeted by the end of the next fiscal year. A 10% growth in the formulations segment is anticipated for FY23. Double-digit sequential growth is expected in Q4 and Q1 of the next fiscal year. Conservative estimates project approximately USD 50 million in annual revenue from new products, potentially higher. The Penicillin G project (USD 250 million) is expected to generate cash flow starting in FY25, with positive cash flow anticipated in FY24 as well. Another projection suggests a revenue target of $121-$125 million for the next financial year.",
            "citations": [
              "497d13c659a135ecf9e7d0531093d3bf",
              "7f627af6e37a5e81e9ba1b4bf847de1e",
              "acddd50c64703e10890150a9e80b43c9",
              "9b73ddaa5bd9220db8e561b8f2234d1c",
              "d70924f6793762900e240aee6fc95591",
              "7031fc2ed6f98dfb0c702177f376a4df",
              "21fbc7aa06c94f358b741eb427394bdb"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "Revenue from operations was Rs 6,851 crore, a 9.9% YoY increase. US revenue increased by 11.2% YoY and 8.5% QoQ to Rs. 3,304 crores. Growth Markets revenue increased by 12.9% YoY. ARV business revenue was Rs 190 crore. Formulation business grew 6.6% QoQ to Rs. 5,817.2 crores. API business revenue was 1,033.3 crores, a 14% YoY increase. Eugia Injectable US business revenue increased by 11.7% YoY and 11.4% QoQ to USD 80.1 million. Global Eugia Pharma Speciality sales were USD 122 million. Europe Formulations revenue was 1,836.8 crores, an 18.6% YoY increase. Net cash position, including investments, was USD 178 million.",
              "citations": [
                "5a8de2e26426aa8a8a2ed2584d91a466",
                "24a5a2d8396aca9fcc2f78c48991b10a",
                "c3166d5f87f3074d0aec8fc67b0d4b6e",
                "27dd9bf2ad8c123e1c57c12c2c0ca242",
                "6102e4376a64b325cef12be7cb3474b8",
                "20f6343eeb0ba8b2a1522741306546d6",
                "a00f9b202daf1a164e9b89cf121e88b2"
              ]
            },
            "['Q2', '2024']": {
              "answer": "In Q2 2024, Aurobindo Pharma reported a 25.8% year-on-year revenue increase to Rs 7,219 crore (approximately USD 870 million). US revenue (excluding Puerto Rico) reached USD 409 million, a 31% YoY and 7% QoQ increase. Net profit increased by 83.6% year-on-year to Rs 752 crores (approximately USD 90 million). EBITDA before forex and other income grew to Rs 1,403 crore (approximately USD 169 million), reflecting a margin of 19.4%.",
              "citations": [
                "287c1373f0112bcb9a784d9fa093a790",
                "4a8f7567e1da8906bfe6ca59a3f24b8b",
                "c743ca6105f98f653767ce82b1bd3ed3",
                "05a9c7a9107594759da67d142e63cdb5",
                "c548d7eba466a46a69aff5be9a66c421",
                "b96f332ac77fb5035bea4d923968d0e0",
                "3d62b668c72926c7b0385b288e36fd62"
              ]
            },
            "['Q4', '2023']": {
              "answer": "Revenue from operations reached 6,473.0 crores in Q4FY23, an 11.4% year-over-year increase. US revenue increased by 11.6% YoY and 1.4% QoQ to Rs. 3,044.5 crores. EBITDA before forex and other income grew by 2.8% year on year to Rs. 1,002.2 crores. Net Profit increased to Rs. 505.9 crores.",
              "citations": [
                "009677b9deb69c764200f9774225084f",
                "077f2d14281d3e9e882e598552cc6568",
                "c344259ea85b587caacf055d183d7853",
                "cb967904bace866207aff8f23ab05ff3",
                "151a774290d72de5b71a1704c24acb46",
                "f9ec80ec56febbfcb9fab0891adb4a8a",
                "bfab39809aedf09cc113cb26f2bed418"
              ]
            },
            "['Q3', '2023']": {
              "answer": "In Q3 FY23, revenue was Rs 6,407 crore, a 6.7% increase YoY and 11.6% QoQ. US revenue increased by 9.3% YoY and 13.8% QoQ to Rs 3,001.2 crore (46.8% of consolidated revenue). Formulation business grew by 9.2% YoY and 14.3% QoQ to Rs 5,452 crore. API business revenue was Rs 955 crore (15% of total revenue). European formulation revenue reached Rs 1,701 crore, a marginal 4% YoY increase and 12.2% QoQ increase. Growth market revenue increased by 26% to Rs 499 crore. ARV business revenue was Rs 251 crore, a 61% YoY increase (47% in dollar terms).",
              "citations": [
                "610d6578c3cda808c7780112b4202d43",
                "989cb20b3fe149d725d19ce49008102c",
                "6440495b16765e2712efc6606b55752c",
                "6d8e5da59d58b78216f74a5690d9daa4",
                "e780996327088c6d566d1581453db272",
                "e9c92a987bf92b15c80c11c4b0640ca9",
                "497d13c659a135ecf9e7d0531093d3bf",
                "36e1a82d6399a4795f0bcc6b6e2cd05d",
                "292800153225282b370128952d92407d",
                "b84a8fc505397602db8d2b6c463d1583",
                "e7654fa75b6a053cb456c419f46fd592",
                "7ee66e55daaee504f0abc1ed1210d103",
                "7f627af6e37a5e81e9ba1b4bf847de1e",
                "d70924f6793762900e240aee6fc95591",
                "acddd50c64703e10890150a9e80b43c9",
                "de1124f6476d2ba21fa1ed31446de97e",
                "b5dd10050c88b00a8a286cc89070d466",
                "21fbc7aa06c94f358b741eb427394bdb"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While overall revenue showed growth exceeding the YoY guidance for FY23 formulations (9.2% vs 10%), the Biosimilars segment's performance and the overall revenue target for the next financial year cannot be evaluated based solely on Q3 data.  Further data is needed to assess the full year performance against the annual targets."
          }
        },
        {
          "theme": "New Product Launches and Market Expansion",
          "narrative": "Management outlined plans for numerous new product launches and expansion into new geographical markets.  This includes specialty products and ANDAs.",
          "management_guidance": {
            "answer": "The launch of 10 new specialty products is planned within the next two quarters. Approximately 40 ANDAs are expected to be commercialized over the next 12 months. An immunology biosimilar is planned for the US market by 2025-2026. Commercialization in EMEA is anticipated before the end of the next fiscal year for at least one product, with a second product launch possible in Q1 or Q2 of the following fiscal year.  Similar timelines are projected for Canada.",
            "citations": [
              "497d13c659a135ecf9e7d0531093d3bf",
              "9b73ddaa5bd9220db8e561b8f2234d1c",
              "49ff34dab1ae14bca2c54caaae6ca637",
              "877801658c35df8fd0c06513da367e10",
              "d5cce5c2dec8383593e581ea4ff1ece8",
              "acddd50c64703e10890150a9e80b43c9"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "19 ANDAs received final approval and 15 products were launched in Q1 FY24. As of June 30th, 2023, there were 613 final ANDA approvals in the US.",
              "citations": [
                "6102e4376a64b325cef12be7cb3474b8",
                "c9c3d3d5235dfbd5b44b0b6a0bf3499c"
              ]
            },
            "['Q2', '2024']": {
              "answer": "Specific numbers of new product launches and ANDA commercializations in Q2 2024 are not detailed in the provided data.",
              "citations": []
            },
            "['Q4', '2023']": {
              "answer": "26 ANDAs received final approval and 10 products were launched during Q4.",
              "citations": [
                "c344259ea85b587caacf055d183d7853"
              ]
            },
            "['Q3', '2023']": {
              "answer": "No specific actual results for new product launches or market expansion are provided in the data for Q3 2023.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q3 2023 data lacks details on new product launches or market expansion, preventing assessment against management's guidance."
          }
        },
        {
          "theme": "Supply Chain and Capital Expenditure",
          "narrative": "Management addressed the timing of capital expenditures related to various projects.",
          "management_guidance": {
            "answer": "The arrival of materials for various projects is expected between April and June, with installation slated for July to September. Commissioning of several projects is anticipated to begin by March 31, 2024.",
            "citations": [
              "4f48731d31e2e18a43ab0e249c1bf770",
              "326296bcc76533c40d2745d4e44315f9"
            ]
          },
          "actual_results": {
            "['Q1', '2024']": {
              "answer": "No specific actual results related to supply chain or capital expenditure timing are provided in the Q1 2024 data.",
              "citations": []
            },
            "['Q2', '2024']": {
              "answer": "The provided data does not offer specific information on the completion status of these projects in Q2 2024. However, it does mention high capacity utilization for formulations suggesting supply chain is managing demand.",
              "citations": [
                "0367e7704983d0bc2aeffa32153762eb",
                "88fac62c3156257db1bc1495ff37283f"
              ]
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results for this theme in Q4 2023.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "Freight costs saw significant reduction in Q2 and Q3. Civil works for a project were 75-80% complete, with purchase orders exceeding Rs 1,500 crore issued for mechanical and electrical components.",
              "citations": [
                "204fbad089f62a95280c90aeb2fd765c",
                "b5dd10050c88b00a8a286cc89070d466"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The progress on civil works (75-80% complete) and significant purchase orders suggest the project is on track to meet the anticipated commissioning date by March 31, 2024, aligning with management's guidance on timing."
          }
        }
      ]
    },
    "['Q3', '2022']": {
      "themes": [
        {
          "theme": "Financial Performance",
          "narrative": "Management provided mixed signals regarding financial performance in Q3 2022. While some statements suggest a bottoming out of performance and anticipation of improvement, others indicate continued challenges and muted growth in certain areas.  There's a strong emphasis on future revenue targets, both organic and inorganic.",
          "management_guidance": {
            "answer": "A revenue growth target of 15% by the end of the fiscal year is mentioned. A revenue target of $500 million by the end of the fiscal year is also stated. A three-year goal of reaching 1,000 crore sales is mentioned, with a strategy including both organic and inorganic growth. A $650-700 million run rate for the injectable business in FY24 is anticipated. Q3 is considered the bottom, with expectations of stabilization or improvement thereafter. Double-digit growth is expected for the next year. A steady and muted growth in Europe for FY23 is anticipated, with a pickup expected from FY24 onwards. The US injectable business is expected to improve in the coming weeks. A significant portion of the anticipated growth in the injectable business over the next two years will come from the US (75:25 US:Other markets ratio). A plan to cut operating costs by 10% in the upcoming quarter is mentioned. A goal to cut operational expenses by 15% in the next two quarters is set.",
            "citations": [
              "978d0741aca9b96bc410ee761ebdf977",
              "0df6cce2e28e7b28103959fd23336fed",
              "075f92e15b473612d3c6326115e1c4e3",
              "7047fdffc8b258796c0ad656d14f3e4b",
              "6f9aa8769017e2318d3e3e6b8d11fd8f",
              "9143674a265f066688bde3bb4424b304",
              "1ab6f2abc8cae9ea4d4b9d9b916b2bba",
              "9b80945876c5d9d7209c350981dc75b8",
              "c723949bb909192daf56a0e9e1739681",
              "700c33827fbcc3fe016454ba4f6ecf5b"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, Aurobindo reported consolidated revenue of Rs. 5,739 crores (a 3.4% YoY decrease). US revenue decreased by 11% YoY and QoQ to Rs. 2,638 crore (46% of consolidated revenue). European revenue declined by 2.1% QoQ to Rs. 1,516 crore (26.4% of consolidated revenue). The API business posted a revenue of Rs 969 Cr (a 6.9% QoQ increase, 16.9% of consolidated revenue). Growth Market formulations revenue increased by 4.9% QoQ (7.9% of revenue). ARV business revenue was Rs 164 crore (2.8% of revenue). Aurobindo Pharma USA revenue decreased by 19% YoY in USD terms. Eugia US (injectable business) revenue decreased by 27.6% YoY to $49 million. Net profit for the quarter was Rs 409.4 crore. US revenue in Q2 FY23 was $331 Million.",
              "citations": [
                "df0de8b51be602b42be8f219e88e148b",
                "df194fb58c8fcb42f1bbc8209c711da3",
                "68e00d0135dadefeda24c37bb44d1b82",
                "b29c9dced56b46eb7549b63adadec405"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, Aurobindo reported revenue from operations at Rs 6,235.9 crore, a 9.4% increase quarter-over-quarter. US revenue increased by 10.8% year-over-year and 8.9% quarter-over-quarter to Rs. 2,971 crore (47.7% of consolidated revenue).  European formulation revenue decreased by 2.2% year-over-year to Rs 1,548 crore. API business revenue increased by 11.6% year-over-year to Rs 906 crore. EBITDA before Forex and Other income was Rs 964.7 crore, with an EBITDA margin of 15.5%.  Net profit decreased by 9.6% quarter-over-quarter to INR 520.5 Cr.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "8d3a751b122302ee798354d78563b485",
                "9b072971053e013ef5dba660d6df9bc4"
              ]
            },
            "['Q3', '2022']": {
              "answer": "Revenue from operations was Rs 6,002.2 crore (1% QoQ increase). US revenues were US$ 366.9 million. US Formulations revenue decreased by 4.4% YoY to Rs. 2,745.2 crore (46% of consolidated revenue). Europe revenue increased by 1.4% YoY to Rs 1,694 crore (28% of consolidated revenue). API business revenue was Rs 1,010 crore (16.8% of consolidated revenue), showing 48% YoY growth. Growth Markets formulations revenue was largely flat YoY, growing 2.8% QoQ to INR 397 Cr (6.6% of revenue). ARV business revenue was Rs 156 crore (2.6% of revenue). Net profit was Rs 604.3 crore. EBITDA (before forex and other income) was Rs 1,016.3 crore, with an EBITDA margin of 16.9%. Formulation business declined 3.3% QoQ to Rs. 4,992 crores (83% of total revenue). Auromedics (injectable business) revenue decreased by 7% YoY to 63.2 million. R&D expenditure was Rs 393 crore (6.6% of revenue). Net cash including investments at the end of December 2021 was ~US$ 211.1 million. The average Forex rate was Rs. 73.68. Net working capital reduced by $137 million due to inventory reduction. Price erosion impacted revenue by approximately 45 million in Q3. Freight costs increased by around 8.5 million.",
              "citations": [
                "661e5cc4700d0d5b9f5b65cf4c887c89",
                "2f179865e7ffd34da7b76cd66f813601",
                "971be7c56b178088e6e56a963d5dbc28",
                "93572bd05f67a9fe8a5e64accafb1f80",
                "b0a34fefeabf9d346dc6c7b3100907e9",
                "724a039292aac7fa5c6147b14134b215",
                "09b419fbc10ee3f348c886db255efb1f",
                "38bb8d98e4398a49df6f7e32f57308b8",
                "9143674a265f066688bde3bb4424b304"
              ]
            },
            "['Q4', '2022']": {
              "answer": "Revenue from operations declined by 3.2% QoQ to ₹5,809.4 crore in Q4 FY22. US revenues were US$ 363.3 Million. API business revenue increased by 15% YoY to ₹913 crore. Net profit decreased by 28.1% YoY and 4.7% QoQ to ₹576 Crores. The formulation business declined by 1.9% QoQ to ₹4,896 crores. US revenue decreased by 4.5% YoY to Rs. 2,728 crore. Europe revenue was largely flat YoY at Rs 1,541 crore. Growth Markets formulations revenue increased by 28% YoY. The net working capital was reduced by about $98 million for the quarter and $126 million for the year, mainly due to inventory reduction. Overall volume increased by 6%, but pricing pressure continued. Aurobindo USA revenue decreased by 5% YoY; Auromedics (injectable) revenue increased by 4% YoY to $70 million; European formulations revenue decreased by 0.8% YoY; Growth Markets revenue increased by 28% YoY; ARV business registered a 51.5% QoQ growth, but a 52% YoY decline. EBITDA before Forex and Other income was Rs 974.4 crore (16.8% margin). Net profit was Rs 576.1 crore. The average raw material cost increased by about 9% during the quarter, and freight costs were up by more than 10% YoY and QoQ. The average raw material cost increased by 18% year-on-year, and freight costs by 42%.",
              "citations": [
                "fb657cde3ee12aa31d59f50bf347317a",
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "3627fc72b8cae78fcb6f6f2b8d7f190c",
                "ba2d7ff5bdbf512530be0f860010c146"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While Q3 showed some positive aspects like API growth and a slight QoQ revenue increase, overall, the results fell short of the ambitious growth targets set by management for the fiscal year, particularly in the US formulations and injectables segments."
          }
        },
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo is progressing with its biosimilar pipeline, with a key oncology biosimilar anticipated to be filed in the next financial year.",
          "management_guidance": {
            "answer": "Three more biosimilars are in different stages of phase III clinical trials. One oncology biosimilar, currently in phase III trials, will potentially be filed in the next fiscal year (Q3-Q4 timeframe).",
            "citations": [
              "845b1ea2808b16f96dc0cb2abcb00768"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, Aurobindo completed randomization of all 690 metastatic breast cancer subjects in its Phase 3 efficacy trial comparing its biosimilar to the innovator's product. R&D expenditure was Rs 276 crore (4.8% of revenue).",
              "citations": [
                "15aa0519bfe95b028876e74a33778ab0",
                "df0de8b51be602b42be8f219e88e148b",
                "a5eca36e349844298a105cec69bd0978",
                "d136e2c9ed4566656670e5d755152b9d"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, R&D expenditure was INR 310 Cr (5% of revenue).",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "ef667bd5424dbf24c64ade46ead0b6c2",
                "5035c5d6c105328e735814ee94527da9"
              ]
            },
            "['Q3', '2022']": {
              "answer": "R&D expenditure was Rs 393 crore (6.6% of revenue).",
              "citations": [
                "661e5cc4700d0d5b9f5b65cf4c887c89",
                "b0a34fefeabf9d346dc6c7b3100907e9"
              ]
            },
            "['Q4', '2022']": {
              "answer": "In Q4 of the last fiscal year, a key Immunology asset advanced to Phase 1 clinical trial in ANZ. A second Oncology biosimilar was filed with the EMA, as expected. R&D spend was Rs 431 crore (7.4% of revenue).",
              "citations": [
                "de581f83b3a18acdd719bfee5b4adcab",
                "fb657cde3ee12aa31d59f50bf347317a",
                "807ae8c7eeef95b731e4e08e24a6f6df"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q3 2022 actual results only report R&D expenditure; there is no information on the progress of the biosimilar pipeline, including the filing of the oncology biosimilar, making it impossible to assess whether expectations were met."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "The company is facing ongoing regulatory challenges, particularly concerning Unit 1, which is under a warning letter.",
          "management_guidance": {
            "answer": "Aurobindo is working to resolve the issues with the FDA and aims to do so within the next year. Injectable launches will be subject to inspections and approvals.",
            "citations": [
              "45904d79cf0e78f2fe57f251eb4142c9",
              "1dfab5e884ca7c4a7abce5dd1a28a623"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "No specific actual results regarding regulatory compliance were provided for Q2 FY23 in the given data. However, the number of ANDA filings was mentioned as 756 as of 30th September 2022.",
              "citations": [
                "b29c9dced56b46eb7549b63adadec405"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, Aurobindo received final approval for 10 ANDAs and launched 7 products.  Unit VII (SEZ) Oral Formulations had 172 approvals, with 13 new filings.  Regarding Unit Seven, management informed the stock exchange that it had been classified as VAI, and Unit 5 had been cleared.",
              "citations": [
                "ef667bd5424dbf24c64ade46ead0b6c2",
                "97672d241ff38fb8598802f7a5a9061c",
                "5ba63bf5bbfe3bdd563829afd4fd5b93"
              ]
            },
            "['Q3', '2022']": {
              "answer": "The company filed 719 ANDAs with the US FDA cumulatively, with 494 having final approval and 30 having tentative approval. In Europe, 3,559 formulation approvals were received. In the US, 719 formulation approvals were received. 362 dossiers were achieved in South America. In Canada, 210 product registrations were received. Across all regions, there were 4,850 formulation approvals and 3,709 API approvals. The estimated regulatory timeframe during COVID was 267-270 days (approximately nine months).",
              "citations": [
                "a3fe58f13b1ff79ec44de839a7d818d4",
                "93572bd05f67a9fe8a5e64accafb1f80",
                "c70f50a9bc34f3f211662533a489a192"
              ]
            },
            "['Q4', '2022']": {
              "answer": "No products were withdrawn. Three ANDAs received final approval, and four products were launched. Fourteen ANDAs were filed (including three injectables). A total of 727 ANDAs were filed with the USFDA cumulatively (505 with final approval). 175 injectable ANDA filings were made (119 with final approval).",
              "citations": [
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "563bebde09484e0d92a01c3393a35a63"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "While the narrative highlights ongoing challenges, the actual results show continued progress in ANDA filings and approvals across various regions, suggesting Aurobindo is making efforts to address regulatory issues.  The statement does not directly address Unit 1's specific status, however."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Aurobindo anticipates market share gains with new biosimilar products.  Expansion plans include a new plant in Vizag.",
          "management_guidance": {
            "answer": "A 10% increase in market share is anticipated next year due to new biosimilar products. The Vizag plant is nearing completion, with filings expected mid-FY23 and commercialization in FY24.",
            "citations": [
              "0df6cce2e28e7b28103959fd23336fed",
              "9b80945876c5d9d7209c350981dc75b8"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, there is mention of the addressable market size for ANDAs related to the Eugia group being US$ 25.82 Billion. No specific actual market share data was provided.",
              "citations": [
                "1251918c71b5e04d22cef47800ad3eaa"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, management reported that they are number one in prescription volume in the US by volume.",
              "citations": [
                "c1e232f6fbab8df538ab94326bd5fd41"
              ]
            },
            "['Q3', '2022']": {
              "answer": "No specific actual results related to market share or plant completion are provided in the data.",
              "citations": [
                "4e3803b36723014c22af39542aa1cc6a",
                "1dfab5e884ca7c4a7abce5dd1a28a623"
              ]
            },
            "['Q4', '2022']": {
              "answer": "No specific market share data is provided in the Q4 2022 results.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q3 2022 data lacks information on market share changes or the Vizag plant's progress, preventing an evaluation of whether management's expectations were met."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Aurobindo is actively developing its product pipeline, with a significant number of products in various stages of development.",
          "management_guidance": {
            "answer": "Approximately 70 new products have been filed, and another 180 are under development.  The company is exploring strategies to boost sales from the current 900-1000 million range to 1300-1500 million. A product launch resulting from a confidential settlement is anticipated in FY24.",
            "citations": [
              "9b80945876c5d9d7209c350981dc75b8",
              "91dcf5b95953f873e7dc04a41ec4a9e4"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, Aurobindo launched approximately 20 new products.",
              "citations": [
                "45e079605f180a0be0067c2fa49ab274"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, Aurobindo filed 13 products.  20 new products were launched in the US market last year.",
              "citations": [
                "bafc7b0678209532e302499c45513483",
                "7ce3a760dcc5784918ef8b2d6d56734a"
              ]
            },
            "['Q3', '2022']": {
              "answer": "Around 70 new products were filed and another 180 are under development.",
              "citations": [
                "e2c39d59b86a57c3fe28f78cddcf63f2",
                "9b80945876c5d9d7209c350981dc75b8"
              ]
            },
            "['Q4', '2022']": {
              "answer": "Eleven new products were launched in FY22. Several projects are at various stages, including biosimilars and vaccines.",
              "citations": [
                "49237b1a65ca22667b01319272681e50",
                "6a0dc4d7fbef0ff8c7f3ff37b768ddb9",
                "a987a66426096b0097c6414397018947"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The actual results directly align with management's guidance on the number of products filed and under development."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Aurobindo is experiencing some supply chain challenges but anticipates improvements.  The company received an extension for a Penicillin G project due to COVID-related government issues.",
          "management_guidance": {
            "answer": "Improvements in lead times for raw material procurement are expected from the following month. Production from a project is expected to start by the end of FY24. The PLI scheme project for 15,000 tons of Penicillin G received a one-year extension due to COVID-related issues.",
            "citations": [
              "e2c39d59b86a57c3fe28f78cddcf63f2",
              "6b8c90380a611615f171bc88484fe546",
              "8fbd7a7e7a000a5bb452e34e97127df0"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 FY23, approximately 55% of Aurobindo's manufacturing has been moved to India.",
              "citations": [
                "c3c77adae4cc1bab4bf3c30d9265c608"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, management reported a 20% increase in production capacity over the last year.",
              "citations": [
                "822adbcfff47193447d5431218345f5e"
              ]
            },
            "['Q3', '2022']": {
              "answer": "Inventory reduction of $100 million (quarterly) and $175 million (yearly). Average raw material cost increased by about 4% during the quarter. Freight costs increased by more than 20% quarter-on-quarter.",
              "citations": [
                "b0a34fefeabf9d346dc6c7b3100907e9",
                "8fbd7a7e7a000a5bb452e34e97127df0"
              ]
            },
            "['Q4', '2022']": {
              "answer": "Significant inventory reduction over the past six months. Raw material prices increased, impacting costs. Inventory reduction of $200 million for the year. Oral plant capacity utilization reached approximately 70% in India. Distributors' and US companies' inventories returned to normal levels.",
              "citations": [
                "ba2d7ff5bdbf512530be0f860010c146",
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "10fda7a41691d41e43663cfeb84e1102",
                "3e06946481f77883aa6375b095fc880b",
                "bdb042809aa73590b3f8c1b5f2e09cac"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the inventory reduction demonstrates progress in supply chain optimization, the increase in raw material and freight costs indicates ongoing challenges, partially meeting management's expectations of improvement.  The Penicillin G extension is a separate issue and doesn't directly relate to overall supply chain performance."
          }
        }
      ]
    },
    "['Q1', '2023']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo is actively pursuing its biosimilar pipeline, with four biosimilars entering clinical trials in 2023.  The company anticipates increased costs associated with these trials, impacting R&D expenditure, with effects visible from Q3 and Q4.  The company aims to maintain its R&D expenditure as a percentage of revenue within a range of 5.75% to 6.5%.  Several new drug projects are underway, with potential filings in the latter half of 2023 and subsequent launches.  Time to market for new drugs is estimated to be approximately one year post-filing.",
          "management_guidance": {
            "answer": "Increased biosimilar costs starting in Q3 and Q4; Average R&D expenditure as a percentage of revenue between 5.75% and 6.5%; Potential filing of at least one product in the second half of 2023; Potential impact of new products on revenue from FY24 onwards; Filing of two products in 2023-24, with five total filings in Europe the following year; Commercial results from approximately 40 products expected in early next year.",
            "citations": [
              "ce1146f7d5bdfbaecdbc9217a9402a44",
              "5035c5d6c105328e735814ee94527da9",
              "ebc1ce8cdabe36c0d72d32464cc3fa94",
              "ea82505d3bc13f597f2fa5dbfd210a35",
              "d0c0a2e7e930a7b875dfab050f7fc1d7",
              "8de74c1efdf4f7ffb98bceac8b194284"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, Aurobindo's R&D spend was Rs 276 crore, representing 4.8% of revenue. One clinical trial (phase 3 for a biosimilar) completed randomization of all subjects.",
              "citations": [
                "df0de8b51be602b42be8f219e88e148b",
                "a5eca36e349844298a105cec69bd0978",
                "d136e2c9ed4566656670e5d755152b9d",
                "15aa0519bfe95b028876e74a33778ab0"
              ]
            },
            "['Q4', '2023']": {
              "answer": "Research & Development spend was Rs 410.7 crore in Q4FY23 (6.3% of revenue). The yearly average was around 5.7%. A Trastuzumab biosimilar completed its treatment phase in 690 metastatic breast cancer subjects.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "In Q3 2023, R&D expenditure was Rs 415.2 crore (6.5% of revenue), significantly higher than Rs 275.6 crore (4.8% of revenue) in Q2 2023. The increase was attributed to biosimilar development, with spending reaching Rs 180 crore compared to Rs 75 crore in the previous quarter. Management had previously indicated that R&D spend for the year would be between 6% and 6.5% of revenue.",
              "citations": [
                "3aa7df684e264d92bdc09707a744a4b3",
                "292800153225282b370128952d92407d",
                "15671aa190ea0708577162b7d49a7e9d",
                "7031fc2ed6f98dfb0c702177f376a4df",
                "831e977176205e77b2567a23172178ae"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 FY23, R&D expenditure was INR 310 crore, representing 5% of revenue. Management noted that this was below their average target range of 6% to 6.5% for the year.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "ef667bd5424dbf24c64ade46ead0b6c2",
                "5035c5d6c105328e735814ee94527da9"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The Q1 2023 R&D expenditure of 5% of revenue fell below the management's guided range of 5.75% to 6.5% for the fiscal year."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Aurobindo anticipates commencing validations and filings for its Vizag injectable plant in Q4 of FY23, aiming for commercialization by Q4 of FY24.",
          "management_guidance": {
            "answer": "Validations and filings for the Vizag injectable plant to begin in Q4 FY23, with commercialization expected by Q4 FY24.",
            "citations": [
              "737017d585aa110f74b5259b83281644"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "No specific actual results for Q1 or Q2 2023 regarding the Vizag plant are provided in the data.",
              "citations": []
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results for this theme in Q4 2023. Information on ANDA approvals and filings is available, but does not directly address the Vizag plant.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "No Q3 2023 actual results are provided in the dataset for this theme.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "No specific actual results for Q1 FY23 related to the Vizag plant were reported in the provided data.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "No Q1 2023 data is available to assess progress on the Vizag plant validations and filings."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "Aurobindo targets a 15% revenue growth for the next fiscal year. The company expects to surpass $500 million in revenue in FY23 and reach $650 million to $700 million in FY24.  Management anticipates improvements in gross margins starting in Q3, driven by cost reduction initiatives.  The European business is showing stable growth, with expectations of 5% to 8% year-on-year growth. The ARV business targets at least $35 million in quarterly revenue. The India branded formulations foray is expected to reach a base of INR 1,000 Cr within two to three years.  Profitability is expected within two years for a specific unnamed company.",
          "management_guidance": {
            "answer": "15% revenue growth target for the next fiscal year; Revenue guidance of $650 million to $700 million for FY24; Revenue exceeding $500 million in FY23; Improved gross margins from Q3 onwards due to cost reduction; European business growth of 5% to 8% year-on-year; ARV business targeting at least $35 million quarterly revenue; India branded formulations to reach INR 1,000 Cr base in two to three years; Profitability expected within two years for a specific unnamed company; Plan to reduce operational costs by 10% over the next two quarters; Profitability beyond 15% expected from a specific initiative.",
            "citations": [
              "7ce3a760dcc5784918ef8b2d6d56734a",
              "0063db9aa0de9ca4e64e65d72dfb0cbd",
              "800650c06c245634f41072f02b17c917",
              "14a99057430ab39263ea64c136b6dc0c",
              "e9c2fe1df18ded4f18ce1dbb683b355c",
              "e7d96902a72dc759c419d991abadc868",
              "8de74c1efdf4f7ffb98bceac8b194284",
              "7ce3a760dcc5784918ef8b2d6d56734a",
              "ea82505d3bc13f597f2fa5dbfd210a35"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, Aurobindo's consolidated revenue was Rs. 5,739 crores, a decrease of 3.4% year-on-year. US revenue decreased by 11% YoY and QoQ to Rs. 2,638 crore (46% of consolidated revenue). European revenue declined by 2.1% QoQ to Rs 1,516 crore. ARV business revenue was Rs 164 crore (2.8% of revenue). Growth Market formulations revenue increased by 4.9% QoQ (7.9% of revenue). API business revenue was Rs 969 Cr (16.9% of consolidated revenue). Various conflicting statements regarding revenue growth are present in the data.",
              "citations": [
                "df0de8b51be602b42be8f219e88e148b",
                "df194fb58c8fcb42f1bbc8209c711da3",
                "68e00d0135dadefeda24c37bb44d1b82",
                "5cd869d24993d46ef6e63bb8d105b45e",
                "24ebf1aae812769d60be6acf484666e3",
                "6a9f08a342c016fcc297179e74dd6ffc",
                "0282f4e224d04299de87efb0927725a2",
                "c5ef1402ac9997f5caca28b0a7b31e98",
                "a5eca36e349844298a105cec69bd0978",
                "c73e7aedeac72b7e5e57223ee2d2c36e",
                "b29c9dced56b46eb7549b63adadec405"
              ]
            },
            "['Q4', '2023']": {
              "answer": "Revenue from operations reached 6,473.0 crores in Q4FY23 (11.4% year-over-year increase). US revenue was US$ 370.4 Million. Gross Profit was 3,542.0 crores (7.8% increase YoY). EBITDA (before forex and other income) was 1,002.2 crores (2.9% increase YoY). Net Profit was Rs 505.9 crore. Aurobindo Pharma USA increased its market share by 5% last year. Operational costs were reduced by 8% over the last fiscal year.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "In Q3 2023, revenue reached Rs 6,407 crore, a 6.7% increase year-on-year and an 11.6% increase quarter-on-quarter. US revenue grew by 9.3% year-on-year and 13.8% quarter-on-quarter. European revenue increased by 12.2% quarter-on-quarter. ARV business revenue was Rs 251 crore. EBITDA (before forex and other income) was Rs 954 crore.",
              "citations": [
                "610d6578c3cda808c7780112b4202d43",
                "989cb20b3fe149d725d19ce49008102c",
                "6440495b16765e2712efc6606b55752c",
                "6d8e5da59d58b78216f74a5690d9daa4",
                "e780996327088c6d566d1581453db272",
                "e9c92a987bf92b15c80c11c4b0640ca9",
                "497d13c659a135ecf9e7d0531093d3bf",
                "36e1a82d6399a4795f0bcc6b6e2cd05d",
                "292800153225282b370128952d92407d",
                "b84a8fc505397602db8d2b6c463d1583",
                "e7654fa75b6a053cb456c419f46fd592",
                "7ee66e55daaee504f0abc1ed1210d103",
                "7f627af6e37a5e81e9ba1b4bf847de1e",
                "d70924f6793762900e240aee6fc95591",
                "acddd50c64703e10890150a9e80b43c9",
                "de1124f6476d2ba21fa1ed31446de97e",
                "b5dd10050c88b00a8a286cc89070d466",
                "21fbc7aa06c94f358b741eb427394bdb"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 FY23, revenue was INR 6,235.9 crore (approximately $760 million based on current exchange rates), showing a 9.4% YoY increase. US revenue increased by 6.1% year-on-year and 6.2% quarter-on-quarter to US$ 386 million. European formulation revenue decreased by 2.2% year-on-year in INR terms but increased by 5.9% in EUR terms. ARV business revenue increased by 28.1% YoY to INR 380 crore (approximately $46 million). Gross profit margin data shows a slight decrease compared to the previous year, and EBITDA margin was reported at 15.5%.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "8d3a751b122302ee798354d78563b485",
                "5c81accfa65dbe0bc261a905c024db9a",
                "87b6a7ddd27e4c2b1e23a2a98a316eb2",
                "7ce3a760dcc5784918ef8b2d6d56734a",
                "7bd076d6e1e7716b829911d84bd2c053",
                "9b072971053e013ef5dba660d6df9bc4",
                "0063db9aa0de9ca4e64e65d72dfb0cbd",
                "ef667bd5424dbf24c64ade46ead0b6c2",
                "800650c06c245634f41072f02b17c917"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While Q1 revenue exceeded $500 million,  the overall YoY revenue growth of 9.4% fell short of the 15% target for the full fiscal year, and gross margins decreased.  However, ARV revenue significantly exceeded expectations."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Aurobindo aims for a 5% to 10% market share in a $34 billion addressable market, targeting over $300 million in revenue within a couple of years.  Commercialization of a new initiative is expected to begin in January 2024, with a duration of three to four years.",
          "management_guidance": {
            "answer": "Targeting a 5% to 10% market share, leading to over $300 million in revenue within a couple of years; Commercialization to begin in January 2024 and last three to four years.",
            "citations": [
              "14a99057430ab39263ea64c136b6dc0c",
              "ebc1ce8cdabe36c0d72d32464cc3fa94",
              "a946b049a9947c51a4ae335ed5d6880e"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "No specific actual results for Q1 or Q2 2023 related to market share or revenue are provided in the data. However, one document mentions an addressable market size of US$ 25.82 Bn for ANDAs related to the Eugia group.",
              "citations": [
                "1251918c71b5e04d22cef47800ad3eaa",
                "6a9f08a342c016fcc297179e74dd6ffc",
                "a847971edd8703297d0a9b1eebfaef3b"
              ]
            },
            "['Q4', '2023']": {
              "answer": "Aurobindo Pharma USA increased its market share by 5% last year. Customer satisfaction score reached 85%.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "No Q3 2023 actual results are provided in the dataset for this theme.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "While specific market share data for Q1 FY23 wasn't directly provided, management reported being number one in prescription volume in the US market by volume.",
              "citations": [
                "c1e232f6fbab8df538ab94326bd5fd41",
                "822adbcfff47193447d5431218345f5e"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "Although management claimed the number one position by prescription volume,  no quantitative data on market share or revenue is provided for Q1 2023 to assess progress against the stated goal."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Aurobindo has filed approximately 10-12 products per quarter, including 13 in the current quarter.  The company is progressing with its PLI project, aiming for completion by Q4 2024 and commissioning on April 1, 2024.",
          "management_guidance": {
            "answer": "PLI project completion by Q4 2024 and commissioning on April 1, 2024; Filing of approximately 10-12 products per quarter.",
            "citations": [
              "df04a0756ed463f778ce9f28d16cdbdc",
              "bafc7b0678209532e302499c45513483"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, management indicated approximately 20 product launches for the year. Investment in the PLI Penicillin G Project reached $63 million against a budget of $235 million.",
              "citations": [
                "45e079605f180a0be0067c2fa49ab274",
                "0282f4e224d04299de87efb0927725a2",
                "a5eca36e349844298a105cec69bd0978",
                "5d64713bb441b01cbee30315c43acc91"
              ]
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain specific actual results for this theme in Q4 2023.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "In Q3 2023, management mentioned that approximately 40 ANDAs were expected to be commercialized over the next 12 months.",
              "citations": [
                "9b73ddaa5bd9220db8e561b8f2234d1c"
              ]
            },
            "['Q1', '2023']": {
              "answer": "In Q1 FY23, Aurobindo filed 13 products.",
              "citations": [
                "bafc7b0678209532e302499c45513483"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Exceeded",
            "evaluation_reason": "The 13 product filings in Q1 2023 exceeded the management's guidance of 10-12 filings per quarter."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Aurobindo's existing four plants are expected to meet demand until FY26.",
          "management_guidance": {
            "answer": "Existing four plants will meet demand until FY26.",
            "citations": [
              "5ba63bf5bbfe3bdd563829afd4fd5b93"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, approximately 55% of manufacturing had been moved to India.",
              "citations": [
                "c3c77adae4cc1bab4bf3c30d9265c608",
                "3907652bc9e5628a0b561c9d083684fb"
              ]
            },
            "['Q4', '2023']": {
              "answer": "The provided data does not contain actual results for this theme in Q4 2023.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "No specific Q3 2023 data on this is available in the provided dataset, although there is mention of freight cost reduction in Q2 and Q3.",
              "citations": [
                "204fbad089f62a95280c90aeb2fd765c"
              ]
            },
            "['Q1', '2023']": {
              "answer": "No specific data on supply chain performance for Q1 FY23 was provided. However, management mentioned increased production capacity in the previous year.",
              "citations": [
                "822adbcfff47193447d5431218345f5e"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "No Q1 2023 data is available to assess whether existing plants met demand."
          }
        }
      ]
    },
    "['Q4', '2022']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo's R&D expenditure as a percentage of revenue is expected to decrease from a historically high level to around 6% going forward.  The company targets 20 filings and 20 launches annually.  Specific timelines are provided for biosimilar filings and launches, with some projects expected to extend into 2024 or even 2025.  There's an 80%+ confidence level in a complex injectable, but success isn't guaranteed until fully achieved.  One oncology biosimilar is in global phase III trials, with filing expected in Q4 of the next fiscal year.",
          "management_guidance": {
            "answer": "R&D expenditure as a percentage of revenue will be around 6% going forward. 20 filings and 20 launches are targeted annually. Filing for an oncology biosimilar is expected in Q4 of the next fiscal year. Filing for another product is expected in late 2023 or early 2024 due to extensive clinical trials. Another product's clinical trial is expected to conclude in 2023-2024, with potential filing in Q4 2023-2024 or as early as Q3.",
            "citations": [
              "109290069ef55bb2d6f66878f9a9b00c",
              "6a0dc4d7fbef0ff8c7f3ff37b768ddb9",
              "c4b5124d2d3e217be4a90604ab147c42",
              "2c03a2bccb667e18748ba696e24ee153",
              "2c03a2bccb667e18748ba696e24ee153"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, R&D expenditure was 4.8% of revenue (Rs 276 crore). A Phase III trial for an oncology biosimilar completed randomization of all subjects.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "In Q3 FY23, R&D expenditure was 6.5% of revenue (Rs 415.2 crore), exceeding the projected 6%. A key driver was increased biosimilar investment (Rs 180 crore compared to Rs 75 crore in the previous quarter).",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, R&D expenditure was 5% of revenue.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "ef667bd5424dbf24c64ade46ead0b6c2",
                "5035c5d6c105328e735814ee94527da9"
              ]
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, R&D spend was 7.4% of revenue (Rs 431 crore). An immunology asset advanced to Phase 1 clinical trials.",
              "citations": [
                "fb657cde3ee12aa31d59f50bf347317a",
                "de581f83b3a18acdd719bfee5b4adcab"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The R&D expenditure of 7.4% exceeded the guided 6%, and while an immunology asset advanced,  no specific filings mentioned in guidance were completed in Q4 2022."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Aurobindo anticipates submitting exhibits for Depo products in FY23, with potential filing in FY24 (best-case scenario).  Regulatory processes for various products (including a bacterial vaccine) are expected to commence in Q3-Q4 of the current year.",
          "management_guidance": {
            "answer": "Exhibits for Depo products will be submitted in FY23, with potential filing in FY24. Indian regulatory processes for certain products will be initiated in Q3-Q4 of the year.",
            "citations": [
              "8efdc3fb2098586a675f53c15a035ba3",
              "69083c2422088ec18c226b91998b50ff",
              "c0ae1e6bd14871539dae5adbd9f8192c"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, the number of ANDA filings was reported as 756 as of September 30, 2022. A decrease in South Africa filings was also noted due to SAHPRA backlog clearance.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "No specific Q4 2022 results related to the management guidance on Depo products or other regulatory submissions are provided in the Q3 2023 data. Information on ANDA approvals and filings is present, but does not directly address the management guidance provided.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, management reported receiving final approval for 10 ANDAs and launching 7 products. Further information on specific Depo product submissions or other regulatory processes initiated in Q3-Q4 was not available in the provided Q1 2023 data.",
              "citations": [
                "ef667bd5424dbf24c64ade46ead0b6c2"
              ]
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, final approval was received for 3 ANDAs, and 4 products were launched. 14 ANDAs were filed, including 3 injectables. A total of 727 ANDAs were with the USFDA cumulatively, with 505 having final approval. The second oncology biosimilar was submitted to the EMA.",
              "citations": [
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "de581f83b3a18acdd719bfee5b4adcab",
                "456e1455187eef97132b996f1879b650"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the guidance regarding Depo product submissions and filings in Q3-Q4 is not directly addressed in the Q4 2022 results,  the company did make progress on other regulatory filings and approvals, exceeding expectations in some areas."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "The company aims for 10% revenue growth in the next fiscal year through portfolio expansion and new market entry.  Double-digit growth is expected for the injectables business, particularly specialty products (Oncology, hormonal, and general injectables).  A 15% reduction in operational costs is targeted by year-end.  The company hopes to increase EBITDA margin from 10-11% to 14-15%.  For the specialty business, revenue is projected to reach $650-700 million by FY24.",
          "management_guidance": {
            "answer": "10% revenue growth is targeted for the next fiscal year. Double-digit growth is expected for the injectables specialty business in the next year. 15% reduction in operational costs is targeted by year-end. EBITDA margin increase from 10-11% to 14-15% is hoped for. Specialty business revenue is projected to reach $650-700 million by FY24.",
            "citations": [
              "3c144f7d0d61121a0cf9cb94d4de9f38",
              "7846825223a6ad9e996f9135bd8898fd",
              "7b6b8665606ed4b8ba2762e889bae61c",
              "7846825223a6ad9e996f9135bd8898fd",
              "2c24c5d80bb2b957c71ad3dd78b0b4da",
              "6a0dc4d7fbef0ff8c7f3ff37b768ddb9"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, revenue was Rs. 5,739 crores, a decrease of 3.4% year-on-year. US revenue decreased by 11% YoY and QoQ. European revenue declined by 2.1% QoQ. EBITDA before Forex and other income was Rs. 836.9 crores. Net profit decreased to Rs. 409.4 crores for the quarter. One source reported a 15% increase in sales over the past year, while others reported 8% revenue growth in Q2 FY23.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "In Q3 FY23, revenue increased by 6.7% YoY and 11.6% QoQ. Formulation business grew 9.2% YoY and 14.3% QoQ. US revenue increased by 9.3% YoY and 13.8% QoQ. EBITDA margin before Forex and Other income was 14.9%, exceeding the target range. Specific data on operational cost reduction is not explicitly provided in the Q3 2023 data.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, revenue increased by 9.4% QoQ. EBITDA margin was 15.5%. Further details on operational cost reductions were not directly available in the Q1 2023 data.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5"
              ]
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, revenue from operations declined by 3.2% QoQ to Rs 5,809 crores. Net profit decreased by 28.1% YoY and 4.7% QoQ to ₹576 Crores. US revenue decreased by 4.5% YoY to Rs. 2,728 crore. EBITDA before Forex and Other income was Rs 974.4 crore, with an EBITDA margin of 16.8%. API business revenue increased by 15% YoY to ₹913 crore.",
              "citations": [
                "fb657cde3ee12aa31d59f50bf347317a",
                "3627fc72b8cae78fcb6f6f2b8d7f190c",
                "807ae8c7eeef95b731e4e08e24a6f6df"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "Q4 2022 showed a decline in overall revenue and net profit, falling short of the projected 10% growth.  While the EBITDA margin exceeded expectations, this was not sufficient to offset the overall negative financial performance."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Aurobindo is focusing on Oncology but has advanced an Immunology asset into Phase 1 trials, with potential for global Phase 3 trials by Q3-Q4, aiming for a top-three filing position by 2024-2025.  There are no plans to expand in the oral side for at least three years.  A product launch in the Indian market is expected in Q1 2023.",
          "management_guidance": {
            "answer": "Potential launch of a product into the Indian market in Q1 2023. Aiming to be in the top three to file an immunology product by 2024-2025. No plans to expand in the oral side for at least three years.",
            "citations": [
              "ce9d3508145cfcf31cc524e7837ad1a7",
              "de581f83b3a18acdd719bfee5b4adcab",
              "2c87544a58787700d5803d281cd3f574"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "No specific Q2 2023 results directly address market share changes or competitive ranking in relation to the provided guidance. However, data on addressable market size for ANDAs related to the Eugia group was provided (US$ 25.82 Bn) in Q2 2023.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "The Q3 FY23 data does not contain information directly related to the market launch in India, market share, or the competitive position in immunology.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, management stated that they are number one in the US by prescription volume. Information regarding the Indian market launch or progress on the immunology asset was not directly provided in the Q1 2023 data.",
              "citations": [
                "c1e232f6fbab8df538ab94326bd5fd41"
              ]
            },
            "['Q4', '2022']": {
              "answer": "A product launch in the Indian market occurred in Q1 2023.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The Indian market launch, although occurring in Q1 2023,  met the expectation set for a launch in Q1 2023."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Aurobindo is on track to launch three new biosimilar products by the end of 2023.  Significant launches are expected to drive future growth.  A new plant is starting production, focusing on dermatology, MDIs, and patches; filings for several products are underway.",
          "management_guidance": {
            "answer": "Launch of three new biosimilar products by the end of 2023. Production start at a new plant focusing on dermatology, MDIs, and patches by the end of the year.",
            "citations": [
              "3c144f7d0d61121a0cf9cb94d4de9f38",
              "10fda7a41691d41e43663cfeb84e1102"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, management reported approximately 20 product launches for the year.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "The Q3 FY23 data doesn't provide specific details on the number of biosimilar launches or the commencement of production at the new plant.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, management reported launching 7 products in the US market. Information on the three biosimilar launches or the new plant's production start was not available in the provided Q1 2023 data.",
              "citations": [
                "ef667bd5424dbf24c64ade46ead0b6c2"
              ]
            },
            "['Q4', '2022']": {
              "answer": "In FY22, there were 11 launches.",
              "citations": [
                "6a0dc4d7fbef0ff8c7f3ff37b768ddb9"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q4 2022 data provides information on FY22 launches, not on the progress towards the three biosimilar launches targeted for 2023 or the new plant's status."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Significant capital expenditure (around ₹1500 crores) is related to injectables, oral, and derma plants in the US.  The oral plant is expected to be commissioned before the end of FY23, while the injectable plant might spill over to the next year. Vizag plant capacity will increase to 425 million tablets/capsules per month next year.",
          "management_guidance": {
            "answer": "Oral plant commissioning before FY23 end; injectable plant potentially spilling over to next year. Vizag plant capacity increase to 425 million tablets/capsules per month next year.",
            "citations": [
              "8974c0bf224d5951f7b81e73ff31a1dc",
              "2c24c5d80bb2b957c71ad3dd78b0b4da"
            ]
          },
          "actual_results": {
            "['Q2', '2023']": {
              "answer": "In Q2 2023, it was reported that approximately 55% of manufacturing had been moved to India. Details on the commissioning of the US oral and injectable plants and the Vizag plant capacity increase were not available. A 140,000 square feet manufacturing footprint with 10 KL capacity bioreactors for internal programs was mentioned. This may relate to the new plant but is not explicit confirmation of its completion or capacity.",
              "citations": []
            },
            "['Q3', '2023']": {
              "answer": "The Q3 FY23 data mentions progress on the new plants (75-80% civil works completed, purchase orders issued for >₹1500 crore), but doesn't confirm commissioning of the oral plant or provide an update on the injectable plant's timeline. There's no information on Vizag plant capacity increase. However, there is mention of significant freight cost reduction in Q2 and Q3.",
              "citations": []
            },
            "['Q1', '2023']": {
              "answer": "In Q1 2023, management indicated an increase in production capacity over the last year to meet growing demand. Specific details on the commissioning of the oral and injectable plants or the Vizag plant capacity increase were not provided in the Q1 2023 data.",
              "citations": [
                "822adbcfff47193447d5431218345f5e"
              ]
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, Vizag plant capacity was approximately 325 million tablets or capsules per month. Significant inventory reduction occurred over the past six months.",
              "citations": [
                "2c24c5d80bb2b957c71ad3dd78b0b4da",
                "c0ae1e6bd14871539dae5adbd9f8192c",
                "ba2d7ff5bdbf512530be0f860010c146"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The Vizag plant capacity increase to 425 million tablets/capsules per month was not achieved by the end of Q4 2022.  There is no information on the commissioning of the oral plant."
          }
        }
      ]
    },
    "['Q2', '2022']": {
      "themes": [
        {
          "theme": "Research and Development (R&D) and New Product Launches",
          "narrative": "Aurobindo Pharma is actively pursuing its biosimilars pipeline and anticipates several key milestones in the near future.  The company is also focused on expanding its product portfolio, particularly in injectables.  There is a significant emphasis on increasing R&D investment to fuel innovation.",
          "management_guidance": {
            "answer": "Increased R&D investment (10% increase planned); Biosimilar development (three at different clinical trial stages, one potentially filed by next financial year, another advancing to Phase I trials in Q4 of current financial year, and another in the next financial year); Pneumococcal launch expected in India by Q3 of next financial year; MDI product launches (second in Q1 of next financial year, third filing by end of next year); 5-6 product approvals expected in next 3-6 months; Three additional product launches expected in next quarter.",
            "citations": [
              "54633a00edb1e5e49065fce3234cc148",
              "4f58ef3af23d6cc3c6555d2b8681ad14",
              "579ea8726039b860ef2e13dbc47d0adf",
              "ef937b4591a722f815a6d9ba966e4286",
              "1be9f128b80eba0344177769a5eab29c",
              "9d8140202429865e5f04aba89e2808df"
            ]
          },
          "actual_results": {
            "['Q1', '2023']": {
              "answer": "The provided Q1 2023 data does not offer direct comparison to the specific R&D guidance given for Q2 2022. Q1 2023 R&D expenditure was 5% of revenue. Information on specific product launches or biosimilar milestones is missing from the Q1 2023 data.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "ef667bd5424dbf24c64ade46ead0b6c2",
                "5035c5d6c105328e735814ee94527da9"
              ]
            },
            "['Q3', '2022']": {
              "answer": "In Q3 2022, R&D expenditure was Rs 393 crore (6.6% of revenue).  The number of ANDAs achieved was 131 (CNS, CVS, and ARV).  Further,  719 ANDAs were filed with the US FDA cumulatively, with 494 having final approval and 30 having tentative approval. A second Oncology biosimilar was filed with the European Medicines Agency in January 2022.",
              "citations": [
                "661e5cc4700d0d5b9f5b65cf4c887c89",
                "b0a34fefeabf9d346dc6c7b3100907e9",
                "4e3803b36723014c22af39542aa1cc6a",
                "93572bd05f67a9fe8a5e64accafb1f80",
                "845b1ea2808b16f96dc0cb2abcb00768"
              ]
            },
            "['Q2', '2022']": {
              "answer": "R&D expenditure was Rs 399 crore (6.7% of revenue). The number of ongoing clinical trials in the oncology Eugia portfolio included 55 products, with 12 filed and 9 launched. 28 products were filed with the USFDA, with 2 receiving approval. The Vizag plant had 50 general injectables in development, 12 of which were approved from Unit 4. 7 ANDAs (including 2 injectables and 1 505(b)(2) NDA) were approved. Filings included 27 ANDAs, including 5 injectables.",
              "citations": []
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, R&D spend was Rs 431 crore (7.4% of revenue). One important Immunology asset advanced to Phase 1 clinical trial in ANZ. The company received final approval for 3 ANDAs and launched four products. A second Oncology biosimilar was with the EMA.",
              "citations": [
                "fb657cde3ee12aa31d59f50bf347317a",
                "de581f83b3a18acdd719bfee5b4adcab",
                "807ae8c7eeef95b731e4e08e24a6f6df"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While 7 ANDAs were approved,  the 10% increase in R&D investment was not achieved (only 6.7% was reached), and specific milestones regarding biosimilar development and product launches mentioned in the guidance are not fully reflected in the Q2 2022 actual results, preventing a complete assessment."
          }
        },
        {
          "theme": "Revenue Growth and Financial Targets",
          "narrative": "Aurobindo Pharma is confident in achieving its medium-term revenue aspirations. The company is targeting significant revenue growth through market expansion and product portfolio optimization.  There's discussion around the contribution of the US plant and the impact of the new Vizag facility.",
          "management_guidance": {
            "answer": "Targeting 15% revenue growth for next fiscal year; Confident about reaching $700 million in revenue by FY24 (includes sales from US plant and new Vizag facility, but excludes biosimilars and vaccines initially).",
            "citations": [
              "54633a00edb1e5e49065fce3234cc148",
              "4c02967b5080220d5d937e15b7b3f1c1",
              "a5c5d1e40d5f8b3ac0b82a56c6d5258a",
              "eadc3efa162cb8c0e27c774f6c699f4d"
            ]
          },
          "actual_results": {
            "['Q1', '2023']": {
              "answer": "Q1 2023 revenue showed a 9.4% year-on-year increase. US revenue increased by 6.1% year-on-year and 6.2% quarter-on-quarter to US$386 million. This falls short of the 15% target for the full fiscal year. Data on the Vizag facility's contribution is not available.",
              "citations": [
                "257ae9f983bfaf67db581f4775cf26c5",
                "87b6a7ddd27e4c2b1e23a2a98a316eb2",
                "7ce3a760dcc5784918ef8b2d6d56734a",
                "7bd076d6e1e7716b829911d84bd2c053",
                "9b072971053e013ef5dba660d6df9bc4",
                "0063db9aa0de9ca4e64e65d72dfb0cbd",
                "ef667bd5424dbf24c64ade46ead0b6c2"
              ]
            },
            "['Q3', '2022']": {
              "answer": "In Q3 2022, revenue from operations was Rs 6,002.2 crore, a 1% increase quarter-on-quarter. US revenue was US$ 366.9 million.",
              "citations": [
                "661e5cc4700d0d5b9f5b65cf4c887c89",
                "09b419fbc10ee3f348c886db255efb1f"
              ]
            },
            "['Q2', '2022']": {
              "answer": "Revenue from operations was Rs 5,941.9 crore, a 4.2% QoQ increase. US revenues were US$ 401.4 million, a 10.3% QoQ increase. European formulations revenue increased by 10% YoY to Rs 1,662 crore (28% of consolidated revenue). Revenue from Growth markets formulations increased by 17.3% QoQ to Rs 386 crore (6.5% of revenue). ARV business revenue was Rs 145 crore (2.4% of revenue). API business revenue was Rs 781 crore (13.1% of consolidated revenue). US revenue increased by 6.9% YoY to Rs 2,967.6 crore (50% of consolidated revenue). On a constant currency basis, US revenue increased by 7.3% year-on-year to $401 million. Sequentially, US business grew by 10% in US$ terms and 10.7% on a reported currency basis. Global injectable sales were approximately $105 million.",
              "citations": []
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, revenue was Rs 5,809.4 crore, a 3.2% QoQ decline. US revenue decreased by 4.5% YoY to Rs. 2,728 crore (47% of consolidated revenue). European revenue was largely flat YoY at Rs 1,541 crore (26.5% of consolidated revenue). Revenue from Growth Markets formulations increased by 28% YoY (6.7% of revenue). API business revenue increased by 14.9% YoY to Rs 913 Cr (15.7% of consolidated revenue). ARV business revenue increased by 51.5% QoQ to Rs 236 crore (4.1% of revenue).",
              "citations": [
                "fb657cde3ee12aa31d59f50bf347317a",
                "e79a71ccbd9b4338ac1d5f0627a66eab",
                "b2abadab9594d55a144ba8beb7d6320e",
                "b2abadab9594d55a144ba8beb7d6320e",
                "b2abadab9594d55a144ba8beb7d6320e"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided Q2 2022 data shows a sequential increase, but doesn't offer sufficient information to assess progress toward the 15% annual revenue growth target or the $700 million FY24 goal."
          }
        },
        {
          "theme": "Supply Chain Optimization",
          "narrative": "Aurobindo Pharma is actively working to optimize its inventory management and improve its supply chain efficiency.  There's a focus on reducing lead times and improving inventory turnover.",
          "management_guidance": {
            "answer": "Inventory reduced by $62 million, with plans to continue for at least another one or two quarters; Finalizing procurement for a specific raw material expected to take another 6 months, with procurement starting 9 months from the time of the statement; Vizag facility civil work expected to be completed by June of next year, with approvals expected by year-end.",
            "citations": [
              "c8b076d01323f4832acde4bb4a6f4b5a",
              "d9e88e8038c383ca66f5395c75b5902d",
              "9d8140202429865e5f04aba89e2808df"
            ]
          },
          "actual_results": {
            "['Q1', '2023']": {
              "answer": "Q1 2023 data does not directly address the inventory reduction target or raw material procurement timelines. There is mention of increased production capacity, but no specific figures related to the management's guidance. Information on the Vizag facility progress is unavailable.",
              "citations": [
                "822adbcfff47193447d5431218345f5e"
              ]
            },
            "['Q3', '2022']": {
              "answer": "In Q3 2022, inventory was reduced by $100 million (quarterly) and $175 million (yearly). The average raw material cost increased by about 4% during the quarter, and freight costs increased by more than 20% quarter-on-quarter.",
              "citations": [
                "b0a34fefeabf9d346dc6c7b3100907e9",
                "8fbd7a7e7a000a5bb452e34e97127df0"
              ]
            },
            "['Q2', '2022']": {
              "answer": "Working capital was reduced by $62 million during the quarter.",
              "citations": []
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, inventory was reduced by approximately $200 million for the year. Oral plant capacity utilization in India reached approximately 70%, and overall utilization in India formulation plants was 68-70%. Distributor and US company inventories reached normal levels.",
              "citations": [
                "ba2d7ff5bdbf512530be0f860010c146",
                "10fda7a41691d41e43663cfeb84e1102",
                "3e06946481f77883aa6375b095fc880b"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The Q2 2022 actual results directly reflect the management's guidance regarding inventory reduction of $62 million."
          }
        },
        {
          "theme": "Regulatory Approvals and Market Entry",
          "narrative": "Aurobindo Pharma is actively pursuing regulatory approvals for its products, particularly in the US and Europe.  Successful licensure trials have been completed for biosimilars.",
          "management_guidance": {
            "answer": "Engaging with EMA and filing a product in current financial year; Filings for one or two depot injection products expected by next year; Litigation settled, market share gains expected from 2023 onwards.",
            "citations": [
              "4f58ef3af23d6cc3c6555d2b8681ad14",
              "9d8140202429865e5f04aba89e2808df"
            ]
          },
          "actual_results": {
            "['Q1', '2023']": {
              "answer": "In Q1 2023, Aurobindo received final approval for 10 ANDAs and launched 7 products. Additional details on EMA filings, depot injection product filings, or the impact of the settled litigation are not provided in the Q1 2023 data.",
              "citations": [
                "ef667bd5424dbf24c64ade46ead0b6c2"
              ]
            },
            "['Q3', '2022']": {
              "answer": "In Q3 2022, the number of formulation approvals increased to 719 in the US, 3,559 in Europe, 362 in South America, and 130 in Canada (by December 21). API approvals were 258 in the US, 1,932 in Europe, and 164 CoS approvals (by December 21). Total formulation approvals across all regions were 4,850, and total API approvals reached 3,709 (as of December 21).",
              "citations": [
                "a3fe58f13b1ff79ec44de839a7d818d4",
                "5036dbbe7c88604bfeaa7ea54b1d78e3",
                "93572bd05f67a9fe8a5e64accafb1f80",
                "845b1ea2808b16f96dc0cb2abcb00768"
              ]
            },
            "['Q2', '2022']": {
              "answer": "27 ANDAs (including 5 injectables) were filed with the USFDA in Q2FY22. 7 ANDAs (including 2 injectables and 1 505(b)(2) NDA) were approved in Q2FY22. Unit I underwent inspection and responses were submitted within the stipulated time.",
              "citations": []
            },
            "['Q4', '2022']": {
              "answer": "In Q4 2022, the company had 727 ANDAs with the USFDA (505 with final approval). 175 injectable ANDA filings (119 with final approval). A second Oncology biosimilar was with the EMA.",
              "citations": [
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "de581f83b3a18acdd719bfee5b4adcab",
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "456e1455187eef97132b996f1879b650"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The Q2 2022 results show progress with ANDA filings and approvals, but lack specifics on EMA engagement, depot injection filings, or the litigation settlement's impact, making a comprehensive evaluation impossible."
          }
        }
      ]
    },
    "['Q4', '2021']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Aurobindo plans to file two biosimilar products in 2021 and two more in 2022. Exhibit batches for four depot products in complex injectables are expected within three to four months, with filings potentially by the end of the fiscal year.",
          "management_guidance": {
            "answer": "Aurobindo plans to file two biosimilar products in 2021 and two more in 2022. Exhibit batches for four depot products in complex injectables are expected within three to four months, with filings potentially by the end of the fiscal year.",
            "citations": [
              "4b7d769cbe833dc0fc1b9be905132a93",
              "2f71ca4d417ef150cf86854fc1508565",
              "137b83a8735ab5743c03d67707cf4351"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "R&D expenditure was Rs. 1,510 Cr in FY21 (6.1% of revenue), compared to Rs. 958 Cr in FY20 (4.1% of revenue). In Q4 FY21, R&D spend was Rs. 457 Cr (7.6% of revenue).",
              "citations": [
                "d41ba069564ff8ec430c69bfb596d594",
                "6ae0ee1bf1e06c835aa33bf3028ce2ea",
                "debec2c32f261f24cff9d10577ef0eda",
                "2cd72d4673b5e166b338c530fb23805e"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The actual results for Q4 2021 focus on R&D expenditure, not the specific biosimilar filings or depot product developments mentioned in the management guidance."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Aurobindo anticipates Vaxxinity receiving emergency use authorization from Taiwan between mid-July and the end of July 2021, with manufacturing of approximately 25 million doses to commence following approval. The company expects approval for its PCV product around mid-2022, requiring production to begin five to six months prior due to the lengthy synthesis process. Approval in India for Vaxxinity's product is projected towards the end of 2021 or the beginning of 2022, pending Phase-2/3 application approval from DCGI.",
          "management_guidance": {
            "answer": "Aurobindo anticipates Vaxxinity receiving emergency use authorization from Taiwan between mid-July and the end of July 2021, with manufacturing of approximately 25 million doses to commence following approval. The company expects approval for its PCV product around mid-2022, requiring production to begin five to six months prior due to the lengthy synthesis process. Approval in India for Vaxxinity's product is projected towards the end of 2021 or the beginning of 2022, pending Phase-2/3 application approval from DCGI.",
            "citations": [
              "3fc419c6401c3e20ca590b108ec0dca6",
              "7b25bdd15f6cb645bd7d399ff215036e",
              "7b25bdd15f6cb645bd7d399ff215036e"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "In Q4 FY21, Aurobindo filed 9 ANDAs with the USFDA and received final approval for 9 ANDAs (including 3 injectables).  A total of 55 ANDAs were filed in FY21 (including 16 injectables), with 42 approvals (including 17 injectables). One DMF was filed with the USFDA during the quarter.",
              "citations": [
                "83e076ba04760ef5a1a8fc27c40155c2",
                "e4dc1e5e8a598d2d68dfdb7518c95e56",
                "17fc9e2bbc50baf637ea23ea61fb8ab0",
                "3fc419c6401c3e20ca590b108ec0dca6",
                "64f1f9b69df6e4dbb1ae9d5dd95ece8d"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The actual results describe USFDA filings and approvals, which are not directly comparable to the management guidance regarding Vaxxinity approvals in Taiwan and India."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "A 10% revenue growth target is set for the next fiscal year. The company aims for its injectable business to reach approximately $700 million within three years. A 15% revenue increase is projected by the end of the fiscal year. Management anticipates improvement in antibiotic sales in the coming quarters, but a full recovery to previous levels may take four quarters. E-pharmacy sales are projected to reach $10 million to $15 million within two to three years. A 15% to 18% portion of the 26% growth in euro terms is attributed to stockpiling. Approximately 20 product exhibit batches are planned for the next 12 to 14 months. A 10% reduction in operational costs is targeted within the next six months.",
          "management_guidance": {
            "answer": "A 10% revenue growth target is set for the next fiscal year. The company aims for its injectable business to reach approximately $700 million within three years. A 15% revenue increase is projected by the end of the fiscal year. Management anticipates improvement in antibiotic sales in the coming quarters, but a full recovery to previous levels may take four quarters. E-pharmacy sales are projected to reach $10 million to $15 million within two to three years. A 15% to 18% portion of the 26% growth in euro terms is attributed to stockpiling. Approximately 20 product exhibit batches are planned for the next 12 to 14 months. A 10% reduction in operational costs is targeted within the next six months.",
            "citations": [
              "20527402c9473b41e47f031ef22b3880",
              "8aa8e9f9ecb29a7f787889999c6acca3",
              "7eb93c95feac3871b7210604213c9eed",
              "2cacd8ae41ac70555f455bfeaa643f15",
              "137b83a8735ab5743c03d67707cf4351",
              "f997caf76c18923e003b4b396756d6f7",
              "28c296f8cb386a15ba715f5bb8a4832a",
              "7eb93c95feac3871b7210604213c9eed"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "There are multiple mentions of revenue growth in Q4 FY21 ranging from 2.1% to 15%, depending on the specific segment and currency considered.  The variations reflect the impact of factors like antibiotic sales, stockpiling, and currency fluctuations.",
              "citations": [
                "52694cc381f90228fd9386ccf61b9a54",
                "3c747ca98f78da9a11d775d142d4bf9f",
                "29fd990e90f7744f924d8bd3f06a23d0",
                "d41ba069564ff8ec430c69bfb596d594",
                "83e076ba04760ef5a1a8fc27c40155c2",
                "0470c391941002acebf1b512519e7117",
                "6ae0ee1bf1e06c835aa33bf3028ce2ea",
                "182dca5743ba13229457d25e90dce66c",
                "07da001e1f3419e03ae96fad42b083b4",
                "e4dc1e5e8a598d2d68dfdb7518c95e56",
                "56c133a0ee7a5ee69c5888940f960a06",
                "20527402c9473b41e47f031ef22b3880",
                "c3779d208301a20d49ddff101bd9e291",
                "eb766b6bcdbe9bb7e0e781597386ee2d",
                "debec2c32f261f24cff9d10577ef0eda",
                "a4c7544df6457d796565721c81eec6b5",
                "373b361aabaf9cd096998133b86233c3",
                "d78d60d8b0b9730adaeaa611b5a40213",
                "2cd72d4673b5e166b338c530fb23805e",
                "8aa8e9f9ecb29a7f787889999c6acca3",
                "137b83a8735ab5743c03d67707cf4351",
                "ac486a1023d7959812da4639e4ec82a2",
                "97af60fae05882c359938532aecaf020",
                "1a6086a460bea4eacd1f210d43dd15c9",
                "f997caf76c18923e003b4b396756d6f7",
                "13577ba136a657eb1c020ce469dda0b7"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The actual revenue growth in Q4 FY21, even at its highest reported value, fell short of the management's projected 15% increase for the entire fiscal year."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Over 10 hormonal and 65 oncology products are under development, targeting a market exceeding $45 billion. Two biosimilar product filings are anticipated in the second half of FY22, with launches in the following year. More than 200 products are under development in the general oral category, with launches planned over the next two to three years. In Eugia's Oncology segment, 55 products are under development, with two more launches expected this quarter. Approximately 50 products are being developed for the Vizag general injectable plant, expected to be operational in 18 months. COVID-19 facility equipment installation and qualification will be completed by the end of June.",
          "management_guidance": {
            "answer": "Over 10 hormonal and 65 oncology products are under development, targeting a market exceeding $45 billion. Two biosimilar product filings are anticipated in the second half of FY22, with launches in the following year. More than 200 products are under development in the general oral category, with launches planned over the next two to three years. In Eugia's Oncology segment, 55 products are under development, with two more launches expected this quarter. Approximately 50 products are being developed for the Vizag general injectable plant, expected to be operational in 18 months. COVID-19 facility equipment installation and qualification will be completed by the end of June.",
            "citations": [
              "64f1f9b69df6e4dbb1ae9d5dd95ece8d",
              "e9b2d0414b9a84bd3b4d508291460b84",
              "5071e8c6f9c29cf2a99f07fce128da5f",
              "5071e8c6f9c29cf2a99f07fce128da5f",
              "5071e8c6f9c29cf2a99f07fce128da5f",
              "b57a9f7948b8fcbe7a311fc011c39743"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "In Q4 FY21, Aurobindo launched 19 products, including 10 injectables.",
              "citations": [
                "83e076ba04760ef5a1a8fc27c40155c2",
                "64f1f9b69df6e4dbb1ae9d5dd95ece8d",
                "97af60fae05882c359938532aecaf020"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "While the actual results mention product launches, they don't provide sufficient detail to assess whether the management's guidance concerning Eugia's oncology product launches was met."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "A new facility is expected to be ready in 12 to 14 months.",
          "management_guidance": {
            "answer": "A new facility is expected to be ready in 12 to 14 months.",
            "citations": [
              "7c109f757850d4dd2082d3fe680af08e"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "No specific data on the new facility's completion is available from the provided data.  However, there's mention that the US plant was already in production. Also, there is mention of supply chain disruptions two quarters prior to Q4 2021.",
              "citations": [
                "7c109f757850d4dd2082d3fe680af08e",
                "6dabf5518c7a710ea593f2032f3b1457"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided actual results offer no information on the completion status of the new facility mentioned in the management guidance."
          }
        }
      ]
    },
    "['Q1', '2022']": {
      "themes": [
        {
          "theme": "Regulatory Approvals and Filings",
          "narrative": "Aurobindo plans to file two products before March in Europe and the UK, with one filing expected the following month. They anticipate filing two additional products in the US during FY22-23.  Furthermore, management plans to utilize funds to cover filing fees and exhibit batches for 45 additional products. The timeline for European approvals is approximately 210 days, while US approvals are estimated at 12-18 months depending on product complexity. One US inspection, deferred due to COVID, is expected by the end of the year or early next year, impacting six products launched through CMOs.",
          "management_guidance": {
            "answer": "Aurobindo's regulatory strategy focuses on timely filings and approvals across Europe, the UK, and the US.  The company anticipates a significant number of filings and is proactively managing timelines and potential delays.",
            "citations": [
              "029a8cb6d4c70324fd4d875771453028",
              "41594e44880441162b07d0cd687be5e6",
              "6b772f40e1c44e0d2285cc0eb1a490cf",
              "bab329a64075f6b6ff6f4a7dec45b055"
            ]
          },
          "actual_results": {
            "['Q3', '2022']": {
              "answer": "In Q3 2022, Aurobindo reported 719 ANDA approvals in the US, 3,559 in Europe, 362 in South America, and 130 in Canada, for a total of 4,850 formulation approvals. API approvals totaled 3,709 across all regions. A second Oncology biosimilar was filed with the European Medicines Agency in January 2022. The regulatory timeframe during COVID was estimated at 267-270 days (9 months).",
              "citations": [
                "a3fe58f13b1ff79ec44de839a7d818d4",
                "5036dbbe7c88604bfeaa7ea54b1d78e3",
                "93572bd05f67a9fe8a5e64accafb1f80",
                "845b1ea2808b16f96dc0cb2abcb00768",
                "c70f50a9bc34f3f211662533a489a192"
              ]
            },
            "['Q2', '2022']": {
              "answer": "In Q2 2022, Aurobindo filed 27 ANDAs (including 5 injectables) with the USFDA—their highest ever in a quarter. They received final approval for 7 ANDAs (including 2 injectables and 1 505(b)(2) NDA).  Unit-wise ANDA approvals are also mentioned for various therapeutic areas.  Further, they reported 681 approvals in the US, 3,507 in Europe, 361 in South Africa, and 203 in Canada by September 2021 for a total of 4,752 approvals.  API approvals totaled 3,673.",
              "citations": [
                "a62b1f03bce25a420a7274e5be16650f",
                "63f7127465523de9fb7196d5821c8581",
                "37f3ec1dddac9eec1c5de7700a450f56",
                "523144274c061704d977b2f6b1a43881",
                "1be9f128b80eba0344177769a5eab29c",
                "9d8140202429865e5f04aba89e2808df"
              ]
            },
            "['Q4', '2022']": {
              "answer": "No specific results for Q1 2022 regulatory filings are provided in the Q4 2022 data. However, Q4 2022 data shows total approvals for formulations reached 4,891 as of March 22, and total API approvals reached 3,884. Three ANDAs received final approval and four products were launched in Q4 2022.",
              "citations": [
                "456e1455187eef97132b996f1879b650",
                "807ae8c7eeef95b731e4e08e24a6f6df",
                "807ae8c7eeef95b731e4e08e24a6f6df"
              ]
            },
            "['Q1', '2022']": {
              "answer": "Aurobindo received final approval for four ANDAs and launched five products in Q1 FY22. They filed 150 injectable ANDAs (98 approved, 52 under review) and a cumulative 654 ANDAs (451 with final approval). Exhibit batches were completed for over 32 products, with filings completed for 22 and approvals for 6. A US inspection, delayed from March 2020 due to COVID, was expected by year-end or early next year.",
              "citations": [
                "1a4ed066302270adf9186a6677c6da95",
                "4ace15f21bc4773cc49bad813ac6613e",
                "41594e44880441162b07d0cd687be5e6"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "While the full extent of the year's filing plan isn't reflected in Q1 results alone, the Q1 data shows progress toward the stated goal of timely filings and approvals, with a significant number of ANDAs approved and in progress."
          }
        },
        {
          "theme": "Financial Performance and Outlook",
          "narrative": "Aurobindo targets a 15% revenue increase by the fiscal year-end. Six ANDAs are ready for marketing, anticipated to generate approximately $30 million annually. A previously acquired entity is expected to exceed last year's turnover of $13 million. Management expresses confidence in achieving a long-term goal, despite quarter-to-quarter variations. There's also mention of aiming for a 60% gross margin (currently at 58%), although this is contingent on price erosion factors. A plan to reduce operational costs by 10% over the next two quarters is also mentioned. Finally, management, while cautious about providing specific guidance, expresses excitement about exceeding $20 million in revenue for the current year from six outsourced molecules, and exceeding $100 million in three years.",
          "management_guidance": {
            "answer": "Aurobindo projects strong revenue growth, driven by new ANDAs and acquisitions.  The company aims for improved margins through cost reduction and anticipates significant revenue increases from outsourced molecules.",
            "citations": [
              "b33ff9eb1bbdce080a1e4411d5f7ac0c",
              "ab6da485728f13911a407fa295e251ac",
              "1a4ed066302270adf9186a6677c6da95",
              "0105af57e0fb52412e792b8a373ba786",
              "f309da38b9fed109799697afa509c69d",
              "029a8cb6d4c70324fd4d875771453028",
              "0cd7cae8a9e2cdb31d1dab039717815a",
              "93e5d89ca23b2ab13c319d729b0e3363"
            ]
          },
          "actual_results": {
            "['Q3', '2022']": {
              "answer": "In Q3 2022, Aurobindo's revenue from operations was Rs 6,002.2 crore, a 1% QoQ increase. US revenue was US$ 366.9 Million. US Formulations revenue decreased by 4.4% YoY to Rs. 2,745.2 crore (46% of consolidated revenue). Europe revenue increased by 1.4% YoY to Rs 1,694 crore (28% of consolidated revenue). Growth Markets formulations revenue was largely flat YoY, growing 2.8% QoQ to INR 397 Cr (6.6% of revenue). API business revenue was Rs 1,010 Cr (16.8% of consolidated revenue), with a 48% YoY growth. ARV business revenue was Rs 156 crore (2.6% of revenue). The gross profit margin was 54.3% in Q3FY22, down from 59.6% in Q3FY21 and 57.8% in Q2FY22. EBITDA before Forex and other income was Rs 1,016.3 crore, with an EBITDA margin of 16.9%. Net profit was Rs 604.3 crore. Operational costs were reduced by 5% in the last fiscal year.",
              "citations": [
                "661e5cc4700d0d5b9f5b65cf4c887c89",
                "f8aae9efa224ac63593ad42aa9998f9d",
                "2f179865e7ffd34da7b76cd66f813601",
                "9574f4bbc88523e37bcd9c24d53f2e76",
                "971be7c56b178088e6e56a963d5dbc28",
                "724a039292aac7fa5c6147b14134b215",
                "09b419fbc10ee3f348c886db255efb1f",
                "93572bd05f67a9fe8a5e64accafb1f80",
                "b0a34fefeabf9d346dc6c7b3100907e9"
              ]
            },
            "['Q2', '2022']": {
              "answer": "In Q2 2022, revenue from operations was Rs 5,941.9 crore (a 4.2% QoQ increase). US revenues were US$ 401.4 million (a 10.3% QoQ increase).  European revenue increased 10% YoY to Rs 1,662 crore (28% of consolidated revenue). Revenue from Growth markets formulations increased 17.3% QoQ to Rs 386 crore (6.5% of revenue).  ARV business revenue was Rs 145 crore (2.4% of revenue). API business revenue was Rs 781 crore (13.1% of consolidated revenue). US revenue increased 6.9% YoY to Rs 2,967.6 crore (50% of consolidated revenue).  On a constant currency basis, US revenue increased by 7.3% year-on-year to $401 million. Sequentially, US business grew by 10% in US$ terms and 10.7% on a reported currency basis.  Net profit was Rs 696.7 crore.  EBITDA (before forex and other income) was Rs 1,186.7 crore (20% margin).",
              "citations": [
                "84f952076174f2d5ef45fe579b13c051",
                "8581dd1724c2a2ef1bab194f25fe5223",
                "6ed4e7eb1ef924e9a5ed593ee012a3f4",
                "d5a0b8c815440b4a5d1dc9defb40471e",
                "e39237475ac3f86a5d64b6dd9b7f9347",
                "0e42ea547a7a78c7a4f2d4e3f40ae87f"
              ]
            },
            "['Q4', '2022']": {
              "answer": "Q4 2022 data shows a revenue of Rs 5,809 crores, with a 3.2% quarter-on-quarter decrease. This doesn't directly reflect the full-year 15% target, nor the individual projections for ANDAs or acquisitions. However, a 15% increase in sales was mentioned for the last quarter, indicating some success in revenue generation. The API business registered a 15% year-on-year growth in revenue. Information on gross margin and operational cost reduction is partially available, with a mention of operational cost reduction by 8% over the past year.",
              "citations": [
                "3627fc72b8cae78fcb6f6f2b8d7f190c",
                "9b9b6394115d76ab81ce8cc92a7ca2f6",
                "49237b1a65ca22667b01319272681e50",
                "90781d6adfacea4e72f931c5d0aace7f",
                "2a1a8676d630cfa88379a3cad5b31552",
                "3627fc72b8cae78fcb6f6f2b8d7f190c",
                "49237b1a65ca22667b01319272681e50",
                "2a1a8676d630cfa88379a3cad5b31552"
              ]
            },
            "['Q1', '2022']": {
              "answer": "Revenue for Q1 FY22 was INR 5,702 crore, a 2.9% YoY increase. Net profit increased by 8.9% to INR 770 crore. US revenue declined 1.5% YoY, while Europe revenue increased 19.7% YoY. Revenue from growth market formulations increased 13.7% YoY. ARV business revenue decreased 30.3% YoY. API business revenue was INR 812 crore. The acquired entity exceeded $6.5 million in turnover in the first half of the year.",
              "citations": [
                "0e0474959a9f48818fd578d6b2d7b29c",
                "8511462ad2c8ec4e60f3b7bb7fb3c591",
                "1a4ed066302270adf9186a6677c6da95",
                "4ace15f21bc4773cc49bad813ac6613e",
                "0105af57e0fb52412e792b8a373ba786",
                "df8a2d2f69bcba777a6e9b696a5549c1"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The 2.9% YoY revenue increase in Q1 fell significantly short of the 15% full-year target. While the acquired entity exceeded expectations, the overall financial performance in Q1 did not meet the company's ambitious guidance."
          }
        },
        {
          "theme": "Product Launches and Pipeline",
          "narrative": "Aurobindo anticipates 30+ product launches annually. One to two products are expected to be added to the portfolio each year, depending on trial length. Two products are slated for launch in the following month, utilizing third-party units.",
          "management_guidance": {
            "answer": "Aurobindo maintains a robust product launch pipeline, aiming for a consistent flow of new products to the market.",
            "citations": [
              "07af6f5ef9369c6b888629d03ce4df44",
              "bab329a64075f6b6ff6f4a7dec45b055",
              "0beceb933e385bf6a87dcb5b799a47f2"
            ]
          },
          "actual_results": {
            "['Q3', '2022']": {
              "answer": "No specific Q3 2022 results directly correlating to this guidance are provided in the data.",
              "citations": []
            },
            "['Q2', '2022']": {
              "answer": "In Q2 2022, Aurobindo launched 6 products, including 3 injectables.",
              "citations": [
                "a62b1f03bce25a420a7274e5be16650f"
              ]
            },
            "['Q4', '2022']": {
              "answer": "Q4 2022 data mentions 11 launches in FY22 and 5 new product launches in the year. This data doesn't specifically address Q1 2022 launches, but suggests the company maintained a consistent product launch pipeline.",
              "citations": [
                "6a0dc4d7fbef0ff8c7f3ff37b768ddb9",
                "49237b1a65ca22667b01319272681e50"
              ]
            },
            "['Q1', '2022']": {
              "answer": "Five products were launched in Q1 FY22.",
              "citations": [
                "4ace15f21bc4773cc49bad813ac6613e"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The launch of five products in Q1 is a reasonable contribution toward the annual target of 30+, indicating the company is on track to meet its expectations for a consistent product launch pipeline."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Aurobindo positions itself as the largest supplier by volume in a specific (unspecified) area and aims to maintain and expand this position due to a large portfolio.",
          "management_guidance": {
            "answer": "Aurobindo aims to solidify and expand its leading market position through its extensive product portfolio.",
            "citations": [
              "95ebc3f3527bc301fdb84706313a772e"
            ]
          },
          "actual_results": {
            "['Q3', '2022']": {
              "answer": "In Q3 2022, the total market size was US$ 140.34 Bn. Many products were going off-patent, starting in May, and Aurobindo was present in most of those off-patented molecules. No quantifiable market share data is available.",
              "citations": [
                "4e3803b36723014c22af39542aa1cc6a",
                "1dfab5e884ca7c4a7abce5dd1a28a623"
              ]
            },
            "['Q2', '2022']": {
              "answer": "In Q2 2022, Aurobindo's market share in injectables was approximately 20-22%.",
              "citations": [
                "ae70b2951cec4323a952a8691b81b6a9"
              ]
            },
            "['Q4', '2022']": {
              "answer": "Q4 2022 data offers limited direct evidence regarding market share. However, statements about customer satisfaction improvements suggest some success in maintaining customer relationships, which could indirectly contribute to market position. The mention of India plants achieving 70% capacity utilization and a statement about the US market representing a small portion of plant capacity provides some insight into the geographic distribution of sales and capacity utilization, but not direct market share data.",
              "citations": [
                "90781d6adfacea4e72f931c5d0aace7f",
                "2a1a8676d630cfa88379a3cad5b31552",
                "10fda7a41691d41e43663cfeb84e1102",
                "e017b9a5ba76eac55f4a8fa929b93ad4"
              ]
            },
            "['Q1', '2022']": {
              "answer": "No specific quantifiable results regarding market share are available from the provided data for Q1 2022. However, 60-65% of their portfolio held top 1-3 market share rankings.",
              "citations": [
                "b435a0cd7a0534fb43d63c02d7aae6c2"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "While precise market share figures are absent for Q1, the fact that a substantial portion of their portfolio maintained top rankings suggests the company likely met its goal of maintaining its leading market position."
          }
        }
      ]
    },
    "['Q3', '2021']": {
      "themes": [
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Management discussed R&D expenditure as a percentage of revenue and the timeline for various clinical trials, particularly in oncology and immunology.  There was also mention of utilizing facilities for COVID vaccine development.",
          "management_guidance": {
            "answer": "R&D expenditure is projected to be around 6.1% for the quarter, potentially lower on an annualized basis, but could reach 7.5% if multiple Phase-III biosimilar and vaccine trials commence. Clinical trials for various molecules (BP14, BP13, BP02, BP06) have specific completion timelines mentioned, ranging from late Q1FY22 to Q2FY22. Phase II/III trials for a product are expected to begin in Brazil by the end of the month (of the Q3 2021 reporting period), with data anticipated by July. The company expects to use its viral facility for COVID vaccine development in FY22.",
            "citations": [
              "3c061a3bb8aebac6a985dff5acc7b24e",
              "fba81ff5405e10ae91f8a0be8811e18b",
              "225e54731db894e334e15f56431a9d31",
              "ce04a1dc7a14e4cb174e3faa60e1cc06"
            ]
          },
          "actual_results": {
            "['Q2', '2022']": {
              "answer": "In Q2 2022, R&D spend was Rs 399 crore, representing 6.7% of revenue.  There's mention of 55 products under development in the oncology Eugia portfolio, with 12 filed and 9 launched.",
              "citations": []
            },
            "['Q4', '2021']": {
              "answer": "In Q4 2021, R&D expenditure was Rs. 457 Cr, representing 7.6% of revenue. For the full fiscal year (FY21), R&D expenditure totaled Rs. 1,510 Cr, 6.1% of revenue.",
              "citations": [
                "6ae0ee1bf1e06c835aa33bf3028ce2ea",
                "2cd72d4673b5e166b338c530fb23805e",
                "d41ba069564ff8ec430c69bfb596d594",
                "2cd72d4673b5e166b338c530fb23805e"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, R&D expenditure was INR 358 crore, representing 6.3% of revenue.",
              "citations": [
                "4ace15f21bc4773cc49bad813ac6613e",
                "0e0474959a9f48818fd578d6b2d7b29c",
                "1a4ed066302270adf9186a6677c6da95"
              ]
            },
            "['Q3', '2021']": {
              "answer": "R&D spend was Rs. 390.5 crore (6.1% of revenue) in Q3 2021. Phase I for one product was completed, and approvals were received to conduct Phase III trials for BP01 (Oncology). Phase I and II studies were successfully completed for another product.",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784",
                "9eb7ae7618e9cc84d492ff8ee19e233b",
                "3c061a3bb8aebac6a985dff5acc7b24e",
                "fba81ff5405e10ae91f8a0be8811e18b",
                "73e1ff74007385a700008c399af92561"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "The actual R&D expenditure of 6.1% of revenue matched the lower end of management's projected range (6.1% - 7.5%), and significant progress was reported on several clinical trials."
          }
        },
        {
          "theme": "Regulatory Compliance",
          "narrative": "Management addressed regulatory submissions and timelines for approvals,  and also discussed revisiting compliance issues after normalcy returns.",
          "management_guidance": {
            "answer": "Regulatory submission of data is expected by July, with approval anticipated in the following fiscal year. A specific product completed Phase I and II studies, with Phase III anticipated in March 2021 and regulatory filing in Q4FY22. A revisit of compliance issues is planned for around March 2022.",
            "citations": [
              "ce04a1dc7a14e4cb174e3faa60e1cc06",
              "73e1ff74007385a700008c399af92561",
              "893c0f7c1828ad893ac5b37eea5da4e5"
            ]
          },
          "actual_results": {
            "['Q2', '2022']": {
              "answer": "In Q2 2022, 27 ANDAs (including 5 injectables) were filed with the USFDA, the highest ever quarterly filings.  7 ANDAs (including 2 injectables) and 1 505(b)(2) NDA received final approval.  Unit I underwent inspection and the response was submitted within the stipulated time.  There were also various other approvals mentioned across different regions.",
              "citations": []
            },
            "['Q4', '2021']": {
              "answer": "In Q4 2021, 9 ANDAs were filed with the USFDA, and final approval was received for 9 ANDAs (including 3 injectables). A total of 55 ANDAs were filed in FY21 (including 16 injectables), with 42 approvals (including 17 injectables). 1 DMF was filed with the USFDA during the quarter. The number of filings in South Africa decreased from 436 (March 2020) to 348 (March 2021) due to SAHPRA backlog clearance.",
              "citations": [
                "83e076ba04760ef5a1a8fc27c40155c2",
                "83e076ba04760ef5a1a8fc27c40155c2",
                "e4dc1e5e8a598d2d68dfdb7518c95e56",
                "17fc9e2bbc50baf637ea23ea61fb8ab0"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, final approval for four ANDAs was received, and five products were launched. A total of 150 injectable ANDAs were filed as of June 30, 2021, with 98 receiving final approval; 654 ANDAs were filed cumulatively, with 451 receiving final approval. USFDA audited Unit-1 for nine days, concluding in Q1 2022.",
              "citations": [
                "4ace15f21bc4773cc49bad813ac6613e",
                "1a4ed066302270adf9186a6677c6da95",
                "4fb476f4b3e9f1f20abdc5f6d1f8193c",
                "144f1a96cf689f6c056b8ae4d8165ebc"
              ]
            },
            "['Q3', '2021']": {
              "answer": "The provided data mentions 251 DMFs filed with the USFDA and over 3,000 filings in other geographies. 141 injectable ANDAs were filed as of December 31, 2020, with 87 receiving final approval and 54 under review. The number of filings in South Africa decreased from 436 (March 31, 2020) to 341 (December 31, 2020).",
              "citations": [
                "71ca8b2ae34e6de8aab1a2049264f735",
                "d5889da6904c9d6279919879cfce9545",
                "9eb7ae7618e9cc84d492ff8ee19e233b"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q3 2021 actual results provide general regulatory filing numbers but lack specific data to compare against the management's guidance on specific submissions and timelines mentioned in the narrative."
          }
        },
        {
          "theme": "Financial Performance",
          "narrative": "Management provided revenue growth projections and plans to reduce operational costs.",
          "management_guidance": {
            "answer": "Revenue growth of 15% is projected for the next fiscal year. The company aims to double external sales within 4-5 years, with a significant portion of this growth expected in fiscal year 25. Revenue is expected to reach $650 million to $700 million over the next 3 years from the current $380 million. Operational costs are planned to be reduced by 10% in the coming quarter.",
            "citations": [
              "89f56abd70db18c7e016d05c435b00c8",
              "71ca8b2ae34e6de8aab1a2049264f735",
              "1928fa56ad8b80884b2a8b6cdf5fe9c0",
              "ead3276acca29aa3414a73fee25feb19",
              "3c061a3bb8aebac6a985dff5acc7b24e",
              "6e0f6a6e22604768dfbd2645d109656f"
            ]
          },
          "actual_results": {
            "['Q2', '2022']": {
              "answer": "In Q2 2022, revenue from operations was Rs 5,941.9 crore, a 4.2% QoQ increase. US revenues were US$ 401.4 Million, up 10.3% QoQ.  Various other revenue figures are reported across different segments and geographies, showing mixed growth patterns. Net profit was Rs 696.7 crore.",
              "citations": []
            },
            "['Q4', '2021']": {
              "answer": "There are multiple, sometimes conflicting, figures reported for revenue growth in Q4 2021 and FY21. Reports include 88% YoY growth, 8% YoY growth for FY21, 15% increase last quarter, 5% YoY growth in Q4 FY21, and 2.1% YoY increase to Rs. 6,007 crores in Q4 FY21. Further discrepancies exist regarding specific business segments (US, Europe, API, formulations).",
              "citations": [
                "3c747ca98f78da9a11d775d142d4bf9f",
                "29fd990e90f7744f924d8bd3f06a23d0",
                "52694cc381f90228fd9386ccf61b9a54",
                "0470c391941002acebf1b512519e7117",
                "debec2c32f261f24cff9d10577ef0eda",
                "a4c7544df6457d796565721c81eec6b5"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, revenue from operations was INR 5,702.0 Cr, a decrease of 3.8% from Q1FY21. However, other sources indicate a 2.9% YoY revenue growth. Net profit increased by 8.9% year-on-year to Rs.770 crores. US revenue declined by 1.5% YoY, while Europe revenue increased by 19.7% YoY. Some sources reported a 15% revenue increase.",
              "citations": [
                "0a10e4f7f469ab4acf390f87fe343ef4",
                "ac82f488f256a177bf562bd93b124c68",
                "df8a2d2f69bcba777a6e9b696a5549c1",
                "4ace15f21bc4773cc49bad813ac6613e",
                "8511462ad2c8ec4e60f3b7bb7fb3c591",
                "b3ca7992c551d88e4f36a8c836d3e37e",
                "54d62ec6a2be24dde215e37846c70b70",
                "ffd0a32791694268d4d5c2adc1baa1c8",
                "162b7e5c0517e7c8b63d322e28fc15ab"
              ]
            },
            "['Q3', '2021']": {
              "answer": "Revenue from operations was Rs. 6,364.9 crore in Q3 FY21, an 8% YoY increase. Net profit after JV share and minority interest was Rs. 2,946.5 crore, a 317.7% YoY increase. US revenue grew by 6.8% YoY to Rs. 3,171.6 crore (49.8% of consolidated revenue); European revenue increased by 13.2% YoY to Rs. 1,671.2 crore (26.3% of consolidated revenue). Injectable business showed 6% sequential growth. Global generic Injectable sales were US$ 109 million in Q3FY21 and US$ 283 million for 9MFY21. Total revenue (including captive consumption) was US$ 206 million for Q3FY21 and US$ 632 million for 9MFY21. Gross profit margin was 59.6% in Q3FY21. EBITDA (before forex and other income) was Rs. 1,368.6 crore (21.5% margin), a 13.3% YoY increase. Reported EPS was Rs. 50.29.",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784",
                "62107a03ed29c89fd1b9cac6f468bbbe",
                "b421be8bb5cdb840c66e86d78549be3f",
                "ea47a8e8f18b3c8de382c7997a40755a",
                "1a0a605049cf7dc7de05a64c61efaad4",
                "0423ce6f6053c9b542d2add09cb2c0eb",
                "8a54e667060f48e3aa3fef5b36350465",
                "71ca8b2ae34e6de8aab1a2049264f735",
                "9eb7ae7618e9cc84d492ff8ee19e233b",
                "c1a0a671aefc9d6e5d97dcdcb52b55f6"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Met",
            "evaluation_reason": "While the 8% YoY revenue growth in Q3 2021 is lower than the projected 15% for the full fiscal year, it represents positive growth and provides a foundation for achieving the longer-term target."
          }
        },
        {
          "theme": "Market Position",
          "narrative": "Management discussed expansion plans in Europe and the timeline for a new facility.",
          "management_guidance": {
            "answer": "The setup of a dedicated injectable facility in Europe is underway. This facility is expected to be completed in 15 months.",
            "citations": [
              "623ae49007b071cfc6dc5ed2560e27e5",
              "a528aa9a7de8597e991417f59cb9f2c0"
            ]
          },
          "actual_results": {
            "['Q2', '2022']": {
              "answer": "No specific data on European facility completion or market share changes is provided in the Q2 2022 data. However, there is mention of a 10% YoY increase in Europe revenue to Rs 1,662 crore in Q2FY22.  There are also various other mentions of market position data, but none directly address the European facility.",
              "citations": []
            },
            "['Q4', '2021']": {
              "answer": "Specific data on market share or ranking among competitors is not available in the provided Q4 2021 data, but there are mentions of increased exports to Europe and sourcing from India.",
              "citations": [
                "28c296f8cb386a15ba715f5bb8a4832a",
                "f997caf76c18923e003b4b396756d6f7"
              ]
            },
            "['Q1', '2022']": {
              "answer": "No specific results related to the European facility completion are available in the provided Q1 2022 data.",
              "citations": []
            },
            "['Q3', '2021']": {
              "answer": "Global generic Injectable sales were reported, providing some indication of market performance.",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The Q3 2021 results do not provide information on the progress of the European facility construction, preventing evaluation against the 15-month completion target."
          }
        },
        {
          "theme": "Innovation and Pipeline",
          "narrative": "Management discussed the number of products planned for launch and the size of their development pipeline.",
          "management_guidance": {
            "answer": "Approximately 4 product launches are targeted for the quarter. Around 12 to 15 injectable product launches are anticipated annually. A new plant will enable the immediate supply of 20 approved or filed products, with an additional 30 products to follow, totaling 50 products. 52 products are under development, planned for launch over the next 1-1.5 years.",
            "citations": [
              "dd2cc9f57e0ee80920051eb85f21ee3a",
              "d78fcacc9efb039d182a002f4c9e605b",
              "5d8a6e8999f68746bd026419cb4da5fc"
            ]
          },
          "actual_results": {
            "['Q2', '2022']": {
              "answer": "In Q2 2022, 6 products (including 3 injectables) were launched.  Further details on the number of patents filed and the diversity of the drug pipeline are provided, but not directly tied to the original guidance.",
              "citations": []
            },
            "['Q4', '2021']": {
              "answer": "In Q4 2021, 19 products were launched, including 10 injectables.",
              "citations": [
                "83e076ba04760ef5a1a8fc27c40155c2",
                "64f1f9b69df6e4dbb1ae9d5dd95ece8d"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, three new products were launched. There were approximately 67 products in total, with 40 injectables and 27 non-injectables in the pipeline. Another source mentions a pipeline of 174 products under different dosage forms.",
              "citations": [
                "ffd0a32791694268d4d5c2adc1baa1c8",
                "1a4ed066302270adf9186a6677c6da95",
                "fe93814321b5d251b9a9bf78bf6b1797"
              ]
            },
            "['Q3', '2021']": {
              "answer": "11 products were launched during the year, with an expectation of another 3-4 before year-end. Approximately 20 products were filed or approved but not fully capitalized upon.",
              "citations": [
                "dd2cc9f57e0ee80920051eb85f21ee3a",
                "d78fcacc9efb039d182a002f4c9e605b"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the number of launches in Q3 2021 is not explicitly stated, the yearly total of 11-15 falls short of the implied quarterly target of 4 and the overall annual projection of 12-15 injectable launches, although the full year's performance is closer to meeting the expectations."
          }
        },
        {
          "theme": "Supply Chain Management",
          "narrative": "Management discussed capacity expansion plans and the timeline for these expansions.",
          "management_guidance": {
            "answer": "Capacity is being doubled from 220 million doses to 480 million doses by June 2021. Capacity expansion in Vizag is planned for large-volume products, expected to be completed within 1-1.5 years.",
            "citations": [
              "73e1ff74007385a700008c399af92561",
              "568d544cd82cd8f0a150d7120fcdd84e"
            ]
          },
          "actual_results": {
            "['Q2', '2022']": {
              "answer": "In Q2 2022, there's a mention of a $62 million reduction in working capital QoQ, indicating some success in supply chain optimization.  However, there's no direct data on the completion of capacity expansion in Vizag or the overall increase in capacity.",
              "citations": []
            },
            "['Q4', '2021']": {
              "answer": "In Q4 2021, there's mention of a capacity of 480 million doses in the new viral vaccine facility, but no specific data on whether this target was met by June 2021. There is also mention of supply chain disruptions two quarters prior to Q4 2021.",
              "citations": [
                "7b25bdd15f6cb645bd7d399ff215036e",
                "6dabf5518c7a710ea593f2032f3b1457"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, a new manufacturing plant became fully operational, increasing production capacity by 25%.",
              "citations": [
                "54d62ec6a2be24dde215e37846c70b70"
              ]
            },
            "['Q3', '2021']": {
              "answer": "Production capacity increased by 15% over the past two years.",
              "citations": [
                "89f56abd70db18c7e016d05c435b00c8"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The 15% increase over two years is significantly less than the targeted doubling of capacity by June 2021, indicating that the capacity expansion plan fell short of its initial goals."
          }
        }
      ]
    },
    "['Q1', '2021']": {
      "themes": [
        {
          "theme": "Research and Development (R&D) and Innovation",
          "narrative": "Aurobindo Pharma's management highlighted significant investments in R&D, particularly in biosimilars and vaccines.  They discussed timelines for clinical trials and regulatory filings for various products, including a COVID-19 vaccine and other biosimilars for both the US and European markets.  There was also mention of the development and filing of new MDIs (metered dose inhalers).",
          "management_guidance": {
            "answer": "Biosimilar Filings:  The company planned to file one biosimilar in Europe by the end of 2021 and another by the first quarter of 2022.  Subsequently, they anticipated filing at least two more biosimilars annually in the US and Europe. COVID-19 Vaccine:  Capacity for the company's COVID-19 vaccine was expected to be ready in phases.  Phase I and II trials were planned by the end of 2021, with the commercial facility aiming for completion by March-April 2022 for Phase III trials. Other Product Filings and Launches:  The company aimed to file approximately 50 new products during the fiscal year.  They also planned for launches of 30 new products in the U.S. by the end of 2021. New Injectable Plant: A new injectable plant for Europe and emerging markets was projected to be operational within 15 months. R&D Expenditure:  A budget of approximately Rs. 800 crore was allocated for R&D, including Rs. 360 crore for specific projects.  There was discussion about the possibility of lower R&D expenditure if clinical trials were delayed due to COVID-19.",
            "citations": [
              "86c109b980c8e9a7850595a0df4436cf",
              "a615a4352099a948aae07bb1ff78051e",
              "610f6e9aa77146d4cd3132361cba2100",
              "84819c26fe434bd4a898a42ae5640c67",
              "bedbfc30072571daf0857b5fd7cea9b2",
              "04b2cfd063e7effd2a74f2810d0f85d3",
              "bf551000e96cc534b29f80ca1bf3f155",
              "c72e80194cabd23f271325565d39daab"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "The provided data for Q4 2021 shows R&D expenditure of Rs. 457 crore (7.6% of revenue) for the quarter and Rs. 1,510 crore (6.1% of revenue) for the fiscal year.  There is no information on specific biosimilar filings, COVID-19 vaccine trial progress, or the number of new product filings and launches achieved during Q1 2021.",
              "citations": [
                "d41ba069564ff8ec430c69bfb596d594",
                "6ae0ee1bf1e06c835aa33bf3028ce2ea",
                "debec2c32f261f24cff9d10577ef0eda",
                "2cd72d4673b5e166b338c530fb23805e"
              ]
            },
            "['Q1', '2021']": {
              "answer": "R&D expenditure was Rs. 254.5 crore (4.3% of revenue) in Q1 2021. A provision of Rs. 60 crore was made for R&D assets developed by a third party. The company filed 14 ANDAs with the USFDA, including 3 injectables. They received final approval for 10 ANDAs. They filed 3 DMFs with the USFDA. One MDI inhaler was filed.",
              "citations": [
                "21936e7f6fa5696b61376163f5325cac",
                "6202cd6f2a1e5ec91032930fb3de0367",
                "0f36566c43212f70a13affd4a56fbc66",
                "610f6e9aa77146d4cd3132361cba2100",
                "a6cd1b110ccb79f94747d3a99f4d5694",
                "22e9528763105611055cd6b8f669ceb0",
                "6a713a2444678e7c89c7757de6101f95"
              ]
            },
            "['Q3', '2021']": {
              "answer": "The provided Q3 2021 data does not offer direct comparison to the specific biosimilar and vaccine timelines. However, it does indicate R&D expenditure of Rs. 390.5 crore (6.1% of revenue) in Q3 2021. The number of ongoing clinical trials is mentioned, with Phase I completion and commencement of Phase III trials for an oncology product (BP01).",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784",
                "9eb7ae7618e9cc84d492ff8ee19e233b",
                "3c061a3bb8aebac6a985dff5acc7b24e",
                "fba81ff5405e10ae91f8a0be8811e18b",
                "73e1ff74007385a700008c399af92561"
              ]
            },
            "['Q2', '2021']": {
              "answer": "In Q2 2021, R&D expenditure reached Rs. 408 crore (6.3% of revenue). Clinical trials commenced for biosimilar products, with spending of approximately $3-4 million in the previous quarter and $17 million in Q2 2021.",
              "citations": [
                "1af972b5ea002f48b7e2234de464c867",
                "a940b570b4ee167d8ff69782ae4385b5",
                "f79a39fd873b203881771d67f12326b4"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "The Q1 2021 actual results for biosimilar filings and the COVID-19 vaccine are not reported, and the R&D expenditure was significantly lower than the budgeted Rs. 800 crore, falling short of the company's ambitious R&D plans for the year."
          }
        },
        {
          "theme": "Financial Performance and Outlook",
          "narrative": "Management provided forward-looking statements about revenue growth and cost reduction initiatives.  There was also commentary on debt reduction.",
          "management_guidance": {
            "answer": "Revenue Growth: A 15% increase in revenue was projected for the next fiscal year. Cost Reduction: A plan to reduce operational costs by 10% over the next two quarters was mentioned. Debt Reduction: Management indicated that net debt would continue to be reduced, although the reduction rate might not be consistent across quarters. Return on Capital Employed (RoCE): A pre-tax RoCE of 15% was targeted by the end of the next fiscal year.",
            "citations": [
              "bedbfc30072571daf0857b5fd7cea9b2",
              "bedbfc30072571daf0857b5fd7cea9b2",
              "3507179ce9b740e8601cb763ea458b65",
              "ac52ac2d8b49606cbc070dec35c1910c"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "Q4 2021 results show varying revenue growth rates depending on the source and segment reported. Some sources indicate  8% YoY revenue growth for the full fiscal year, while others mention 8% YoY growth for the full year and 2% year-on-year growth for formulations in Q4.  There's mention of a 5% YoY revenue increase in Q4 FY21.  The data does not provide information on operational cost reductions, net debt reduction, or RoCE achieved in Q1 2021.",
              "citations": [
                "52694cc381f90228fd9386ccf61b9a54",
                "3c747ca98f78da9a11d775d142d4bf9f",
                "29fd990e90f7744f924d8bd3f06a23d0",
                "d41ba069564ff8ec430c69bfb596d594",
                "83e076ba04760ef5a1a8fc27c40155c2",
                "0470c391941002acebf1b512519e7117",
                "6ae0ee1bf1e06c835aa33bf3028ce2ea",
                "debec2c32f261f24cff9d10577ef0eda",
                "a4c7544df6457d796565721c81eec6b5"
              ]
            },
            "['Q1', '2021']": {
              "answer": "Revenue increased by 8.8% year-on-year in Q1 2021. Net profit increased by 22.8% year-on-year. US revenue grew by 15.6% YoY. On a constant currency basis, revenue grew by 6.5% YoY.",
              "citations": [
                "2e374549fbefd050f57b58faa462533c",
                "21936e7f6fa5696b61376163f5325cac",
                "a6cd1b110ccb79f94747d3a99f4d5694",
                "698c025abf95c98f4ca7440e7751bda6"
              ]
            },
            "['Q3', '2021']": {
              "answer": "In Q3 2021, revenue from operations showed an 8% YoY growth (Rs. 6,364.9 crore). While the overall revenue growth was not 15% as guided, there are numerous data points showing different growth rates for segments. The actual gross margin was 59.6% in Q3 2021. EBITDA before forex and other income increased by 13.3% YoY to Rs. 1,368.6 crore, with a margin of 21.5%.",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784",
                "b421be8bb5cdb840c66e86d78549be3f",
                "0423ce6f6053c9b542d2add09cb2c0eb",
                "c1a0a671aefc9d6e5d97dcdcb52b55f6"
              ]
            },
            "['Q2', '2021']": {
              "answer": "In Q2 2021, revenue increased by 16% year-on-year to Rs. 6,483 crores. Operational costs were reduced by 8% in the same period.",
              "citations": [
                "14d759b0184adce3dcd234c8a650c755",
                "24d538b9eb07c5cde52261102fbb342c"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While revenue growth was positive, it fell short of the 15% target for the fiscal year.  Information regarding cost reduction, debt reduction, and RoCE is missing for a complete evaluation of the financial outlook for Q1 2021."
          }
        },
        {
          "theme": "Supply Chain and Capacity Expansion",
          "narrative": "Aurobindo Pharma addressed the increasing demand for its products and the need to expand capacity.  They discussed investments in API (Active Pharmaceutical Ingredient) modules to free up existing capacity and mentioned plans for new manufacturing facilities.",
          "management_guidance": {
            "answer": "Capacity Expansion: Investments were made to increase capacity for viral vaccine production to 300-350 million doses per year, and a bacterial vaccine facility was being established with initial capacity of 50 million doses, scalable as needed. New Manufacturing Facilities:  A new plant in the US was expected to be ready for production in early 2022.  A dedicated injectable facility near Vizag was also under construction for Europe and other markets. API Module Investment:  Investment in two to three large-volume API modules was planned to address surging demand.",
            "citations": [
              "5f5f4df4838cc2bed79187853971edc1",
              "04b2cfd063e7effd2a74f2810d0f85d3",
              "a76c2473e4e4a6d430867c00407a0481",
              "61993e36e885aa7d3ab82b1624fd3621"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "The Q4 2021 data mentions the US plant being in production.  There's no specific information about the actual capacity achieved for viral and bacterial vaccine production or the progress of the injectable facility near Vizag in Q1 2021.",
              "citations": [
                "7c109f757850d4dd2082d3fe680af08e",
                "7b25bdd15f6cb645bd7d399ff215036e"
              ]
            },
            "['Q1', '2021']": {
              "answer": "No specific quantifiable results regarding capacity expansion or API module investments are available from the provided data for Q1 2021.",
              "citations": []
            },
            "['Q3', '2021']": {
              "answer": "Q3 2021 data shows no direct metrics on capacity expansion for vaccines or new facilities. However, there is mention of a 15% increase in production capacity over the past two years, suggesting progress in overall capacity expansion.",
              "citations": [
                "89f56abd70db18c7e016d05c435b00c8"
              ]
            },
            "['Q2', '2021']": {
              "answer": "No specific quantifiable results related to capacity expansion or new facilities are available in the provided Q2 2021 data.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided Q1 2021 data lacks specific quantifiable results to assess the progress of the capacity expansion and API module investments."
          }
        },
        {
          "theme": "Regulatory Approvals and Time to Market",
          "narrative": "The company provided timelines for regulatory filings and approvals for biosimilars, vaccines, and other products.",
          "management_guidance": {
            "answer": "This is largely covered under the R&D and Innovation theme above, as the guidance is intricately linked to R&D activities.",
            "citations": []
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "In Q4 2021, Aurobindo filed 9 ANDAs with the USFDA and received final approval for 9 ANDAs (including 3 injectables). They also filed 1 DMF with the USFDA.",
              "citations": [
                "83e076ba04760ef5a1a8fc27c40155c2",
                "e4dc1e5e8a598d2d68dfdb7518c95e56"
              ]
            },
            "['Q1', '2021']": {
              "answer": "Results are largely covered under the R&D and Innovation theme. The company received final approval for 10 ANDAs in Q1FY21.",
              "citations": [
                "a6cd1b110ccb79f94747d3a99f4d5694"
              ]
            },
            "['Q2', '2021']": {
              "answer": "In Q2 2021, Aurobindo received GMP certificates from European, Japanese, and Brazilian regulatory authorities for Unit-11 after completing remedial measures.",
              "citations": [
                "7524446743db199c4ef845f41d6f086a"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The evaluation of regulatory approvals is intrinsically linked to the R&D theme and lacks specific independent data for Q1 2021 to assess against specific targets beyond the ANDA approvals."
          }
        }
      ]
    },
    "['Q2', '2021']": {
      "themes": [
        {
          "theme": "Financial Performance and Growth Strategy",
          "narrative": "Management expressed confidence in achieving significant revenue growth, driven by several factors including expansion in injectables, new plant capacities, and strategic market expansion.  Specific targets were set for revenue growth and the expansion of the generic injectable business.  Concerns regarding export incentives and their potential impact on financial performance were also acknowledged.",
          "management_guidance": {
            "answer": "A 15% revenue growth target for the fiscal year was mentioned. The generic injectable business, currently at a $380 million annual run rate, is projected to reach $650-$700 million within three years. Overall growth of 5-10% was anticipated, with potential for minor quarterly deviations. Debt is expected to be fully eliminated by March 31, 2022. Management aimed to maintain gross profit margins above 59%, acknowledging potential impact from currency fluctuations. A 10% reduction in operational costs was targeted by year-end through process improvements and expenditure cuts.",
            "citations": [
              "e5d56c80bf7d5180b769c3e2575e426d",
              "1865e8076e783b040b7ed4c36da48f3b",
              "f2de53cb37844aaa13553960884e96b1",
              "73d56476d7ff331fe77ace1b0507fbb1",
              "4c5d3202b647f2fd1d06e7fa3b6682fd",
              "73d56476d7ff331fe77ace1b0507fbb1",
              "7adbc71ddcc0d5a3f419168d6b825b4b",
              "29e6e0ab319a8c209f19c727aa74eb34",
              "1865e8076e783b040b7ed4c36da48f3b"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "Multiple sources report varying revenue growth figures for Q4 2021. Some cite an 8% YoY growth in revenue for FY21, while others report a 15% increase in sales last quarter. Discrepancies exist, possibly due to different reporting methods (e.g., constant currency vs. reported currency, inclusion/exclusion of specific business units). A 2.1% year-on-year revenue increase to Rs.6,007 crores in Q4 FY21 is also mentioned. There is no single conclusive figure for Q4 2021 revenue growth that aligns with all reported data.",
              "citations": [
                "29fd990e90f7744f924d8bd3f06a23d0",
                "52694cc381f90228fd9386ccf61b9a54",
                "182dca5743ba13229457d25e90dce66c",
                "d78d60d8b0b9730adaeaa611b5a40213",
                "13577ba136a657eb1c020ce469dda0b7",
                "eb766b6bcdbe9bb7e0e781597386ee2d",
                "97af60fae05882c359938532aecaf020",
                "ac486a1023d7959812da4639e4ec82a2",
                "debec2c32f261f24cff9d10577ef0eda"
              ]
            },
            "['Q1', '2022']": {
              "answer": "Conflicting revenue growth figures are reported for Q1 2022. Sources report 2.9% YoY growth, 15% increase, and 3.8% decrease. Further investigation is needed to reconcile these discrepancies.",
              "citations": [
                "ac82f488f256a177bf562bd93b124c68",
                "0e0474959a9f48818fd578d6b2d7b29c",
                "8511462ad2c8ec4e60f3b7bb7fb3c591",
                "b3ca7992c551d88e4f36a8c836d3e37e",
                "54d62ec6a2be24dde215e37846c70b70",
                "0a10e4f7f469ab4acf390f87fe343ef4",
                "ffd0a32791694268d4d5c2adc1baa1c8",
                "b33ff9eb1bbdce080a1e4411d5f7ac0c",
                "0562abbdc578cee56be0d7dd87e071e7",
                "1b99be7994cec4cbc7738df2751f73ee",
                "df8a2d2f69bcba777a6e9b696a5549c1",
                "ab6da485728f13911a407fa295e251ac",
                "1a4ed066302270adf9186a6677c6da95",
                "4ace15f21bc4773cc49bad813ac6613e",
                "0105af57e0fb52412e792b8a373ba786",
                "f309da38b9fed109799697afa509c69d",
                "162b7e5c0517e7c8b63d322e28fc15ab",
                "0cd7cae8a9e2cdb31d1dab039717815a"
              ]
            },
            "['Q3', '2021']": {
              "answer": "In Q3 2021, Aurobindo Pharma reported varying revenue growth rates: 8% YoY (source 1), 15% (source 2), and 16.9% YoY (source 3). The injectable business reached approximately $435-$440 million annualized (source 4). Gross margin was 59.6% (source 5).  Sources are represented by their unique identifiers.",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784",
                "0423ce6f6053c9b542d2add09cb2c0eb",
                "c1a0a671aefc9d6e5d97dcdcb52b55f6",
                "d9f9448fa27e71d8fce19fa4ea73d62e",
                "62107a03ed29c89fd1b9cac6f468bbbe",
                "fd7c25bf5ed0f7269ac3bd9711183858",
                "ff95daab8e8c88c2ebd618e627de9222",
                "c8d6c3f6b4e0c752046b57c1dda8cbd8",
                "b421be8bb5cdb840c66e86d78549be3f",
                "ead3276acca29aa3414a73fee25feb19",
                "4a4138eb59d4af1783f9456304cbfce5",
                "0423ce6f6053c9b542d2add09cb2c0eb"
              ]
            },
            "['Q2', '2021']": {
              "answer": "Revenue for Q2 FY21 was $712 million. The company clocked a revenue of Rs.6,483 crores, a 16% increase year-on-year. Net profit increased by 26% year-on-year to Rs.806 crores. Formulations business grew by 18% year-on-year to Rs.5,654 crores. US business posted a 12% year-on-year growth to Rs.3,190 crores. Aurobindo Pharma USA (oral products) revenue increased by 8%. AuroMedics (Injectable business) revenue decreased by 15% year-on-year to US$64 million. European Formulations revenue increased by 8% to Rs.1,515 crores. Growth markets revenue increased by 40% year-on-year (33% on a constant currency basis) to Rs.446 crores. ARV Formulations revenues increased by 111% year-on-year (100% on a constant currency basis) to Rs.503 crores. R&D expenditure was Rs.408 crores (6.3% of total revenue). The generic injectable business had a $380 million annual run rate.",
              "citations": [
                "64f9ad1af4ca367754acd67738f80b6b",
                "24d538b9eb07c5cde52261102fbb342c",
                "14d759b0184adce3dcd234c8a650c755",
                "1af972b5ea002f48b7e2234de464c867",
                "f2de53cb37844aaa13553960884e96b1",
                "7ba577fd4b3f24172c5906752854e02b",
                "73d56476d7ff331fe77ace1b0507fbb1"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While overall revenue growth exceeded the anticipated 5-10%, the injectable business, a key driver of growth, showed a decline, falling short of the projected expansion.  The 16% overall growth partially met expectations."
          }
        },
        {
          "theme": "Capacity Expansion and Facility Developments",
          "narrative": "Aurobindo Pharma highlighted significant investments in new manufacturing facilities, particularly for injectables, targeting both the US and European/emerging markets.  Timelines for completion and commissioning were provided.",
          "management_guidance": {
            "answer": "The new Vizag plant (dedicated to Europe and emerging markets) is expected to be completed within 12 months. The US plant is anticipated to conduct exhibit batches in January-February. The vaccine manufacturing facility's investments will mostly conclude in the current fiscal year, with commissioning expected by April or May. A new injectable facility for Europe and emerging markets is being established in Vizag. The multi-dose capacity of a new facility is expected to be around 450 million doses. Completion and qualification of a mentioned facility is targeted for March-April and April, respectively.",
            "citations": [
              "a4cc48e033b27a7f7d0b5f4096aeded0",
              "a4cc48e033b27a7f7d0b5f4096aeded0",
              "25e48bc0cc9d141f225ce2ef4a5dd361",
              "f79a39fd873b203881771d67f12326b4",
              "f985d0cb9c05d9e00d6b9a95edb5fa08",
              "f985d0cb9c05d9e00d6b9a95edb5fa08",
              "4eb57d29fb9edfe5f650a017c8057283"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "No specific actual results regarding facility completion or commissioning timelines are available in the provided Q4 2021 data.",
              "citations": []
            },
            "['Q1', '2022']": {
              "answer": "No specific actual results regarding facility completion or commissioning timelines are available in the provided Q1 2022 data.",
              "citations": []
            },
            "['Q3', '2021']": {
              "answer": "No specific actual results for Q3 2021 regarding facility completion or commissioning are available in the provided data.",
              "citations": []
            },
            "['Q2', '2021']": {
              "answer": "No specific actual results for facility completion or commissioning are provided in the data.",
              "citations": []
            }
          },
          "evaluation": {
            "evaluation": "Insufficient Info",
            "evaluation_reason": "The provided data for Q2 2021 lacks information on the actual progress of facility development and commissioning, preventing an evaluation against management's guidance."
          }
        },
        {
          "theme": "Research and Development (R&D)",
          "narrative": "Management discussed R&D expenditure as a percentage of revenue, providing guidance for the current and next fiscal years.  The timeline for completion of clinical trials for several products was also shared.",
          "management_guidance": {
            "answer": "R&D expenditure is guided at 5.5%-6% of revenue for the full year. A potential increase of 1%-1.5% in R&D expenditure in the next year was mentioned, depending on the concentration of biosimilars Phase-3 trials. Two products are expected to complete clinical trials by mid-2022 to 2023.",
            "citations": [
              "7ba577fd4b3f24172c5906752854e02b",
              "7ba577fd4b3f24172c5906752854e02b",
              "a940b570b4ee167d8ff69782ae4385b5"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "In Q4 2021, R&D spend was Rs. 457 Cr, 7.6% of revenue. For FY21, R&D expenditure was Rs. 1,510 Cr, 6.1% of revenue.",
              "citations": [
                "2cd72d4673b5e166b338c530fb23805e",
                "d41ba069564ff8ec430c69bfb596d594",
                "debec2c32f261f24cff9d10577ef0eda"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, R&D expenditure was 6.3% of revenue (INR 358 crore).",
              "citations": [
                "0e0474959a9f48818fd578d6b2d7b29c",
                "1a4ed066302270adf9186a6677c6da95",
                "4ace15f21bc4773cc49bad813ac6613e"
              ]
            },
            "['Q3', '2021']": {
              "answer": "In Q3 2021, R&D spend was 6.1% of revenue (source 1). Phase I clinical trials were completed, and approvals were received to conduct Phase III trials for an oncology product (source 2). Phase II studies were also successfully completed (source 3). Sources are represented by their unique identifiers.",
              "citations": [
                "a5fe252cfe5bb88022a5ec44ced68784",
                "9eb7ae7618e9cc84d492ff8ee19e233b",
                "3c061a3bb8aebac6a985dff5acc7b24e",
                "fba81ff5405e10ae91f8a0be8811e18b",
                "73e1ff74007385a700008c399af92561"
              ]
            },
            "['Q2', '2021']": {
              "answer": "In Q2 FY21, R&D expenditure was 6.3% of revenue (Rs.408 crores). Clinical trials for biosimilars cost around $3 to $4 million in the previous quarter and around $17 million in Q2 FY21.",
              "citations": [
                "1af972b5ea002f48b7e2234de464c867",
                "a940b570b4ee167d8ff69782ae4385b5",
                "f79a39fd873b203881771d67f12326b4"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Exceeded",
            "evaluation_reason": "R&D expenditure as a percentage of revenue (6.3%) exceeded the guided range of 5.5%-6% in Q2 2021."
          }
        },
        {
          "theme": "Regulatory Approvals",
          "narrative": "Management provided guidance on the number of regulatory filings planned for Europe and the USA.  They also addressed the timeline for resolving compliance issues at an existing facility.",
          "management_guidance": {
            "answer": "Three product filings in Europe and two in the USA are planned by the end of the next calendar year. Resolution of CAPA issues at an existing facility is expected within two to four months.",
            "citations": [
              "a940b570b4ee167d8ff69782ae4385b5",
              "d77a01b31eafdf073819d5f0de0dc843"
            ]
          },
          "actual_results": {
            "['Q4', '2021']": {
              "answer": "In Q4 FY21, 9 ANDAs were filed with the USFDA, and final approval was received for 9 ANDAs (including 3 injectables). A total of 55 ANDAs were filed in FY21, including 16 injectables, and 42 ANDAs were approved (including 17 injectables). One DMF was filed with the USFDA during the quarter. Information on European filings and CAPA resolution is not available in the Q4 2021 data.",
              "citations": [
                "83e076ba04760ef5a1a8fc27c40155c2",
                "e4dc1e5e8a598d2d68dfdb7518c95e56"
              ]
            },
            "['Q1', '2022']": {
              "answer": "In Q1 2022, four ANDAs received final approval, and five products were launched. 150 injectable ANDAs were filed (98 with final approval, 52 under review). Cumulative ANDAs filed totaled 654 (451 with final approval).",
              "citations": [
                "4fb476f4b3e9f1f20abdc5f6d1f8193c",
                "d591401a6f43796ed457960622b34815",
                "1a4ed066302270adf9186a6677c6da95",
                "4ace15f21bc4773cc49bad813ac6613e",
                "41594e44880441162b07d0cd687be5e6"
              ]
            },
            "['Q3', '2021']": {
              "answer": "In Q3 2021, 251 DMFs were filed with the USFDA, and over 3,000 filings were made in other geographies (source 1). 141 injectable ANDAs were filed as of December 31, 2020, with 87 receiving final approval and 54 under review (source 2). The number of filings in South Africa decreased due to a backlog clearance program (source 3). No specific information on CAPA resolution is available. Sources are represented by their unique identifiers.",
              "citations": [
                "71ca8b2ae34e6de8aab1a2049264f735",
                "9eb7ae7618e9cc84d492ff8ee19e233b",
                "d5889da6904c9d6279919879cfce9545"
              ]
            },
            "['Q2', '2021']": {
              "answer": "Unit-1 received GMP certificates from European regulators. Unit-11 received GMP certificates from European, Japanese, and Brazilian authorities.",
              "citations": [
                "7524446743db199c4ef845f41d6f086a"
              ]
            }
          },
          "evaluation": {
            "evaluation": "Expectations Not Met",
            "evaluation_reason": "While the company received GMP certificates from European and other regulators for Units 1 and 11,  there’s no information on US filings or CAPA resolution progress, preventing a complete evaluation against the stated guidance."
          }
        }
      ]
    }
  },
  "step": 3,
  "updated_at": {
    "$date": "2024-11-21T11:43:50.425Z"
  }
}