[{"theme": "Geopolitical and Economic Challenges", "subtheme": "Global Market Dynamics and Trade Shifts", "score": -15, "data": {"tone": {"score": -15, "previous": 7, "current": -8}, "weight_current": 8, "weight_previous": 7, "utterances_current": {"summary": "The company's management commentary highlights their strategic focus on navigating current geopolitical and economic challenges, particularly in the context of global market dynamics and trade shifts. They emphasize the importance of their global competitive advantage and are closely monitoring market dynamics to manage trade shifts effectively. The management acknowledges that current market conditions are hindering growth. A significant portion of the discussion centers around the shifting global supply chains, with Southeast Asia being highlighted as a major supply hub. The geopolitical effects have led to a migration of business away from China, benefiting countries like Bangladesh, Vietnam, Indonesia, and India. Management is adjusting their manufacturing strategies based on market fluctuations, such as the performance of national versus private brands. They also discuss potential opportunities to capture market share from struggling smaller players. However, challenges remain in key markets like Pakistan and Sri Lanka, and some financially weaker entities might exit the market. The company notes cautious behavior among large retailers, who are reducing purchases due to market uncertainties. They emphasize the need for a disciplined approach to business operations in regions like Bangladesh, where pressures are mounting. Finally, they acknowledge that while Vietnam and Bangladesh have captured much of the business migrating from China, India is still developing the necessary infrastructure and ecosystem to capitalize on such opportunities, which will take time.", "citations": ["5b38507c42ed17a53f4dbd0112b3f039", "a2720f8f9f2d6d2486b03c23f478ebac", "c519d5584a714dd7fc2e5db4d81c03bc", "38b43c0036a38dc77c93ea2b1b1406ff", "bf9b574af30b07787ee3ce118eac759a", "48dc7b91568ffb4f95de3cb0c2443ea9", "71db5f335b90b422cd57b956348fb804", "fa4009e41faf829096e1fc159f2cc5fb", "b9ca3ac25b86796a54bf0d48308bf71c", "7693ff253b9acfed6dc6d515d2ab9b80", "aeaac283e4ffa3a388ccf4543097d259"]}, "utterances_previous": {"summary": "The company discusses various geopolitical and economic challenges affecting the global market dynamics and trade shifts. They highlight a challenging demand environment in the US, but find opportunities in other geographies where they have a strong customer base and supplier presence, which may help them navigate these difficulties. Despite high inflation, certain product categories like clothing and home furnishings are experiencing different trends in major markets like the US, contrasting with the overall inflationary trend. The geopolitical situation remains unchanged, presenting both challenges and opportunities. The company notes potential benefits from a geopolitical shift away from China as the world's factory, suggesting other regions might gain from this shift. Lastly, they express confidence in maintaining revenue levels despite a potential recession in the US, by gaining market share from other countries and companies.", "citations": ["5fa7d53b4c70186e80fd3b24cc8dccba", "da6b4a108e4c324df3f0a033a8813763", "da6b4a108e4c324df3f0a033a8813763", "5e92686ec3e64353b0953d603cb39c9d", "5e92686ec3e64353b0953d603cb39c9d", "6667874edf366984431cf9d152ff0cb8"]}}}, {"theme": "Geopolitical and Economic Challenges", "subtheme": "Inflation and Currency Impact", "score": 13, "data": {"tone": {"score": 13, "previous": -6, "current": 7}, "weight_current": 7, "weight_previous": 6, "utterances_current": {"summary": "The company is navigating geopolitical and economic challenges, particularly focusing on inflation and currency impacts. They acknowledge that fluctuations in currency rates have posed challenges and are actively adjusting their strategies to manage these impacts effectively. In regions like Bangladesh, despite inflation driven by increased petroleum and energy costs, the depreciation of the dollar offers some compensation, reducing the inflation impact to less than 1%. They are also monitoring inflation trends closely to adapt their pricing strategies. Additionally, the company notes that past tailwinds from raw material prices and foreign exchange have contributed to growth, which they are trying to leverage as part of their strategy.", "citations": ["8740431b66afa67483f1929f7bed9bf6", "643f135cda6c14e5cf5dfcee7b600fba", "7693ff253b9acfed6dc6d515d2ab9b80", "2cc7f88c95a88080ca20d67b6932c4e5", "6dd2f139a80599a7aed71ae5b8fb9a11", "c519d5584a714dd7fc2e5db4d81c03bc"]}, "utterances_previous": {"summary": "The company discusses the challenges posed by recent fluctuations in currency exchange rates and inflation, emphasizing the impact on import costs and consumer sentiment. They are managing these challenges through strategic financial measures and price adjustments. The US market shows some positive trends, but the sustainability of these trends is uncertain due to inflationary pressures. Global macroeconomic factors and inflation are highlighted as significant challenges affecting customer sentiment and various costs, including energy, housing, and consumer goods. The company is closely monitoring inflation trends to inform their pricing strategies. A question about the inflationary situation in the US hints at its importance to the business.", "citations": ["653f58f3a0eb383be2d89e2e4b50bed0", "12d5e887e84f47330da10662ca652200", "5fa7d53b4c70186e80fd3b24cc8dccba", "da6b4a108e4c324df3f0a033a8813763", "fc68b9b5fb45f0a303cedeca9d8b9123", "4b552d10dd19c403f2a5b081647c98bd"]}}}, {"theme": "Market Expansion and Strategic Partnerships", "subtheme": "Geographic Diversification and New Markets", "score": -8, "data": {"tone": {"score": -8, "previous": 16, "current": 8}, "weight_current": 8, "weight_previous": 8, "utterances_current": {"summary": "The company is emphasizing its strategy of market expansion and strategic partnerships, with a focus on geographic diversification and entering new markets. They aim to enhance their global presence by expanding operations into new geographic regions. Currently, they are present in eight countries, with no single country's contribution exceeding 35%, thus mitigating risk. Their vision is to provide supply chain solutions globally. The acquisition of a company in Vietnam has provided strategic advantages. They are also pursuing partnerships with international distributors to expand into new markets. The company is optimistic about growth opportunities in Asian markets, particularly in Vietnam and Bangladesh, which are currently outperforming India. The strategy includes leveraging each geography's growth potential, with plans for expansion in India under the PLI scheme.", "citations": ["03d05531ce981cf813ef2d93ae9967dd", "a2720f8f9f2d6d2486b03c23f478ebac", "bb2a38f1b37d7ffc83986838195ba34a", "38b43c0036a38dc77c93ea2b1b1406ff", "cb48e44e3bd9c4292470c2746f8a807a", "8740431b66afa67483f1929f7bed9bf6", "643f135cda6c14e5cf5dfcee7b600fba", "7693ff253b9acfed6dc6d515d2ab9b80", "aeaac283e4ffa3a388ccf4543097d259"]}, "utterances_previous": {"summary": "The company's management commentary focuses on market expansion through geographic diversification and strategic partnerships. They emphasize the positive outcomes from entering new geographic markets, which have led to increased customer acquisition and revenue growth. The company has diversified its customer base globally, which has helped maintain business share and operational efficiency despite macroeconomic challenges. The company leverages its multi-product and multi-country manufacturing capabilities, with operations in Indonesia, Vietnam, Bangladesh, and India, which have been advantageous during regional upheavals and logistics challenges. They also plan to expand into additional supply chains beyond their current major ones in the apparel sector. Furthermore, the company aims to increase its market share in regions like Japan, the UK, and Europe to counter trends in the US market. Their recent expansion into Southeast Asia has opened new revenue streams and strengthened their market position.", "citations": ["653f58f3a0eb383be2d89e2e4b50bed0", "fc68b9b5fb45f0a303cedeca9d8b9123", "5fa7d53b4c70186e80fd3b24cc8dccba", "e0d59734c3e5843baad19a969cc7274a", "829412629727c48c3c59c58fa63de671", "dd6145f63d195ab0106249d01d243d69", "12d5e887e84f47330da10662ca652200"]}}}, {"theme": "Sustainability Initiatives and Innovation", "subtheme": "Eco-friendly Practices and Resource Optimization", "score": -8, "data": {"tone": {"score": -8, "previous": 14, "current": 6}, "weight_current": 6, "weight_previous": 7, "utterances_current": {"summary": "The company is emphasizing its commitment to sustainability initiatives through the adoption of eco-friendly practices and resource optimization. The management is focused on reducing the environmental impact of their operations by integrating sustainable practices across various processes. Mr. Pallab Banerjee highlights efforts aimed at both reducing environmental impact and optimizing resources. Mr. Raj reiterates the company's dedication to minimizing environmental impact through eco-friendly practices. There is a consistent theme throughout the statements that focus on enhancing sustainability measures and integrating more eco-friendly practices to achieve these goals.", "citations": ["03d05531ce981cf813ef2d93ae9967dd", "a2720f8f9f2d6d2486b03c23f478ebac", "8740431b66afa67483f1929f7bed9bf6", "643f135cda6c14e5cf5dfcee7b600fba", "6dd2f139a80599a7aed71ae5b8fb9a11"]}, "utterances_previous": {"summary": "The company is emphasizing its commitment to sustainability initiatives and innovation, focusing on eco-friendly practices and resource optimization. They are adopting eco-friendly practices to reduce costs and minimize environmental impact. The company is actively exploring improvements in renewable energy and chemical efficiencies, which are in demand in the market and will benefit the company in future quarters. Additionally, they have invested in solar panels for their manufacturing plants, resulting in a significant reduction in their carbon footprint.", "citations": ["653f58f3a0eb383be2d89e2e4b50bed0", "829412629727c48c3c59c58fa63de671", "12d5e887e84f47330da10662ca652200"]}}}, {"theme": "Corporate Governance and Compliance", "subtheme": "Statutory Auditor and Governance Practices", "score": 6, "data": {"tone": {"score": 6, "previous": 6, "current": 12}, "weight_current": 6, "weight_previous": 6, "utterances_current": {"summary": "The company is emphasizing its commitment to improving corporate governance and compliance, particularly in relation to statutory auditing and governance practices. The management highlights that significant improvements have been made in governance practices over the past year, as noted by their statutory auditors. Ms. Garcia specifically mentions that the company has ensured compliance with all statutory regulations and has further strengthened governance practices. Additionally, the company has focused on enhancing its governance practices to meet the latest statutory requirements. Overall, the tone of the management commentary is positive and proactive regarding their governance and compliance efforts.", "citations": ["8740431b66afa67483f1929f7bed9bf6", "643f135cda6c14e5cf5dfcee7b600fba", "6dd2f139a80599a7aed71ae5b8fb9a11"]}, "utterances_previous": {"summary": "The company is discussing its commitment to robust corporate governance and compliance practices. They emphasize the importance of transparency and accountability in meeting statutory and regulatory requirements. Recent audits have confirmed the company's adherence to these governance practices. Additionally, they have appointed a new statutory auditor to further enhance oversight of their financial practices, reinforcing their dedication to transparency. Overall, the tone of the management commentary is one of assurance and proactive governance.", "citations": ["653f58f3a0eb383be2d89e2e4b50bed0", "fc68b9b5fb45f0a303cedeca9d8b9123", "12d5e887e84f47330da10662ca652200"]}}}, {"theme": "Operational Efficiency and Financial Performance", "subtheme": "Cost Management Strategies", "score": -1, "data": {"tone": {"score": -1, "previous": 9, "current": 8}, "weight_current": 8, "weight_previous": 9, "utterances_current": {"summary": "The company is discussing its focus on operational efficiency and cost management strategies to enhance its financial performance. It has implemented cost control measures that have significantly improved profit margins. Operational improvements have been noted in Bangladesh, with expectations of continued efficiency gains. New strategies are being implemented to improve cost management and operational efficiency. The company is optimizing cost management to maintain a competitive edge and is strategically managing resource utilization to enhance efficiency. The improvements in operational efficiency are reflected in the manufacturing cost reductions and gross margin improvements. Consistent improvements have been demonstrated in Vietnam across multiple quarters. Despite these efforts, there is an acknowledgment of the challenge investors face in identifying these improvements strictly from financial numbers.", "citations": ["03d05531ce981cf813ef2d93ae9967dd", "6dd2f139a80599a7aed71ae5b8fb9a11", "c4b027cfc7b19229820080575b5f543c", "a2720f8f9f2d6d2486b03c23f478ebac", "8740431b66afa67483f1929f7bed9bf6", "5ae692051b9ae30a5d85fd35f3648a5a", "2f35e494ffe13fa9e41f119a17d1a3eb", "602b8af623cf1e5bd3ef97ab6e3e267c", "e0721360ab56ee869a6b49ca733eb8f1"]}, "utterances_previous": {"summary": "The company is discussing its efforts to enhance operational efficiency and financial performance through various cost management strategies. There is a notable improvement in capacity utilization, which has contributed to overall operational efficiency. The company is also benefiting from falling raw material prices, although these prices are subject to fluctuations that are typically passed on to customers. The management highlights a mix of in-house and subcontracted manufacturing, with subcontracting contributing significantly to revenue, though it also increases other expenses, which remain proportional to sales. The focus on cost management strategies is set to continue, with plans to enhance operational efficiency in the next quarter. Automation, capacity utilization, inventory control, and digitization are emphasized as key initiatives to improve efficiency, leading to some observable improvements in performance metrics. Additionally, the company has implemented cost-cutting measures that have resulted in a 5% reduction in operational expenses this quarter.", "citations": ["97aca4f6b5ca577a86a799744099374f", "da6b4a108e4c324df3f0a033a8813763", "dba9b6a88bd1b047f72071ed90f8021d", "71e8da45d7aa96352cc5fbb3d28493b9", "fc68b9b5fb45f0a303cedeca9d8b9123", "829412629727c48c3c59c58fa63de671", "12d5e887e84f47330da10662ca652200"]}}}, {"theme": "Operational Efficiency and Financial Performance", "subtheme": "Working Capital and Cash Flow Management", "score": -1, "data": {"tone": {"score": -1, "previous": 8, "current": 7}, "weight_current": 7, "weight_previous": 8, "utterances_current": {"summary": "The company is emphasizing its focus on maintaining operational efficiency and enhancing financial performance through effective working capital and cash flow management. Mr. Sanjay Gandhi highlights the company's efforts in managing working capital efficiently, which ensures a stable cash flow to support ongoing operations. Additionally, the commentary suggests a readiness to make investments when necessary, indicating a strategic approach to utilizing resources efficiently. Furthermore, there is a mention of having already addressed inventory corrections, suggesting past challenges in inventory management have been managed and are no longer a current concern.", "citations": ["03d05531ce981cf813ef2d93ae9967dd", "5ae692051b9ae30a5d85fd35f3648a5a"]}, "utterances_previous": {"summary": "The company is discussing its improved operational efficiency and financial performance, highlighting significant progress in working capital and cash flow management. They report a strengthening balance sheet with a substantial reduction in gross debt and net gearing ratios on both consolidated and standalone bases. The return on capital employed (ROCE) has markedly improved, and net working capital days have decreased significantly, indicating better management of resources. The company has also seen an increase in cash and cash equivalents. Additionally, there is a mention of minimal pack and hold inventory from customers, which is not expected to persist.", "citations": ["1228eb89e7285a418911d6b044c9b77a", "4b563fb7db1afe2add9423922c564a3b"]}}}, {"theme": "Operational Efficiency and Financial Performance", "subtheme": "Revenue Growth and Profit Margins", "score": 0, "data": {"tone": {"score": 0, "previous": 9, "current": 9}, "weight_current": 9, "weight_previous": 9, "utterances_current": {"summary": "The company's management commentary reflects a positive and strategic outlook towards operational efficiency and financial performance, with a strong emphasis on revenue growth and profit margins. Despite facing tough market conditions, including inflationary pressure and macroeconomic challenges, the company has managed to deliver healthy top-line and bottom-line results. A significant driver of this performance is the improvement in operational efficiency, especially in overseas operations like Vietnam and Bangladesh, which have contributed to margin improvements. The integration of the Alpha acquisition has also been revenue and EBITDA accretive, allowing for a return on capital employed between 18% to 20%. Financial metrics are strong, with a reported PBT of INR 120 crores and PAT of INR 100 crores for nine months FY '23, showing a growth of 140% year-on-year. Revenue for the same period grew by 42% year-on-year, mainly due to a strong first half. EBITDA grew by 71% in Quarter 3 FY '23, with margins expanding to 10% compared to 6% in the previous year. The company aims to maintain high single-digit margins by the end of the year and is working towards achieving stable double-digit margins in the medium to long term, supported by a stable global economic environment. The management expresses cautious optimism about order momentum and retailer demand, which is higher than two quarters ago, indicating potential for accelerated revenue growth. Overall, the company is focused on improving operational efficiencies, reducing costs, and strategically enhancing its product and customer mix to sustain and grow its profit margins.", "citations": ["5b38507c42ed17a53f4dbd0112b3f039", "e4f14561ad5de629ec9dcbd93e5b32b8", "7f5d804a193ac2507502ca375594bff2", "c4b027cfc7b19229820080575b5f543c", "6d0cc95a849858d10aeaf8655b727b78", "b9ca3ac25b86796a54bf0d48308bf71c", "e0721360ab56ee869a6b49ca733eb8f1", "643f135cda6c14e5cf5dfcee7b600fba", "4117d2ae167c808c598c2426f78efb0f"]}, "utterances_previous": {"summary": "The company's management commentary is focused on enhancing operational efficiencies to improve profit margins, as indicated in citation 653f58f3a0eb383be2d89e2e4b50bed0. The company achieved record-breaking revenue growth, with H1 FY23 revenues increasing by 53% year-on-year, driven by a 30% increase in overseas revenue and a 60% increase in domestic revenue (97aca4f6b5ca577a86a799744099374f, dfa1f2f79b333b0dff965b910c4c0773). EBITDA also grew by 106%, with margin improvement from 5.2% to 7% (dfa1f2f79b333b0dff965b910c4c0773). Despite the impressive growth in H1, management is cautious about H2 due to potential market slowdowns but aims to maintain market share (dba9b6a88bd1b047f72071ed90f8021d). The strategy includes focusing on product mix and operational efficiencies to achieve double-digit EBITDA margins in the coming quarters (6667874edf366984431cf9d152ff0cb8). Margins are also influenced by factors like raw material prices and product mix, particularly in high-end segments in overseas markets (379229b9f301be374f6c6bcb3316118e, 4b552d10dd19c403f2a5b081647c98bd). The tone is optimistic but cautious, as management is watchful of market trends and external factors that could impact future performance (c33b0fd5a9fa139e977e97c13754f932).", "citations": ["653f58f3a0eb383be2d89e2e4b50bed0", "97aca4f6b5ca577a86a799744099374f", "dfa1f2f79b333b0dff965b910c4c0773", "dba9b6a88bd1b047f72071ed90f8021d", "6667874edf366984431cf9d152ff0cb8", "379229b9f301be374f6c6bcb3316118e", "4b552d10dd19c403f2a5b081647c98bd", "c33b0fd5a9fa139e977e97c13754f932"]}}}, {"theme": "Market Expansion and Strategic Partnerships", "subtheme": "Customer Acquisition and Retention", "score": 0, "data": {"tone": {"score": 0, "previous": 7, "current": 7}, "weight_current": 7, "weight_previous": 7, "utterances_current": {"summary": "The company is emphasizing its strategy of market expansion and strategic partnerships, focusing particularly on customer acquisition and retention. They highlight their longstanding relationships with key customers, noting that four of their top five customers have been retained for over a decade. The company has strategically established offices and teams in major locations like the US, UK, and Spain to enhance customer service and maintain proximity to their markets. They have developed a steady customer base by offering high-value, technically advanced products, which has proven successful and beneficial for the company. Additionally, they acknowledge some overlap in customer base with competitors like PDS, particularly in the UK, but suggest a differentiated focus to avoid direct competition. Overall, their tone is confident and optimistic, as they continue to leverage their strategic locations and customer relationships to adapt to dynamic market conditions.", "citations": ["bb2a38f1b37d7ffc83986838195ba34a", "bb2a38f1b37d7ffc83986838195ba34a", "48dc7b91568ffb4f95de3cb0c2443ea9", "cb48e44e3bd9c4292470c2746f8a807a", "c162b9d7de94e59d3f534f40887f15fa", "48dc7b91568ffb4f95de3cb0c2443ea9"]}, "utterances_previous": {"summary": "Based on the provided utterances, the company is discussing its approach to market expansion and strategic partnerships with a focus on customer acquisition and retention. The tone of the management commentary is confident and strategic. The company is actively expanding into new markets and acquiring new customers while leveraging its multiple manufacturing locations as a strength. It has established a strong presence in key global markets by having offices and design teams located near major customer bases in cities like New York, London, Barcelona, and La Coruna, as well as Hong Kong. This geographical presence is cited as a competitive edge over Indian competitors. The company positions itself as a strategic partner by offering comprehensive services across various locations, including design and product development, which has been well-received by its customer base. This strategy is set to be expanded in future seasons. Furthermore, the company emphasizes its strong relationships with top customers, engaging in long-term planning and being strategically positioned in mature manufacturing markets like Indonesia, Vietnam, and Bangladesh, which boosts confidence in its order book.", "citations": ["5fa7d53b4c70186e80fd3b24cc8dccba", "e0d59734c3e5843baad19a969cc7274a", "ff567e475c1ea20d037dc72c1243f9de", "4b552d10dd19c403f2a5b081647c98bd"]}}}, {"theme": "Market Expansion and Strategic Partnerships", "subtheme": "International Market Strategies", "score": null, "data": {"tone": {"previous": 0, "current": 7}, "weight_current": 7, "weight_previous": 0, "utterances_current": {"summary": "The company emphasizes the importance of strategic partnerships for its growth strategy in international markets. The management highlights that the international market strategies formulated in 2019-2020 are still being executed and will continue to unfold over the coming years. Additionally, the company is committed to making detailed and strategic investments in both India and international markets, with a focus on identifying opportunities that promise better returns. The management plans to expand into other markets in the near future and anticipates continued benefits from these strategic moves. The tone of the management commentary is forward-looking and strategic, with an emphasis on calculated growth and expansion.", "citations": ["03d05531ce981cf813ef2d93ae9967dd", "38b43c0036a38dc77c93ea2b1b1406ff", "aeaac283e4ffa3a388ccf4543097d259"]}, "utterances_previous": []}}, {"theme": "Sustainability Initiatives and Innovation", "subtheme": "Product Development and Technological Integration", "score": null, "data": {"tone": {"previous": 0, "current": 6}, "weight_current": 6, "weight_previous": 0, "utterances_current": {"summary": "The company is discussing its commitment to sustainability initiatives through product development and technological integration. They emphasize the advantages of closely collaborating on product designs, which allows for future improvements and corrections. Additionally, Dr. Patel highlights that the team is actively working on developing innovative products that incorporate the latest technology.", "citations": ["b9ca3ac25b86796a54bf0d48308bf71c", "643f135cda6c14e5cf5dfcee7b600fba"]}, "utterances_previous": []}}, {"theme": "Sustainability Initiatives and Innovation", "subtheme": "Corporate Social Responsibility and Environmental Impact", "score": null, "data": {"tone": {"previous": 6, "current": 0}, "weight_current": 5, "weight_previous": 6, "utterances_current": [], "utterances_previous": {"summary": "The company is discussing how its corporate social responsibility (CSR) initiatives are integrated with its sustainability objectives, indicating a strategic alignment between CSR efforts and environmental impact goals.", "citations": ["fc68b9b5fb45f0a303cedeca9d8b9123"]}}}, {"theme": "Corporate Governance and Compliance", "subtheme": "Regulatory and Risk Management", "score": null, "data": {"tone": {"previous": 0, "current": 6}, "weight_current": 6, "weight_previous": 0, "utterances_current": {"summary": "The company is discussing its approach to managing risk by closely monitoring global competitors and industry trends. They emphasize the importance of maintaining visibility into market dynamics, including the strategies and margins of major players. This observation allows them to strategically adapt and mitigate risks effectively.", "citations": ["bf9b574af30b07787ee3ce118eac759a"]}, "utterances_previous": []}}, {"theme": "Corporate Governance and Compliance", "subtheme": "Legal Disclaimers and Forward-Looking Statements", "score": null, "data": {"tone": {"previous": 0, "current": 0}, "weight_current": 5, "weight_previous": 0, "utterances_current": [], "utterances_previous": []}}, {"theme": "Geopolitical and Economic Challenges", "subtheme": "Government Initiatives and Policy Influence", "score": null, "data": {"tone": {"previous": 0, "current": -6}, "weight_current": 6, "weight_previous": 0, "utterances_current": {"summary": "The company is discussing the impact of the Government of India's Production Linked Incentive (PLI) schemes, focusing on the theme of Government Initiatives and Policy Influence within Geopolitical and Economic Challenges. According to Pallab Banerjee, the PLI schemes require new investments, and only after shipping goods worth more than INR 200 crores from these investments will companies start receiving the advantages of the PLI. However, this benefit is anticipated to materialize in a few years.", "citations": ["0f79bbe4d3f8b05f38c9fd5ccad9ab26"]}, "utterances_previous": []}}]