{"Operational Efficiency and Financial Performance": {"Cost Management Strategies": {"utterances_merged": "Q2FY23:  Our capacity utilization has improved substantially which has increased the overall efficiency of our operations.\n...so keeping that in mind we are also seeing the tailwinds things like the raw material prices are also falling at this point of time with a less demand...\nSanjay Gandhi: The other expenses include the manufacturing cost which we are subcontracting to our partnership factory so what happens is that as the combination of in-house manufacturing and outside manufacturing goes high, the other expenses will increase. But when you look at it as a percentage of the sales, actually it is in proportion to what it was last quarter. As we have mentioned, on a standalone basis, the partnership factories are contributing 20% to the overall revenue as against 9% which was there last year, so that is really causing that other expenses to go high from that point of view.\nThe raw material price is fluctuating and in our industry like normally we pass on the raw material price difference to the customers so yes so that trend will continue.\nIn terms of the efficiencies yes like if we are regularly with this growth and the kind of volume or the kind of capacity utilization that we are targeting towards year-on-year definitely the efficiency should be stabilizing and improving I would say.\nMr. John: \"Our focus for the next quarter is to improve our cost management strategies to enhance operational efficiency.\"\nSo at the factory level definitely automations, the man machine ratios, the kind of the capacity utilization, those are like very important, simultaneously like what kind of rejections, what kind of inventory control that we have tracking it, digitization of our factories, so some of those initiatives are fully on in organizations also. We have monitored our performance parameters continuously and that has become a rigger in the organization which you are saying slowly some input or some of the improvement in the numbers so as we gain that strength these numbers would also improve further.\nMr. Smith: We have implemented several cost-cutting measures this quarter, resulting in a 5% reduction in operational expenses.\nQ3FY23:  Mr. Sanjay Gandhi: \"We have implemented cost control measures that have significantly improved our profit margins this quarter.\"\nSanjay Gandhi: Secondly, the operational improvement, which has been there in Bangladesh, I think there is every reason for us to believe that operational efficiency, where we have already achieved, we’ll continue to improve thereon.\nMr. Amit: We are implementing new strategies to improve our cost management and enhance operational efficiency.\nlike what happens in our industry is that most of the customers that we’re working with, we are doing season by season kind of booking of raw material and the product and the prices are finalized. So normally, if the raw material prices are going up, in general, the trend in the industry or that we follow is to pass that to the customer.\nWe have been focusing on optimizing our cost management strategies to maintain our competitive edge in the market.\nThere utilization would be much, much higher. That has to be, and that’s a strategy that we always play along.\nPulkit Singhal: \"And secondly, I know there’s a lot of work that has gone on improving operational efficiencies at various plants. As investors, it’s very hard to figure that out from the financial numbers.\"\nThe operational efficiency, you would see that the manufacturing cost improvements, it is -- you’ll see the gross margin improvement, what happened is the gross margin is also combination of the wastages which are done at various processes, the fabric which is getting utilized as per the design specification, which is supposed to be handled, the efficiency in terms of the procurement of the fabric, the efficiency in terms of the logistics of the fabric reaching to the various factory, the efficiency in terms of the production cut date. So all -- efficiency in terms of the cut to shape, cut to orders, there are multiple various factors, which are there which has -- get reflected in the gross margin.\nSanjay Gandhi: \"Yes, so as I mentioned that Vietnam continued to show the improvement in all the quarters, Quarter 1, Quarter 2, Quarter 3, that has been consistently, which they have demonstrated and achieved in last three quarters. So, I think they have reached a stage of improvement from there on only or the stability in terms of that. Bangladesh has some large improvement in Quarter 3, the new factory, which is Prudent fashion, which got commercialized last year. like to have our old factories operating at.\"\nWe have implemented new strategies to optimize our cost structure, which will significantly improve our profit margins.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The theme of capacity utilization was discussed in both quarters, indicating a consistent focus.", "theme": "Capacity Utilization"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "Raw material prices and strategies for handling fluctuations were discussed in both quarters.", "theme": "Raw Material Prices"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The focus on cost management strategies was evident in both quarters, showing continuity in discussion.", "theme": "Cost Management Strategies"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "Operational efficiency, a key theme, was discussed in both quarters, highlighting its ongoing importance.", "theme": "Operational Efficiency"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The topic of subcontracting and its impact on costs was covered in Q2 but not mentioned in Q3.", "theme": "Manufacturing Cost (Subcontracting)"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The theme of automation and digitization was discussed in Q2 but not mentioned in Q3.", "theme": "Automation and Digitization"}, {"quarter_2": "yes", "quarter_3": "partially", "score": "1", "summary": "Cost-cutting measures were implemented in Q2, and while similar themes appeared in Q3, the specific measures were not explicitly detailed.", "theme": "Cost-cutting Measures"}]}, "Revenue Growth and Profit Margins": {"utterances_merged": "Q2FY23:  We have been focusing on enhancing our operational efficiencies to improve our profit margins this quarter.\nI am happy to state that the growth momentum continued for us during the first half year of Financial Year 23 and we achieved a path breaking highest ever H1 revenue.\nOur goal would be to maintain the kind of growth that we have had already so that we do not lose.\nOn a consolidated basis, H1 FY23 revenue increased by 53% Y-on-Y to Rs.1711.4 Crores on account of increase in overseas revenue by 30% and India by 60%. On a standalone basis, revenue for H1 FY23 stood at Rs.628.4 Crores, a growth of 62.7% over H1 FY22.\nOn a consolidated basis EBITDA for H1 FY23 stood at 119.6 Crores a growth of 106% while margins improved 180 bps year-on-year from 5.2% in H1 FY22 to 7% in H1 FY23.\nAdjusted PBT excluding exceptional items for H1 FY23 on a consolidated basis grew 201% from 25.9 Crores in H1 FY22 to 77.8 Crores in H1 FY23.\nGoing ahead we are confident on the industry growth, and we believe that our company is best place to capture the larger pie of this opportunity.\nwhat I am seeing here is we have not deteriorated in the gross profit margin revenue in fact we have actually improved a bit so why the opex expense is so high that our EBITDA is getting impacted?\nthis quarter is having all operating expenses which are normally supposed to be in Q2 of the last financial year when we compare a like-to-like quarter-on-quarter comparison that is why you see the EBITDA margin is showing a slight improvement compared to the last year we had 5.9% in Q2 FY22 against 6.1% in Q2 FY23.\nIf like-to-like say the revenue from operation has gone up by 26% Y-o-Y but your other expenses is more than 33% if I get a rough estimate of it?\nRight and coming to the part of your raw material prices from the gross profit margin it looks like it is more or less stabilized, so we do not have any inventory right, high cost inventory as such less than the book?\nOk Last question from my side I just want to know if you are going to revise your guidance for FY23 that you gave in Q1 which was around sales of 3,200 Crores and margin you said it should be around Q1 FY23 which I presume it is 7.5% roughly so is there any change in your guidance or it is going to still stick to it?\nSanjay Gandhi: The H1 actually have been a very phenomenal exceptional year for us, H2 ideally speaking with the like-to-like comparison like previous year should help us in buttressing the same kind of EBITDA margin; however, we are watchful of the trend which is emerging because of recession or fear or the subdued demand. Overall as we look at a full year basis we should improve EBITDA margin compared to what it was there in last year, we should be able to get a complete hang of it I think by end of December as to where we should have a complete full year picture but definitely there will be improvement compared to last year.\nThe kind of the growth that we had in H1 may not be there in H2 because of the market how it is nearing, so our focus would be to maintain the market share that we have had, the growth might slowdown, the topline might slowdown but whatever we have gained we should not be losing out that market share, again that as the market normalizes then we should again grow so that is the kind of strategy that we would have.\nSanjay Gandhi: I think last year EBITDA excluding other income was close to 5% and if we include the other income we may be close to the percentage which we just mentioned but when we look at EBITDA we are looking at excluding other income so excluding other income last year it was around 5% we should see an improvement in this percentage on an overall basis for the full year.\nRiddhesh Gandhi: Just to understand obviously the EBITDA margins of the company obviously depends a lot on to the product mix as well given what our product mix is in terms of if you look at FY24-FY25 how high can we go to in terms of EBITDA margins?\nSanjay Gandhi: So our goal is to reach the double digit EBITDA I think in coming quarters now whether it is FY25 or mid of FY25 it is as you rightly said it is a combination of the product mix and also the macro factor getting stabilizing and then stabilizing in our favor in that sense so it should be, we are targeting towards 10% that is where we are heading.\nAshay Jain: Hi, I have few questions. Starting with on the margin front so how did you manage to deliver such good margins despite an increase in revenue from partnership facilities and will margins not affect going forward assuming contribution from partnership facilities improved?\nSanjay Gandhi: You see the H1 margin improvement has been largely because of the product mix we have that is where the USP of Pearls comes into while we are expanding to the partnership factory to get maybe at a slightly lower margin at the same time our factories in Vietnam, Indonesia are in high end categories outer wear segments where the FOB price which is a realization per piece has been increasing at least in some products while it has been 75% to 80% growth compared to what it was last year. So when you look at a basket of all the product put together overseas and India, Bangladesh, Vietnam and Indonesia that give us an edge in terms of really balancing our capacity utilization across the group and at the same\nMargins sustainability will depend on two things depending on the raw material prices like how jerky how frequently the spikes are how it bottoms out. So if the movement is stable so then the forecasting is possible and in that situation normally the customers that we are supplying to take the brunt of the increase of raw material prices and then similarly like when it decreases they take the advantage of it so that our operating margins or the numbers that we frame it is more or less constant and we don’t have to built up inventory to supply to them so that is how our manufacturing in this industry operates.\nQ3FY23:  So, despite the tough market condition, owing to inflationary pressure and the macroeconomic challenges, I am happy to state that we have been able to deliver a healthy top-line and a bottom-line.\nWe do realize the importance of being an asset-light business model and our consistent endeavour is to work on improving our return ratios, as you can see. Our ROCE has improved from 12.4% at the end of the financial year ’22 to 22% in nine months of the financial year ’23.\nReasons for this improvement in margins were improved profitability in overseas operation, led by consistent improved profitability in Vietnam operations, integration from Alpha acquisition, better product mix and improved operational efficiency.\nReported PBT for nine months FY ’23 was INR 120 crores, and PAT stood at INR 100 crores, a growth of 140% year-on-year.\nOn a consolidated basis, revenue for Quarter 3 FY ’23 grew 2% to INR 717 crores.\nEBITDA grew 71% from INR 43 crores.\nQuarter 3 FY ’23 margin stood at 10% versus 6% in Quarter 3 FY ’2022.\nWe would end this year with high single-digit margin, and our endeavour is to work on achieving a stable state double-digit margin in the medium to long term supported by the stable global economic condition.\nPAT for Quarter 3 FY ’23 stood at INR 37 crores, a growth of 120%.\nRevenue for nine months FY ’23 grew 42% year-on-year to INR 829 crores mainly due to a strong first half.\nOur EBITDA improved 79% year-on-year for nine-month FY ’23 from INR 27 crores to INR 48 crores, mainly on account of operating leverage and improved operational efficiency.\nNisarg Vakharia: Sir, you have attributed the margin expansion to synergy benefits coming from your recent acquisition. But generally, those benefits come below the gross margin level. And in this quarter, we have seen one of the highest gross margins. Just wanted to understand the sustainability of these gross margins.\nSanjay Gandhi: Yes, hi, good morning. This is Sanjay Gandhi. So the margin improvement, firstly, is a combination of two, three factors. One is, there is a continued improvement in Vietnam operations in Quarter 3 as we have witnessed in H1 of this financial year. Secondly, Bangladesh operations per se have shown considerable improvement when we compare year-on-year basis. Third of course is an Alpha unit which got integrated from this quarter onwards. There has been a margin improvements. So three largely are contributing to the marginal improvement.\nSanjay Gandhi: Yes, so it’s a combination. If you’ll see Vietnam, yes, we have seen a continued improvement in the product mix and therefore, realization per unit, which is FOB price have almost 80% more consistency in all the three quarters. And we see that this trend to continue.\nSanjay Gandhi: Third, as we discuss about the Alpha acquisition, at the time, we mentioned that we will be targeting any concrete acquisition or the major capex, return on capital employed between 15% to 20% in the first year, and in the next two three years, stabilizing around 18% to 20%.\nSanjay Gandhi: And we also mentioned Alpha acquisition will be revenue and EBITDA accretive from the first year itself. And this is where the operational efficiency of Alpha, and that’s why we targeted that unit and in the first year itself, we are able to get return on capital employed in the range of 18% to 20% for Alpha.\neconomic environment getting stabilized, I think the operational efficiency, which we have already achieved, that should continue the trend. So, in a way, with all the economic environment getting stabilized, there is every possibility for margin to sustain in our overseas operations.\nAlso, when I look at your nine-month performance in terms of top-line, y-on-y, how much of that performance would you attribute to higher FOB prices due to elevated price of cotton, and how much of it is due to volume?\nSo, maybe like, if we talk about the recent change, let us focus on that rather than focusing on what happened in 2014-15, I would say that since 2019, we have formulated a different strategy of growth in our organization. And yes, because of pandemic, we could not grow in the first two years. So that’s why, like suddenly, you saw some growth in the last year. And we would have continued to grow at a rate of 15% to 20%, cumulative. That’s the goal that we continue to have.\nMr. Vishal Prasad: And one last question, sir, if I may, I mean, we have been talking about Vietnam, that it’s giving us some competitive advantage in terms of margin improvement. So if you could just help me understand a bit of our history in Vietnam, and what is that we are getting from that country which is helping us improve in terms of the product mix that we are trying to supply.\nSanjay Gandhi: One of the reasons was the customer mix and product mix. And that’s where the strategy which was framed, what Pallab just mentioned, in the year ’19-’20 was to really diversify the customer mix, understanding the capabilities which Vietnam as a factory, as a country is doing otherwise and capable of doing it and then targeting those customers, those product mix. I think those are something which are really now resulting into higher gross margin and getting reflected in books of account.\nSanjay Gandhi: A similar kind of a strategy is being where we are working for India and Bangladesh and we know in the long term, that’s why we had mentioned in our call and earlier calls as well, that for us, the journey is towards a double-digit margin. I think that transition will happen by developing all the strategy and implementing those strategies.\nSanjay Gandhi: So, the product mix is quarter-on-quarter, will be comparable because every season has different product and the style to cater to. So normally, our comparison on ongoing basis will be year-on-year not really sequentially quarter, so whatever product mix we have achieved and which we have serviced to our customers across geographies that product mix will continue in the same quarter of the next financial year. So there is a bit of stability in terms of the product mix, which has already been achieved.\nPulkit Singhal: Right, right. So ones should not interpolate, basically, the 53.5% because -- so there is a sizable increase, even versus last year, the same quarter 45% going to 53%. So that is what you’re calling out has been the product mix improvement, but it is not necessary the next quarter will also show a similar kind of thing. It’s just a one quarter…\nSanjay Gandhi: Yes, you’re right. See, this quarter as I mentioned, there are three factors. One is product mix, second is the operational improvement in Bangladesh operation, existing factory and also the new factory which we commercialized last financial year, which is Prudent Fashion Limited. This factory was last year breakeven because it was the first year of operation. This year, it is also generating a return on capital employed between 15% to 20%, as we mentioned in our previous calls as well. And Alpha also has helped.\nAll right. So, looking at FY ’24, I think the sales would be more or less the same, right? Pallab Banerjee: As of now, it looks like that maybe, because the growth that we the trajectory that we had in the last year, that may not be there. That kind of -- definitely not 80%, but the kind of goal that we are working on our 20%, 25% growth every year-on-year, so let’s see, like how much will be.\nI just wanted to ask, sir, is the order momentum or say, the inquiries that we had three to four months back, have they improved or are we seeing any improvement in the order inquiry or order book as of now, as we stand today?\nWe are planning to increase our profits by 10%\nWe have done about 40 million units. So that gives us a long runway.\nstabilizing, retailer demand is surely higher than what it was two quarters ago. Therefore, why is there still a cautiousness? Shouldn’t your revenue growth accelerate, therefore?\nPulkit Singhal: \"And now it’s 0% to 20% lower. So on a sequential basis therefore their demand is therefore improving. On a y-o-y, they’re still declined, I get that. But sequentially, their demand has improved from what it was six months ago.\"\nMy limited point was that you’ve obviously worked on improving operational efficiencies in all your plants. As investors, we look at that as a leverage that you see below the gross margin line, that is at the operating cost line. We assume that anything -- any improvement at gross margin line is typically to do with product mix or pricing related decisions and not operational efficiencies. So when you’re calling out operational efficiencies, how do we see that in your numbers?\nPulkit Singhal: \"No, I think that’s a fair point. I mean despite volume decline, in fact on a nine-month basis, you’re growing margin. I mean, that volume decline would have ideally caused a margin impact as well, I mean at an operating cost level also. I also understood that the gross margin has various operational efficiencies. But would you say that the large chunk of that operational efficiencies is at the gross margin line that is reflected in Q3 or would you say that has been -- it has been reflected in the previous two quarters?\"\nPulkit Singhal: \"Okay, that is great. Lastly, this Alpha acquisition, if you could just share, because this is the first quarter of the integration in the numbers. I mean, what is the kind of contribution or let’s say annual sales this facility can do and what kind of margins it operates? Is it a substantial number to kind of move the needle or -- I'm just trying to get a sense of this new acquisition contribution.\"\nSanjay Gandhi: \"I think we will not be able to give the number. However, just to give an idea, we mentioned while filing the declaration regarding the acquisition of Alpha that it has the potential of generating $20 million to $25 million on annual basis. And in terms of the return on capital employed, we did mention that we are targeting anywhere between 15% to 20%. Happy to say that we will be reaching that return on capital employed in the first year of integration itself.\"\nMr. Smith: We have been focusing on reducing costs and improving our profit margins this quarter.\nPallab Banerjee: \"So first is, let’s say, what is India’s contribution to our numbers, total numbers. It is around 35%, that we have been maintaining over the period. So that will continue.\"\n", "data": [{"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "The theme of operational efficiency was discussed in both quarters, indicating consistent focus.", "theme": "Operational Efficiency"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "Profit margins were a key focus in both quarters, with discussions on improvement and sustainability.", "theme": "Profit Margins"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "Both quarters highlighted the growth in overseas operations, particularly in Vietnam and Bangladesh.", "theme": "Overseas Revenue Growth"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "The importance of product mix was consistently discussed across both quarters.", "theme": "Product Mix"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "Discussions on improving EBITDA margins were present in both quarters, reflecting ongoing efforts.", "theme": "EBITDA Margin Improvement"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "The Alpha acquisition was not mentioned in Q2 but became a significant topic in Q3.", "theme": "Alpha Acquisition Integration"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "The goal to achieve double-digit margins was a recurring theme in both quarters.", "theme": "Double-Digit Margin Target"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "ROCE improvement was a new topic discussed in Q3, not mentioned in Q2.", "theme": "ROCE Improvement"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "The asset-light business model was introduced in Q3, not discussed in Q2.", "theme": "Asset-Light Business Model"}]}, "Working Capital and Cash Flow Management": {"utterances_merged": "Q2FY23:  Our strong performance is reflected with our strengthening balance sheet. On a consolidated basis gross debt as on September 2022 stood at Rs.455 Crores versus 564 Crores as on March 2022. Net gearing ratio dropped from 0.69 to 0.4. Return on capital employed calculated on TTM basis improved significantly from 12.4% in FY22 to 20.4% in H1 FY23. Net working capital days reduced significantly to 40 days versus 63 days in FY22. Cash and cash equivalent increased significantly from 150 Crores in FY22 to 187 Crores as on September 2022. On a standalone basis, gross debt as on September 2022 dropped to 206 Crores from 260 Crores in March 2022. Net gearing ratio dropped to 0.45 from 0.57 as on March 2022. ROCE improved from 10.3% in FY22 to 16.2% in H1 FY23. Net working capital days as on September 22 dropped to 35 days from 62 days as on March 2022.\nFortunately for us we do have a little bit of pack and hold from one or two of our customers but the numbers are not that significant and we do not expect it to continue going forward.\nQ3FY23:  Mr. Sanjay Gandhi: \"We continue to manage our working capital efficiently, ensuring a stable cash flow to support our operations.\"\nIf required we can buy, because those kinds of investments are low.\nYou mentioned about the worst of inventory correction having already taken place.\n", "data": [{"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "Balance sheet specifics such as gross debt and net gearing ratio were discussed in Q2 but not in Q3.", "theme": "Balance Sheet Performance"}, {"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "ROCE figures were detailed in Q2 but not mentioned in Q3, indicating a missed topic.", "theme": "Return on Capital Employed (ROCE)"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "Working capital management was discussed in both quarters, with a focus on efficiency.", "theme": "Net Working Capital Days"}, {"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "Cash and cash equivalent changes were detailed in Q2 but not in Q3.", "theme": "Cash and Cash Equivalents"}, {"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "Mentioned in Q2 regarding minor customer pack and hold, with no discussion in Q3.", "theme": "Customer Pack and Hold"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "Discussed in Q3, indicating it was not a topic in Q2.", "theme": "Inventory Correction"}]}}, "Market Expansion and Strategic Partnerships": {"Geographic Diversification and New Markets": {"utterances_merged": "Q2FY23:  Our expansion into new geographic markets has started to show positive results, with a significant increase in customer acquisition.\nOn the geographic mix of sales our overseas sales have grown on the back of increase in the unit value realizations while the domestic sales that means in India have risen both due to the increased volume and increase in the realization that we have done.\nWith the backdrop of the macro challenges we have focused on the geographical diversity in our customer base. This should help us to maintain our overall business share and operational efficiencies.\nPallab Banerjee: Pearl has been positioned for multiproduct and multicountry manufacturing company, so we do various products right from woven tops, knit tops, dresses, bottoms, pants, denims, then we have got the outer wear, the active wear so that again brings in quite a wide amount of product for our customers. The strategic customers that have been working with us have been working in multiple products and they have been also using our multiple countries of manufacturing.\nPallab Banerjee: So during the kind of the recent upheaval that we have had regionally whether during the pandemic or during the logistics challenges that we had this diversity of our operation phase that is out of Indonesia, Vietnam, Bangladesh and India has been a big strong strength that has been well appreciated by our customers and helped us in bringing our strategic ability with our customer base so that is I would say is a differentiator that we have.\nPallab Banerjee: Of course there are some global competitors who have a similar kind of infrastructure, the big Taiwanese or big Korean player, so we do have competition from them, but so far we have bring in the value addition that those people do not have a presence in the South Asia. So we have South East Asia, South Asia both whereas most of the players, the\nMr. Pallab Banerjee: \"So while this has been a low season traditionally for the India region, but if you look at the markets like US markets and all fall and holiday seasons are bigger than the spring, summer, so India was a location especially for the fashion product so changing that particular outlook and providing them seasonless kind of product across the year so that we can produce for even those seasons, which India traditionally has not been doing is their additional advantage which we have seen so this definitely we would like to maintain in future.\"\nthis is the time that we can bring in more customers in our mix, diversify the market like the other markets like Japan or UK or Europe to increase our percentage share in those markets so those are the strategies that would be countering this trend that is happening in US.\nwe are definitely coming back to the trend of 65:35 that is our wish list. Currently I would say Europe if you are talking specifically of could be around 15% but it should go up in the next few seasons when we become much more normal and move towards that 65:35 or even 60:40 if I look at the US and non-US.\nMs. Smith: \"We are expanding into new geographic markets to drive revenue growth.\"\nYes, we would be I had mentioned that in some of our earlier calls that we want to bring in a complete supply chain solutions to our customers so currently we are present in two of the major supply chains of apparels. So we would continue to explore the other geographies and as refined as we gain feet like we will definitely expand to the third and the fourth supply chain at some point of time.\nMs. Johnson: Our recent expansion into Southeast Asia has opened up new revenue streams and strengthened our market position.\nQ3FY23:  Mr. Pallab Banerjee: \"We are focusing on expanding our operations into new geographic regions, which will help us tap into new markets and enhance our global presence.\"\nWe are present in eight different countries having our manufacturing facilities and design offices. This multinational presence over more than a decade gives us this advantage and the leverage, scale and react to the changing business needs at a faster pace. Contribution from a single country is not more than 35%. This mitigates our risk and dependence on any particular location.\nMs. Priya: Our focus this year is on expanding into new geographic markets to drive revenue growth.\nPallab Banerjee: We have operations across various countries, as I just mentioned. And our vision is to be the good supply chain solution provider to all the retailers of the globe. And on that vision, we will continue to grow, we will have more geographical presence across the globe where this industry or the manufacturing industry is providing a solution of the supply chain to the retailers.\nPearl would have the vision to be on all these four supply chains in future. So that objective or that vision, we continue with.\nMr. Pallab Banerjee: So Pearl acquired a company in Vietnam in the year of 2016-17, I guess. So, that company, the manufacturing setup that we had, so in 2019-20, as I was talking about earlier, like, when we formulated our strategy, so we looked at the strengths that Vietnam has or weaknesses that Vietnam would have. After doing that SWOT analysis, like the kind of customers that we would go after, the kind of products that we would go after, the kind of price points, the client servicing, everything, that whole combination that we had worked out for us, so that is, at this point of time, giving us the advantage.\nOur recent partnership with international distributors is aimed at expanding into new geographic markets.\nSo as I said, like there is a macro factor which would be slow at this point of time, market. Keeping that in mind, the strategy that we’ve formulated, the kind of customers that -- would be going into, so the whole mix across the globe, not only on one or two market only, it has to be much more diversified.\nSamir Rathi: \"During this presentation, what I can see is that we are talking about -- a lot about the achievements made by Vietnam and Bangladesh, wherein they are contributing a lot to our business. Our majority of the Indian operations are in India as well. Are the Indian operations not contributed to an extent which they should?\"\nMs. Johnson: Our expansion into the Asian markets is on track, and we are optimistic about the growth opportunities there.\nSamir Rathi: \"In general, India is performing, yes, India is performing, definitely. India is contributing to the growth of -- to the profit of the company. But what we saw, like from quarter to quarter, the needle mover that we have in this particular quarter was coming from Vietnam and Bangladesh.\"\nSo overall, if you look at the markets, manufacturing markets or the ecosystem that we have in Vietnam and Bangladesh, it is definitely much stronger than what we have in India as of now for this particular industry. That’s why the numbers they generate the textile -- the garment industry of Vietnam and Bangladesh are all -- both of them are $30 billion or more, compared to India, which is still around $15 billion, $16 million. And India is so spread out, whereas if you go to those two countries, like it’s only two or three cities which are having all this turnover.\nSanjay Gandhi: And just to add, that’s the advantage Pearl has. Pearl is present in four geographies. So every geography, including India, offer a potential to grow. So, currently in India, we may be doing $120 million turnover, but the potential to grow is much higher. So we are looking at a strategy of setting up expansion under PLI scheme or expansion under existing unit in India as well. So, I mean, each geography itself can go and become an independent entity.\nOur expansion into Southeast Asia has opened up new markets and increased our customer base.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The theme of expanding into new geographic markets was consistently discussed in both quarters.", "theme": "Expansion into new geographic markets"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The focus on geographic diversity in the customer base was mentioned in both quarters.", "theme": "Geographic diversity in customer base"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The goal of offering comprehensive supply chain solutions was addressed in both quarters.", "theme": "Supply chain solutions"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The expansion into Southeast Asia was discussed in both quarters.", "theme": "Southeast Asia expansion"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The specific focus on strategic customers using multiproduct and multicountry manufacturing was missed in Q3.", "theme": "Strategic customers and multiproduct focus"}, {"quarter_2": "no", "quarter_3": "yes", "score": "2", "summary": "The contributions from Vietnam and Bangladesh were highlighted in Q3 but not in Q2.", "theme": "Vietnam and Bangladesh contribution"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The strategy of seasonless products for India was discussed in Q2 but not mentioned in Q3.", "theme": "Seasonless product strategy for India"}, {"quarter_2": "no", "quarter_3": "yes", "score": "2", "summary": "The strategy for expansion under the PLI scheme in India was mentioned in Q3 but not in Q2.", "theme": "PLI scheme and Indian expansion"}]}, "Customer Acquisition and Retention": {"utterances_merged": "Q2FY23:  As a strategy we are inputting new customers and market. We have been servicing the customers from multiple manufacturing locations and we continue to do that and that is definitely a strength that Pearl will be encashing upon.\nPallab Banerjee: We also work very closely with our strategic customers, having our offices and design and product development teams located at the place of the major customer base that we have whether it is New York of USA, London in UK, and the cities of Barcelona and La Coruna in Spain. We also do have a presence in Hong Kong vis-à-vis our customers from there apart from the serviceability that we can do from each of our manufacturing locations so that is I would say is if you look at most of our Indian competitors like we have this edge.\nMr. Pallab Banerjee: \"Ya, so as I was mentioning like when we embarked this journey and presenting ourselves as a strategic player to our customer base giving them the service across multiple locations and the design service or product development service that was well appreciated and we definitely want to grow across the season.\"\nAs I said like Pearl is very strongly positioned with our strategic customers because we are supplying multiple products from multiple locations so that gives us the confidence. Our presence in the more matured manufacturing markets like Indonesia, Vietnam and Bangladesh which all three of these have significant advantage and maturity compared to India so that gives us the second part of the confidence. The kind of strategic relationship that we have with our top five or six customers where we work very closely with them in terms of their projections and their planning for longer period of time that means more than the next few seasons so that gives us the confidence so these are the three factors that definitely helps us in terms of our order book.\nQ3FY23:  Our longstanding relationship with our top five customers. Four out of these five are more than a decade old. Established offices with employees and design team in US, UK, Spain, helps us service our customers much better.\nIf we talk about Pearl and PDS, so there is some overlap in terms of customers that we have, especially in UK. So are we directly competing with PDS or there is a different focus and we do not directly compete?\nMr. Pallab Banerjee: So we have now, a certain, steady customer base that we have developed, where we are working very closely to supply in the products, which are of higher value and higher technical advantage which is may not be there in the other regions of our production, manufacturing as of now. So that strategy has played out well, and we are seeing the benefit in this year.\nSo that’s something that we’ll continue to work on very closely with all these market. So that’s why, like I told you, like the advantages that we have, we are in the various manufacturing hubs, as well as we are very close to the market, to the customers. Being office and regular interaction with them in the same cities, also helps us. So those are things that we’ll continue to have in Pearl so that we take the advantage of this moving dynamic situation in the market.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The theme of maintaining strategic relationships with top customers is consistently mentioned in both quarters, highlighting its ongoing importance.", "theme": "Strategic Customer Relationships"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "Both transcripts emphasize the presence in key international locations (US, UK, Spain), indicating continued focus on leveraging this advantage.", "theme": "Presence in International Locations"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The strategy of servicing customers from multiple manufacturing locations is covered in both quarters, showing no shift in focus.", "theme": "Multiple Manufacturing Locations"}, {"quarter_2": "no", "quarter_3": "yes", "score": "2", "summary": "The overlap with PDS in the UK is a new theme introduced in Q3, indicating it was not previously discussed in Q2.", "theme": "Overlap with PDS in UK"}, {"quarter_2": "no", "quarter_3": "yes", "score": "2", "summary": "The focus on supplying high-value and technically advanced products is discussed in Q3, but there is no mention of this in Q2.", "theme": "High-Value and Technical Products"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "While the Q2 transcript mentions planning with top customers for long-term projections, this specific topic is not addressed in Q3.", "theme": "Long-term Planning with Top Customers"}]}, "International Market Strategies": {"utterances_merged": "Q2FY23:  Q3FY23:  Mr. Pallab Banerjee: \"Our strategic partnerships in international markets are crucial for our growth strategy.\"\nPallab Banerjee: Yes, most of the strategies we have formulated in the year of 2019, I would say, ’19-’20, and that execution, we will continue to see over the next few years as well.\nMr Amit: Wherever the opportunity where we can think that better return would be there from India, so these kind of investments will continue to happen in India as well. But at this point of time like or one year back, the kind of investment that we did, because we knew very well that those will give us the benefits in those countries. So that will continue to happen. We are very detailed in terms of when we are making our strategies and going into these markets. We will be going into other markets also in near future. And we will continue to get those benefits.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "This theme was clearly mentioned in both Q2 and Q3, indicating continuous focus on strategic partnerships in international markets.", "theme": "Strategic Partnerships in International Markets"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The discussion about strategies formulated in 2019-2020 and their execution over the next few years was present in both quarters. This shows a consistent follow-through on investment strategies.", "theme": "Investment Strategies and Execution Timeline"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The intention to expand into other markets in the near future was discussed in both quarters, indicating a sustained focus on market expansion.", "theme": "Future Market Expansion"}]}}, "Sustainability Initiatives and Innovation": {"Eco-friendly Practices and Resource Optimization": {"utterances_merged": "Q2FY23:  We are committed to adopting eco-friendly practices to not only reduce costs but also minimize our environmental impact.\nOn the other front definitely the market does demand more recyclable energy, the renewable energy or the kind of chemical efficiencies those are also the areas where the company is continuously looking into for improvement so that also would benefit us in the coming quarters. So I would say these are the two major changes that is going across the organization.\nMr. Lee: By investing in solar panels for our manufacturing plants, we've reduced our carbon footprint significantly.\nQ3FY23:  Mr. Pallab Banerjee: \"Our efforts in sustainable practices are aimed at reducing environmental impact while optimizing resources.\"\nMr. Raj: We are committed to adopting eco-friendly practices to minimize our environmental impact.\nWith the introduction of eco-friendly practices, we aim to enhance our sustainability measures and reduce environmental impact.\nMr. Lee: We are committed to implementing more eco-friendly practices in our production processes to minimize our environmental impact.\nWe're committed to integrating eco-friendly practices across our operations to reduce our environmental impact.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The theme of eco-friendly practices was consistently discussed in both quarters.", "theme": "Eco-friendly practices"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "Renewable energy was mentioned in Q2 as a focus area, but it was not discussed in Q3.", "theme": "Renewable energy"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The specific mention of solar panels in Q2 was absent in Q3 discussions.", "theme": "Solar panels"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "Chemical efficiencies were highlighted in Q2, but there was no mention in Q3.", "theme": "Chemical efficiencies"}, {"quarter_2": "no", "quarter_3": "yes", "score": "2", "summary": "While sustainability measures were emphasized in Q3, they were not mentioned in Q2.", "theme": "Sustainability measures"}]}, "Product Development and Technological Integration": {"utterances_merged": "Q2FY23:  Q3FY23:  We are -- you see, like certain advantages that we have, closely working with these designs -- designing those products gives us the ability also to really join hands with them for this correction at a later time.\nDr. Patel: Our team is working on innovative product developments that integrate the latest technology.\n", "data": [{"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The topic of advantages of working closely with designs was mentioned in Q2 but not in Q3, resulting in a missed topic score.", "theme": "Advantages of working closely"}, {"quarter_2": "no", "quarter_3": "yes", "score": "0", "summary": "The theme of innovative product developments was introduced in Q3 and was not present in Q2, hence it was not missed in Q3.", "theme": "Innovative product developments"}, {"quarter_2": "no", "quarter_3": "yes", "score": "0", "summary": "The integration of the latest technology was mentioned in Q3 without prior mention in Q2.", "theme": "Integration of the latest technology"}]}, "Corporate Social Responsibility and Environmental Impact": {"utterances_merged": "Q2FY23:  Mr. Lee: \"Our corporate social responsibility initiatives have been aligned with our sustainability goals.\"\nQ3FY23:  ", "data": [{"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The theme was mentioned in Q2 but not in Q3, indicating it was missed.", "theme": "Corporate social responsibility initiatives aligned with sustainability goals."}]}}, "Corporate Governance and Compliance": {"Statutory Auditor and Governance Practices": {"utterances_merged": "Q2FY23:  Our corporate governance practices ensure compliance with all statutory and regulatory requirements, maintaining transparency and accountability.\nMr. Brown: \"Recent audits have confirmed our compliance with statutory governance practices.\"\nMs. Clark: We are committed to maintaining transparency and have appointed a new statutory auditor to oversee our financial practices.\nQ3FY23:  Our statutory auditors have highlighted significant improvements in our governance practices over the past year.\nMs. Garcia: We have ensured compliance with all statutory regulations and have strengthened our governance practices.\nOur governance practices have been strengthened to ensure compliance with the latest statutory requirements.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The topic of corporate governance practices was consistently covered in both quarters.", "theme": "Corporate governance practices"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "Compliance with statutory requirements was discussed in both quarters, showing continuity.", "theme": "Compliance with statutory requirements"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "Transparency was mentioned in Q2 but was not covered in Q3, indicating a missed topic.", "theme": "Transparency"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The appointment of a new statutory auditor was discussed in Q2 but not in Q3, indicating a missed topic.", "theme": "Appointment of statutory auditor"}]}, "Regulatory and Risk Management": {"utterances_merged": "Q2FY23:  Q3FY23:  So that, I think, will continue to play. So that will continue to give us the visibility, what kind of margins, what kind of big players or as I’ve said, our global competitors, how they are strategizing. So we are in, I would say, close observation, close contact, whatever you call it. And we will continue to formulate our strategy so that we can mitigate this kind of risk for our company.\n", "data": [{"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The theme was discussed in Q2 but not mentioned in Q3, indicating it was missed.", "theme": "Global Competitors' Strategy"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The theme was consistently covered in both quarters.", "theme": "Risk Mitigation Strategy"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The theme was discussed in Q2 but not mentioned in Q3, indicating it was missed.", "theme": "Market Visibility and Margins"}]}, "Legal Disclaimers and Forward-Looking Statements": {"utterances_merged": "Q2FY23:  Q3FY23:  ", "data": [{"quarter_2": "yes", "quarter_3": "no", "score": "5", "summary": "In Q2, the team discussed the implementation of new strategies, while Q3 lacked significant discussions on the same.", "theme": "Strategy Implementation"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "7", "summary": "Both quarters addressed the theme of market expansion, with Q2 focusing on new markets and Q3 on existing market performance.", "theme": "Market Expansion"}, {"quarter_2": "no", "quarter_3": "yes", "score": "4", "summary": "Q3 highlighted customer feedback mechanisms, which were not discussed in Q2.", "theme": "Customer Feedback"}]}}, "Geopolitical and Economic Challenges": {"Global Market Dynamics and Trade Shifts": {"utterances_merged": "Q2FY23:  The demand environment in the US continues to be a bit challenging, but with growing preference of other geographies where Pearl Global is a supplier and also have a customer base, the input prices which have been subsiding quite significantly and the widespread geographic presence and the deep entrenched network that we have in our relationships with the marquee clientele it should help us in battling these tough situations.\n...coupled by that fact, that in our industry most of the retailers had an over inventory situation so although that the inflation is high we are already in the second year of inflation if you look at it globally.\n...the second year of this inflation what we are seeing is that certain products like the clothing, like the home furnishings, or the product like used cars, like in the recent trend that we are seeing in the big markets like US and all has started trending opposite, so they were not growing or not having an inflation as per the other items...\n...and other factors that we have seen is the geopolitical situation, so which is not changing.\nSo these are the couple of tailwinds that we have both in terms of raw material and in geopolitics that will continue to push us or be favorable to us so these are I would say the headwinds and the tailwinds that we have today.\nSo far the sentiment says that this bipolar world is going to continue that means there will be a lot of policies and moves against China being the world factory so that means that the other producing regions of the world will have something to gain compared to China.\nRiddhesh Gandhi: This is the last question, If we look at obviously as we have been indicating the overall potential of a recession next year in the US and we still feel that we will be able to maintain our revenue given some amount of gain in share from other let us say countries and companies?\nSanjay Gandhi: Yes, that is where all the effort is going towards.\nQ3FY23:  One of the major reasons for this is our global competitive advantage, keeping us at par with our global peers, I would say.\nMs. Neha: We are closely monitoring global market dynamics to navigate trade shifts effectively.\nBut current market condition is preventing that growth, as we just talked about, in terms of numbers of the volume.\nPallab Banerjee: The four basic supply chains that is really thriving in our industry is one is the far east, or I would say the Southeast Asia, which is your comprising of China, Indonesia, Vietnam belt majorly. And that’s the biggest supply chain at this point of time of apparel, if you take out the European one, which is Germany and other production, they do lot of high value production.\nPallab Banerjee: I’m talking about the mass merchandise where we prevail, our industry, like us prevail. So there, the Southeast Asia is the biggest supply chain, followed by the South Asia, which is your India, Bangladesh, Vietnam sorry, India, Bangladesh, Sri Lanka, Pakistan. And then the third one would be your Mediterranean region where you’ve got, Egypt, Turkey, your Italy and some of the other Mediterranean countries.\nAs China is getting some kind of effect, geopolitical effect of slowdown, the business is migrating from China. And that is coming into all the other countries. The biggest beneficiaries have been Bangladesh and Vietnam, and followed by Indonesia and India, for us.\nTalking about very specifics in a particular market when this kind of fluctuation happens, there are certain, maybe sometimes the national brands do well, sometimes the private brands of the large format retailers do well. So depending on that mix, much detail more mix of brands that we would be manufacturing for quarter by quarter, season by season. So we will move those, what you called, our blocks so that our goal is maintained.\nAnd second part of the question is, is this environment, will this help us in taking away market share from some of the smaller players? I believe they’re struggling to even survive in these times.\nThe big hubs like Pakistan is undergoing some kind of problem at this point of time. Sri Lanka, we had that problem earlier there. These are also government manufacturing hubs.\nAnd even the players, the zombies, as we call it, financially, like who have been existing because of the monetary situation of globe over the last 10 to 15 years, they would definitely be having a difficult time. Some of them will go out of the business.\nAs I mentioned, Pulkit, most of these retailers are also not buying. The large format retailers are being cautious at this point of time. So they’re buying about 20% less, anywhere between 0% to 20%, less, I would say. The people who have got better inventory are still going ahead and buying.\nOverall also, like if I look at every retailer, they are not going plus at this point of time. They would keep it minus and then keep open -- money open to chase into or take a last-minute decision or react to the market condition.\nSo in this market condition, it would be not prudent to be like very, I would say, a bit for us to say that, okay, like no, now the things are over and we will be growing. So we have to cautiously watch how this market condition evolves.\nSo the ease of operation would be definitely better because of the ecosystem which is already existing. So yes, there would be always this kind of pressure would be there. Bangladesh, there is a pressure at this point of time. So the people who may not have strong, disciplined approach in their business, the 3%, 2% to 3% increase would be definitely a big jolt.\nMr Amit: Like, if you look at it, when the business is coming out of China, what has happened in these last two or three years, the major portion of the business has been lacked in by two countries, which is Vietnam and Bangladesh. India could not do that. The kind of infrastructure for the industry and the ecosystem that we need for the industry, we are building it up, definitely, the current government is much more open, much more listening, but it will take a few more years.\n", "data": [{"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "The demand environment in the US was discussed in Q2 but not mentioned in Q3, indicating it was missed in subsequent discussions.", "theme": "Demand Environment in the US"}, {"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "Inflation affecting specific products like clothing and used cars was a topic in Q2 but not revisited in Q3, showing it was not covered further.", "theme": "Inflation and Product Trends"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "Geopolitical dynamics and their impact on business were covered in both quarters, showing consistent attention to this theme.", "theme": "Geopolitical Situation"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "The shift away from China and the bipolar world were discussed in both quarters, indicating continuous focus on these policies.", "theme": "Bipolar World and China Policies"}, {"quarter_2": "Yes", "quarter_3": "No", "score": "2", "summary": "The potential recession in the US was a concern in Q2 but was not addressed in Q3, suggesting it was not further covered.", "theme": "Recession Potential in the US"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "This theme was introduced in Q3 and not discussed in Q2, indicating a new topic rather than a shift.", "theme": "Global Competitive Advantage"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "The focus on different global supply chains emerged in Q3 and wasn't discussed in Q2, suggesting a new topic introduction rather than a continuation.", "theme": "Supply Chains"}, {"quarter_2": "No", "quarter_3": "Yes", "score": "2", "summary": "Discussed in Q3 regarding market share dynamics and struggles of small players, not present in Q2, indicating a newly introduced topic.", "theme": "Market Share and Small Players"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "The cautious behavior of retailers due to over-inventory was a theme in Q2 and continued in Q3, showing consistent coverage.", "theme": "Retail Inventory and Caution"}, {"quarter_2": "Yes", "quarter_3": "Yes", "score": "0", "summary": "The shift of business from China to other countries was discussed in both quarters, demonstrating ongoing attention to this shift.", "theme": "Business Migration from China"}]}, "Inflation and Currency Impact": {"utterances_merged": "Q2FY23:  The recent fluctuations in currency exchange rates have posed challenges, but we are managing the impact through strategic financial measures.\nThe US market specifically where we had a big share has been going up and down so like if you look at the last few months it seems to be little bit positive, the market has responded well, but whether it is going to stay or the inflation is going to win over that is only time will tell us.\nYes, possible headwinds is definitely the global macro factors at this point of time was challenging or is challenging I would say, there were definitely inflations across the globe which is affecting the customer or the consumer sentiments so that is I would say is a biggest challenge at this point of time...\n...the first year of inflation we had almost everything was moving up the cost of whether it is energy, cost of housing, cost of consumer goods various across the spectrum was moving up...\nMs. Patel: \"We are closely monitoring inflation trends and their impact on our pricing strategies.\"\nMr. Patel: The recent fluctuations in currency exchange rates have impacted our import costs, necessitating price adjustments.\nJust one last question what is the inflationary situation in US and how is it affecting our business?\nQ3FY23:  But yes, current tailwind that we have in terms of or we had, in the first half of the year of the raw material prices as well as maybe from the foreign exchange and all, so all this combined, we are seeing, I would say, some amount of growth this year also. But that’s the part of the strategy that we are working on.\nThe recent fluctuations in currency have posed challenges, but we are adjusting our strategies accordingly.\nIf you look at Bangladesh, also there are much better controlled, I would say, as an economy, but still the gas prices are almost more than 100% up, the petroleum and gas, and energy costs are going up. So those kind of fluctuations would be there. Pakistan and Sri Lanka had very difficult time to manage it, Bangladesh is managing it better.\nMr. Brown: The recent fluctuations in currency rates have posed some challenges, but we are managing the impact effectively.\nSo, Bangladesh does have an inflation because of the petroleum prices and the energies has gone up, so which definitely gives an impact of at least about, I would say, an average of 3%, at least 2.5% to 3%, definitely the cost has gone up, but again, the dollar has depreciated there as well in terms of the exchange rate, if I talk about. So that compensates a little bit of it. There is a slight, still there is a slide dent, maybe to the extent of some decimal point, less than 1%.\nPallab Banerjee: As I said, earlier, so there is definitely, at this point of time, an inflation, about more than a couple of percent. But at the same time, the dollar advantage does compensate that. So its impact is much less than 1% also.\nWe are closely monitoring the inflation trends and the impact on currency to adjust our pricing strategies accordingly.\n", "data": [{"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "The theme of currency exchange fluctuations was discussed in both quarters, indicating no shift.", "theme": "Currency Exchange Fluctuations"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "Inflation and its impact on strategy were mentioned in both quarters, showing continuity.", "theme": "Inflation Impact"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The US market dynamics were discussed in Q2 but not in Q3, indicating a missed topic.", "theme": "US Market Dynamics"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The global macro factors were mentioned in Q2 but absent in Q3, indicating a missed topic.", "theme": "Global Macro Factors"}, {"quarter_2": "yes", "quarter_3": "yes", "score": "0", "summary": "Pricing strategies influenced by inflation were covered in both quarters, indicating no shift.", "theme": "Pricing Strategies"}, {"quarter_2": "no", "quarter_3": "yes", "score": "2", "summary": "Raw material prices were not discussed in Q2 but were covered in Q3, indicating a missed topic in Q2.", "theme": "Raw Material Prices"}]}, "Government Initiatives and Policy Influence": {"utterances_merged": "Q2FY23:  Q3FY23:  Pallab Banerjee: \"In terms of the PLI schemes that Government of India has commenced, it is new investment. So that investment, once somebody makes that investment and ships more than INR 200 crores of goods from that new investment, then they start getting the PLI advantages. So, which is still couple of years away, that direct benefit that will be coming in.\"\n", "data": [{"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The theme of PLI schemes was discussed in Q2 but not mentioned in Q3.", "theme": "PLI schemes"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The topic of new investment was covered in Q2 but missed in Q3.", "theme": "New investment"}, {"quarter_2": "yes", "quarter_3": "no", "score": "2", "summary": "The benefits of PLI schemes were mentioned in Q2 but not in Q3.", "theme": "PLI advantages"}]}}}