[{"theme": "Financial Performance and Strategy", "topics": [{"topic": "Revenue growth analysis", "data": {}}, {"topic": "Free cash flow dynamics", "data": {"['Q2', '2020']": {"answer": "608cede1cfb02bcdff699556c5f0c113 --> Going forward and in the absence of any unforeseen escalation of COVID-19 and new travel restrictions, it is our ambition not to consume cash before M&A and customer financing in the second half of the year.\n\n0d5b2759963692a2f054c6f131b166fc --> It is our ambition not to consume cash before M&A and customer financing in the second half of 2020.\n\nf78e0d4dbb90e06608b2493ef5f2acd9 --> Weʼve set ourselves the objective to – not to consume cash in the second half of the year before M&A and customer financing.\n\ncf2ff7f729b9d8dc366677bafd3345a9 --> And I think this will be a key focus item for next year, in 2021, to stabilize the cash. We have some cash outs, exceptional cash outs like the severance pay that weʼll need to deliver next year. And then, of course, thereʼs an offset weʼre trying to achieve with working on these prefab, prefinished goods inventories to bring them more in line with the rates.", "citations": ["608cede1cfb02bcdff699556c5f0c113", "0d5b2759963692a2f054c6f131b166fc", "f78e0d4dbb90e06608b2493ef5f2acd9", "cf2ff7f729b9d8dc366677bafd3345a9"]}, "['Q4', '2020']": {"answer": "849f400e0af4d6bb41837760e94e7205 --> Our free cash flow before M&A and customer financing is expected to be at least €2 billion in 2021.\n\n433f54a5acc69ce6dbbf2df4ac04df8f --> In the current market environment, a low level of customer financing may not be sustainable, and we anticipate some usage of cash in the coming years. We intend to mitigate that consumption via external financing sources with support from the export credit agencies.\n\n6a390df847274ec0a48f8c15a526893c --> The company expects to have a cash outflow in the mid-triple-digit millions for a couple of years, tapering off over the following couple of years.", "citations": ["849f400e0af4d6bb41837760e94e7205", "433f54a5acc69ce6dbbf2df4ac04df8f", "6a390df847274ec0a48f8c15a526893c"]}, "['Q1', '2020']": {"answer": "fb00a3d3d3dde532c198ef72f5fd345f --> In the coming quarters, we will continue to focus on cash preservation and we'll be reducing cash outflows with the aim of stopping the net cash consumption by Q4.", "citations": ["fb00a3d3d3dde532c198ef72f5fd345f"]}, "['Q4', '2021']": {"answer": "3455914080698277a6608cca3ab99e44 --> Dominik Asam [The guidance I'm going to give you is that for this year ʼ22, I think that the sum of the two will a headwind in that cash conversion calculation of about half a billion.]\n\n3455914080698277a6608cca3ab99e44 --> Dominik Asam [This is explaining why we go from the €5.5 billion EBIT adjusted down to a €3.5 billion free cash flow.]", "citations": ["3455914080698277a6608cca3ab99e44"]}, "['Q1', '2021']": {"answer": "d962b984398f82b4d313e4965e5ae2cf --> we are not expecting that you will have a kind of very strong positive Q1 free cash flow.", "citations": ["d962b984398f82b4d313e4965e5ae2cf"]}, "['Q1', '2022']": {"answer": "fbb2edd987774138bdbac05cd5c4ddee --> Going forward, the further cash in as in recent years will not be sustainable as we anticipate some usage of cash in this and the coming years.", "citations": ["fbb2edd987774138bdbac05cd5c4ddee"]}, "['Q3', '2024']": {"answer": "2b6e30918ac1b0c968aef56dc0dbcd91 --> With the deliveries that we expect until the end of the year, that should be the major factor to bring the cash flow to our target.", "citations": ["2b6e30918ac1b0c968aef56dc0dbcd91"]}, "['Q3', '2021']": {"answer": "c8d9987290a45eed0c6f08711b8708c8 --> It reflects our efforts on cash containment and also includes a strong positive phasing impact in working capital, part of which is expected to be neutralized in Q4 2021.\n\n5ea9382daf843e407d59d8a7977fe635 --> When it comes to our fiscal year 2021 free cash flow, and in particular, looking at our working capital, we expect the 9-month phasing effects to be partially neutralized in the fourth quarter and to see an impact from our single-aisle ramp-up.\n\n3fb75b7fea9a476e3dd4e2ac45e634dd --> And all these factors will, in total, bring the free cash flow down to the kind of €4.2 billion remain to do, which we have guided from today's perspective.", "citations": ["c8d9987290a45eed0c6f08711b8708c8", "5ea9382daf843e407d59d8a7977fe635", "3fb75b7fea9a476e3dd4e2ac45e634dd"]}, "['Q3', '2020']": {"answer": "70e186f983acdb7f98f4cb2eb2853a12 --> Post Q3, we took additional steps to extend the maturities of our funding sources. In October, we successfully refinanced our €3 billion credit facility maturing in 2021 by securing a new one for a total of €6 billion with initial maturity of three years and two extension options of one year.\n\n0340ee2b749ae63d5bb2bf1ab86257a3 --> On that basis, the company targets at least breakeven free cash flow before M&A and customer financing in the fourth quarter of 2020.\n\n0340ee2b749ae63d5bb2bf1ab86257a3 --> We will also keep our strong focus on cash containment, and of course on achieving our free cash flow before M&A and customer financing guidance in the fourth quarter.", "citations": ["70e186f983acdb7f98f4cb2eb2853a12", "0340ee2b749ae63d5bb2bf1ab86257a3"]}}}, {"topic": "Profitability trends", "data": {"['Q4', '2020']": {"answer": "8032b08d222324584e51733231ad63bf --> But in total, we talk about a mid-triple-digit million number for all these, what I call, nonsustainable savings in 2020.", "citations": ["8032b08d222324584e51733231ad63bf"]}, "['Q4', '2021']": {"answer": "b13f6d4ad37a7925b3deb320e6dd05ae --> Dominik Asam [We see some opportunities to gradually, over a five year planning horizon, move the margin slightly up.]", "citations": ["b13f6d4ad37a7925b3deb320e6dd05ae"]}, "['Q2', '2023']": {"answer": "0661feafc8da85cbcf5b8172f33c1cdb --> And that's why it's really important to ramp up and to reach that rate 14, at least for Airbus. That's when we start to become profitable.", "citations": ["0661feafc8da85cbcf5b8172f33c1cdb"]}}}, {"topic": "Earnings guidance and projections", "data": {"['Q3', '2023']": {"answer": "74b0610f4d7510f927b16b5f1a39d558 --> We maintain our 2023 guidance, while acknowledging that the charges recording in our Space business are putting some additional pressure on EBIT adjusted.\n\ndadb63990a606c8c0b9a2b6b79be29d1 --> [Inferred as CEO] \"to achieve in 2023 around 720 commercial aircraft deliveries, EBIT adjusted of around EUR6 billion and the free cash flow before M&A and customer financing of around EUR3 billion.\"\n\nf5b1787861adbe198c214d296d55d80a --> We expect our CapEx to slightly increase in 2023, supporting our industrial ramp-up.\n\n7873207c398e2e10f418d15d90fb28f3 --> We think we are well placed to deliver the 161 planes that would around the 161 that will bring us around the 720 for the year.\n\ncf5d2978554ed87dcdb864e784e33e07 --> So, I need to say it very clearly. And for Pratt & Whitney that's the case as well for 2024. So, we will be ramping up in 2024.\n\nbd521dd06f400e0afddfb41774743822 --> Overall, the Q4 that we're expecting is slightly above what we had last year. And I think with delivery trajectory that we currently have, this is also what we deem fully realistic.\n\n0684070f6eb14951b2c33497bd52dcb0 --> Phil Buller [The midterm rates come 2026 are even higher on the A350]\n\nc9b1e2d8811bd7a31b5ac0c262cff65d --> Thomas Toepfer [We said that we think we're able to generate a high-single-digit margin on it going forward, and I think that is also the ambition that we have for the business in the future.]\n\n8c7c906837153a76019ac5d4fad45b10 --> On the 220, we are going to or we think we're going to deliver this year according to our plan that contributes to the reaching the guidance, the ramp-up it still targets the rate 14 by 2026.\n\na44bd966b72928ca46147a42bf6c2e6e --> The reason why we are raising from the previously announced rate nine in 2025 to now rate 10 in 2026.\n\n32bc288b5027c65933fda0344245027b --> We have been on track, in-line with the trajectory for the first nine months of the year, and therefore, we're also expecting that Q4 will evolve accordingly. That is fully baked into our guidance and also, therefore, I can confirm that, of course, we're also seeing the inflation, but it's not an additional risk relative to what we have that we would achieve this year.", "citations": ["74b0610f4d7510f927b16b5f1a39d558", "dadb63990a606c8c0b9a2b6b79be29d1", "f5b1787861adbe198c214d296d55d80a", "7873207c398e2e10f418d15d90fb28f3", "cf5d2978554ed87dcdb864e784e33e07", "bd521dd06f400e0afddfb41774743822", "0684070f6eb14951b2c33497bd52dcb0", "c9b1e2d8811bd7a31b5ac0c262cff65d", "8c7c906837153a76019ac5d4fad45b10", "a44bd966b72928ca46147a42bf6c2e6e", "32bc288b5027c65933fda0344245027b"]}, "['Q2', '2020']": {"answer": "0b8a989936fe3fa9634ba25b14a85bdb --> A restructuring provision is expected to be recognized once necessary conditions are fulfilled. The amount is expected to be between €1.2 billion and €1.6 billion.\n\n4858f10dbf671f29bb71d3e9f6a43360 --> It's more an investment that we do in the course of the four to five years to come.\n\n9dceee3abf06e64ac87a65aa4805f00c --> On a full year basis, we still expect CapEx to be around €1.9 billion.\n\nd7bd6da72a7d997b61c4c54c0a1975d6 --> Dominik Asam [This has not, to a huge degree, happened in Q2 yet, but will be very much a topic also in Q3, where we really rephased all these hedges.]\n\n88904b082484bfc8fcfd66f8a4595742 --> Dominik Asam [So next year, weʼll have still a kind of – we are not having the full year effect of these cost reduction measures yet, so that will be only in 2022.]", "citations": ["0b8a989936fe3fa9634ba25b14a85bdb", "4858f10dbf671f29bb71d3e9f6a43360", "9dceee3abf06e64ac87a65aa4805f00c", "d7bd6da72a7d997b61c4c54c0a1975d6", "88904b082484bfc8fcfd66f8a4595742"]}, "['Q4', '2020']": {"answer": "25e8c2e1a0e5089761cbbb33f443de86 --> As a result of that collective effort, we delivered 566 aircraft in 2020, including around 150 aircraft for which we were using the so-called e-Deliveries.\n\nf848b7f414167943e7466d04fa4370f3 --> There will be no dividend proposed for 2020.\n\n02945a9f2b3ca71f7cfc40a72cf4b6d0 --> On that basis, the company targets to at least achieve in 2021 same number of commercial aircraft deliveries as in 2020; EBIT adjusted of €2 billion; and breakeven free cash flow before M&A and customer financing.\n\n433f54a5acc69ce6dbbf2df4ac04df8f --> For 2021, we expect our CapEx to be at a similar level as compared to 2020.\n\nd2fbdedb408ba0a1854542207bcf0c28 --> Looking into 2020 and beyond, we will continue to maintain a strong liquidity position that will support us as we continue navigating the crisis and position us for growth once the situation improves.\n\nf31a843a062dde50eb3b8c7cdaccfbf6 --> Going forward, we expect a slower ramp-up than initially anticipated. This will impact the learning curve and translate into a slower improvement in unit margin, hence positioning our breakeven targets -- sorry, hence, postponing our breakeven target.\n\nb84995bf329b4fcc848a4c9cde4a2e4d --> So yes, we guide for at least flat deliveries.\n\n679fb2db98079b8e7c98277e6f912a9e --> We have kind of deferred push to the right, the ramp of the A220. And now we really have to go through this J curve in earnest, and that will cost us a kind of low triple-digit million increment. These topics include a kind of massive drop-off in variable compensation, which will need to be normalized in '21. We basically cut travel to 0, and we will need to resume some activities. And we have frankly deferred some projects, which are necessary, but could be deferred for a while. And these are now kind of driven out of the P&L in 2022 and beyond because then we will enjoy the full year effect of the reduction of our restructuring.\n\n043b9344063db704c18dddc61824b851 --> So we believe it's reasonable to say it will be at least at the level of deliveries of 2020.\n\nd3c70c441f56e59594868ff911bb3844 --> We have another 7,500 to do. And this is what I referred to before that, that 7,500 is still gradually phasing in, in 2021. And we will benefit from the full year cost reduction only in 2022.\n\nda494e852f727e71bf4a38351250503c --> But I think in a difficult circumstance, it could be that we see like €1 billion-plus on a yearly basis, which is, of course, far more than we've done in the last years.\n\n8032b08d222324584e51733231ad63bf --> So yes, of course, the bulk is coming now in 2021. It will still be burdened to a certain degree in '22, but much less so than in '21. I'd say, and then hopefully, normalizing '23 time frame.\n\n9a7f2322cffc044886736f14ddf0762b --> We have hopes that we can extrapolate that to some degree that we add a little bit of a margin every year going forward.\n\n9a7f2322cffc044886736f14ddf0762b --> In 2021, we have to do something that we have deferred, and I see more kind of flattish development. But then by virtue of the restructuring, some good upsides in the years thereafter.", "citations": ["25e8c2e1a0e5089761cbbb33f443de86", "f848b7f414167943e7466d04fa4370f3", "02945a9f2b3ca71f7cfc40a72cf4b6d0", "433f54a5acc69ce6dbbf2df4ac04df8f", "d2fbdedb408ba0a1854542207bcf0c28", "f31a843a062dde50eb3b8c7cdaccfbf6", "b84995bf329b4fcc848a4c9cde4a2e4d", "679fb2db98079b8e7c98277e6f912a9e", "043b9344063db704c18dddc61824b851", "d3c70c441f56e59594868ff911bb3844", "da494e852f727e71bf4a38351250503c", "8032b08d222324584e51733231ad63bf", "9a7f2322cffc044886736f14ddf0762b"]}, "['Q1', '2020']": {"answer": "df45ff901988f90cccd74e71fab5e7a9 --> I yet now I expect [indiscernible] to be done by minus 48% year-on-year in 2020 and a decrease of passenger revenue by minus $314 billion versus 2019 levels.\n\n7c52d01ad3634b1ac70e378b5f81d540 --> We have scrutinized our fiscal year 2020 CapEx and decided to cut it by about EUR700 million. So we're now expecting around EUR1.9 billion.\n\n0c2fff486810ab4b91f79605a58229f3 --> Then there is the rate beyond 60. As you have probably heard or seen, we have decided to pause the investment we had on the new A321 final assembly line in Toulouse. We have not canceled the investment we have just paused and we will recover at a later stage.\n\nba41c919c5e2b7462e534e63e367f7e2 --> What I want to say is that we're looking into Q4 and want to bring the cash-out to a level where we can cope with even very pessimistic cash-in scenarios; that's the kind of idea to really look for kind of rock-bottom idea; you never know where rock-bottom really is but in terms of everything we can see today, every customer dialog we have, if we look at both the POD we can expect and the PDPs we can expect, and then try to resize the cost base. And the key question is, of course the rates, if the deliveries would suffer more we would need to potentially adjust as we said before, in June. But for the time being, it's about bringing these two back and balance at the latest in the December quarter.\n\n674f96c2cde9b40fc6a4e5ba4d54c490 --> So the June timeframe is our assessment today of how long it will take to restabilize a new scenario in this new world.", "citations": ["df45ff901988f90cccd74e71fab5e7a9", "7c52d01ad3634b1ac70e378b5f81d540", "0c2fff486810ab4b91f79605a58229f3", "ba41c919c5e2b7462e534e63e367f7e2", "674f96c2cde9b40fc6a4e5ba4d54c490"]}, "['Q4', '2022']": {"answer": "40db051d4d51e6cd81cfaa0ef862c8b8 --> this means that it will take us 2 years to achieve what we had planned to do in one.\n\n85b3a3e8316596be1552bb84f85a589b --> The company targets to achieve in 2023 around 720 commercial aircraft deliveries, an EBIT adjusted of around €6 billion and free cash flow before M&A and customer financing of around €3 billion.\n\n2329597bdf0852bf0d396ac692285294 --> We expect our capital expenditures to slightly increase in 2023.\n\nea2b288aae7ba39939989ef40b935153 --> We stick to our commitment that over the 5-year planning horizon from 2022 through 2026, there will be a cash conversion of 1 as weʼve stated already on the Capital Markets Day.\n\ndc4a139b145f6a6f3e7ca89593434858 --> we now I mean in our target to deliver 720 by the end of 2023\n\ncdac23f80e71fbd10ffb139a1a82b1ef --> We are targeting 60 across more, a bit less than 60 compared to what we have done in 2022. And we really believe thatʼs feasible in the current environment.\n\nb44abe97620e9725b1d9c94b42473bcd --> We now see reaching rate 65 by end of next year, which is 1 year later than what we were targeting when we entered into 2022.\n\nb44abe97620e9725b1d9c94b42473bcd --> This will be achieved by 2026.\n\nee0c74fe0a007159017ace203c8c078d --> Dominik Asam [there is actually a negative, letʼs say, a couple of hundred million in the bridge from ‘22 to ‘23, thatʼs a net.]\n\n46b2e3dbe04d40db637395e4de16cd4c --> You have given us delivery guidance 720 planes for 2023\n\nf491aa101fc34e858e8f8dfd0fc39c88 --> Dominik Asam [The net was positive in ‘22 and will turn to zero next year.]\n\ne12311e9e2208d26a43aa0f2ed8baba7 --> Dominik Asam [the famous €3.3 billion net PDP flow in contract assets and liabilities in 2022 will not repeat, but will go down.]\n\nf3d008ae3bb45a64915bd987b9c77a2c --> Well, actually, we have a target for 2023, which is 720 planes.\n\ne710c8e07ff22d26ddd7f6964b17ccc8 --> Dominik Asam [We had a 6.8% in 2021. I donʼt think we will recover that entirely, but there will be a good move back we anticipate in 2023.]\n\ne710c8e07ff22d26ddd7f6964b17ccc8 --> Dominik Asam [Now, with regards to the 8% aspiration, I have to say, that is a kind of more long-term grinding target. So, itʼs moving out towards the outer years of the forecast horizon of 5 years and the slope at which you can do that is really structural improvement grinding similar to the slope you might see on Helico, where you see also we have some margin every year.]", "citations": ["40db051d4d51e6cd81cfaa0ef862c8b8", "85b3a3e8316596be1552bb84f85a589b", "2329597bdf0852bf0d396ac692285294", "ea2b288aae7ba39939989ef40b935153", "dc4a139b145f6a6f3e7ca89593434858", "cdac23f80e71fbd10ffb139a1a82b1ef", "b44abe97620e9725b1d9c94b42473bcd", "ee0c74fe0a007159017ace203c8c078d", "46b2e3dbe04d40db637395e4de16cd4c", "f491aa101fc34e858e8f8dfd0fc39c88", "e12311e9e2208d26a43aa0f2ed8baba7", "f3d008ae3bb45a64915bd987b9c77a2c", "e710c8e07ff22d26ddd7f6964b17ccc8"]}, "['Q4', '2021']": {"answer": "4dba3891d3ad475deeb6e7d9bee9cfad --> We progressively resume activities to prepare our future and we will further accelerate in 2022.\n\n1056519c1ae004e55d13fd006fbc46c0 --> that underpin our proposal to reintroduce dividend payments going forward, which will amount to €1.5 per share for 2021.\n\n5a4408dbcb1ef5ad3aa2c310e28e9833 --> We expect our CapEx to be around minus €2.4 billion in 2022.\n\nf434b7275968c2b3739c99ffa489d826 --> The company's 2022 guidance is before M&A. On that basis, the company targets to achieve in 2022 around 720 commercial aircraft deliveries, EBIT adjusted of €5.5 billion and free cash flow before M&A and customer financing of €3.5 billion.\n\n92b15a187d54c0a0e46d77e74912401b --> Dominik Asam [CFO][We talked about a mid-double digit potential there in terms of deliveries over the next two, three years, I'd say.]\n\nf352cd2e127c65719da0db1fb5138685 --> We want to be in a position to decide by mid of the year. And this would be the right timing for decision for ʼ24, ʼ25.\n\nf352cd2e127c65719da0db1fb5138685 --> So the short answer is, by mid of this year, we want to have concluded on what we do for ʼ24, ʼ25 and beyond.\n\nb13f6d4ad37a7925b3deb320e6dd05ae --> Dominik Asam [So now we will see in ʼ23, ʼ24, that they will be delivered.]\n\n6ef8ed8eca71b895bcc770185107ff74 --> Freighter enter into service in ʼ25, well we have now all the burden of the investment, and then weʼll benefit.\n\n5014b219fe8a7171185c9dfb84e44874 --> we're trending towards kind of, I'd say low triple-digit numbers over the coming years, every year. But it should also be over the next couple, two to three years.\n\n7de70bec1e310440b948ab88df6f996e --> We think it's not going to be easy but we think we can definitely do it, that's why we guide on it. Significantly more is, in my view, extremely difficult. So I would not bet, if I were you, on significantly more than 720.", "citations": ["4dba3891d3ad475deeb6e7d9bee9cfad", "1056519c1ae004e55d13fd006fbc46c0", "5a4408dbcb1ef5ad3aa2c310e28e9833", "f434b7275968c2b3739c99ffa489d826", "92b15a187d54c0a0e46d77e74912401b", "f352cd2e127c65719da0db1fb5138685", "b13f6d4ad37a7925b3deb320e6dd05ae", "6ef8ed8eca71b895bcc770185107ff74", "5014b219fe8a7171185c9dfb84e44874", "7de70bec1e310440b948ab88df6f996e"]}, "['Q2', '2023']": {"answer": "eee9859171dd035e4af4c0df0b0c77b8 --> The company's 2023 guidance is before M&A. And on that basis, the company targets to achieve, in 2023, around 720 commercial aircraft deliveries, EBIT adjusted of around €6 billion and a free cash flow before M&A and customer financing of around €3 billion.\n\nb46a37ec1f86ba937fb191374515edc2 --> We expect our CapEx to slightly increase in 2023, supporting our industrial ramp-up.\n\n1c12719b2206bbe00701ebf403065c98 --> We generated €1.6 billion of free cash flow in H1 and we are forecasting to generate €1.4 billion in H2 to go to the guidance of €3 billion.\n\nffe6e6469fb06669ee03519eaf3b6939 --> We continue to target rate 75 when it comes to the single aisle for 2026.", "citations": ["eee9859171dd035e4af4c0df0b0c77b8", "b46a37ec1f86ba937fb191374515edc2", "1c12719b2206bbe00701ebf403065c98", "ffe6e6469fb06669ee03519eaf3b6939"]}, "['Q1', '2024']": {"answer": "c5daff5be8943906a78f4b7805873973 --> To support our ramp-up, we expect our CapEx to continue to increase in 2024, yet at a lower pace relative to previous year.\n\nfc5433d4e7cfb101439970962a1d78f4 --> Thomas Toepfer [CFO][And going forward, we continue to expect our full-year R&D to slightly increase compared to last year.]\n\nb47349405b7c660beb33a975544ef9f8 --> The company targets to achieve in 2024 around 800 commercial aircraft deliveries, EBIT adjusted between €6.5 billion and €7 billion, and the free cash flow before customer financing of around €4 billion.\n\n303e72a10b1f6de643a3f0d0f78c64ac --> We have adjusted our portfolio this quarter by implementing some rollovers to reflect the delivery target for 2024 and its delivery profile, which we expect to be back-end loaded.\n\nea2e81b8ac2291d20e820dff9bb26d84 --> Now, if you take it all together, and also with our focus on efficiency, namely to counteract some of the inflation that, of course, we do see, that should bring you to this roughly €1 billion more in 2024 for the remaining nine months of the year than what we had last year.\n\n827b770d085590bedf81e8b9eaf14e31 --> We have decided to increase the rates by 2028 by two points.\n\ncc615c98b7cfed3e265993b1ea16e6d0 --> Higher deliveries of 50 aircraft expected for the full year.\n\ncc615c98b7cfed3e265993b1ea16e6d0 --> €400 million charges to be reversed in 2023.\n\na5448b57cf4d4907dd8c128d59422375 --> And that's how we came to the rate 12 by 2028.\n\na757ffae31efabd31a6c19c772f78a15 --> However, this mid to high single-digit margin that we said we would achieve for ADS that certainly will take a couple of years before that will materialize.\n\n887cfda1d0bfff604009238bf0559259 --> So therefore, I would say what you can expect for the full year is what I would call a solid mid-single-digit margin for Defense and Space.\n\na281f1f6033157178a9e41f04249076e --> we will work against this with some efficiency measures for the end of -- for the rest of the year. And so therefore, I would say it's, of course, a three-digit number negative, but in the low range for 2024.", "citations": ["c5daff5be8943906a78f4b7805873973", "fc5433d4e7cfb101439970962a1d78f4", "b47349405b7c660beb33a975544ef9f8", "303e72a10b1f6de643a3f0d0f78c64ac", "ea2e81b8ac2291d20e820dff9bb26d84", "827b770d085590bedf81e8b9eaf14e31", "cc615c98b7cfed3e265993b1ea16e6d0", "a5448b57cf4d4907dd8c128d59422375", "a757ffae31efabd31a6c19c772f78a15", "887cfda1d0bfff604009238bf0559259", "a281f1f6033157178a9e41f04249076e"]}, "['Q1', '2021']": {"answer": "a30266dcde419e2e321457c0adfa391e --> During our full year 2020 disclosure, so by mid of Feb, we have established a 2021 guidance to provide some visibility in a complex business environment. And based on everything we see today, we keep our guidance unchanged.\n\nf458059f1087b8477a6ab94249cd0cee --> Going forward, we aim to make our cost savings more sustainable and to underpin our earnings and cash growth trajectory for the period beyond 2021.\n\n66b371f9f464e2ffed11cfb6199f9e0b --> The company's 2021 guidance is before M&A. And on that basis, the company target to at least achieve in 2021 same number of commercial aircraft deliveries as in 2020, EBIT adjusted of €2 billion and breakeven -- sorry, breakeven free cash flow before M&A and customer financing.\n\naea05bea14238a4d7cc6dbdb50574f11 --> we maintain our predictions to start the ramp-up of single-aisle in Q3 and Q4 modestly, but that's an important point for us.\n\n3bf20544a55d4467970feba25ee90f2a --> For the full year 2021, we expect an average hedge rate of $1.21 compared to $1.19 in 2020.\n\n3bf20544a55d4467970feba25ee90f2a --> For 2021, we expect our CapEx to be at a similar level as compared to 2020.\n\n3606daa62748203e07c1afcb07142fe8 --> And we said that in 2021, there will be a difficult situation with a significant negative impact from the overall balance, and this is still to happen in this year.", "citations": ["a30266dcde419e2e321457c0adfa391e", "f458059f1087b8477a6ab94249cd0cee", "66b371f9f464e2ffed11cfb6199f9e0b", "aea05bea14238a4d7cc6dbdb50574f11", "3bf20544a55d4467970feba25ee90f2a", "3606daa62748203e07c1afcb07142fe8"]}, "['Q1', '2022']": {"answer": "78a7b2c276ac50e6313060f8e1a2c575 --> Inferred as CEO: Based on our good Q1 results in Q1, we keep our guidance for 2022 unchanged, although our overall risk profile for the remainder of the year has become more challenging.\n\n62a1070443dffc041feddca6fdd3f010 --> We expect our CapEx to be around minus €2.4 billion in 2022.\n\na27444b9d85f0b59a85bab3b6dd9ddf7 --> The company targets to achieve in 2022 around 720 commercial aircraft deliveries, €5.5 billion of EBIT adjusted and €3.5 billion of free cash flow before M&A and customer financing.\n\n25c09d85539c6e30fbcd537635aaaa54 --> We see that it's going to be going a bit beyond the end of 2023.\n\n4658f8fd3c72117f2d1d34cf69caf520 --> Dominik Asam [CFO][There is a slide in the deck, which I've commented where you can see that for the years '22 through '24, we have about a $20 billion per annum hedged portfolio against the exposure.]\n\n4658f8fd3c72117f2d1d34cf69caf520 --> Dominik Asam [CFO][In the -- you mentioned 2025, we show $13.3 billion forward sales as of March 2022, so a considerable part is hedged and the rate is at $1.25 still.]\n\n6826486e6bb5dd42f2187ef9f7c0620c --> We intend to reach the rate of 65 middle of next year.\n\n6826486e6bb5dd42f2187ef9f7c0620c --> then the 75 in '25, and we'll do this progressively as we move forward.", "citations": ["78a7b2c276ac50e6313060f8e1a2c575", "62a1070443dffc041feddca6fdd3f010", "a27444b9d85f0b59a85bab3b6dd9ddf7", "25c09d85539c6e30fbcd537635aaaa54", "4658f8fd3c72117f2d1d34cf69caf520", "6826486e6bb5dd42f2187ef9f7c0620c"]}, "['Q3', '2024']": {"answer": "e6c90ea1c119227085199b2b10cca06f --> To support our ramp-up, we expect our CapEx to increase in 2024, also reflecting the change in development cost capitalization, which I highlighted earlier.\n\n6ff5d383a3ae7bcef5ec868dbfafbacd --> This anticipated capitalization results in a lower R&D expense in the range of a high double-digit number as of the first nine months of this year.\n\n7c9c6d35a841de28593480d05bf76808 --> The company targets to achieve as issued in June, in 2024, around 770 commercial aircraft deliveries and EBIT adjusted of around €5.5 billion and a free cash flow before customer financing of around €3.5 billion.\n\nbb3fbe5d758347f02673e8d299ab8e55 --> The tax rate of the core business continues to be at around 27%. It excludes the potential French surtax, which could result in an impact of around €300 million for the year 2024, however, which would, of course, only be payable in 2025.\n\nb374dfe3488648c090c3eeeb220e4374 --> The full assessment of the EAC of the program will be completed before the end of 2024.\n\nf458631d2744809234b129489c4e7926 --> We are still expecting a couple of $100 million negative effect from inflation in 2024.\n\n9b5bf723184f11f23b7b0236d647a230 --> What should be the impact of that for the full year? I would roughly quantify it with a couple of hundred million positive effects.\n\n92c2499e24b815f536067cc6e6bb74ea --> Directionally, we've seen inflation coming down from 2023 into 2024. And I would expect that that direction continues into 2025.\n\n7f58ff13c2c9b696bf3f0ff66611d756 --> We're expecting that signing will occur before the end of the year.\n\nadf60bafcb68e392827463c29ade9366 --> We believe that we will reach the around 770 for this year.\n\n2b6e30918ac1b0c968aef56dc0dbcd91 --> The number of deliveries should be higher in order to reach the target of around 770.", "citations": ["e6c90ea1c119227085199b2b10cca06f", "6ff5d383a3ae7bcef5ec868dbfafbacd", "7c9c6d35a841de28593480d05bf76808", "bb3fbe5d758347f02673e8d299ab8e55", "b374dfe3488648c090c3eeeb220e4374", "f458631d2744809234b129489c4e7926", "9b5bf723184f11f23b7b0236d647a230", "92c2499e24b815f536067cc6e6bb74ea", "7f58ff13c2c9b696bf3f0ff66611d756", "adf60bafcb68e392827463c29ade9366", "2b6e30918ac1b0c968aef56dc0dbcd91"]}, "['Q3', '2021']": {"answer": "7392df62ff632cc535cf5191dec3c331 --> Following our 9-month financial performance, we raised our 2021 guidance for EBIT adjusted and free cash flow before M&A and customer financing.\n\nceb4685feb3cf1f3db68dd86590662ab --> We feel we are on track to achieve our 2021 delivery guidance of around 600 commercial aircraft.\n\n6353773c4c612ca0af3c0f2743ee203b --> For the full year 2021, we expect an average hedge rate of $1.21 compared to $1.19 in 2020.\n\n6353773c4c612ca0af3c0f2743ee203b --> For 2021, we continue to expect our capital expenditures to be around €2 billion cash out.\n\n5a2dbd54814497104e99f9dd68483b31 --> we plan to deliver the vast majority of those planes until the end of the year. That's why we maintain the guidance of 600 planes because we think we can achieve it.\n\nfae8886cf1c8af2d2cdb6042874d3a5a --> We are not changing our margin target, where we said that when we are back to the rate of 2019, we want to deliver the EBIT margin we had in 2019.\n\n36bb037adabb60454b2c159581d1ad11 --> The company has updated its 2021 guidance and now targets to achieve in 2021 around 600 commercial aircraft deliveries, no change; EBIT adjusted of €4.5 billion; and free cash flow before M&A and customer financing of €2.5 billion.\n\n3c63b84d1dcf0d48331a331e1477c171 --> Because the demand, in our perspective, will justify going beyond 65. And you know that we are considering 70, 75 moving forward because we see the very strong demand for the 320 moving far away in the second half of the decade.\n\ne46a77220d961f030f498a261a8e6b2a --> Dominik Asam [CFO][On the COVID-related charges we took last year within EBIT adjusted was about €1 billion. We are releasing so far about €400 million.]", "citations": ["7392df62ff632cc535cf5191dec3c331", "ceb4685feb3cf1f3db68dd86590662ab", "6353773c4c612ca0af3c0f2743ee203b", "5a2dbd54814497104e99f9dd68483b31", "fae8886cf1c8af2d2cdb6042874d3a5a", "36bb037adabb60454b2c159581d1ad11", "3c63b84d1dcf0d48331a331e1477c171", "e46a77220d961f030f498a261a8e6b2a"]}, "['Q3', '2020']": {"answer": "70e186f983acdb7f98f4cb2eb2853a12 --> On a full year basis, we still expect CapEx to be around €1.9 billion.\n\n2a4f885d52d29ee56399d1e3f195b290 --> Dominik Asam [CFO][we want to achieve that again breakeven at least in Q4.]", "citations": ["70e186f983acdb7f98f4cb2eb2853a12", "2a4f885d52d29ee56399d1e3f195b290"]}, "['Q2', '2024']": {"answer": "0f0afd8a4fee0b6e9462f37aaa3b4e7d --> The Company updated its 2024 guidance and adjusted the trajectory of the A320 family ramp up, confirming the rate 75, but now for 2027.\n\n98298433cb1c263c7abbf584b1b78acd --> We target to close the deal in early 2025, we're working together with Space to secure the critical ramp-up investments in medium and long term and to support the transition phase and secure the immediate operations, we have deployed an Airbus workforce of over 100 people, still the challenge remains high.\n\n4085ca826b96664e5d9cf49ab55b862b --> 2/3 is probably the right order of magnitude to be normalized in your models.\n\nb1b21fd1d024fda0f192575a37b82c6c --> The Company targets to achieve in 2024, around 770 commercial aircraft deliveries and EBIT adjusted of around €5.5 billion and the free cash flow before customer financing of around €3.5 billion.\n\n52a95c59ec197a2dbbe59e5aa6a62cea --> we expect our CapEx to continue to increase in 2024, however, at a somewhat lower pace.\n\n408e9244ef974c0cfc523c8e13d0b7f4 --> Thomas Toepfer [We've always said that the program is not yet breakeven until we reach the rate of 14 in 2026.]\n\nd26ec31db8176405e0515dc7e470e113 --> to get to the midpoint of our guidance for this year, we would have something like €4.1 billion.\n\n553ce3cdf1734d61dbbfff8bbdb3e9a1 --> But indeed, the number of deliveries that we have to reach with the rate 75 by 2027, A350 by 2028.\n\na785fb60937f3cfeabe0249c54f01d07 --> I would rather also here come back to the full year guidance that we have given from all that we can see we're on track but there is no, I would say, additional effects from the lead program as of today that you should add, as I have said, -- we have -- we are considering that the positive effects from the program will essentially compensate negative effects from inflation and from the increase in R&D, and that is what is baked in our full year guidance.\n\n8e0f1f459143ec2c2f0d2480004cf36c --> When it comes to pushing out from '26 to '27. It was more on the view that the shortcomings of this year have more longer-term impact when it comes to the time it takes to recover...\n\n6235d2a5dac43ff5d132c99b82bc2a21 --> So, we are slightly slower on the short term that leads to the 770 guidance for this year.\n\n73aab43e8880b778781aebf26d099a26 --> If you retranslate our production rate that we're targeting for 2026, '27 into a ramp-up I agree that you will come to double-digit growth rates in certain years.", "citations": ["0f0afd8a4fee0b6e9462f37aaa3b4e7d", "98298433cb1c263c7abbf584b1b78acd", "4085ca826b96664e5d9cf49ab55b862b", "b1b21fd1d024fda0f192575a37b82c6c", "52a95c59ec197a2dbbe59e5aa6a62cea", "408e9244ef974c0cfc523c8e13d0b7f4", "d26ec31db8176405e0515dc7e470e113", "553ce3cdf1734d61dbbfff8bbdb3e9a1", "a785fb60937f3cfeabe0249c54f01d07", "8e0f1f459143ec2c2f0d2480004cf36c", "6235d2a5dac43ff5d132c99b82bc2a21", "73aab43e8880b778781aebf26d099a26"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New aircraft models", "data": {"['Q3', '2023']": {"answer": "ef9a05c277086a7aa65b61cdc7932800 --> Guillaume Faury [On the XLR, the aircraft completed in September its Route Proving Campaign and more recently its first passenger experience flight, two important milestones towards certification and the entry into service that is expected to take place in Q2 2024, no change compared to previous situation.]", "citations": ["ef9a05c277086a7aa65b61cdc7932800"]}, "['Q2', '2020']": {"answer": "69ee7510ca65ce078dbfe28a7d8450e7 --> The five-bladed H145 and the H160 helicopters are expected to receive certification from the FAA later this year.", "citations": ["69ee7510ca65ce078dbfe28a7d8450e7"]}, "['Q4', '2020']": {"answer": "a843b176d5c4b31e8c7ff8799b87d5b8 --> The goal for 2021 is for FCAS to enter the preliminary demonstrator development phase for the next-generation fighter and the remote carrier aircraft.\n\nf31a843a062dde50eb3b8c7cdaccfbf6 --> The entry into service is scheduled in 2023.\n\n134ee294f20a27b3e4d4e54d0ba59e04 --> The A380s are the Emirates ones, which are still outstanding. Everything else is delivered. So these will be delivered as planned in the coming years.", "citations": ["a843b176d5c4b31e8c7ff8799b87d5b8", "f31a843a062dde50eb3b8c7cdaccfbf6", "134ee294f20a27b3e4d4e54d0ba59e04"]}, "['Q4', '2022']": {"answer": "14b0463c18cb1f69d00e95f4ebd47167 --> On the XLR, we expect the entry into service to take place in Q2 2024, no change.\n\nd8450b846d10f5367833937284237330 --> Mobil is moving forward as planned. I think its first delivery plan in 2024, ‘25.\n\nd8450b846d10f5367833937284237330 --> when it comes to Toulouse, the new A321 file in Toulouse will deliver its first aircraft, the very first by end of this year.", "citations": ["14b0463c18cb1f69d00e95f4ebd47167", "d8450b846d10f5367833937284237330"]}, "['Q4', '2021']": {"answer": "770f068d563673346a1eba1bf8dc1354 --> On FCAS, we continue to work with our industrial partners with the objective to move on to the next development phase later in the year.\n\nbeb13b8587e1df31865f32e8aeb4a989 --> On the A321XLR, the first of the development aircraft to enter the FAL in Hamburg in November, this aircraft will perform the flight testing and type certification program starting this year to pave the way for service production and entry into service next year, 2023.\n\n6ef8ed8eca71b895bcc770185107ff74 --> The introduction of the XLR, which is of course only giving us the harvesting in ʼ24, ʼ25 timeframe.", "citations": ["770f068d563673346a1eba1bf8dc1354", "beb13b8587e1df31865f32e8aeb4a989", "6ef8ed8eca71b895bcc770185107ff74"]}, "['Q2', '2023']": {"answer": "a4dfc8945a9123efc629e090ec8b03dc --> Starting this summer, our customers will be offered an option to have 5% pure SaaS on board for their ferry flights from Toulouse and Hamburg, an option that is already available from Tianjin and Mobile.\n\n2a01688b2d95da65294271d90e097fd7 --> Entry into service remains expected to take place in Q2 2024, Q2 next year.\n\n2a01688b2d95da65294271d90e097fd7 --> Developments of the freighter variant of the A350 for into service now running 2026.", "citations": ["a4dfc8945a9123efc629e090ec8b03dc", "2a01688b2d95da65294271d90e097fd7"]}, "['Q1', '2024']": {"answer": "3cc9ee3f3e817ecb3cae70abc36da14b --> On the launcher activity, we obviously look forward to the upcoming Ariane 6 maiden flight targeted between June 15 and end of July 2024, so this year.", "citations": ["3cc9ee3f3e817ecb3cae70abc36da14b"]}, "['Q1', '2022']": {"answer": "304bad692676ad3e3bb495f507c421cc --> We continue to work towards the first flight by the end of Q2 2022.\n\n304bad692676ad3e3bb495f507c421cc --> Regrettably, the entry into service is now expected to take place in early 2024.", "citations": ["304bad692676ad3e3bb495f507c421cc"]}, "['Q3', '2021']": {"answer": "b64b7a82fc42bf0068eaf5153534cb87 --> The modernization of the A320 family striving to lose is progressing well and should be operational by end of 2022.", "citations": ["b64b7a82fc42bf0068eaf5153534cb87"]}, "['Q3', '2020']": {"answer": "624a84e5166140a731a697cdbfe98339 --> In October, we also launched the ACJ TwoTwenty business jet. It will address a new market segment the extra-large business jets. The entry into service is targeting for early 2023. Six aircraft have already been ordered.", "citations": ["624a84e5166140a731a697cdbfe98339"]}, "['Q2', '2024']": {"answer": "34d6bca67e8fd7049ba1149cfc24a814 --> For the A321 XLR, we are pleased -- we are very pleased with the recent EASA type certification we received. This is for the CFM engine version. This is a key milestone, paving the way for the entry into service at the end of this summer.\n\nd26ec31db8176405e0515dc7e470e113 --> delta of 28 aircraft that we will deliver more", "citations": ["34d6bca67e8fd7049ba1149cfc24a814", "d26ec31db8176405e0515dc7e470e113"]}}}, {"topic": "Sustainable aviation technologies", "data": {}}, {"topic": "R&D investment priorities", "data": {"['Q3', '2023']": {"answer": "b82423a8107310ac726eac4f923787e4 --> we continue to expect our full year R&D to slightly increase compared to 2022.", "citations": ["b82423a8107310ac726eac4f923787e4"]}, "['Q2', '2020']": {"answer": "80fbd3bdf34f067b6d6b44760574c615 --> We reviewed our R&D road map and other fixed costs and cut 2020 CapEx while still protecting key projects like the A321XLR or our DDMS project, the ones that are key to prepare the future.", "citations": ["80fbd3bdf34f067b6d6b44760574c615"]}, "['Q4', '2020']": {"answer": "849f400e0af4d6bb41837760e94e7205 --> We plan to increase our R&D spending by 10% in 2022.\n\n2d47ed9d2945cd637ea0497b865bcd72 --> We aim to keep our R&D at a similar level in 2021 in order to protect our competitive positioning going forward.", "citations": ["849f400e0af4d6bb41837760e94e7205", "2d47ed9d2945cd637ea0497b865bcd72"]}, "['Q4', '2021']": {"answer": "5d496c7813f44db495269181ba2e4ea8 --> The R&D expenses are expected to increase to around €2.9 billion in 2022.\n\n6ef8ed8eca71b895bcc770185107ff74 --> And yet on the R&D and weʼre also stepping up DDMS, the project I just mentioned is kind of highest spent rate in these years ʼ23, ʼ24.\n\n129a22fe4ed594eb7191f07128afec3a --> So you're stepping up the R&D effort to €2.9 billion with a couple €100 million round about.\n\n5bfb9cd577bfcd0264ef5be662f72775 --> I mentioned that this will come to an end because we will start collecting better PDPs. So I'm anticipating that this is really turning neutral if not slightly positive.", "citations": ["5d496c7813f44db495269181ba2e4ea8", "6ef8ed8eca71b895bcc770185107ff74", "129a22fe4ed594eb7191f07128afec3a", "5bfb9cd577bfcd0264ef5be662f72775"]}, "['Q1', '2021']": {"answer": "f458059f1087b8477a6ab94249cd0cee --> We continue to expect our 2021 full year research and development expenses to be at a similar level as in 2020.\n\n24c7acd61d569fc75b41352e9422fb48 --> We are going to spend about the same amount as last year for the full year on R&D investment, and we have under proportionately spent on that in Q1.", "citations": ["f458059f1087b8477a6ab94249cd0cee", "24c7acd61d569fc75b41352e9422fb48"]}, "['Q3', '2021']": {"answer": "c8d9987290a45eed0c6f08711b8708c8 --> We now expect our 2021 full year research and development expenses to be slightly lower than in 2020.\n\nc8d9987290a45eed0c6f08711b8708c8 --> Some expenses previously foreseen in 2021 will now be incurred in 2022 and we will ramp up our R&D next year.\n\nac3baa32c5c1bc0e4f98c4a3c2abb873 --> We gave some on R&D, when we say we now will be slightly lower than last year.", "citations": ["c8d9987290a45eed0c6f08711b8708c8", "ac3baa32c5c1bc0e4f98c4a3c2abb873"]}, "['Q2', '2024']": {"answer": "852aa4eddd837b2319fc62e11aa98b64 --> Our R&D expenditure will be maintained at around €3 billion for the full year.\n\nda911e792734932839ddbaa7b605aeac --> However, for the full year, we continue to expect our full year R&D to only slightly increase compared to last year.", "citations": ["852aa4eddd837b2319fc62e11aa98b64", "da911e792734932839ddbaa7b605aeac"]}}}, {"topic": "Hydrogen-powered aircraft development", "data": {"['Q4', '2022']": {"answer": "623be7b2822b11e8482caaf40e599a91 --> On hydrogen, we continue to make sure our innovative technologies in preparation for entering to service of a hydrogen powered aircraft by 2035 in the frame of our so-called ZEROe program we announced the development of a hydrogen-powered fuel cell engine.", "citations": ["623be7b2822b11e8482caaf40e599a91"]}, "['Q1', '2022']": {"answer": "da8356444d7ad5e4e399f3c32139345f --> We also officially launched a ZEROe demonstrator program with the objective to test a variety of hydrogen technologies, both on the ground and in the air. A key part of the multiyear program, the hydrogen combustion engine, will be developed by our partner, CFM International. The ZEROe demonstrator will be an important milestone to our road map to deliver the world's first zero emission aircraft by 2035.", "citations": ["da8356444d7ad5e4e399f3c32139345f"]}, "['Q3', '2021']": {"answer": "10885ee951244baafcf2401a9f2f0d70 --> Airbus is here leveraging several years of research and demonstrate our development to plan for a first prototype in 2023 which paves the way towards certification in 2025.", "citations": ["10885ee951244baafcf2401a9f2f0d70"]}}}]}, {"theme": "Operational Efficiency and Supply Chain Management", "topics": [{"topic": "Production rate adjustments", "data": {"['Q3', '2023']": {"answer": "dadb63990a606c8c0b9a2b6b79be29d1 --> [Inferred as CEO] \"In this context, our new organization going live in January 2024.\"\n\nef9a05c277086a7aa65b61cdc7932800 --> Guillaume Faury [On the A220, we delivered 41 aircraft and we continue to ramp-up to reach rate 14 in 2026.]\n\nef9a05c277086a7aa65b61cdc7932800 --> Guillaume Faury [Production is progressing well towards the previously announced rate of 75 aircraft per month in 2026.]\n\nef9a05c277086a7aa65b61cdc7932800 --> Guillaume Faury [We continue to target rate four in 2024 on A330.]\n\nef9a05c277086a7aa65b61cdc7932800 --> Guillaume Faury [I'm happy to share that we decided to increase the production rate to 10 aircraft a month in 2026.]\n\ne38b14429f208f8300b621ded6f9e71a --> 2024 is again about ramp-up.", "citations": ["dadb63990a606c8c0b9a2b6b79be29d1", "ef9a05c277086a7aa65b61cdc7932800", "e38b14429f208f8300b621ded6f9e71a"]}, "['Q2', '2020']": {"answer": "4ec16966415430b2ddea4b7bf3bdd736 --> Adjust A350 rates from six to five per month for now.\n\ne112225cbe200909308e01621665e587 --> We converge production and deliveries in Q3. Thatʼs the objective we have, and it gives an indication that we are, we believe, on the right trajectory.\n\nf78e0d4dbb90e06608b2493ef5f2acd9 --> What we did say is that we tried to converge deliveries and production in Q3.\n\n69ee7510ca65ce078dbfe28a7d8450e7 --> The FAL, the Final Assembly Line in Mirabel is expected to progressively return to pre-COVID levels at rate 4 and the new FAL in Mobile opened in May as planned.\n\n9dceee3abf06e64ac87a65aa4805f00c --> We target production and deliveries to converge in Q3.\n\ne5b950613421e921f39359219623fb43 --> We are at rate 40 for the 320. It fits with our todayʼs understanding of the market situation, I mean, the relationship between Airbus and our own customers in a very granular way. It fits with what we believe is the environment for the next 18 months, and we think there will be a point in time where the ramp-up will come again, and it should be around 2022 for the single-aisle.\n\ne7f69a36365e4326ae643bb3a3bbcf0c --> 145 planes, it should be the high points. We intend to improve moving forward. And this convergence we were mentioning before aimed at reducing significantly the number of non-delivered aircraft by end of 2020.\n\n4c2282aa8738e0dfb7fcb47372a48802 --> And we keep it for the second half of 2020 and entering into 2021.\n\n4c2282aa8738e0dfb7fcb47372a48802 --> It will not happen before mid of 2021. It is very likely that it will happen in 2022 for the single-aisle.\n\n00c4ffc4ea6f43aa54b79c7e571da1d0 --> Our mission is to have less planes stored by end of 2020 than what we have by end of H1 2020. So Iʼm suggesting that we want to have the convergence in H2 2020, or starting the convergence, not the full convergence, but we will reconverge.\n\n50b3ec6965e96fc9b033f7427b923006 --> We are more at rate 40 flat until we see something new happening.", "citations": ["4ec16966415430b2ddea4b7bf3bdd736", "e112225cbe200909308e01621665e587", "f78e0d4dbb90e06608b2493ef5f2acd9", "69ee7510ca65ce078dbfe28a7d8450e7", "9dceee3abf06e64ac87a65aa4805f00c", "e5b950613421e921f39359219623fb43", "e7f69a36365e4326ae643bb3a3bbcf0c", "4c2282aa8738e0dfb7fcb47372a48802", "00c4ffc4ea6f43aa54b79c7e571da1d0", "50b3ec6965e96fc9b033f7427b923006"]}, "['Q4', '2020']": {"answer": "849f400e0af4d6bb41837760e94e7205 --> We expect to deliver around 566 commercial aircraft in 2021.\n\n25e8c2e1a0e5089761cbbb33f443de86 --> In April, we recalibrated our industrial system by reducing our rates by around 40%.\n\n79e97356ec454b47d0b879333164148c --> On A320, production rates will gradually increase from 40 aircraft per month currently to 43 in the third quarter and 45 in the fourth quarter 2021, which represents a slower ramp-up than the previously anticipated 47 aircraft per month from July.\n\n79e97356ec454b47d0b879333164148c --> On A220, rates will increase from 4 to 5 aircraft per month from the end of Q1 2021.\n\nf31a843a062dde50eb3b8c7cdaccfbf6 --> We still believe that the wide-body recovery will take much longer, so we have to be prepared to maintain our A350 and A330 production rates at low levels compared to pre-COVID.\n\n227c12a38a644d308c18f5c180fa294e --> We will do it even more this year on looking at the potential bottlenecks for the ramp-up moving forward.", "citations": ["849f400e0af4d6bb41837760e94e7205", "25e8c2e1a0e5089761cbbb33f443de86", "79e97356ec454b47d0b879333164148c", "f31a843a062dde50eb3b8c7cdaccfbf6", "227c12a38a644d308c18f5c180fa294e"]}, "['Q1', '2020']": {"answer": "1ee350e5acbaa6616da04efd0db58d5f --> As previously announced, we are now adjusting our production rates down to rate 40 for the A320 family, 2 for the A330, and 6 for the A350.\n\n1ee350e5acbaa6616da04efd0db58d5f --> On the 220, the FAL in Mirabel is expected to progressively return to the rate 4 where we were before COVID and the new FAL in Mobile is targeted to open in May as planned.\n\n99b647bc4108c0f3a66319e54c42705a --> Deliveries in Q2 will remain very low - will be very low as we are at the meet of the crisis itself and the bans and it's very difficult for customers to come and take deliveries.\n\n00effd78ae7a7232bd2f870f99ce0a52 --> We think- I mean, our goal is to have sort of completed a new stability to define a new world by June and that's why, as well, we have indicated that we could re- adjust a second time, our production rates June- June-ish, I would say.\n\n083a9c07581e2a464f61c7186ff46a01 --> if you think about the new production rates, they about a third down and at least on the remain to do for the year, that's the kind of target to rebalance and bring the cost out.\n\n0c2fff486810ab4b91f79605a58229f3 --> So what we want to preserve in the next month, is the ability to be back to 60, not too slowly, if the demand comes back, and we think it will come back.", "citations": ["1ee350e5acbaa6616da04efd0db58d5f", "99b647bc4108c0f3a66319e54c42705a", "00effd78ae7a7232bd2f870f99ce0a52", "083a9c07581e2a464f61c7186ff46a01", "0c2fff486810ab4b91f79605a58229f3"]}, "['Q4', '2022']": {"answer": "8f66d01b241d9b3c77033aac0fa17f26 --> This year, we expect our commercial aircraft delivery profile to be backloaded again.\n\n40db051d4d51e6cd81cfaa0ef862c8b8 --> we decided last month to ramp up our A320 family to a monthly production rate of 75% in the middle of the decade.\n\n85b3a3e8316596be1552bb84f85a589b --> This year, more than ever, our main priority is to ramp up commercial aircraft production, including single-aisle aircraft as we progress towards rate 75 now in 2026.\n\n2329597bdf0852bf0d396ac692285294 --> Our portfolio is currently being adjusted by implementing some rollovers to reflect the latest ramp-up trajectory and our delivery target for 2023.\n\n14b0463c18cb1f69d00e95f4ebd47167 --> On 220, we continue to ramp up and are still on track for rate of 14 that we envisaged by the middle of the decade.\n\n14b0463c18cb1f69d00e95f4ebd47167 --> We are now progressing toward a monthly production rate of 65 aircraft by the end of 2024, and 75 in 2026.\n\n14b0463c18cb1f69d00e95f4ebd47167 --> On A330, we now target to reach rate 4 in 2024.\n\n14b0463c18cb1f69d00e95f4ebd47167 --> On A350, we have now decided to target a monthly production rate of 9 A350s, which we plan to reach at the end of 2025.\n\nf3d008ae3bb45a64915bd987b9c77a2c --> we wanted to reach rate 65 by end of 2023. Now, we say end of 2024.", "citations": ["8f66d01b241d9b3c77033aac0fa17f26", "40db051d4d51e6cd81cfaa0ef862c8b8", "85b3a3e8316596be1552bb84f85a589b", "2329597bdf0852bf0d396ac692285294", "14b0463c18cb1f69d00e95f4ebd47167", "f3d008ae3bb45a64915bd987b9c77a2c"]}, "['Q4', '2021']": {"answer": "0d25add9261b86fbdd246c53b018ac77 --> We also announced a global plan to recruit around 6000 new employees across the entire group to support both the ramp up and the company long term project and ambitions.\n\nbeb13b8587e1df31865f32e8aeb4a989 --> In 2021, we also provided additional visibility to our suppliers and in particular we secured the production rate for the A320 family up to summer 2023, which is mid of next year.\n\nbeb13b8587e1df31865f32e8aeb4a989 --> We continue to ramp up and are on track for rate 14 that we envisage by the middle of the decade.\n\nbeb13b8587e1df31865f32e8aeb4a989 --> We continue to deliver on our production ramp up and we are on the trajectory to achieve rate of 65 by summer 2023.\n\n2dc10945540d143cfa26ec6d89ee1a49 --> We target to increase our monthly production rate to almost three aircraft at the end of 2022.\n\n2dc10945540d143cfa26ec6d89ee1a49 --> We continue to expect to increase the A350 production rate from around five per month to around six in early 2023.", "citations": ["0d25add9261b86fbdd246c53b018ac77", "beb13b8587e1df31865f32e8aeb4a989", "2dc10945540d143cfa26ec6d89ee1a49"]}, "['Q2', '2023']": {"answer": "eee9859171dd035e4af4c0df0b0c77b8 --> In the second half of the year, our focus remains on achieving our delivery target of around 720 commercial aircraft and on ramping up production across all our commercial aircraft programs, all at the same time.\n\n2a01688b2d95da65294271d90e097fd7 --> We continue to ramp up to reach rate 14 in the middle of the decade.\n\n2a01688b2d95da65294271d90e097fd7 --> Production is progressing well towards the previously announced rate of 75 aircraft per month in 2026.\n\n2a01688b2d95da65294271d90e097fd7 --> We continue to target rate 4 in 2024 on the A330 and rate 9 on the A350 at the end of 2025.\n\n36e8c036327aa7c37ed5b887767dbdbb --> We've decided to ramp up to rate 75 as we are guiding and taking the supply chain with us to the rate 75.\n\n36e8c036327aa7c37ed5b887767dbdbb --> We will have 10 final assembly lines for the single line for the A320 Family, all of them being A321 capable.\n\n267e0d71b839c26be8654ce16a4e90ae --> That's something that we have already investigated, analyzed and used for the 2024 and 2025 but mainly 2024 production planning...", "citations": ["eee9859171dd035e4af4c0df0b0c77b8", "2a01688b2d95da65294271d90e097fd7", "36e8c036327aa7c37ed5b887767dbdbb", "267e0d71b839c26be8654ce16a4e90ae"]}, "['Q1', '2024']": {"answer": "101d7cd1c1bbcfc3cc0162145220ecfb --> The strong commercial momentum that we observe on wide body aircraft underpins our decision to increase the production rate for the A350 to 12 aircraft a month in 2028.\n\nc5c64c914a0e56ac1d8509885537d6cd --> We continue towards the monthly production rate of 14 aircraft in 2026, while still working on the program's industrial maturity and its financial performance.\n\nc5c64c914a0e56ac1d8509885537d6cd --> We are making progress towards the rate of 75 aircraft per month in 2026, and we continue to expect the entry into service of the XLR in Q3 this year.\n\nc5c64c914a0e56ac1d8509885537d6cd --> We have decided to increase the production rate for the A350 to 12 aircraft a month in 2028, as mentioned earlier, superseding the rate 10 in 2026, and on the A330, we continue to target rate 4 in 2024.\n\ncae113a3a3f847f7618fbef3ddfb98de --> And the second line will enter into service, as far as I remember, top of my head, ‘26. So, it will not be at full steam before ‘27, but good enough to contribute to the rate 75, as I said earlier.\n\nca7d2b901ccefda233a4c4da61fa52fe --> We're in the ramp up of the production, the construction work of the U.S. and Chinese files as well, with a readiness of the full production system by 2026, consistently with the rate 75 in 2026.", "citations": ["101d7cd1c1bbcfc3cc0162145220ecfb", "c5c64c914a0e56ac1d8509885537d6cd", "cae113a3a3f847f7618fbef3ddfb98de", "ca7d2b901ccefda233a4c4da61fa52fe"]}, "['Q1', '2021']": {"answer": "d4a3bec5b15c8546c3c378d33b537e4d --> We will gradually increase our A320 production rate to 43 in Q3 and 45 in Q4 as planned.\n\n72a07c5d77002ed8bf84c815d84b10cc --> We want to take advantage of the currently lower production rates to best prepare the Airbus industrial system of the future. In that context, we decided to place fuselage aerostructure assembly at the heart of our Airbus production system, and we intend to create 2 new aerostructures entities, 1 in France and 1 in Germany, and a third entity import in Germany has a strong global player for detailed parts.\n\nee134c2ebb9d89361b12c271c4114dd1 --> We have said we want to do the 566 in last year -- like last year, at least, the more that we do, the lower inventories will be.\n\n53cdbbaa93ddb183402a18edb3277e5f --> Well, when it comes to 2020 production rates, we are planning now and will, for the single-asile, continue the ramp-up. So you see the 43 in Q3, the 45 Q4, and it will continue to ramp-up in 2022.\n\n53cdbbaa93ddb183402a18edb3277e5f --> But it's a steep ramp-up in '22 and '23 for the single-aisle.\n\n24c7acd61d569fc75b41352e9422fb48 --> The ramp activity and the resources required for that are very much loaded towards the second half of the year.", "citations": ["d4a3bec5b15c8546c3c378d33b537e4d", "72a07c5d77002ed8bf84c815d84b10cc", "ee134c2ebb9d89361b12c271c4114dd1", "53cdbbaa93ddb183402a18edb3277e5f", "24c7acd61d569fc75b41352e9422fb48"]}, "['Q1', '2022']": {"answer": "9c8922353dc603c00809517450052394 --> [CEO] \"We expect to achieve a 10% increase in production by Q4 2022.\"\n\n4af3713d5e85694ab4909cdab7c34866 --> Following an analysis of global customer demand as well as an assessment of the industrial ecosystem's readiness, we are now working with our industry partners to increase the A320 family production rates further to 75 aircraft a month in 2025.\n\n304bad692676ad3e3bb495f507c421cc --> We continue to ramp up and are on track for the rate of 14 that we envisage for the middle of the decade.\n\n304bad692676ad3e3bb495f507c421cc --> Our production is progressing towards rate 65 by summer 2023 in a complex environment.\n\n304bad692676ad3e3bb495f507c421cc --> We are now working with our suppliers and partners to enable a monthly production rate of 75 in 2025.\n\n304bad692676ad3e3bb495f507c421cc --> We target to increase our A330 monthly production rate to almost 3 at the end of 2022.\n\n304bad692676ad3e3bb495f507c421cc --> We continue to expect to increase the monthly production rate to around 6 aircraft in early 2023.\n\n56b72284841191131828ecd220c2d69d --> And we see that from the rate 65 that we intend to reach mid of next year and 2025, this gives enough time to have a speed of ramp-up that is consistent with what the supply chain will be able to deliver.\n\nda8356444d7ad5e4e399f3c32139345f --> Moving to the ramp-up of our A320 family, it remains, of course, one of our top, top priorities. After what we went through together in the past 2 years, I'm pleased to be in a situation to increase our rate to 75, which again will benefit the entire global value chain and will support employment, especially in our home countries and in the U.S.", "citations": ["9c8922353dc603c00809517450052394", "4af3713d5e85694ab4909cdab7c34866", "304bad692676ad3e3bb495f507c421cc", "56b72284841191131828ecd220c2d69d", "da8356444d7ad5e4e399f3c32139345f"]}, "['Q3', '2024']": {"answer": "3149556cceae0e15b3acde5bff3ced5d --> We continue towards a monthly production rate of 14 aircraft in 2026, so rate 14 2026, while still working on the financial performance of this program.\n\n3149556cceae0e15b3acde5bff3ced5d --> We continue to ramp-up towards a rate of 75 aircraft per month for 2027.\n\n3149556cceae0e15b3acde5bff3ced5d --> On the A350, we continue to target the rate 12 in 2028, as we are also actively managing specific supply chain challenges that may have an impact on the ramp-up trajectory in particular next year, 2025.\n\n59b82c803bed6fe34128099e58dd2fbe --> Ross Law reiterated the rate 75 in 2027 for A320 production\n\nb8d92256dc76e60ed6503699cdd8d12c --> But we are very certain that by the end of the year we will also have assessed this program.\n\nb374dfe3488648c090c3eeeb220e4374 --> A320 production rates are to reach 75 in 2027, with full year at rate 75 by 2028.\n\ndaf2d054c124c3b14701d68c77b2c9d1 --> We had agreed for 2023 and 2024 on a reduced number of Pratt engines to Airbus to cope with that tension between supporting the fleet and producing new planes.", "citations": ["3149556cceae0e15b3acde5bff3ced5d", "59b82c803bed6fe34128099e58dd2fbe", "b8d92256dc76e60ed6503699cdd8d12c", "b374dfe3488648c090c3eeeb220e4374", "daf2d054c124c3b14701d68c77b2c9d1"]}, "['Q3', '2021']": {"answer": "b64b7a82fc42bf0068eaf5153534cb87 --> Our production rate currently at 5 per month is expected to increase to around 6 per month in early 2022, with a monthly production rate of 14 envisaged by the middle of the decade.\n\nb64b7a82fc42bf0068eaf5153534cb87 --> We are on our trajectory to achieve rate 65 by summer 2023.\n\nb64b7a82fc42bf0068eaf5153534cb87 --> We expect to increase our A330 production rate from around 2 to almost 3 aircraft per month on average at the end of next year.\n\nb64b7a82fc42bf0068eaf5153534cb87 --> We now expect to increase the A350 production rate from around 5 per month to date to around 6 in early 2023.\n\nf66fcdcaac99f63d455403f657c8130b --> Obviously, you're now committed to the production ramp-up every 6 months.\n\n21a11582cc1dad92754c155dba3f6bfa --> The first question was on the open slots where I don't want to answer specifically by type, except telling you that on the A320, we have no slots available in 2023.", "citations": ["b64b7a82fc42bf0068eaf5153534cb87", "f66fcdcaac99f63d455403f657c8130b", "21a11582cc1dad92754c155dba3f6bfa"]}, "['Q3', '2020']": {"answer": "2cc28184bdbb24835f9b9475f872a27c --> The one which is in place now by the way relies on the rate 40 till the end of the first half of 2021 and with the start of ramp-up by beginning of Q3 2021 from the rate 40 to the rate 47 for the second half of 2021.\n\n9a2755b24e509ebf042f1e3e4a53ae2e --> The ramp-up has been moved from beginning of Q2 to beginning of Q3 2021.\n\n35119489da106bd8c3ee5e48d3292236 --> In the current environment, where we are stable at rate 40, as we have said we want to converge the delivery and the production to be in a steady flow...\n\n35119489da106bd8c3ee5e48d3292236 --> ...but when it will come to ramping up the impact on deliveries of the planes that go at the Station 40 is obviously a couple of months later.\n\n6399de6abe9d61c7dcb6581c08847467 --> These are aircraft where we have a contract which has been now re-phased and we discuss to the customer and where delivery might be simply postponed a year or 2.\n\ncb8e9774cf5a95d49826a5cbf6cf1915 --> We started by adjusting from almost 10 on the 350 to down to 6. And then we have further adjusted to 5. We are around 5. We are depending on the months around 5 let's say. We don't see today reasons to change that, but we will keep monitoring and updating. We think we are quite appropriately geared with this 5-ish.\n\ncb8e9774cf5a95d49826a5cbf6cf1915 --> And on the 330, we are at a rate 2. It's small, but it's sustainable for the program.\n\nbc3a6663ce364f40f84c2c34e2f02897 --> The rate increase from rate 40 to rate 47 is start of Q3, 2021.", "citations": ["2cc28184bdbb24835f9b9475f872a27c", "9a2755b24e509ebf042f1e3e4a53ae2e", "35119489da106bd8c3ee5e48d3292236", "6399de6abe9d61c7dcb6581c08847467", "cb8e9774cf5a95d49826a5cbf6cf1915", "bc3a6663ce364f40f84c2c34e2f02897"]}, "['Q2', '2024']": {"answer": "530ca62ceea6eaa4e24cf6f77c5e3ced --> Our recent decision to adjust the rate 75 to 2027 gives to the key suppliers the additional time they need to fulfill the requirements of our production planning and it relaxes the tension for most of the suppliers by giving them a bit more time.\n\n852aa4eddd837b2319fc62e11aa98b64 --> We are on track to deliver 720 aircraft by the end of 2024.\n\n852aa4eddd837b2319fc62e11aa98b64 --> We plan to increase our production rate for the A320 family to 75 aircraft per month by 2026.\n\n330aca40193e570ab47f02358fa9d24e --> Our portfolio is currently being adjusted by implementing some rollovers to reflect the latest ramp-up trajectory and also our delivery target for 2024.\n\n34d6bca67e8fd7049ba1149cfc24a814 --> we have adjusted our A320 ramp-up trajectory to reflect specific supply chain challenges in the production rate of 75 A320 aircraft a month is now expected in 2027\n\n34d6bca67e8fd7049ba1149cfc24a814 --> We continue to target rate for the A330 this year and rate 12 for the A350 in 2028.\n\n52a95c59ec197a2dbbe59e5aa6a62cea --> we continue towards monthly production rate target of 14 aircraft in 2026", "citations": ["530ca62ceea6eaa4e24cf6f77c5e3ced", "852aa4eddd837b2319fc62e11aa98b64", "330aca40193e570ab47f02358fa9d24e", "34d6bca67e8fd7049ba1149cfc24a814", "52a95c59ec197a2dbbe59e5aa6a62cea"]}}}, {"topic": "Supply chain enhancements", "data": {"['Q4', '2022']": {"answer": "5529f8ba8f005bdd0d482aa9094f8982 --> we think it’s going to improve progressively moving forward, but we don’t count on a complete recovery of the supply chain in the short-term, and we will continue to face problems in 2023.", "citations": ["5529f8ba8f005bdd0d482aa9094f8982"]}, "['Q2', '2023']": {"answer": "8a87c842e536c50ce64c03581a1bad2a --> Guillaume Faury [Pratt & Whitney has confirmed that there is no impact for the delivery streams of engines from Pratt to Airbus for 2023, okay, for this year.]", "citations": ["8a87c842e536c50ce64c03581a1bad2a"]}, "['Q3', '2024']": {"answer": "80675cba3d1783cd4b77f2f48c748dd3 --> We think the next two to three years we will continue to be challenging because we'll continue to ramp-up and as our suppliers keep doing better we will keep asking for more.", "citations": ["80675cba3d1783cd4b77f2f48c748dd3"]}, "['Q3', '2021']": {"answer": "772a6e10222a118970d47de8c5eaa6fc --> we think the things we are having at the moment, the topics, the issues we're having are things that we will manage in the course of the next month.", "citations": ["772a6e10222a118970d47de8c5eaa6fc"]}, "['Q2', '2024']": {"answer": "530ca62ceea6eaa4e24cf6f77c5e3ced --> On engines, the 2024 and 2025 volumes are aligned with our suppliers.", "citations": ["530ca62ceea6eaa4e24cf6f77c5e3ced"]}}}, {"topic": "Cost management strategies", "data": {"['Q3', '2023']": {"answer": "a957b89713dafc31a209ce812f825b2d --> We aim to implement in early 2024 a simplified organizational structure with peacefully empowered and accountable business lines, Air Power, combining our existing military air system and FCAS activities, space systems and connected intelligence and supported by a strong transitional operational functions.", "citations": ["a957b89713dafc31a209ce812f825b2d"]}, "['Q2', '2020']": {"answer": "80fbd3bdf34f067b6d6b44760574c615 --> Weʼre also addressing our long-term cost structure, and we have announced plans to adapt our global workforce and resize our commercial aircraft activity. This adaptation is expected to result in a reduction of around 15,000 active workforce positions no later than summer next year, summer 2021.\n\n88904b082484bfc8fcfd66f8a4595742 --> Dominik Asam [The big chunk of the 15,000 headcount reduction we are targeting in active workforce, and donʼt forget thereʼs also temporary workers coming on top of that, will materialize during the course of next year.]\n\nd9c4830defd29e23eeb13d4f55a939c4 --> We expect to manage the objective to reduce significantly the number of aircraft stored by end of 2020 compared to today.\n\n174aebd0f97efe12f0cc4ce99e380e37 --> The objective is to get rid of the vast majority of inventories, mostly by end of this year or part next year.\n\n1ba4ef97e6c61095519da67f335df6fb --> On the question of how quickly the temps are out, itʼs something that is, of course, quicker than the active workforce reduction. Iʼd say, phasing over the second half of this year and then the lionʼs share should be done, but we want to keep also some temps in some areas to preserve some flexibility.", "citations": ["80fbd3bdf34f067b6d6b44760574c615", "88904b082484bfc8fcfd66f8a4595742", "d9c4830defd29e23eeb13d4f55a939c4", "174aebd0f97efe12f0cc4ce99e380e37", "1ba4ef97e6c61095519da67f335df6fb"]}, "['Q1', '2024']": {"answer": "369c5ef239c71b053d7dc2fba5b9a74f --> Thomas Toepfer [Inferred as CFO] [So 12,000 employees transferred from central functions into the business lines, significant.]", "citations": ["369c5ef239c71b053d7dc2fba5b9a74f"]}, "['Q1', '2022']": {"answer": "9c8922353dc603c00809517450052394 --> [COO] \"Our goal is to reduce costs by 5% over the next year.\"", "citations": ["9c8922353dc603c00809517450052394"]}, "['Q3', '2024']": {"answer": "30fefe8bda82bf3a122e63d757e1c907 --> This shall result in the transfer of some headquartered functions to the business lines in the course of next year, in the course of 2025 and in a reduction of up to 2,500 positions until mid of 2026.", "citations": ["30fefe8bda82bf3a122e63d757e1c907"]}, "['Q2', '2024']": {"answer": "9e1568964b6a8961c917ef90e93707dc --> We would clearly decelerate the hiring in 2024.", "citations": ["9e1568964b6a8961c917ef90e93707dc"]}}}, {"topic": "Logistics disruption management", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Global market penetration", "data": {"['Q3', '2021']": {"answer": "6838c776479bf51d8b2318171e052fc9 --> We anticipate we expect something rather similar for 2021.", "citations": ["6838c776479bf51d8b2318171e052fc9"]}}}, {"topic": "Strategic alliances", "data": {"['Q4', '2021']": {"answer": "a403a4d7d4d9a9bc20f7956e8ba88a5d --> We launched, there was a launch of our new wholly owned subsidiary Airbus Atlantic in France and the agreement with our social partners in Germany to establish a fully integrated similar aerostructure assembly st company, which will be operational on the first of July this year, 1 of July 2022.", "citations": ["a403a4d7d4d9a9bc20f7956e8ba88a5d"]}}}, {"topic": "Competitive positioning", "data": {}}, {"topic": "Emerging market opportunities", "data": {"['Q1', '2024']": {"answer": "fd84f9d457e80d99e17669847f5564bc --> We'll be soon at 5,000 Airbus employees in India. So I think it will be the case by 2025, roughly.", "citations": ["fd84f9d457e80d99e17669847f5564bc"]}}}]}, {"theme": "Customer Engagement and Satisfaction", "topics": [{"topic": "Airline customer partnerships"}, {"topic": "Service quality improvement"}, {"topic": "Long-term partnership focus"}]}, {"theme": "Defense and Space Operations", "topics": [{"topic": "Military aircraft contracts", "data": {"['Q2', '2020']": {"answer": "77b381bf12b6508954b1d7afd983f766 --> The support plan announced by the French government in June includes the following future order commitments: eight H225M for the French Air Force, 10 H160 for Gendarmerie Nationale and 2 H145 for security at Seville and as well a second demonstrator of the military drone that we developed for the French Navy.", "citations": ["77b381bf12b6508954b1d7afd983f766"]}, "['Q1', '2022']": {"answer": "0862c0f10f2d9abaec04d4ef71e2e2f4 --> We continue to work towards launching Phase Ib later this year, which is the next milestone for the success of this crucial European defense program.", "citations": ["0862c0f10f2d9abaec04d4ef71e2e2f4"]}, "['Q2', '2024']": {"answer": "8d484d0d1afc306f53db5bd1fea3bd3c --> Saudi Arabia has signed a contract for four additional MRTTs to be recorded in the backlog once all administrative work or paper work is done.", "citations": ["8d484d0d1afc306f53db5bd1fea3bd3c"]}}}, {"topic": "Space systems development", "data": {"['Q3', '2023']": {"answer": "7781fcecd389d50c4b6a3fcbd1dc4463 --> The priority now is on successfully completing the final test of Ariane 6 and securing its ramp-up to provide the sovereign access to space for Europe.\n\n7781fcecd389d50c4b6a3fcbd1dc4463 --> On Ariane 6, two important tests, the hot firing of the main and upper stages have been successfully achieved recently, another key milestone towards the inaugural flight next year.", "citations": ["7781fcecd389d50c4b6a3fcbd1dc4463"]}, "['Q3', '2024']": {"answer": "c896e9bc3332bc2f2fab69b9765e4c6c --> We currently expect the final assessment of the major space program under technical review by year-end.\n\n094527b7f185ea021114c2bf147ccd22 --> Here, Iʼd like to echo what Thomas said under one major space program that is still under review, and we are progressing, and we expect the final assessments by year-end, slightly before year-end.", "citations": ["c896e9bc3332bc2f2fab69b9765e4c6c", "094527b7f185ea021114c2bf147ccd22"]}, "['Q2', '2024']": {"answer": "8d484d0d1afc306f53db5bd1fea3bd3c --> Airbus will design and build two telecommunication satellites for Yahsat, allowing in-orbit reconfiguration of coverage area capacity and communication frequency.", "citations": ["8d484d0d1afc306f53db5bd1fea3bd3c"]}}}, {"topic": "Eurofighter and C295 orders", "data": {}}]}, {"theme": "Sustainability and Decarbonization", "topics": [{"topic": "Emission reduction strategies", "data": {"['Q3', '2023']": {"answer": "99ba19e1ffa4872f03a0be0d8f0b0496 --> We unveiled the Airbus Helicopters PioneerLab demonstrator to test and mature technologies aiming for a fuel reduction of up to 30%, three zero.", "citations": ["99ba19e1ffa4872f03a0be0d8f0b0496"]}, "['Q4', '2020']": {"answer": "849f400e0af4d6bb41837760e94e7205 --> We're aiming for a 15% reduction in CO2 emissions by the end of 2025.", "citations": ["849f400e0af4d6bb41837760e94e7205"]}, "['Q4', '2021']": {"answer": "a403a4d7d4d9a9bc20f7956e8ba88a5d --> The decarbonisation of air travel is a key pillar of Airbusʼ sustainability strategy. And this strategy was given a renewed impetus last year with the commitment of the entire sector to reach Net Zero Emissions by 2050.", "citations": ["a403a4d7d4d9a9bc20f7956e8ba88a5d"]}, "['Q2', '2024']": {"answer": "852aa4eddd837b2319fc62e11aa98b64 --> We are targeting a 10% reduction in carbon emissions by 2025.", "citations": ["852aa4eddd837b2319fc62e11aa98b64"]}}}, {"topic": "Sustainable aviation initiatives", "data": {"['Q3', '2023']": {"answer": "dadb63990a606c8c0b9a2b6b79be29d1 --> [Inferred as CEO] \"Given the growing importance of sustainability in our business, we have also decided as part of the reorganization to create the role of Chief Sustainability Officer.\"", "citations": ["dadb63990a606c8c0b9a2b6b79be29d1"]}, "['Q3', '2020']": {"answer": "0340ee2b749ae63d5bb2bf1ab86257a3 --> Finally, and it's very important to us, we will invest in decarbonized technologies. And we aim at developing the first climate neutral zero-emission passenger aircrafts.", "citations": ["0340ee2b749ae63d5bb2bf1ab86257a3"]}}}, {"topic": "Hydrogen technology testing", "data": {}}]}, {"theme": "Strategic Partnerships and Collaborations", "topics": [{"topic": "Joint ventures and alliances", "data": {"['Q1', '2022']": {"answer": "d6fd5a92c8d8886a7eabc9a1b9a3b40b --> I want to thank the teams for the historical agreement signed between ArianeSpace and Amazon [Airport] for 18 Ariane 6 launches over a period of 3 years, which illustrates the great potential of this platform.", "citations": ["d6fd5a92c8d8886a7eabc9a1b9a3b40b"]}}}, {"topic": "Supplier partnerships enhancement", "data": {"['Q3', '2020']": {"answer": "9a2755b24e509ebf042f1e3e4a53ae2e --> Suppliers are expected to be ready for ramp-up in nine months from now.", "citations": ["9a2755b24e509ebf042f1e3e4a53ae2e"]}}}, {"topic": "Industry collaboration benefits", "data": {}}]}, {"theme": "Risk and Compliance Management", "topics": [{"topic": "Regulatory compliance efforts"}, {"topic": "Risk mitigation strategies"}, {"topic": "Safety and quality standards"}]}, {"theme": "Market Environment and Dynamics", "topics": [{"topic": "Air traffic recovery trends", "data": {"['Q2', '2020']": {"answer": "4ec16966415430b2ddea4b7bf3bdd736 --> Air traffic would reach its 2019 level again somewhere between 2023 to 2025.\n\ncf2ff7f729b9d8dc366677bafd3345a9 --> But indeed, the Chinese airlines will take by far more deliveries in the second half of 2020 than what they did in the first half. So – and this is consistent with the expectation that their domestic market will keep recovering, but they still have a market that is underserved in terms of number of planes, so they will need, in particular on the single-aisle, to keep procuring planes. So we think there will be a recovery. It will not be at the levels of pre-COVID-19, but it should be at a quite high level or higher level in H2 2020 and a significantly higher level in 2021.", "citations": ["4ec16966415430b2ddea4b7bf3bdd736", "cf2ff7f729b9d8dc366677bafd3345a9"]}, "['Q4', '2020']": {"answer": "9a7f2322cffc044886736f14ddf0762b --> There will be room for some opening demand, we call it, when we look at the forecast that's more '23, '24.", "citations": ["9a7f2322cffc044886736f14ddf0762b"]}, "['Q1', '2020']": {"answer": "99b647bc4108c0f3a66319e54c42705a --> So if we continue to go up before it goes down, I would say the scheme is probably that it will start to go down in Q3 and there are two effects. We anticipate that customers will be able to come more easily and probably in larger numbers to pick their planes.\n\nfd5a9320ee219e0c1b7d43aa143ddebb --> On the wide-body, we think it is going to take more time and scenarios of full recovery of the COVID-19 is probably between 2023 to 2025 but its work ongoing.\n\nfd5a9320ee219e0c1b7d43aa143ddebb --> And China, yes, the situation is recovering in China and we'll see deliveries in Q2 in China.", "citations": ["99b647bc4108c0f3a66319e54c42705a", "fd5a9320ee219e0c1b7d43aa143ddebb"]}, "['Q4', '2021']": {"answer": "1056519c1ae004e55d13fd006fbc46c0 --> These uncertainties are not today of the nature to change our expectations that the market will recover between 2023 and 2025 with domestic and regional markets, clearly leading the way.", "citations": ["1056519c1ae004e55d13fd006fbc46c0"]}, "['Q1', '2021']": {"answer": "9dc104c5a7d74ab57e5f7ee823b82cdd --> We continue to expect the market to recover, and with a full recovery, expected between '23 and '25 with domestic and regional markets leading that recovery.", "citations": ["9dc104c5a7d74ab57e5f7ee823b82cdd"]}, "['Q1', '2022']": {"answer": "ef05545cc9e8a4cb30dd733981c52ca1 --> We still expect commercial air traffic to recover to pre-COVID levels between 2023 and 2025 with domestic and regional markets leading the way.", "citations": ["ef05545cc9e8a4cb30dd733981c52ca1"]}, "['Q3', '2021']": {"answer": "4095e1338cbdf86cbadf0c1a8d6a472a --> We continue to expect the market to recover between 2023 and 2025, with domestic and regional market clearly leading the recovery.", "citations": ["4095e1338cbdf86cbadf0c1a8d6a472a"]}, "['Q3', '2020']": {"answer": "b6246d04b89b1cad4fae3521a5782799 --> We continue to expect that air traffic will reach its 2019 level again between 2023 and 2025.", "citations": ["b6246d04b89b1cad4fae3521a5782799"]}}}, {"topic": "Geopolitical influences", "data": {}}, {"topic": "Competitive landscape overview", "data": {"['Q4', '2020']": {"answer": "9a7f2322cffc044886736f14ddf0762b --> We don't want to bet for '21 and '22 on orders. We will get now that we think it's too risky. And we enjoy a strong backlog.", "citations": ["9a7f2322cffc044886736f14ddf0762b"]}}}]}]