[{"theme": "Financial Performance and Growth", "topics": [{"topic": "Revenue growth trends", "data": {"['Q1', '2025']": {"answer": "5895d78bda911ca0030127cb1841a90b --> The Managing Director and Chief Executive Officer stated that the bank aims to increase its loan portfolio by 20% by the end of the fiscal year.\n\n2e2085ec9e9680fefeea445485312061 --> The management indicated a growth of 42% year-over-year and 6% quarter-over-quarter in the affordable housing book size by Q1 FY '25.\n\nf4d22575bf465f49f893ba7d4b953291 --> The CEO stated that the bank aims to increase its loan book by 25% for the fiscal year 2024-2025.\n\nfabbb46129254fa82e6cacc2a8861d3e --> There is a plan to continue the growth trend of over 40% in the coming years.\n\nde63c630e95b9088ccfb439671a8499e --> Ashish Goel mentioned that the company expects to achieve around 10% growth in Bihar for the current year.\n\n1e7a89a4aa2c897e5c305da5e3dcefde --> The company aims to grow its outstandings by 20%, maintain a 20% return on equity, achieve a 9% net interest margin (NIM), keep credit costs within 1.70%, increase its secured book to around 35% by the end of the financial year, and actively pursue a Universal Bank license within this financial year.", "citations": ["5895d78bda911ca0030127cb1841a90b", "2e2085ec9e9680fefeea445485312061", "f4d22575bf465f49f893ba7d4b953291", "fabbb46129254fa82e6cacc2a8861d3e", "de63c630e95b9088ccfb439671a8499e", "1e7a89a4aa2c897e5c305da5e3dcefde"]}, "['Q1', '2023']": {"answer": "d66755cd4b3cbe95e6563802d872c395 --> The CFO stated that the bank aims to achieve a loan book growth of 30% by the end of the fiscal year.\n\n3fdea2fb11142c6a655ff3201c170363 --> The Managing Director and Chief Executive stated that the bank aims to achieve a loan growth of 25% by the end of the fiscal year.\n\n910167785697c5569b3e03d0c1e71c26 --> Management indicated that for repeat loans after the third or fourth cycle, the maximum ticket size goes up to Rs. 1 lakh, with an average ticket size close to Rs. 58,000.\n\n910167785697c5569b3e03d0c1e71c26 --> Management stated that the maximum loan amount for a new group loan customer is Rs. 1 lakh.\n\n2cbe9fa39d0680d5cd609b98f705c680 --> The company is focusing on granular retail growth to increase its deposit base in coming quarters, with branches working at full capacity and targeting various segments including government and local municipalities.\n\n851822edba44d688128f864175d8472c --> The CEO mentioned that a 30% growth rate is reasonable for microfinance banks in the current recovery year.\n\nef68cfd8a6a874d47f15cdb48ab91a53 --> Incremental disbursements for the MSE business on a quarter-on-quarter basis are 48% in the formal segment.\n\nef68cfd8a6a874d47f15cdb48ab91a53 --> Quarter-on-quarter disbursements in the salaried segment of the affordable housing business are almost 54% to 55%.", "citations": ["d66755cd4b3cbe95e6563802d872c395", "3fdea2fb11142c6a655ff3201c170363", "910167785697c5569b3e03d0c1e71c26", "2cbe9fa39d0680d5cd609b98f705c680", "851822edba44d688128f864175d8472c", "ef68cfd8a6a874d47f15cdb48ab91a53"]}, "['Q3', '2023']": {"answer": "92df2180946c27cac40454db24ab781e --> The company expects to grow its gross loan book by about 25% in FY '24.\n\n7e4cef2043522a15a194681a2c654425 --> Mr. M. D. Ramesh Murthy (CFO) stated that the bank aims to increase its loan book by 20% over the next year.\n\n7d947a5d8516499c85581e397f394229 --> Deepak Khetan provided a broad growth guidance of 25% for the year 2024.\n\nd77f1ee3a691603fe9826c9f26b34855 --> Deepak Khetan mentioned that more financial data about next year will be shared in the fourth quarter.\n\n98733f3f0e7b6fbcb8da8f6df8fec8ca --> The initial guidance for H2 was INR 500 crore, and it remains unchanged.\n\nbdef75506f8a72ed0fa00894d7d1e64a --> The management targets to reach a 50-50 secured loan portfolio in the next five years.", "citations": ["92df2180946c27cac40454db24ab781e", "7e4cef2043522a15a194681a2c654425", "7d947a5d8516499c85581e397f394229", "d77f1ee3a691603fe9826c9f26b34855", "98733f3f0e7b6fbcb8da8f6df8fec8ca", "bdef75506f8a72ed0fa00894d7d1e64a"]}, "['Q1', '2024']": {"answer": "d44f677919aab403a780821c5cf859f6 --> The management team expects disbursements in micro-banking to pick up by the second half of the fiscal year.\n\nd44f677919aab403a780821c5cf859f6 --> Vehicle finance and gold loans should start to contribute in the second half of the year.\n\n645ab1e2cb2d3f7ed3a17578c0566359 --> The speaker expects disbursement to pick up again by the second half of the fiscal year.\n\na180706592cb835842beb5365cb1b6e2 --> Deepak Khetan indicated that SA balances will improve in the coming quarters due to new facilities, products, and a brand campaign.\n\ncbae70ec4821f5fb48c41367ec5b65d2 --> Every MFI is guiding to 30% growth over a very high base.\n\n72b4fd60b7a430b6c5cdf9b0d5d2f1f0 --> Vibhas Chandra indicated that the Individual Lending (IL) segment is expected to grow much faster than the Group Lending (GL) segment in the current financial year.\n\n5776bb6965a7a5eeb97bdf6786a9bb2e --> The CEO mentioned targeting a 25% increase in digital sales over the next two years.", "citations": ["d44f677919aab403a780821c5cf859f6", "645ab1e2cb2d3f7ed3a17578c0566359", "a180706592cb835842beb5365cb1b6e2", "cbae70ec4821f5fb48c41367ec5b65d2", "72b4fd60b7a430b6c5cdf9b0d5d2f1f0", "5776bb6965a7a5eeb97bdf6786a9bb2e"]}, "['Q2', '2024']": {"answer": "33679795fe73fb69d50bee6465d0b241 --> The bank is targeting a credit growth of 22% for the upcoming fiscal year.\n\n9bde8b418fcaa1134918e496a260e2e6 --> The business is on strong footing to deliver a 25% growth with a sustained ROE of 20% plus.\n\n5676a8c162eddc21c9d3e7e64116720b --> Vibhas Chandra indicated that there will be a better pickup in disbursement and loan growth in quarters 3 and 4.\n\n6cfc24c77fb2a16fc01a596d4bbf4e13 --> Deepak Khetan indicated that the structural improvement in insurance income should sustain in the second half of the year.\n\naedeb1f5b33e0cd23f49f91eb39bec3d --> The CEO stated that the bank aims to increase its loan book by 20% by the end of the next fiscal year.\n\n3cf94da5b7984d4424ed83cadcaf423c --> The CFO announced that the bank aims to increase its loan portfolio by 20% over the next year.", "citations": ["33679795fe73fb69d50bee6465d0b241", "9bde8b418fcaa1134918e496a260e2e6", "5676a8c162eddc21c9d3e7e64116720b", "6cfc24c77fb2a16fc01a596d4bbf4e13", "aedeb1f5b33e0cd23f49f91eb39bec3d", "3cf94da5b7984d4424ed83cadcaf423c"]}, "['Q4', '2023']": {"answer": "5f1d2d6c9cc050628a4c252c5ee047b2 --> The CEO mentioned a target for the gross loan portfolio to grow by 25% in the next fiscal year.\n\nc5dfa1ea1dcb4c7e66ca6c316773afec --> The gross loan book growth is expected to be 25% or more during FY '24.\n\nc5dfa1ea1dcb4c7e66ca6c316773afec --> The deposit growth for this year is projected to be 30% or more.\n\n646f914ae8bc37596299f374abdb7905 --> The speaker mentioned that for the next financial year, the unsecured/micro banking portfolio is expected to be about 68%, with the rest being secured with multiple products.\n\n646f914ae8bc37596299f374abdb7905 --> The speaker indicated a long-term target to move towards having 50% of the MFI book in a certain category, aiming to reach this mark in 3 to 5 years.\n\n9014d03d9dbb15bbf637d4a8b5aacb26 --> Ittira Davis stated that the deposit target growth is 30%, with the CASA ratio expected to increase to 30% by the end of the financial year '24.\n\n86c621a5c1d6f48fd75bb48385db1c98 --> The management mentioned a target for deposit growth of around 30%.\n\n4782e8e484a76cae17ba414ee43fa11e --> The CFO stated that the bank aims to achieve a credit growth of 30% year-on-year for the fiscal year 2023-2024.", "citations": ["5f1d2d6c9cc050628a4c252c5ee047b2", "c5dfa1ea1dcb4c7e66ca6c316773afec", "646f914ae8bc37596299f374abdb7905", "9014d03d9dbb15bbf637d4a8b5aacb26", "86c621a5c1d6f48fd75bb48385db1c98", "4782e8e484a76cae17ba414ee43fa11e"]}, "['Q3', '2024']": {"answer": "4c3543c43363755e613185aeeb46e396 --> Ittira Davis expects the strong trend in loan disbursements to continue in the fourth quarter.\n\n1f839792567db1cb9f769c5166622a26 --> The Chief Business Officer outlined a goal to increase the micro banking portfolio by 25% within the next year.\n\n5411805fd18c21a62ca77a4cd0c2d35c --> Saumil Shah referred to the company's guidance for FY '24 to grow the loan book by 25% and deposits by 30%.\n\nf8562a10df768d4f4310981ddca7190a --> The CFO projected a 20% increase in quarterly earnings by the end of the fiscal year.\n\n1dfee8f55d5af8d45e47657b0c396d28 --> The CEO stated that the bank aims to achieve a 20% growth in its loan portfolio by the end of the fiscal year.\n\n6225406cd60e8d0806ea4fea8e1d60c6 --> The CFO stated that revenue is expected to grow by 15% in the next fiscal year.\n\nd4b92fff32ab034fbea4d7838b353c55 --> Ashish Goel stated that they expect to see significant deposits from their pre-COVID MSME book in the next 2 to 4 quarters.", "citations": ["4c3543c43363755e613185aeeb46e396", "1f839792567db1cb9f769c5166622a26", "5411805fd18c21a62ca77a4cd0c2d35c", "f8562a10df768d4f4310981ddca7190a", "1dfee8f55d5af8d45e47657b0c396d28", "6225406cd60e8d0806ea4fea8e1d60c6", "d4b92fff32ab034fbea4d7838b353c55"]}, "['Q4', '2024']": {"answer": "7d7bc0e5878e44d0fa96e810d1cf518e --> The CEO stated that the bank aims to achieve a 20% growth in its loan portfolio in the fiscal year 2024-25.\n\n49968f8e55870e0d3f81bb36fa953d43 --> Our total CASA book now stands at INR8,335 crores. Our CASA ratio improved to 26.5 against 25.5 in the last quarter.\n\n9cb04bcf9f78063d0b9cb329b4f190e3 --> Ashish Goel confirmed that the bank plans to continue operating in the range of INR40 lakhs to INR50 lakhs for MLAP loans.\n\nf2cd991e5a4012ae641fdf142f378599 --> The collection team’s trend is expected to continue during this financial year.\n\nc291ff73ea8b3e3ace329b366cdaed60 --> Carol Furtado mentioned plans to increase the FIG lending portfolio to balance the secured asset book.\n\n8918c58cf7dd17bf8ad48943a4d955c3 --> The trend of Individual Loan growth outpacing Group Loan growth is expected to continue in FY25.\n\ndab3f16cf270cb2f3cee736111021967 --> The management expects to recover around INR100 crores in the current year through continued initiatives.\n\ndab3f16cf270cb2f3cee736111021967 --> The management estimates the gross loan book to grow between 20% to 25% for financial year '25, with deposits growing in line with asset growth.\n\n7ada96a9629cdf6fed48e6288c3de8aa --> Ashish Goel stated that the individual loan portfolio is expected to grow at a rate of 40%.\n\nb5339be99d2667684e3ae9c114f01edc --> The company is targeting recoveries in the range of INR100 crores to INR110 crores this year.\n\ndf6843a97eac11c25546713c237b7985 --> Carol Furtado stated that other income is expected to grow in line with business growth, with insurance and PSLC as key areas of focus for future performance.", "citations": ["7d7bc0e5878e44d0fa96e810d1cf518e", "49968f8e55870e0d3f81bb36fa953d43", "9cb04bcf9f78063d0b9cb329b4f190e3", "f2cd991e5a4012ae641fdf142f378599", "c291ff73ea8b3e3ace329b366cdaed60", "8918c58cf7dd17bf8ad48943a4d955c3", "dab3f16cf270cb2f3cee736111021967", "7ada96a9629cdf6fed48e6288c3de8aa", "b5339be99d2667684e3ae9c114f01edc", "df6843a97eac11c25546713c237b7985"]}, "['Q2', '2023']": {"answer": "08000950d3e28cca4e1359cf158c060c --> The company maintains a 30% gross advances growth guidance with deposits growing a little faster.\n\n2857ddd7e7788e8b1216bbc7809137f6 --> The management team indicated an AUM growth of 30%.\n\n2857ddd7e7788e8b1216bbc7809137f6 --> Ittira Davis confirmed that disbursements are expected to be over INR 4,000 crores quarter-on-quarter.\n\n9bb013d2c0cf27f3509f0d6eaea01aa1 --> The management is guiding for a 30% growth in AUM.\n\n7af1d6c4d30733c4d3c745becdaa718c --> The management stated a 30% growth target for the financial year.\n\n30f90a7d4fad5a19f6af23532f4f3fb2 --> Deepak Khetan confirmed that deposit growth will be higher than 30% loan book growth for this fiscal year.\n\nab559130858293213c8b09510aebd697 --> The management indicated a focus on increasing the IL percentage quarter-on-quarter in the future.", "citations": ["08000950d3e28cca4e1359cf158c060c", "2857ddd7e7788e8b1216bbc7809137f6", "9bb013d2c0cf27f3509f0d6eaea01aa1", "7af1d6c4d30733c4d3c745becdaa718c", "30f90a7d4fad5a19f6af23532f4f3fb2", "ab559130858293213c8b09510aebd697"]}}}, {"topic": "Interest income trends", "data": {"['Q3', '2023']": {"answer": "dcc59e379f6242e7a94aa38c2cd2c06c --> The Chief Financial Officer projected a 20% increase in net interest income for the next quarter.\n\nffdf21dc50c4a9f8827468200b54c06a --> The CFO mentioned a potential rate hike for new disbursements linked to EBLR by 90 to 100 bps.\n\n046e9c9785c29aee09f654d2134886d3 --> The industry, including Ujjivan Small Finance Bank, expects a turnaround or a decline in interest rates to start sometime in the second half of the financial year.", "citations": ["dcc59e379f6242e7a94aa38c2cd2c06c", "ffdf21dc50c4a9f8827468200b54c06a", "046e9c9785c29aee09f654d2134886d3"]}, "['Q1', '2024']": {"answer": "2bc20233c1954093bcb92988b2cfda2a --> The CEO mentioned plans to continue benefiting from yield expansion due to book repricing.\n\n5130402e84c88f31ff509596404d0971 --> The management indicated they will continue at the current IBPC rate of around 2000 odd crores for the full year.", "citations": ["2bc20233c1954093bcb92988b2cfda2a", "5130402e84c88f31ff509596404d0971"]}, "['Q2', '2024']": {"answer": "8d1add3502ed26d0b41a69e8b3c2f98f --> The cost of funds graph is expected to flatten going forward, assuming market interest rates remain stable.\n\nadfc75d70f52a2222e145445c5f5b9f4 --> Deepak Khetan mentioned that 28% of the micro banking book will see a 50 basis point repricing and the balance will be a 100 basis point repricing over the next 3 to 4 quarters.\n\nf102a0d48ed03077a061cd74afa3afea --> Deepak Khetan mentioned that the yield in the MSME segment is expected to remain more or less in the current range of 12.5%.", "citations": ["8d1add3502ed26d0b41a69e8b3c2f98f", "adfc75d70f52a2222e145445c5f5b9f4", "f102a0d48ed03077a061cd74afa3afea"]}, "['Q3', '2024']": {"answer": "16e45808ea08b40849ae7d848493ea7b --> The management plans to continue benefiting from the repricing of the asset book, with around 65% of the book in the high bracket, and approximately 37% sourced in specific periods yet to be fully repriced.\n\n2be9cebe0aebb1b50353f0ee59d84663 --> The management team indicated a plan to reduce the cost of borrowings in the future.\n\n25470404894380862c274c89eafa01d4 --> Deepak Khetan stated that the microfinance book, the GLI book, will see a 50 basis points improvement in 20% of the book and a 100 basis points improvement in 17% of the book over the next few months, including Q4 and possibly into Q1.", "citations": ["16e45808ea08b40849ae7d848493ea7b", "2be9cebe0aebb1b50353f0ee59d84663", "25470404894380862c274c89eafa01d4"]}, "['Q4', '2024']": {"answer": "fe5133fad079faabe688dec47c028698 --> The CFO indicated that the cost of funds will see a marginal uptake due to a recent rate hike.\n\n5febbfba1ed95b9cda11141b763c7484 --> The CEO mentioned an expectation for an increase in refinancing during the current year.", "citations": ["fe5133fad079faabe688dec47c028698", "5febbfba1ed95b9cda11141b763c7484"]}, "['Q2', '2023']": {"answer": "4bed50b142b0619a97890a5b5eb26569 --> Carol Furtado stated that they recently did a rate hike and are yet to see the results, following another rate hike in August which got good traction.", "citations": ["4bed50b142b0619a97890a5b5eb26569"]}}}, {"topic": "Profitability metrics", "data": {"['Q1', '2025']": {"answer": "298a8a10cdf985fb97bf4381dac8b44f --> The management aims to maintain a 20% asset book growth and achieve a full-year ROE of 20%.\n\n741fe8e4fb172049e6fa47b7ef1338f9 --> The objective is to achieve granular retail deposits at a lower cost, with an improvement target from 70% in March '24 to 74% as on June '24.\n\n3cd5a9d6813d59ffa89a33b9dea7a8dd --> Ashish Goel mentioned that the ROE should remain in the range of 20%.\n\n7f405ca1897ad089d088a147fcb622f4 --> The CFO provided guidance on achieving a gross margin improvement of 2% by the end of the fiscal year.\n\n19bcc894487cfde1f9dfd65757b0554c --> Carol Furtado indicated a 20% ROE for this year.", "citations": ["298a8a10cdf985fb97bf4381dac8b44f", "741fe8e4fb172049e6fa47b7ef1338f9", "3cd5a9d6813d59ffa89a33b9dea7a8dd", "7f405ca1897ad089d088a147fcb622f4", "19bcc894487cfde1f9dfd65757b0554c"]}, "['Q1', '2023']": {"answer": "3211c9bf90f2847aa73dc788ea185100 --> Return on assets should be north of 2.3% for the financial year '23.\n\n4422248f6688139229ed1bc2488e0e30 --> Deepak Poddar mentioned that the management is guiding for an ROA of 2.3% plus.", "citations": ["3211c9bf90f2847aa73dc788ea185100", "4422248f6688139229ed1bc2488e0e30"]}, "['Q3', '2023']": {"answer": "11ab1da3d84672574d5433b21104d49f --> The management expects Q4 ’23 to be similar to Q3 ’23 in terms of financial performance.\n\n8b7ed044fbd89c0e832a2556c8edf8c5 --> The CFO projected a 12% increase in EBITDA margin by the end of the fiscal year.\n\nc84cb0bac1be7c07b2c784cd08b45080 --> Deepak Khetan stated that the long-term sustainable return on assets (ROA) is expected to be between 2.25% to 2.5%.\n\n96213d50af899f65c96436f4f96532be --> Deepak Khetan stated that the long-term sustainable ROA should be around 2.5%.", "citations": ["11ab1da3d84672574d5433b21104d49f", "8b7ed044fbd89c0e832a2556c8edf8c5", "c84cb0bac1be7c07b2c784cd08b45080", "96213d50af899f65c96436f4f96532be"]}, "['Q1', '2024']": {"answer": "142a1eb44aaf3d90fd359fd8f089bb06 --> The management stated that the Return on Assets (ROA) is expected to be 3% plus for this year.\n\n142a1eb44aaf3d90fd359fd8f089bb06 --> The management mentioned that the Return on Equity (ROE) for this year will be 22% plus.\n\n00eff8c7ded7022924a8021e26302478 --> The CFO projected a 7% increase in EBITDA for the next quarter.\n\n0564b6933a09da986e61a6e7a2ff01b3 --> Deepak Khetan stated that they would be ending the year at around 2% on a specific metric.", "citations": ["142a1eb44aaf3d90fd359fd8f089bb06", "00eff8c7ded7022924a8021e26302478", "0564b6933a09da986e61a6e7a2ff01b3"]}, "['Q2', '2024']": {"answer": "b7cb999ff474e02474ee6aa731f64f92 --> The management has provided an ROE guidance of 22% for the current fiscal year.\n\nb7cb999ff474e02474ee6aa731f64f92 --> The management has set an ROE target of 20% plus for FY '25 and '26.\n\n8e3a11692c23ef8a39e64f048f3b04da --> Sarvesh Gupta referenced the ROE guidance stating that the company has already achieved 29% for the first half and questioned why the guidance is set at 22% plus for the full year.", "citations": ["b7cb999ff474e02474ee6aa731f64f92", "8e3a11692c23ef8a39e64f048f3b04da"]}, "['Q4', '2023']": {"answer": "5e5cb99c578bdec8b8fed78bb4e4b2df --> The guidance for Return on Equity (ROE) is to maintain 22% or more.\n\n6bcb62de62bebb5d2169a3b73406813c --> The CFO indicated a target for return on assets (ROA) to reach 2% by the end of the next financial year.\n\n53fe109183b99348fcd84799cc702448 --> The CFO projected an EBITDA margin improvement to 25% by the end of the fiscal year.\n\n9ef230d09c55afbd4020c833c4b1ccf7 --> A guidance of 22% on the ROE for the next period has been given.", "citations": ["5e5cb99c578bdec8b8fed78bb4e4b2df", "6bcb62de62bebb5d2169a3b73406813c", "53fe109183b99348fcd84799cc702448", "9ef230d09c55afbd4020c833c4b1ccf7"]}, "['Q3', '2024']": {"answer": "69be78acd4b66e8b43a36dcfd4357b4e --> The cost-to-income ratio target is around 50% to 52% in the next 2 years.\n\n5411805fd18c21a62ca77a4cd0c2d35c --> Deepak Khetan confirmed that the company maintains their guidance for net profit growth for the current year and their RoA, RoE guidance for FY '25, '26.\n\n39fa70bd09101dc2a2b5916d6ad729dd --> The book value is expected to increase by 2.4% to 2.5% post the reverse merger.\n\n94dce02781cdbc8d999a1c7893a5d34b --> The management has guided that the cost-to-income ratio will remain in the range of 275-280 basis points for the full year.\n\n1cfae3b22f8f0289194b8fac19d1c308 --> The management maintains a long-term Return on Equity (RoE) guidance of 22% plus for FY '25 and '26.", "citations": ["69be78acd4b66e8b43a36dcfd4357b4e", "5411805fd18c21a62ca77a4cd0c2d35c", "39fa70bd09101dc2a2b5916d6ad729dd", "94dce02781cdbc8d999a1c7893a5d34b", "1cfae3b22f8f0289194b8fac19d1c308"]}, "['Q4', '2024']": {"answer": "f2cd991e5a4012ae641fdf142f378599 --> The management expects NIMs to stay around 9% and the ROE at around 22%.\n\n9186411edf2f250a48e88a7ce7fa0486 --> The management indicated that the cost-to-income ratio is expected to remain at similar levels as investments continue.\n\n297070095795abbb2f01d003be72be7e --> The CFO stated that the company expects a gross margin improvement of 2% in the next quarter.\n\nc7101910e85b1b13a93fa1a7d0cd2c0b --> The CFO projected a 20% increase in net profit for the upcoming fiscal year.\n\n54b7987abc5091ca07febeb7c38c1eb8 --> The CEO expects a 20% increase in net profit margin by the end of the fiscal year.", "citations": ["f2cd991e5a4012ae641fdf142f378599", "9186411edf2f250a48e88a7ce7fa0486", "297070095795abbb2f01d003be72be7e", "c7101910e85b1b13a93fa1a7d0cd2c0b", "54b7987abc5091ca07febeb7c38c1eb8"]}, "['Q2', '2023']": {"answer": "f140b27d1739faa2104e4a2a0f15acf0 --> The management expects the cost-to-income ratio to be comfortably below 60% for the entire year.", "citations": ["f140b27d1739faa2104e4a2a0f15acf0"]}}}, {"topic": "Net interest margin analysis", "data": {"['Q1', '2025']": {"answer": "5895d78bda911ca0030127cb1841a90b --> The Chief Financial Officer mentioned that the bank expects to maintain a net interest margin of 8% for the remainder of the year.", "citations": ["5895d78bda911ca0030127cb1841a90b"]}, "['Q1', '2023']": {"answer": "39f1aaaa4b17bcf951442a4f1b94287a --> The CFO mentioned a target for the net interest margin (NIM) to be maintained above 10% for the fiscal year.", "citations": ["39f1aaaa4b17bcf951442a4f1b94287a"]}, "['Q1', '2024']": {"answer": "df4b0819b3ec34843a9fb9e350f1da44 --> The management maintains a guidance of around 9% Net Interest Margins (NIMS) for this year.", "citations": ["df4b0819b3ec34843a9fb9e350f1da44"]}, "['Q2', '2024']": {"answer": "67c390341a5e9365ebe6e47a99455d66 --> Deepak Khetan stated that they stick to the 9% NIM guidance for the full year, expecting NIM to be better in the second half compared to Q2, and achieving a 9% NIM for the full year is not seen as a major challenge.", "citations": ["67c390341a5e9365ebe6e47a99455d66"]}, "['Q4', '2023']": {"answer": "77e5128fc0d236cc983b5933a4313362 --> Deepak Khetan expects the NIM in the coming year to be 9% or more.\n\nd2d3d9e1da6af4ef7b318ee677712f52 --> The bank has provided guidance for a 9% yield that includes the gold loan portfolio.\n\ne0330e5d11874e8d283917e27abd0bee --> The management provided a guidance of sub-100 basis points.", "citations": ["77e5128fc0d236cc983b5933a4313362", "d2d3d9e1da6af4ef7b318ee677712f52", "e0330e5d11874e8d283917e27abd0bee"]}, "['Q3', '2024']": {"answer": "5f0a5a70a31ad7e8a5766de79639d125 --> The company is maintaining a full year guidance of 9% NIM.\n\nb47a08151c8346f7727a45cfe8df8a24 --> Deepak Khetan mentioned maintaining a NIM around 9% for the bank.\n\n85baeefe256199a62691d8d08907bcd6 --> The CFO indicated a target for net interest margin (NIM) to be maintained at around 10% for the upcoming fiscal year.\n\nc895c2111de2750f0b804ad774e97f9e --> The CFO announced plans to improve the net interest margin by 50 basis points in the coming year.\n\nd1cf42ead1255ce29885bce46bfc5596 --> The CFO announced a target to increase net interest margin by 0.5% within the next two quarters.", "citations": ["5f0a5a70a31ad7e8a5766de79639d125", "b47a08151c8346f7727a45cfe8df8a24", "85baeefe256199a62691d8d08907bcd6", "c895c2111de2750f0b804ad774e97f9e", "d1cf42ead1255ce29885bce46bfc5596"]}, "['Q4', '2024']": {"answer": "7d7bc0e5878e44d0fa96e810d1cf518e --> The CFO mentioned that the bank expects to maintain a net interest margin of around 10% throughout the next fiscal year.\n\nacd9070e12579614250556ba24cee7f4 --> The NIM guidance is set at 9%.\n\nbc73deda49a3b05739102d7053869920 --> The CFO confirmed the bank's plan to improve its net interest margin by 50 basis points over the next two quarters.\n\na1ffc741b9386778394432dff15f395d --> The guidance for NIM (Net Interest Margin) is to go with 9%.", "citations": ["7d7bc0e5878e44d0fa96e810d1cf518e", "acd9070e12579614250556ba24cee7f4", "bc73deda49a3b05739102d7053869920", "a1ffc741b9386778394432dff15f395d"]}, "['Q2', '2023']": {"answer": "4bc3b1e3c3d84917314022ee18672b54 --> Ujjivan Financial Services Limited projects NIMs (Net Interest Margins) to be around 9.5% for the year.", "citations": ["4bc3b1e3c3d84917314022ee18672b54"]}}}, {"topic": "Capital adequacy ratios", "data": {"['Q1', '2025']": {"answer": "741fe8e4fb172049e6fa47b7ef1338f9 --> The management team has set a target to maintain the CD ratio at 85%, inclusive of IBPC securitization, as part of their liquidity management and negative carry reduction strategy.\n\n1366ac3096ec4082d1c979b72b7a3768 --> The 60-40 composition, with 40% being the secured asset portfolio, is expected to be achieved by FY '26.", "citations": ["741fe8e4fb172049e6fa47b7ef1338f9", "1366ac3096ec4082d1c979b72b7a3768"]}, "['Q1', '2023']": {"answer": "79dcc89993aa2bc636d0223b05269715 --> The company plans a fresh issue in December.\n\n8f5b301c3bf1b65536ca3bdaec9ebd67 --> The CFO stated that the company aims to reduce its debt by $500 million by the end of the fiscal year.", "citations": ["79dcc89993aa2bc636d0223b05269715", "8f5b301c3bf1b65536ca3bdaec9ebd67"]}, "['Q3', '2023']": {"answer": "895783a7bccb1362770e7b7b46b8ce02 --> Ittira Davis (Inferred as CEO) mentioned the goal to achieve a 50-50 balance between secured and unsecured debts in five years.", "citations": ["895783a7bccb1362770e7b7b46b8ce02"]}, "['Q1', '2024']": {"answer": "e2ed7afc8070f1f4c45f0ac87dd6428f --> Deepak Khetan confirmed that post the reverse merger, roughly around INR3 crores odd shares will be cancelled.", "citations": ["e2ed7afc8070f1f4c45f0ac87dd6428f"]}, "['Q2', '2024']": {"answer": "6d3efd30aa6ef6998df318dad9d632d4 --> The CFO outlined a plan to reduce debt by $100 million over the next two years.\n\nc3d5c594250b1df7d1abe019dea904f2 --> Deepak Khetan stated that there will be an addition of around INR400 crores to the equity network and a reduction of approximately 2.82 crores of shares from the total base, which should add to the book value by around INR2.4 or a little more.", "citations": ["6d3efd30aa6ef6998df318dad9d632d4", "c3d5c594250b1df7d1abe019dea904f2"]}, "['Q4', '2023']": {"answer": "43aed8ad003d14965340c14bc7076386 --> The CEO stated that the company is targeting to end FY '24 with a CASA ratio of around 30%.\n\n54285c6fc0ac927489bd13577afb8f0d --> Ittira Davis stated that there is no expected need for additional capital in the next 2 years, maintaining a capital adequacy target of not going below 20%.", "citations": ["43aed8ad003d14965340c14bc7076386", "54285c6fc0ac927489bd13577afb8f0d"]}, "['Q3', '2024']": {"answer": "a7db149fc2d0348bb4ab03693b38562a --> Deepak Khetan stated that by March 2026, there is a guidance of a 40:60 mix between secured and unsecured products.\n\ncac18be85b247954a86aa49c1cd9631f --> The CFO stated that capital expenditures will increase by 20% in the next quarter to support new product development.", "citations": ["a7db149fc2d0348bb4ab03693b38562a", "cac18be85b247954a86aa49c1cd9631f"]}, "['Q4', '2024']": {"answer": "a1ffc741b9386778394432dff15f395d --> The internal target for the CA SA ratio is towards the magic number of 30.\n\ndffcf2bda43b4e759d8f0d3c445f4f0c --> There will be no need for additional capital for the years 2024 and 2025, despite a 25% growth in the loan book and 15% growth in net worth.\n\n54b7987abc5091ca07febeb7c38c1eb8 --> The CFO anticipates a 5% reduction in capital expenditures over the next two quarters.", "citations": ["a1ffc741b9386778394432dff15f395d", "dffcf2bda43b4e759d8f0d3c445f4f0c", "54b7987abc5091ca07febeb7c38c1eb8"]}}}]}, {"theme": "Digital Transformation and Technology", "topics": [{"topic": "Digital banking enhancements", "data": {"['Q1', '2025']": {"answer": "8ae40bc46ad08794cfb06d2384446fb7 --> The speaker (inferred as CEO) mentioned launching digital current accounts targeting the MSME segment and enhancing the digital platform as part of their strategic plans.", "citations": ["8ae40bc46ad08794cfb06d2384446fb7"]}, "['Q4', '2023']": {"answer": "c5dfa1ea1dcb4c7e66ca6c316773afec --> The commercial launch of digital deposits is planned for early in the current fiscal year.\n\n6bcb62de62bebb5d2169a3b73406813c --> The COO outlined a digital transformation goal to increase digital transactions by 30% within the next six months.", "citations": ["c5dfa1ea1dcb4c7e66ca6c316773afec", "6bcb62de62bebb5d2169a3b73406813c"]}, "['Q3', '2024']": {"answer": "85baeefe256199a62691d8d08907bcd6 --> The Chief Operating Officer mentioned the goal to increase digital transactions by 30% within the next six months.", "citations": ["85baeefe256199a62691d8d08907bcd6"]}, "['Q4', '2024']": {"answer": "6310896e8d4324b944fb5612e1a0f04a --> The management plans to introduce digital initiatives such as smart statements, video banking, and WhatsApp banking during the first quarter of the financial year.\n\nc7c6f1f5e234a8082e196b53c2133df0 --> The management plans to launch the Loan Origination System (LOS) for the MSME business in the first quarter.\n\nc7101910e85b1b13a93fa1a7d0cd2c0b --> The COO mentioned the implementation of a new digital platform by Q3 this year.", "citations": ["6310896e8d4324b944fb5612e1a0f04a", "c7c6f1f5e234a8082e196b53c2133df0", "c7101910e85b1b13a93fa1a7d0cd2c0b"]}}}, {"topic": "Mobile app features", "data": {"['Q4', '2023']": {"answer": "6aa8c1262527fc3e9aec02944cf92c61 --> The MD and Chief Executive Officer stated that the bank is working towards enabling loan applications on their mobile app.", "citations": ["6aa8c1262527fc3e9aec02944cf92c61"]}}}, {"topic": "Technology infrastructure upgrades", "data": {}}, {"topic": "Cybersecurity investments", "data": {}}, {"topic": "AI integration roadmap", "data": {}}]}, {"theme": "Risk Management and Asset Quality", "topics": [{"topic": "Credit risk assessment", "data": {"['Q1', '2025']": {"answer": "f79ee1b99524243ba51ae2469b2aba93 --> Sanjeev Nautiyal (MD and CEO) mentioned the cautious approach in acquiring new to credit customers amid a slowdown in microfinance.\n\n43ba23556848fd0e12ec7864c5be0e40 --> The management is confident of meeting their FY '25 credit cost guidance.\n\na712918aea4879751d88428304d2a719 --> Ashish Goel mentioned that the credit cost is expected to be in the range of 1.7% for the full year.\n\n3cd5a9d6813d59ffa89a33b9dea7a8dd --> Ashish Goel stated that the credit cost for the first half of the year will stay within the range of 1.4% to 1.6%.\n\n3cd5a9d6813d59ffa89a33b9dea7a8dd --> Ashish Goel confirmed that the credit cost for the entire year will stay within 1.7%.\n\na10ab815914cb109f0897770d211f707 --> Ashish Goel stated that they had set a target for 5% to 7% of BBB and below-rated corporates in their portfolio.\n\n92d412a3faf6041d06792a18dda5d382 --> Ayush Vimal stated that the issue pertaining to overlending in the state is expected to be resolved in 3 to 6 months.", "citations": ["f79ee1b99524243ba51ae2469b2aba93", "43ba23556848fd0e12ec7864c5be0e40", "a712918aea4879751d88428304d2a719", "3cd5a9d6813d59ffa89a33b9dea7a8dd", "a10ab815914cb109f0897770d211f707", "92d412a3faf6041d06792a18dda5d382"]}, "['Q3', '2023']": {"answer": "7d947a5d8516499c85581e397f394229 --> Mr. Davis mentioned that FY '24 is expected to be a good year with credit cost around 1%.\n\ncd9e42526932678fe713949361aebda5 --> Ashish Goel confirmed that they are guiding for 100 basis point on the gross number for credit costs.", "citations": ["7d947a5d8516499c85581e397f394229", "cd9e42526932678fe713949361aebda5"]}, "['Q1', '2024']": {"answer": "bff0e3f0bd494b0a90c902dc884d16f5 --> Ashish Goel stated that the credit cost is expected to be less than 1% for FY '24.", "citations": ["bff0e3f0bd494b0a90c902dc884d16f5"]}, "['Q2', '2024']": {"answer": "b7cb999ff474e02474ee6aa731f64f92 --> The management has given a credit cost guidance of less than 100 basis points for the current fiscal year.\n\nb7cb999ff474e02474ee6aa731f64f92 --> The management has provided a normalized credit cost guidance of around 125 to 150 basis points.", "citations": ["b7cb999ff474e02474ee6aa731f64f92"]}, "['Q4', '2023']": {"answer": "77e5128fc0d236cc983b5933a4313362 --> The management expects to keep credit costs sub 100 basis points and an ROE around 22% for financial year '24.\n\n9ef230d09c55afbd4020c833c4b1ccf7 --> The management has provided guidance on sub-100 basis points credit cost for the next year.", "citations": ["77e5128fc0d236cc983b5933a4313362", "9ef230d09c55afbd4020c833c4b1ccf7"]}, "['Q3', '2024']": {"answer": "2be159fce4ea57113c13be6ba4f3c0cd --> The management expects credit cost to continue moving towards normal levels.\n\nf12a74c5c4327c01f96c088029a1101c --> The management indicated a credit cost guidance of 1% for FY '24 and provided a range for FY '25.\n\n551e4071906411f91553114f4b54492b --> The company is maintaining credit cost guidance to be below 1% for Q4.", "citations": ["2be159fce4ea57113c13be6ba4f3c0cd", "f12a74c5c4327c01f96c088029a1101c", "551e4071906411f91553114f4b54492b"]}, "['Q4', '2024']": {"answer": "65165d4f8e879527a08a8e9db24d1453 --> Ashish Goel mentioned that credit costs are expected to be at a steady state going forward into FY25.\n\ndab3f16cf270cb2f3cee736111021967 --> The management expects credit costs to be in the range of 1.4% to 1.5% for financial year '25.\n\n66435a634baa87d0328e3425960559bb --> Carol Furtado mentioned that the company plans to have a 60-40 split between unsecured and secured advances over FY '25 and '26.", "citations": ["65165d4f8e879527a08a8e9db24d1453", "dab3f16cf270cb2f3cee736111021967", "66435a634baa87d0328e3425960559bb"]}, "['Q2', '2023']": {"answer": "1d0f2870ec298629f1fe0c9e04d6b8f4 --> The CFO stated that credit costs for FY '23 will be less than 1%.\n\n8388cd0ab2360b23cb30731e02b2abf6 --> Ashish Goel stated that the credit costs will continue to be 100 to 150 basis points in a normalized year.\n\n9f713da908c9ad9af90ac35aae01838e --> Ashish Goel (Inferred as CFO) stated that the credit cost is expected to normalize to 100 to 150 basis points for the bank as a whole starting from FY '24.", "citations": ["1d0f2870ec298629f1fe0c9e04d6b8f4", "8388cd0ab2360b23cb30731e02b2abf6", "9f713da908c9ad9af90ac35aae01838e"]}}}, {"topic": "Non-performing asset management", "data": {"['Q1', '2025']": {"answer": "298a8a10cdf985fb97bf4381dac8b44f --> The management has set a target to collect over INR100 crores in bad debt recovery for the year.\n\n19bcc894487cfde1f9dfd65757b0554c --> Ashish Goel expects the NPA to peak at about 2.7% to 2.8% by the end of the financial year, then start showing a reducing trend.", "citations": ["298a8a10cdf985fb97bf4381dac8b44f", "19bcc894487cfde1f9dfd65757b0554c"]}, "['Q1', '2023']": {"answer": "5d7debaa65a362928bcad6ab97ef611b --> Ashish Goel mentioned that there will be a small portion of write-off in the NPA segment, but not for the entire amount.\n\n3211c9bf90f2847aa73dc788ea185100 --> Credit cost is expected to be contained well below 1% for the balance of the financial year '23.", "citations": ["5d7debaa65a362928bcad6ab97ef611b", "3211c9bf90f2847aa73dc788ea185100"]}, "['Q1', '2024']": {"answer": "1b70064784725d8274dea13bd0cf645a --> The speaker stated that bad debt recoveries should be significant in financial year '24, although lower than financial year '23.\n\n90658684d56d552095ea01c84f61c136 --> The management expects bad debt recovery to continue to be strong in FY '24, but slightly lower than the INR 135 crores achieved in FY '23.", "citations": ["1b70064784725d8274dea13bd0cf645a", "90658684d56d552095ea01c84f61c136"]}, "['Q2', '2024']": {"answer": "b55e2ebaa80f02330135fa417d09400d --> Ashish Goel stated the goal of achieving INR100 crores of bad debt recovery for the remaining part of the year.", "citations": ["b55e2ebaa80f02330135fa417d09400d"]}, "['Q4', '2023']": {"answer": "55dd7e98af920a0225f1f73dcb42e621 --> The management expects bad debt recoveries to continue during FY '24.\n\n15d93f9a5b5f637465977982856a3af9 --> Deepak Khetan mentioned that more than INR1,000 crore of active technical write-off book is there, from which recoveries can be expected in this year or the coming years.", "citations": ["55dd7e98af920a0225f1f73dcb42e621", "15d93f9a5b5f637465977982856a3af9"]}, "['Q3', '2024']": {"answer": "e5b3c993d21e30cb757b403b4f0a185e --> Ashish Goel stated the expectation to maintain a similar run rate for bad-debt recovery in Q4.\n\nda0581e6b5d2b06581665beab65836fe --> Ashish Goel stated that the non-performing assets (NPA) are expected to be in the range of 2% by the end of FY '24.\n\n00def5705af752cb72ac425e23fbac71 --> Ashish Goel stated that bad debt recovery is typically in the range of 25% to 30% within 24 months, but for the next year, it will be lower than INR130 crores, which was last year's recovery.", "citations": ["e5b3c993d21e30cb757b403b4f0a185e", "da0581e6b5d2b06581665beab65836fe", "00def5705af752cb72ac425e23fbac71"]}, "['Q4', '2024']": {"answer": "a290b3c2ff53625377143e8801597f4f --> Ashish Goel stated that the recovery from written off accounts is expected to be between INR100 crores and INR110 crores for the current year.", "citations": ["a290b3c2ff53625377143e8801597f4f"]}, "['Q2', '2023']": {"answer": "b596c5b49749ab487a74229b2c77672b --> Mr. Davis stated that the NPA recoveries and collections are expected to continue to be good for the rest of the year, although not as good as the second or first quarter.", "citations": ["b596c5b49749ab487a74229b2c77672b"]}}}, {"topic": "Asset quality metrics", "data": {"['Q1', '2025']": {"answer": "70d687d3683fc00f92c0252551651bec --> Carol Furtado stated the company aims to reach 40% in secured book by the end of the year and achieve a 60-40 ratio (40% secured) over the next two years.", "citations": ["70d687d3683fc00f92c0252551651bec"]}, "['Q3', '2023']": {"answer": "16cc5a9c068ff7ac7d8d5551aeae93b9 --> The CEO stated that the secured and unsecured book ratio is expected to reach 50-50 within five years.", "citations": ["16cc5a9c068ff7ac7d8d5551aeae93b9"]}, "['Q4', '2023']": {"answer": "6c8e410f05e942dc6328e12739fe075d --> The CEO mentioned a target to reduce the unsecured book to around 68% from the current 73%.", "citations": ["6c8e410f05e942dc6328e12739fe075d"]}, "['Q4', '2024']": {"answer": "1abc6c7ca52264a17cccdf3853ac603f --> The company expects the impact of the Karza Mukti Abhiyan on its portfolio in Punjab and Haryana to subside by Q2 of financial year '24.", "citations": ["1abc6c7ca52264a17cccdf3853ac603f"]}}}, {"topic": "Provisioning strategy", "data": {"['Q1', '2023']": {"answer": "67ce8e743fa2eb964798bf72bb0eba92 --> The CEO stated that the company has already taken provisions upfront and does not expect major credit quality challenges this year.", "citations": ["67ce8e743fa2eb964798bf72bb0eba92"]}, "['Q3', '2023']": {"answer": "99c19b5e88a6540e1b2f1bf2872474ee --> The management expects provisions to move up towards 1% on average gross loan book next year.", "citations": ["99c19b5e88a6540e1b2f1bf2872474ee"]}, "['Q2', '2024']": {"answer": "ab3dca9d0effac8cd16a0d1b87eb22f0 --> Ashish Goel stated that the credit cost will be maintained within 100 bps for the year.", "citations": ["ab3dca9d0effac8cd16a0d1b87eb22f0"]}, "['Q4', '2023']": {"answer": "ab0342241c03d239da83c4acca4fb295 --> Deepak Khetan stated that there will be no change in provisioning policy for the next financial year.", "citations": ["ab0342241c03d239da83c4acca4fb295"]}, "['Q2', '2023']": {"answer": "7af1d6c4d30733c4d3c745becdaa718c --> The management plans to keep provisions below 1% for the fiscal year, supplemented by strong recoveries.\n\n806e7612080f1f3ef02aadd798ca2fcf --> Deepak Khetan mentioned that the company will continue to maintain about 1% as a floating provision.\n\n246f1ddbf631deb515f0fd12666c9743 --> Ashish Goel stated that the company plans to carry a 1% floating provision of their overall book for at least the next two quarters.", "citations": ["7af1d6c4d30733c4d3c745becdaa718c", "806e7612080f1f3ef02aadd798ca2fcf", "246f1ddbf631deb515f0fd12666c9743"]}}}, {"topic": "Risk mitigation practices", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Geographic expansion plans", "data": {"['Q1', '2025']": {"answer": "992c330c500898619a3b96da3c52c825 --> We believe our diversified presence of 752 branches standing across 326 districts in 26 states will help achieve this objective. We do believe normalcy will be restored by end of H1 FY '25 and higher volume generation will be achievable from Q3 onwards.\n\n5895d78bda911ca0030127cb1841a90b --> The Executive Director confirmed the plan to open 50 new branches within the next 18 months.", "citations": ["992c330c500898619a3b96da3c52c825", "5895d78bda911ca0030127cb1841a90b"]}, "['Q3', '2023']": {"answer": "852c0fea13fd0bd05d332f0c0d0a2df4 --> The management team mentioned their focus on semi-formal in Tier 2 and Tier 3 towns in the housing sector.\n\nb2597b61c12c44f3432507ebd9255cb8 --> The company plans to add between 50 and 70 branches in the fiscal year 2024, focusing on deposit-rich catchment areas.\n\ndcc59e379f6242e7a94aa38c2cd2c06c --> The Managing Director and CEO of Ujjivan Small Finance Bank Limited stated that they aim to open 100 new branches by the end of the fiscal year.\n\ne5ed065a3633b78e8fdb001c2436391e --> Carol Furtado mentioned the expansion strategy in Telangana with specific branch openings.", "citations": ["852c0fea13fd0bd05d332f0c0d0a2df4", "b2597b61c12c44f3432507ebd9255cb8", "dcc59e379f6242e7a94aa38c2cd2c06c", "e5ed065a3633b78e8fdb001c2436391e"]}, "['Q1', '2024']": {"answer": "1b70064784725d8274dea13bd0cf645a --> The speaker mentioned that 70-odd branches will be added for the rest of this year.\n\n0d9ba186fd4ef537c700fbaa6a166908 --> Deepak Khetan stated that Ujjivan Small Finance Bank plans to open around 70 new branches over the next 9 months.", "citations": ["1b70064784725d8274dea13bd0cf645a", "0d9ba186fd4ef537c700fbaa6a166908"]}, "['Q2', '2024']": {"answer": "5bd9cd0f373c5d9a8b1fdfb6b459c141 --> The CEO mentioned the addition of 45 new branches in the second half of the year.\n\n05235d939247da8faf44e6d565b9f0e9 --> Ittira Davis mentioned that by the end of this financial year, the company will be adding about 150-odd branches from last financial year.\n\nde5e780f1dd1271b065cef6994030f87 --> The management expects the micro LAP business to scale in the coming quarters.\n\nde5e780f1dd1271b065cef6994030f87 --> The affordable housing segment now constitutes 15% of the total gross loan book, with 10 new hubs added this quarter.\n\nec866cb28a222a7a2bd45fc09be6ce2f --> Vibhas Chandra mentioned that the newer branches are expected to start generating business in the third and fourth quarters of this year.\n\n3cf94da5b7984d4424ed83cadcaf423c --> The CEO mentioned plans to open 50 new branches by the end of the fiscal year.\n\n9851e4835f82ab88179897033a5731b0 --> The CEO announced a target to expand the bank's branch network by 20% within the next year.\n\n6d3efd30aa6ef6998df318dad9d632d4 --> The COO expects to open 20 new stores in the next 12 months.", "citations": ["5bd9cd0f373c5d9a8b1fdfb6b459c141", "05235d939247da8faf44e6d565b9f0e9", "de5e780f1dd1271b065cef6994030f87", "ec866cb28a222a7a2bd45fc09be6ce2f", "3cf94da5b7984d4424ed83cadcaf423c", "9851e4835f82ab88179897033a5731b0", "6d3efd30aa6ef6998df318dad9d632d4"]}, "['Q4', '2023']": {"answer": "404a9f9e645576eefc9a61c11617b175 --> The CEO stated that the bank expects to open 100 branches in financial year '24, including entering the state of Andhra.\n\n5f1d2d6c9cc050628a4c252c5ee047b2 --> The Chief Business Officer stated an increase in the number of branches by 50 within the next 12 months.\n\nc0900d3c8b862dee528aca688cf0e24b --> The CEO stated that they plan to add about 100 more branches during FY '24.\n\n6bcb62de62bebb5d2169a3b73406813c --> The CEO announced plans to open 50 new branches by the end of the current fiscal year.\n\n4782e8e484a76cae17ba414ee43fa11e --> The Head of Operations confirmed an increase in the branch network by 50 new branches by Q4 of 2024.", "citations": ["404a9f9e645576eefc9a61c11617b175", "5f1d2d6c9cc050628a4c252c5ee047b2", "c0900d3c8b862dee528aca688cf0e24b", "6bcb62de62bebb5d2169a3b73406813c", "4782e8e484a76cae17ba414ee43fa11e"]}, "['Q3', '2024']": {"answer": "3b2b406377a0f47af5c876d2572026fd --> The management aims to add 23 more branches in the current quarter.\n\n1f839792567db1cb9f769c5166622a26 --> The CEO mentioned plans to expand the branch network by 20 new branches by the end of the fiscal year.\n\n85baeefe256199a62691d8d08907bcd6 --> The CEO announced the expansion plan to open 50 new branches by the end of the next calendar year.\n\nd1cf42ead1255ce29885bce46bfc5596 --> The CEO stated that they aim to open 50 new branches by the end of the fiscal year.\n\ncac18be85b247954a86aa49c1cd9631f --> The CEO confirmed a target of reaching a 25% market share in the new region by the end of the year.", "citations": ["3b2b406377a0f47af5c876d2572026fd", "1f839792567db1cb9f769c5166622a26", "85baeefe256199a62691d8d08907bcd6", "d1cf42ead1255ce29885bce46bfc5596", "cac18be85b247954a86aa49c1cd9631f"]}, "['Q4', '2024']": {"answer": "49968f8e55870e0d3f81bb36fa953d43 --> Gold Loan will now be offered from 250 branches by the end of Financial Year '25, up from 60 currently operating branches.\n\n8918c58cf7dd17bf8ad48943a4d955c3 --> The management aims to add around 50 more branches during FY24-25.\n\nc7101910e85b1b13a93fa1a7d0cd2c0b --> The CEO announced an expansion plan to open 50 new branches by the end of the next calendar year.\n\n932f1c390b68f6092bea968a23e83654 --> The CEO mentioned plans to open 50 additional branches in FY 25.", "citations": ["49968f8e55870e0d3f81bb36fa953d43", "8918c58cf7dd17bf8ad48943a4d955c3", "c7101910e85b1b13a93fa1a7d0cd2c0b", "932f1c390b68f6092bea968a23e83654"]}, "['Q2', '2023']": {"answer": "dc377d7cff8b9ecf26e7103afd8b20c3 --> Ittira Davis mentioned plans for branch expansion and staffing growth.\n\n59d2e716fbf6992009da2ff4b4ee38a4 --> Ittira Davis stated that the company plans to add about 40 to 45 branches this financial year, and next year it could increase to 75 to 100 branches, contingent on the success of their digital strategy.", "citations": ["dc377d7cff8b9ecf26e7103afd8b20c3", "59d2e716fbf6992009da2ff4b4ee38a4"]}}}, {"topic": "Competitive positioning", "data": {"['Q1', '2025']": {"answer": "7f405ca1897ad089d088a147fcb622f4 --> The CEO mentioned that the company aims to increase its market share by 5% within the next 12 months.", "citations": ["7f405ca1897ad089d088a147fcb622f4"]}, "['Q1', '2023']": {"answer": "8f5b301c3bf1b65536ca3bdaec9ebd67 --> The CEO projected that the company will achieve a 20% increase in market share over the next two years.", "citations": ["8f5b301c3bf1b65536ca3bdaec9ebd67"]}, "['Q2', '2024']": {"answer": "6d3efd30aa6ef6998df318dad9d632d4 --> The CEO mentioned a target to increase market share by 5% by the end of the fiscal year.", "citations": ["6d3efd30aa6ef6998df318dad9d632d4"]}, "['Q4', '2023']": {"answer": "53fe109183b99348fcd84799cc702448 --> The CEO mentioned an increase in market share by 5% over the next two years.\n\na18e2991c93ab87d4f2f7194a9761706 --> The CEO stated that the company aims to increase its market share by 5% over the next two years.", "citations": ["53fe109183b99348fcd84799cc702448", "a18e2991c93ab87d4f2f7194a9761706"]}, "['Q3', '2024']": {"answer": "6231ea379b75f5163a24a02f26580715 --> The CFO stated that the company aims to increase its market share by 5% within the next 12 months.\n\nf8562a10df768d4f4310981ddca7190a --> The CEO stated that the company aims to increase its market share by 5% over the next year.\n\n87b864ee1d113fa86b229be4785d7ca1 --> The CEO announced an expected increase in market share by 2% within the next twelve months.", "citations": ["6231ea379b75f5163a24a02f26580715", "f8562a10df768d4f4310981ddca7190a", "87b864ee1d113fa86b229be4785d7ca1"]}, "['Q4', '2024']": {"answer": "6310896e8d4324b944fb5612e1a0f04a --> The company will continue to invest in targeted brand campaigns in financial year '25.", "citations": ["6310896e8d4324b944fb5612e1a0f04a"]}}}, {"topic": "Strategic partnerships", "data": {"['Q3', '2023']": {"answer": "4748c65044b2c3e8d207026fd05c7344 --> The MD noted a strategic adjustment in the MSE book and anticipated growth in that segment once changes and system upgrades are complete.", "citations": ["4748c65044b2c3e8d207026fd05c7344"]}, "['Q2', '2024']": {"answer": "9bde8b418fcaa1134918e496a260e2e6 --> The merger is expected to be completed during the fourth quarter of this financial year.", "citations": ["9bde8b418fcaa1134918e496a260e2e6"]}}}, {"topic": "Rural and urban penetration", "data": {"['Q4', '2024']": {"answer": "bc73deda49a3b05739102d7053869920 --> The CEO stated that the bank aims to increase its loan book by 20% by the end of the fiscal year.", "citations": ["bc73deda49a3b05739102d7053869920"]}, "['Q2', '2023']": {"answer": "e72addaa7686eb3456149fa0b2d80373 --> Carol Furtado stated that the branch growth plan includes focusing on semi-urban and Tier 2, Tier 3 cities, while ensuring 25% of branches are in unpacked rural areas as part of regulatory compliance.", "citations": ["e72addaa7686eb3456149fa0b2d80373"]}}}, {"topic": "New market entry plans", "data": {"['Q1', '2023']": {"answer": "2cbe9fa39d0680d5cd609b98f705c680 --> The company plans to enter the Telangana market this year as part of its branch expansion strategy.", "citations": ["2cbe9fa39d0680d5cd609b98f705c680"]}, "['Q3', '2023']": {"answer": "bdef75506f8a72ed0fa00894d7d1e64a --> The management intends to start operations in about 50 branches for the gold loan market next financial year.", "citations": ["bdef75506f8a72ed0fa00894d7d1e64a"]}, "['Q1', '2024']": {"answer": "910f04e5cf3e6749badd4e86de7e45f1 --> The management indicated that the full extent of their investment in the MSME vertical would be visible within the next two to three financial years.\n\n8ee07f812a5d5984424a82beafff39e3 --> The brand campaign went live on 24th of July, with expenses impacting both the first and second quarters.", "citations": ["910f04e5cf3e6749badd4e86de7e45f1", "8ee07f812a5d5984424a82beafff39e3"]}, "['Q2', '2024']": {"answer": "f9c61d80561bd800b3a1a18332e33fda --> The reverse merger is expected to be completed in the fourth quarter.", "citations": ["f9c61d80561bd800b3a1a18332e33fda"]}, "['Q3', '2024']": {"answer": "38b39ebe8a97ccf7c04354c3453c308d --> The bank expects the reverse merger to be completed by March 2024, by the end of this financial year.\n\n7d0b11be497cf81b44dddd99c619a7f8 --> Ashish Goel stated that the company will scale up gold loans and two-wheeler loans in the next financial year.", "citations": ["38b39ebe8a97ccf7c04354c3453c308d", "7d0b11be497cf81b44dddd99c619a7f8"]}, "['Q4', '2024']": {"answer": "c7c6f1f5e234a8082e196b53c2133df0 --> Financial Year '25 will witness a countrywide launch of fund-based and non-fund-based working capital offerings.\n\nb002b0c7c71ff8bead46868b2ad72a38 --> Sanjeev Barnwal stated that shares will be available for trading by Thursday or Friday.", "citations": ["c7c6f1f5e234a8082e196b53c2133df0", "b002b0c7c71ff8bead46868b2ad72a38"]}, "['Q2', '2023']": {"answer": "1d0f2870ec298629f1fe0c9e04d6b8f4 --> The CEO mentioned that the reverse merger is expected to be completed by September of next year.", "citations": ["1d0f2870ec298629f1fe0c9e04d6b8f4"]}}}]}, {"theme": "Customer Engagement and Experience", "topics": [{"topic": "Customer acquisition strategies", "data": {"['Q3', '2023']": {"answer": "10f845b18fa9eed078bae0755deba010 --> Ashish Goel mentioned that approximately 35% to 40% of disbursements in the MFI piece were to new customers, while between 65% to 70% were to existing Ujjivan customers.", "citations": ["10f845b18fa9eed078bae0755deba010"]}, "['Q2', '2023']": {"answer": "91f55397103d4c55e75f5a2bbad9ca8d --> Mr. Vibhas Chandra mentioned that customers are normally graduated to individual loans after two years, with an average of 24 EMIs.", "citations": ["91f55397103d4c55e75f5a2bbad9ca8d"]}}}, {"topic": "Retention and loyalty programs", "data": {}}, {"topic": "Feedback-driven service improvements", "data": {}}, {"topic": "Customer satisfaction metrics", "data": {}}, {"topic": "Digital engagement tools", "data": {}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New product launches", "data": {"['Q1', '2025']": {"answer": "741fe8e4fb172049e6fa47b7ef1338f9 --> The management aims to enhance their product offerings to cater to the mid-premium and Green Funding segment.\n\n414e49f3053783c8a0dda104e6658598 --> The CEO stated that the company plans to launch three new products by the end of the next fiscal year.\n\n7f405ca1897ad089d088a147fcb622f4 --> The COO highlighted plans to launch three new products by Q3 of next year.", "citations": ["741fe8e4fb172049e6fa47b7ef1338f9", "414e49f3053783c8a0dda104e6658598", "7f405ca1897ad089d088a147fcb622f4"]}, "['Q3', '2023']": {"answer": "92df2180946c27cac40454db24ab781e --> The new initiatives, including the addition of new products like 3 in 1 account, NPS, and mutual fund, will start materializing in the second half of '24.\n\n8b7ed044fbd89c0e832a2556c8edf8c5 --> The CEO announced a target to launch three new products by the third quarter of next year.", "citations": ["92df2180946c27cac40454db24ab781e", "8b7ed044fbd89c0e832a2556c8edf8c5"]}, "['Q1', '2024']": {"answer": "d44f677919aab403a780821c5cf859f6 --> The business for the semi-formal lap product should start to develop towards the end of this fiscal year.\n\n51d67ae5126b19d87d69458317102997 --> Carol Furtado stated that the semi-formal LAP product offers loans ranging from INR 15 lakhs to INR 1.5 crores with a tenure of up to 12 years, and it has been launched since May.\n\n51d67ae5126b19d87d69458317102997 --> Carol Furtado mentioned that the formal LAP product proposes a loan size of around INR 25 lakhs to INR 5 crores with a tenure of up to 15 years, to be set up in select locations.\n\n51d67ae5126b19d87d69458317102997 --> Carol Furtado detailed that the working capital facilities target formal, micro, small and medium enterprises, offering a variety of products with a ticket size of around INR 15 lakhs to INR 10 crores.", "citations": ["d44f677919aab403a780821c5cf859f6", "51d67ae5126b19d87d69458317102997"]}, "['Q3', '2024']": {"answer": "3b2b406377a0f47af5c876d2572026fd --> New products, gold loan and vehicle finance, are ready to scale up in the next fiscal year onwards.\n\n7d0b11be497cf81b44dddd99c619a7f8 --> Ashish Goel mentioned the launch of a working capital product for manufacturers and traders, expected at the beginning of the next financial year.\n\n87b864ee1d113fa86b229be4785d7ca1 --> The COO committed to launching three new products by the end of the fiscal year.", "citations": ["3b2b406377a0f47af5c876d2572026fd", "7d0b11be497cf81b44dddd99c619a7f8", "87b864ee1d113fa86b229be4785d7ca1"]}}}, {"topic": "R&D investment focus", "data": {}}, {"topic": "Service diversification", "data": {}}, {"topic": "Technological advancements", "data": {}}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Process automation initiatives", "data": {"['Q1', '2025']": {"answer": "5895d78bda911ca0030127cb1841a90b --> The Chief Operating Officer indicated a 15% increase in operational efficiency by the next quarter.\n\n5218cd25b431346332a13eefd180665a --> Ashish Goel stated that they expect to maintain efficiencies above 40% in collections for the 1 to 90 bucket in Q2 and maintain the same rate of slippages between 0.6% to 0.7%.", "citations": ["5895d78bda911ca0030127cb1841a90b", "5218cd25b431346332a13eefd180665a"]}, "['Q1', '2024']": {"answer": "d44f677919aab403a780821c5cf859f6 --> More hubs will be commissioned over the next few quarters to improve operating efficiency.", "citations": ["d44f677919aab403a780821c5cf859f6"]}, "['Q4', '2024']": {"answer": "297070095795abbb2f01d003be72be7e --> The CEO confirmed a 10% increase in production capacity by the end of the fiscal year.", "citations": ["297070095795abbb2f01d003be72be7e"]}}}, {"topic": "Cost management strategies", "data": {"['Q1', '2023']": {"answer": "3fdea2fb11142c6a655ff3201c170363 --> The Chief Financial Officer mentioned that they plan to reduce the cost-to-income ratio to below 60% within the next two quarters.\n\n74853d187b545da1c870ebfb9a06272c --> The management aims to achieve a 50% cost to income ratio as a first milestone within the short term.", "citations": ["3fdea2fb11142c6a655ff3201c170363", "74853d187b545da1c870ebfb9a06272c"]}, "['Q3', '2023']": {"answer": "7d947a5d8516499c85581e397f394229 --> Deepak Khetan indicated that the cost-to-income ratio is expected to remain around 55% by the end of the fiscal year.", "citations": ["7d947a5d8516499c85581e397f394229"]}, "['Q1', '2024']": {"answer": "42d31cd14c2f135a4898cb3505011952 --> Over the next three years, the cost to income ratio is expected to decrease by 300 to 350 basis points each year.\n\n5776bb6965a7a5eeb97bdf6786a9bb2e --> The CFO stated that capital expenditures are expected to be reduced by 20% in the upcoming fiscal year.", "citations": ["42d31cd14c2f135a4898cb3505011952", "5776bb6965a7a5eeb97bdf6786a9bb2e"]}, "['Q2', '2024']": {"answer": "8d1add3502ed26d0b41a69e8b3c2f98f --> The company plans to introduce a repeat loan facility on the Hello Ujjivan app to achieve significant cost savings.\n\naedeb1f5b33e0cd23f49f91eb39bec3d --> The CFO confirmed a target for reducing the cost-to-income ratio to below 50% by the end of the current fiscal year.", "citations": ["8d1add3502ed26d0b41a69e8b3c2f98f", "aedeb1f5b33e0cd23f49f91eb39bec3d"]}, "['Q4', '2023']": {"answer": "5f1d2d6c9cc050628a4c252c5ee047b2 --> The COO confirmed a reduction in the cost-to-income ratio to below 60% by the end of the next fiscal year.\n\n4782e8e484a76cae17ba414ee43fa11e --> The CEO mentioned plans to reduce the cost-to-income ratio to below 60% by the end of the next fiscal year.", "citations": ["5f1d2d6c9cc050628a4c252c5ee047b2", "4782e8e484a76cae17ba414ee43fa11e"]}, "['Q3', '2024']": {"answer": "41c4d6bd10b00db6f7c71e70b210aab6 --> The CFO stated that they expect the cost-to-income ratio to improve to below 60% by the end of FY '24.\n\n1f839792567db1cb9f769c5166622a26 --> The CFO stated that the bank aims to improve its cost-to-income ratio by 5% over the next two fiscal quarters.\n\n1dfee8f55d5af8d45e47657b0c396d28 --> The CFO mentioned plans to reduce the cost-to-income ratio to below 50% within two years.\n\n6225406cd60e8d0806ea4fea8e1d60c6 --> The CEO confirmed a 10% reduction in operating costs by Q2 next year.\n\n87b864ee1d113fa86b229be4785d7ca1 --> The CFO stated that capital expenditures will be reduced by 5% for the upcoming fiscal year.", "citations": ["41c4d6bd10b00db6f7c71e70b210aab6", "1f839792567db1cb9f769c5166622a26", "1dfee8f55d5af8d45e47657b0c396d28", "6225406cd60e8d0806ea4fea8e1d60c6", "87b864ee1d113fa86b229be4785d7ca1"]}, "['Q2', '2023']": {"answer": "4bc3b1e3c3d84917314022ee18672b54 --> Ujjivan Financial Services Limited aims to maintain a cost-to-income ratio comfortably below 60% for the financial year '23.", "citations": ["4bc3b1e3c3d84917314022ee18672b54"]}}}, {"topic": "Branch network optimization", "data": {"['Q1', '2024']": {"answer": "645ab1e2cb2d3f7ed3a17578c0566359 --> The business is moving to a hub and spoke model to improve operating efficiency, with more hubs to be commissioned over the next few quarters.", "citations": ["645ab1e2cb2d3f7ed3a17578c0566359"]}}}, {"topic": "Staff productivity enhancement", "data": {}}]}, {"theme": "Regulatory Compliance and Governance", "topics": [{"topic": "Adherence to banking regulations", "data": {"['Q1', '2023']": {"answer": "0d4fa61df37409a2ebafdfbde033353b --> Implementation of the new MFI regulation is expected to be completed by 1st of October.\n\ncae3a3f9d39a37bdbc6396dad1a01093 --> The company plans to meet the SEBI requirement of minimum public shareholding by December.\n\ne3ac28c8b4745965894497af4649ed56 --> Deepak Khetan mentioned the requirement to finish the equity raise by the regulatory deadline of December 11, 2022.\n\n8d81616c91a0ffe308c434ccf638c9c2 --> Deepak Khetan stated that the company would be meeting the SEBI requirement by December as part of the merger process.\n\n9b4dc950975d45f09c68032c3943fa30 --> The requirement changes by the RBI will be met by 1st of October.", "citations": ["0d4fa61df37409a2ebafdfbde033353b", "cae3a3f9d39a37bdbc6396dad1a01093", "e3ac28c8b4745965894497af4649ed56", "8d81616c91a0ffe308c434ccf638c9c2", "9b4dc950975d45f09c68032c3943fa30"]}, "['Q3', '2023']": {"answer": "b2597b61c12c44f3432507ebd9255cb8 --> The proposed merger is expected to be completed by September this year, pending regulatory and shareholder approval.\n\nd7e5e879062515e0550af77de5c8e35c --> The process of reverse merger is expected to close by September '23, pending regulatory approvals.", "citations": ["b2597b61c12c44f3432507ebd9255cb8", "d7e5e879062515e0550af77de5c8e35c"]}, "['Q3', '2024']": {"answer": "39fa70bd09101dc2a2b5916d6ad729dd --> The management team indicated that the process following the NCLT verdict is expected to be completed by March of this year.", "citations": ["39fa70bd09101dc2a2b5916d6ad729dd"]}, "['Q2', '2023']": {"answer": "0e5df3cd2c0787e2667b011ff223cf42 --> The process of amalgamation with the promoter Ujjivan Financial Services is expected to take around 12 months, pending regulatory approvals.", "citations": ["0e5df3cd2c0787e2667b011ff223cf42"]}}}, {"topic": "Risk management frameworks", "data": {}}, {"topic": "Internal audit improvements", "data": {}}, {"topic": "Corporate governance practices", "data": {}}]}, {"theme": "Strategic Initiatives and Partnerships", "topics": [{"topic": "Digital banking expansion", "data": {"['Q1', '2024']": {"answer": "ff2fb911d118166302f58bd273488fbd --> Deepak Khetan mentioned that the reverse merger matter is expected to be wrapped up within this calendar year.", "citations": ["ff2fb911d118166302f58bd273488fbd"]}, "['Q4', '2023']": {"answer": "43aed8ad003d14965340c14bc7076386 --> The CEO mentioned that the company is aiming for the conclusion of the reverse merger by September, although it might extend further depending on the workload of the NCLT.", "citations": ["43aed8ad003d14965340c14bc7076386"]}}}, {"topic": "SME lending focus", "data": {}}, {"topic": "Fintech collaborations", "data": {"['Q2', '2024']": {"answer": "32092a8bf66b898cbae940bfc79f19ac --> The company expects significant contribution from fintech partnerships towards the second half of the year.", "citations": ["32092a8bf66b898cbae940bfc79f19ac"]}, "['Q4', '2024']": {"answer": "40f4959903195782f05dfc5d767776fc --> Carol Furtado stated that the MSME segment is expected to see good growth in this financial year through fintech and revised strategy.", "citations": ["40f4959903195782f05dfc5d767776fc"]}}}, {"topic": "Sustainability efforts", "data": {}}]}, {"theme": "Leadership and Corporate Strategy", "topics": [{"topic": "Executive leadership changes", "data": {"['Q3', '2023']": {"answer": "4748c65044b2c3e8d207026fd05c7344 --> The MD mentioned that the Board would identify potential candidates to work with him for a smooth transition during his extended tenure.", "citations": ["4748c65044b2c3e8d207026fd05c7344"]}, "['Q4', '2023']": {"answer": "5b8200244c8412bee3217c41c5db063b --> The CEO mentioned that a successor will be in place well before January 2025.", "citations": ["5b8200244c8412bee3217c41c5db063b"]}, "['Q4', '2024']": {"answer": "e8112ee5242e263cbb144abedb0ea47f --> Ittira Davis announced the appointment of Mr. Sanjeev Nautiyal as the Managing Director and CEO of the bank, effective from July 1, 2024.", "citations": ["e8112ee5242e263cbb144abedb0ea47f"]}}}, {"topic": "Strategic leadership initiatives", "data": {}}, {"topic": "Stakeholder communication", "data": {}}, {"topic": "Governance and oversight practices", "data": {}}]}]