[{"theme": "Financial Performance", "topics": [{"topic": "Revenue Growth and Trends", "['Q1', '2024']": {"answer": "304066704e99715f008a2ddc943fb50b --> Mr. Kapoor: We are targeting a 15% increase in revenue for the next fiscal year.\n\nf056c59775775944854f4995f49abf01 --> Board Member: We are, though we are sharing with you that there will be pressures coming in on the subscription side, still holding on to our guidance that overall music licensing revenue should be growing at the rate of anything around 22% - 23% this year. We don't see that changing.\n\n0822fad7d7c09e7c01bc01e1958deaa5 --> [Speaker not specified]: \"If I look at a quarter-on-quarter basis, it's been a crazy growth that we have seen. It's a 50% growth. We have touched close to 1.49 lakh units being sold. This compared to around 90,000 that we sold in the Q1 last year.\"\n\n55e6f22f2a8ff25ea9404b2770df0a58 --> Board Member: I want to reiterate that we are holding our guidance on the films and movie side of a 25% growth in revenue and a 15% margin.\nLooking at the Q1 numbers, some of you may have doubts, how you're going to go and achieve it.\nWe are very confident with the lineup, which is sitting in Q3 and Q4 that on an annual basis, we will achieve the 25% revenue growth number with the 15% margin.\n\n8c30e276f0aa494b5f0dbd1ec6957824 --> Board Member: We are holding on to our projection of 23% growth overall on the music licensing side.\n\nf0651515f3356058820199fb8c5a1710 --> Mr. Vikram Mehra: \"We are confident that our revenue will see a growth of 25% in the next fiscal year due to our strategic initiatives.\"\n\n88b193c6b8b505fac5858b93192ca136 --> Vikram Mehra: This year, we are seeing right now, we should be growing at around 25% in that segment.\nAnd in fact, I'm holding on to that guidance on a short- to medium-term basis.\nEvery year, we see our films and TV business growing at 25%, while the total capital allocation will always be maintained within the upper limit of 18%.\n\n3565ad5f27ec66f22139704dffbef317 --> Vikram Mehra: All my growth projections, 23% on the music growth with the 32% to 33% adjusted EBITDA at the company level, all of them are shared with you without considering the upside that will come from paid subscription.", "citations": ["304066704e99715f008a2ddc943fb50b", "f056c59775775944854f4995f49abf01", "0822fad7d7c09e7c01bc01e1958deaa5", "55e6f22f2a8ff25ea9404b2770df0a58", "8c30e276f0aa494b5f0dbd1ec6957824", "f0651515f3356058820199fb8c5a1710", "88b193c6b8b505fac5858b93192ca136", "3565ad5f27ec66f22139704dffbef317"]}, "['Q2', '2022']": {"answer": "fe0c9d5fb1425e25ea8af6fcf8ae1cf2 --> Mr. Kumar: We are aiming to increase our digital business contribution to 50% by the next fiscal year.\n\n40623ad3307a8afe0ff9259cbf59a0d0 --> Board Member: I have always been giving projections of over 20% growth in music licensing year-after-year and this quarter lived up to that number.\n\n7491fbb081da1156b9299c252fed3267 --> Vikram Mehra: The way we are looking at our own revenues, we are growing our overall music licensing business at over 20%. We expect growth to be in the range of 22% - 25% on a short- to medium-term basis.\n\n33c7b77365116076af896a903291d36f --> Mr. Vikram Mehra: We are targeting a 25% year-on-year increase in our Carvaan sales.\n\nd295ca0b9ecad9026a877a1e11ba8548 --> Vikram Mehra: We are growing our music business right now by over 20% and majority of our music business deals are the minimum guarantee deals or fixed fee deals that gives you an idea.\n\ncd1457df641ede25f2ee7466b2036260 --> Kashyap Javeri: Sir, my question is on Yoodlee. The first question is that, we were expecting to reach three-digit revenues in three years.\n\n2453f79d86cfb8311fb074a6f0fcb18a --> Board Member: So overall, we expect this year to be pretty decent, both from the top line and the bottom line perspective.\n\n69608ca453ec291d6d8c8a792bf73113 --> Vikram Mehra: We maintain a bullish stand on music licensing, we should be growing in the range of 22% to 25% over the next three-to-five years.\n\n94ac5c30306dcdf73fe3c0342441247a --> Vikram Mehra: We will declare that at the end of the financial year. I am giving the comfort is that it is growing at a rate of 20% plus.", "citations": ["fe0c9d5fb1425e25ea8af6fcf8ae1cf2", "40623ad3307a8afe0ff9259cbf59a0d0", "7491fbb081da1156b9299c252fed3267", "33c7b77365116076af896a903291d36f", "d295ca0b9ecad9026a877a1e11ba8548", "cd1457df641ede25f2ee7466b2036260", "2453f79d86cfb8311fb074a6f0fcb18a", "69608ca453ec291d6d8c8a792bf73113", "94ac5c30306dcdf73fe3c0342441247a"]}, "['Q4', '2022']": {"answer": "5b74ef2f1207dfd68846e491911eae66 --> Ms. Johnson: \"We are targeting a 15% increase in revenue by the end of this fiscal year.\"\n\nf12cb34c54fea870985c9c554fd1ff66 --> Vikram Mehra: Yes, we are maintaining the 23%-25% guidance there and an operating income before content interest and depreciation number of 32% to 33%.\n\nb547debdf9b9cb177406598784f79899 --> Vikram Mehra: What I have been saying is that because of the investments we are making in newer content and inorganic purchases, the growth rate will move from 20% to 25%. This will in turn result into music licensing revenue growing between 23% and 25% and I am holding onto that number.\n\na5461d759f635c7b3ac92ddaf8fff2b5 --> Board Member: Hopefully Yoodlee on its own should be able to write 100 Crores of the topline in an year or two.\n\n16757e3697bac8bf6a7a5d761b4bf6f0 --> [Unnamed Speaker]: I will repeat something I have said in the last quarter. Our growth rate track record of over 20% is a combination of the industry growth of 11% to 12% and increase in our market share.\n\n89e11503f583766f6b267513a1dd4ce3 --> Vikram Mehra: The real growth in music streaming business is going to come from subscription and not advertising. The day subscription takes off in India. you will see both the industry in general and Saregama in particular growing at a rate far higher than the rate that we are projecting today. I am personally very bullish on subscription taking off in next 18 months to 24 months. But the 23-25% growth projection we are making for our licensing business is without considering any potential upside coming from subscription.\n\n7c94705baa9c668357c37a9af4ed0f7a --> Vikram Mehra: Yes, so remember a large share of music licensing revenue comes out of OTT streaming. If we are showing 26% growth this year on music licensing business, then obviously music streaming has also grown pretty significantly.\n\nd2228804806a2ce2fee17d0e3dd4553c --> Akshay Jogani: When you see over a longer run the industry is doing at 11%, 12% and you want to grow at 20%, 25% what we see is digital advertising itself is growing at 20%, 25% given the large\n\nb94105a2ab79f8ea48d21bb0a7f9ce48 --> Vikram Mehra: We maintain our bullish stand on music licensing; we are looking at 23% to 25% revenue growth in this business over the next three to five years.\n\nb94105a2ab79f8ea48d21bb0a7f9ce48 --> Vikram Mehra: The films and TV series vertical is expected to grow around 20% to 22% as we people go forward, and we are looking at a 15% margin in that vertical.\n\nb94105a2ab79f8ea48d21bb0a7f9ce48 --> Vikram Mehra: Overall we are looking at a 22% to 25% revenue growth for the company with an operating income before content interest and depreciation levels of 32% to 33% as we move into FY2023.", "citations": ["5b74ef2f1207dfd68846e491911eae66", "f12cb34c54fea870985c9c554fd1ff66", "b547debdf9b9cb177406598784f79899", "a5461d759f635c7b3ac92ddaf8fff2b5", "16757e3697bac8bf6a7a5d761b4bf6f0", "89e11503f583766f6b267513a1dd4ce3", "7c94705baa9c668357c37a9af4ed0f7a", "d2228804806a2ce2fee17d0e3dd4553c", "b94105a2ab79f8ea48d21bb0a7f9ce48"]}, "['Q1', '2021']": {"answer": "6d75d57d8822f5085fd2cb27672f397e --> Vikram Mehra: I cannot get into specifics of every deal. The music licensing business in the past has grown up to 25% year-on-year, this year it will be anything between 15% to 20%, Q1 has been exceptional but I will continue with the guidance of 15% to 20% increase in licensing business on a medium to long-term basis.\n\n5d0d3f259c92ee2d5aa23db24ae1c12f --> Mr. Vikram Mehra: We are targeting a 15% revenue growth for the next fiscal year, driven by our new product launches and market expansion strategies.\n\nfd767cd387a395277319aec186334c7e --> Board Member: We believe Carvaan platform will be able to generate advertising revenue for us in a period of 18 to 24 months.\n\n03d9f5259680568a81e0920d7a7d4671 --> Vikram Mehra: I maintain my number right now that the licensing revenue should be growing this year between 15% to 20%.\n\nee4b68f5363d1e5cc998c680309e753b --> Vikram Mehra: So we believe at this juncture I am maintaining my stand that we should be able in a long run basis should be able to continue growing licensing at a 25% number we do not see any issue coming in there.", "citations": ["6d75d57d8822f5085fd2cb27672f397e", "5d0d3f259c92ee2d5aa23db24ae1c12f", "fd767cd387a395277319aec186334c7e", "03d9f5259680568a81e0920d7a7d4671", "ee4b68f5363d1e5cc998c680309e753b"]}, "['Q1', '2022']": {"answer": "874471e6629f53980469bf4b6ae5afac --> [Speaker not mentioned]: The 20% growth that we keep on talking about primarily comes out of the growth in the music industry, which is about 11% to 12% and increase in our market share.\n\nd4864f3e84d4506ec80a475b0bef8eed --> Vikram Mehra: Looking at the current signs in the economy and the entertainment industry, we are confident that Indian music industry will manage to grow at 11-12%, and Saregama’s music licensing revenue will grow at 20% this year.\n\n1030ed61573b9eb56c1bd6fd899ac491 --> Board member: But we are confident that on a full year basis, Yoodlee’s performance this year will be far better than last year’s breakeven. This year we should see growth both on revenue side and hopefully on the profitability too.\n\n1030ed61573b9eb56c1bd6fd899ac491 --> Board member: Our core business of music remains steady and grew at 20%. Carvaan in spite of the lockdowns was able to achieve some kind of a recovery in the later part of the quarter, when the retail networks opened up and we believe the future quarters are going to be better.\n\nb6e2445e5df6fe779e0033f30e17d934 --> Devanshu Sampat: \"Because of the lack of availability, if we are not able to buy or reach a 100 Crores sort of target, will we be able to manage the 20%, 25% envisaged growths this year.\"\n\nae060be84b4afa830a83b2098bdbf413 --> Vikram Mehra: When we people make our projection of a 20% increase in a music licensing revenue, we don’t factor in transition to a paid economy. If that happens the growth can be far higher.\n\n3a2536687be2894bc1b619c015710531 --> Vikram Mehra: Music licensing, our projections have been 20% to 25% growth on a short to medium term basis and we stick to those numbers, there is no change.\n\n87139486aee5a0319302a7d460b2c25c --> Vikram Mehra: ...but on a 2 year time frame revenues from new content should match or overtake the charge offs.\n\nfe1b7ab87e39242877a5c6e805e5f134 --> Vikram Mehra: I had said it in my last quarter call, I will maintain this that we see Yoodlee reaching a triple digit revenue number in the next two to three years.", "citations": ["874471e6629f53980469bf4b6ae5afac", "d4864f3e84d4506ec80a475b0bef8eed", "1030ed61573b9eb56c1bd6fd899ac491", "b6e2445e5df6fe779e0033f30e17d934", "ae060be84b4afa830a83b2098bdbf413", "3a2536687be2894bc1b619c015710531", "87139486aee5a0319302a7d460b2c25c", "fe1b7ab87e39242877a5c6e805e5f134"]}, "['Q1', '2023']": {"answer": "6578901572c6f6c492fe678f99cb473d --> Vikram Mehra: We have been growing at over 20% on an annual basis for over three years now.\n\n44d91a37b73a06466c21664088ceb11c --> Vikram Mehra: In terms of the size of the business we crossed Rs.100 Crores last year and we believe in couple of years we should be hitting the range of Rs.150 Crores to Rs.200 Crores.\n\n198edfa1875920cb5905f215e94d4468 --> Mr. Vikram Mehra: We are targeting a 15% increase in revenue in the next financial year through strategic partnerships and product diversification.\n\n94709b3647cd3808c6ffde712cf8d134 --> Vikram Mehra: \"We are projecting a 22% to 23% growth year-on-year for the next three to five years.\"\n\n94709b3647cd3808c6ffde712cf8d134 --> Vikram Mehra: \"The film series and TV business should keep on growing at a 25% growth rate year-on-year with a margin which is around 15%.\"", "citations": ["6578901572c6f6c492fe678f99cb473d", "44d91a37b73a06466c21664088ceb11c", "198edfa1875920cb5905f215e94d4468", "94709b3647cd3808c6ffde712cf8d134"]}, "['Q1', '2025']": {"answer": "05691ce5e73ec86d37a02bc6474b0a0c --> Mr. Smith: We are targeting a 15% increase in our sales revenue by the end of this fiscal year.\n\n97ef122560f4b8d7792b1089dc0005d7 --> Board member: \"At the consolidated company level, we expect revenue, excluding Carvaan, to grow ata CAGR of 30% over the next 3 years and PBT to double over the next 3 to 4 years.\"\n\n784b1a77e68a6f05a5065425876e2c96 --> Vikram Mehra: But I'm continuing with my guidance of a 26% growth during the year.\n\n2ca28f600550be5e27f62a36ddad40dd --> Mr. Vikram Mehra: We are planning to increase our revenue by 15% by the end of the fiscal year.\n\n45e5390ca0a3699196f4e006db66ff01 --> Overall, we aim for the music vertical - which includes licensing as well as artist management - to grow its revenue by a minimum 25% - 26% during the year.\n\nd4e95b1e2487a54dbda43b6df503bdb4 --> On a combined basis we have been growing at over 23% year-on-year.\nIn fact, this year, our guidance is that we will grow at 26%.\n\ndfbcc1109de5e18780b216e0866bbb07 --> Moderator: We believe, over the next 5 years, we should be able to grow this business at 25% CAGR.\n\n5dc39bc91af52b6b2f466e3c17a11c75 --> Mr. Vikram Mehra: Our revenue increased by 26% over the last year and is in sync with a guidance of 30% revenue increase in FY'25.\n\nb9fb6466f40880a2f2bbdaecd4d50761 --> Board Member: Overall, with a stated goal of acquiring 25% to 30% of all new music releases in India, the licensing vertical should double its revenue in 3 – 3.5 years, which is 25% to 26% growth year-on-year.\n\n70e36e371480c003cd7821a38aa73224 --> Board Member: I can give you the comfort that the music revenue - which is a combination of music and artist management - is on track to achieve our guidance of 25% - 26% growth in the FY'25.\n\n75b17cfb8b890731ff0625c73157018a --> Vikram Mehra: I'm holding my commitment that we are on track for a 26% year-on-year increase on the music business, which is a combination of music licensing and artist management.\n\n28d42909c555fd2e1f0a75b121b15ed0 --> Vikram Mebhra: The financial discipline is that 70% of the cost of production should get recovered before the release of the film by licensing the TV and the digital rights of the film.\n\nf8447823058d56a3d1429901a12dedba --> Govindarajan C: ...how much of the growth from music, you've guided 25% growth.\n\nc544e0e1e0d0c77d9ed003b8de5ee5db --> Vikram Mehra: You are looking at between licensing and artist management, the combined number growing at 26% year-on-year.\n\n1765149203a4b65c343a7ded312a72a4 --> Vikram Mehra: The content charge will be pretty high in FY '25 because the total amount of content investment we are doing in FY '25 is going to be 50% higher than what we did in FY '24.\n\nd48bfabd1f69e842542de662ff14c5a3 --> Prateek Bhandari: Okay. And you also mentioned that for Pocket Aces, you have an intent to grow with a CAGR of 25%, and by this year-end, we shall be at a breakeven.\n\n03e8f6a17c9b50abf4dd83ae54750c85 --> Akhil Gulecha: So, you think for the next quarter, that should go away. Music licensing by itself should be on track for 25%, 30% growth.\n\n322ab802fd65ecc6fa8051317d005e15 --> Vikram Mebhra: We will grow music and licensing business of ours, which is music plus artist management minus Carvaan, at @ minimum 26%. We're confident we will end up achieving those numbers before the year ends.\n\n87d3f93eaec89918c62cc180dd010a1c --> Vikram Mehra: Ma'am -- we have never grown our top line by 30% year-on-year. This year, we have already projected a 30% growth year-on-year.", "citations": ["05691ce5e73ec86d37a02bc6474b0a0c", "97ef122560f4b8d7792b1089dc0005d7", "784b1a77e68a6f05a5065425876e2c96", "2ca28f600550be5e27f62a36ddad40dd", "45e5390ca0a3699196f4e006db66ff01", "d4e95b1e2487a54dbda43b6df503bdb4", "dfbcc1109de5e18780b216e0866bbb07", "5dc39bc91af52b6b2f466e3c17a11c75", "b9fb6466f40880a2f2bbdaecd4d50761", "70e36e371480c003cd7821a38aa73224", "75b17cfb8b890731ff0625c73157018a", "28d42909c555fd2e1f0a75b121b15ed0", "f8447823058d56a3d1429901a12dedba", "c544e0e1e0d0c77d9ed003b8de5ee5db", "1765149203a4b65c343a7ded312a72a4", "d48bfabd1f69e842542de662ff14c5a3", "03e8f6a17c9b50abf4dd83ae54750c85", "322ab802fd65ecc6fa8051317d005e15", "87d3f93eaec89918c62cc180dd010a1c"]}, "['Q2', '2021']": {"answer": "b2f1fc564e6ede6901d242e8414a8692 --> Board Member: We believe in the next 18 to 24 months there will be a large number of Carvaans in the market that will be supporting the Platform functionality and once that happens we will be able to generate enough advertising and subscription revenue through these units.\n\ndb4d55a4a0e4aa8259158ef5922e50fb --> Board Member: So as we go ahead for the remainder of the year I maintain that music licensing business will keep on hovering between 18% to 20% growth this financial year while Carvaan will show a breakeven.\n\nb51a1f047f17e5c7f63d5eda43073864 --> Vikram Mehra: All I will be able to go back and say is that you will see a low double-digit growth coming in the Yoodlee business year-on-year.\n\n417e1214b4b783e1ac7ea3c7ad5d8236 --> Vikram Mehra: I think Rahul was asking a similar question. The only guidance I can give you is double digit growth going year-on-year as far as Yoodlee is concerned.\n\nc8ffa3bb5b2ea4059bfd95f186e3ca1a --> Vikram Mehra: The other benchmark is that any album that we are releasing, 38% of the cost has to get recovered in the year 1 itself.\n\n40579a91adb2df2bbcbe9b752ec851de --> Board Member: We expect our licensing business this year to be growing at 18% to 20% this year and from next year onwards, once the COVID impact is completely off, go back to 22% to 25% growth year-on-year.\n\n40579a91adb2df2bbcbe9b752ec851de --> Board Member: We believe we will be able to grow the films business anything between 15% and 20% on year-on-year basis.", "citations": ["b2f1fc564e6ede6901d242e8414a8692", "db4d55a4a0e4aa8259158ef5922e50fb", "b51a1f047f17e5c7f63d5eda43073864", "417e1214b4b783e1ac7ea3c7ad5d8236", "c8ffa3bb5b2ea4059bfd95f186e3ca1a", "40579a91adb2df2bbcbe9b752ec851de"]}, "['Q2', '2023']": {"answer": "7b69317ddcaacff820688627990b7b83 --> Vikram Mehra: Again, I am telling that the music growth numbers are not slowing down. In fact, they are steady. That is why we are maintaining the projection of 22% to 25% growth on annual basis.\n\n58b0efa5b6a4fcc59955e7515e8c1904 --> Mr. Vikram Mehra: \"We are targeting a revenue growth of 15% in the next fiscal year through strategic expansions and new product launches.\"\n\n664a03f4237227b862eefa78df9bb1f4 --> Vikram Mehra: Yes Sir. We believe some businesses will continue growing now at a 25% year-on-year.\n\n17815e54a065a5d7338eef1e3c6a03e0 --> Board Member: We maintain, as we go forward, our bullish stance on music licensing 22% to 25% growth year-on-year on a short to medium term basis.\n\n17815e54a065a5d7338eef1e3c6a03e0 --> Board Member: Our films, series and television business are expected to grow at 20% to 25% on a year-on-year basis with a 15% margin.", "citations": ["7b69317ddcaacff820688627990b7b83", "58b0efa5b6a4fcc59955e7515e8c1904", "664a03f4237227b862eefa78df9bb1f4", "17815e54a065a5d7338eef1e3c6a03e0"]}, "['Q2', '2024']": {"answer": "011d372368d3447c2862ba2e54a77296 --> Board Member: I’ve been sharing this data multiple times, that the money that we make from streaming platforms should go up by anything between 150% to 300% as the market moves from a free model to a paid model.\n\nf2fc3392fb8520b474677542c127557e --> Board Member: We are fairly confident, that if I look at FY25 because we already six months into FY24 so we cannot make any projection for FY24. In FY25, you are looking at annual growth of minimum 23% and a breakeven at the PBT level happening at Pocket Aces by 25.\n\nf2fc3392fb8520b474677542c127557e --> Board Member: If we go on a medium-term basis we are fairly confident that we will be able to grow the combined revenues of the two companies at anything between 27% to 28% which is a big jump from 23% that we have been talking of Saregama in the past.\n\nc2c9c7546115952a8c024682074eca98 --> Board Member: Difficult to believe, but I’m still holding our guidance, that by the time we end the financial year, the Films and series vertical of ours will see a 25% growth this year. On a like-to-like basis, FY24 will grow by 25% over FY23.\n\nc0fd80403ce4ef50d860af5122945b2f --> Mr. Vikram Mehra: \"We are targeting a 15% increase in our revenue for the next fiscal year.\"\n\n53112930f9e323e35841944388047962 --> Vikram Mehra: The numbers will look different in Q4, when there will be large number of Films of ours getting released from the Yoodlee side. There will be corresponding marketing costs also coming in.\n\nc3ab228130538f43c8357dc2638653a3 --> Vikram Mehra: But what I can tell you is in the majority of the cases, in the earlier days when everybody was there on a free side, our MG numbers were typically anything between 90% to 120%. And these deals were renegotiated every year, to ensure that there is some amount of parity which is maintained.\n\n30a61c36305456d31bd937bef9eed950 --> [Speaker name not provided]: \"I will repeat we believe that when the transition is happening from a free economy to a paid economy we are looking at the kitty that we generate from streaming platforms to go up by anything between one and a half to three times in the short run.\"\n\nd2c87671acf537633ef29719c9f34a27 --> Vikram Mehra: Just a last one, so the growth rate that you have up to 27%, 28%. So, 27%, 28% would be from 2025 onwards just a clarification.\nVikram Mehra Yes.\n\nb30a1c6cb83bcb1ea481497072f05ee7 --> Swapnil Potdukhe: And when we are guiding for 27% to 28% consolidated growth, are we expecting the music licensing business to grow at a similar rate or basically how much of that will be coming from music license?\n\n2834f462abb4dff4ad14639e8528db34 --> At the end of the year, we always end up sharing the licensing revenue with you.\nBut licensing revenue is growing at 22-23% per year and it’s not flat in nature.\n\nfbaa183e2724021d7475b5858c84d483 --> Vikram Mehra: If we are striving for a 27% or a 28% growth three years from now onwards, I cannot achieve that growth unless music licensing also fires at the same pace.\n\nfbaa183e2724021d7475b5858c84d483 --> Vikram Mehra: We will hold on to our numbers of a 22- 23% growth, on the music licensing side.\n\n4a598f97f59164793aee0e3bb64c9274 --> Vikram Mehra: Anything around three years.\n\n12324280798cdfb8e15afc4651913f5b --> Vikram Mehra: \"So, again, it all depends on phasing... All that is a matter of 12 to 18 months, and the endeavor of our Company is that we counter or neutralize the impact of this to whatever extent possible by increasing our YouTube revenues and our...\"\n\n6cc6023b52ded8327b5e3699491f07c8 --> CA Garvit Goyal: Sir, you have earlier guided for 22% to 25% growth if we take the growth segments, then going by that we should have reached somewhere around 900 crore by FY24, but in H1 we did only 340 crore, so although we were supposed to be entirely organic growth, but even if I add Pocket Aces that will contribute in Q4, maybe around 30 crore.\n\n6cc6023b52ded8327b5e3699491f07c8 --> Vikram Mehra: 22% to 23% is the growth that we have been seeing for this financial year. You have to give me time till the 4th Quarter. We’re not changing our guidance for 22-23 as of now.\n\nc5c16405661f8c79fe1f430cf7d4bc94 --> Vikram Mehra: The total size of the industry this year of total content sold should be closer to 1000 crore.", "citations": ["011d372368d3447c2862ba2e54a77296", "f2fc3392fb8520b474677542c127557e", "c2c9c7546115952a8c024682074eca98", "c0fd80403ce4ef50d860af5122945b2f", "53112930f9e323e35841944388047962", "c3ab228130538f43c8357dc2638653a3", "30a61c36305456d31bd937bef9eed950", "d2c87671acf537633ef29719c9f34a27", "b30a1c6cb83bcb1ea481497072f05ee7", "2834f462abb4dff4ad14639e8528db34", "fbaa183e2724021d7475b5858c84d483", "4a598f97f59164793aee0e3bb64c9274", "12324280798cdfb8e15afc4651913f5b", "6cc6023b52ded8327b5e3699491f07c8", "c5c16405661f8c79fe1f430cf7d4bc94"]}, "['Q3', '2021']": {"answer": "f8312017f2afa02450af0164b8204a5c --> Mr. Vikram Mehra: We are projecting a 15% revenue growth in the forthcoming fiscal year with our new strategic initiatives.\n\n15d35839cf29de7a3f1040baa45cad20 --> Vikram Mehra: We people have been projecting this year will be 18%-20% though it looks like we may beat that, in general music licensing or licensing anything between 20%-25%.\n\nb574eea7d4d1a4942d6cc55df0b1ff2a --> We are maintaining our guidance on music licensing growing upwards of 20%.\n\nb574eea7d4d1a4942d6cc55df0b1ff2a --> The Films business will be growing at anything between 14% and 17% year-on-year.\n\n8dc7e23f2a0f98dceca0c0801ca9ec70 --> Vikram Mehra: We are projecting right now anything between 14% to 16% topline growth on Yoodlee part of the business year-on-year.", "citations": ["f8312017f2afa02450af0164b8204a5c", "15d35839cf29de7a3f1040baa45cad20", "b574eea7d4d1a4942d6cc55df0b1ff2a", "8dc7e23f2a0f98dceca0c0801ca9ec70"]}, "['Q3', '2022']": {"answer": "99126932e6a3dc0a47fc7142967b1bd8 --> Board Member: We are on a path of 20% growth year on year for over 12 quarters.\n\n8a519685aabc5716077365dace83f083 --> Vikram Mehra: \"Our projection of 25% to 30% revenue growth that we are giving is a combination of both organic new content purchase as well as some inorganic purchases.\"\n\n4a7c7120415262974ccf86afa379a84c --> Aman Vij: When we talk about 11% industry growth and we are targeting 25% to 30% overall revenue growth in music streaming.\n\nff650c516d3f353903b9e185340e6d6c --> Vikram Mehra: Now we are saying 25% to 30% instead is because earlier numbers were primarily projected on the fact that the industry was also growing and more people were coming in... This gives us the confidence that we will be able to grow the revenue at 25% to 30% while the industry is not going to change. The industry will remain at 11%.\n\n6f6a5e65ee4b1313ea71db6d56b21e85 --> Vikram Mehra: On music licensing and the films business we are looking at 25% to 30% growth in the next year.\n\nc9f2573361c3c2a4afb03a575d0d3456 --> Suhrid Deorah: When you are so confident about the growth being 20% and higher and you mentioned that the pricing you expect will remain at Rs.0.10 paise for the free stream months so the growth ultimately will only come from more streams per song going forward and that is what you are forecasting is going to reach 20%?\n\n9ebeedbee313c903c03fdf9de78109ba --> Vikram Mehra: The numbers that you are talking about right now is a number which is there in the close vicinity. It is not a bizarre number that you are throwing at me. A couple of years we should be able to go back and reach that number.\n\n2905559575426c59e2b47fc7f1bc0b27 --> Vikram Mehra: On a rolling 12-month basis right now we are committing to 25% to 30% growth.\n\nab1539877c34a2f06e21d804a672132e --> Vikram Mehra: We believe that the music business as we people go over the next three to five years should be growing between 25% to 30% y-o-y.\n\nab1539877c34a2f06e21d804a672132e --> Vikram Mehra: The films and series business, we believe that business should also start to grow between 20% to 25% y-o-y.", "citations": ["99126932e6a3dc0a47fc7142967b1bd8", "8a519685aabc5716077365dace83f083", "4a7c7120415262974ccf86afa379a84c", "ff650c516d3f353903b9e185340e6d6c", "6f6a5e65ee4b1313ea71db6d56b21e85", "c9f2573361c3c2a4afb03a575d0d3456", "9ebeedbee313c903c03fdf9de78109ba", "2905559575426c59e2b47fc7f1bc0b27", "ab1539877c34a2f06e21d804a672132e"]}, "['Q3', '2023']": {"answer": "e7710db9b6d4ff7c5ed9912c67992348 --> Vikram Mehra: But we are reasonably confident that the quality of our catalog and our new music acquisition will ensure that we will be writing this 22% to 25% growth even in the short run and in the medium to the long run.\n\ne7710db9b6d4ff7c5ed9912c67992348 --> Vikram Mehra: In 9 months, we have literally grown 100% there. So, I don't see too much of a trouble right now for that business also to grow at 25%.\n\ncc6a886a3b748c10021cf6945f8a86f8 --> Vikram Mehra: Yes, it's over 20%. We will be sharing the growth numbers, both on Music and Carvaan separately at the end of the financial year. Yes, I'm giving the comfort right now, it is upwards of 20%.\n\n2ad0f9465767db12cf5a37117538ec8a --> Board Member: Let me first start with licensing, which continues its growth number of over 20% year-on-year. This will be the fourth or the fifth year that we have been growing at this rate.\n\nceab43e38c560a05fa9bc863cb91b887 --> Vikram Mehra: I’m not running away from all the other commitments I've made to you as a management team member that we are holding ourselves to growth rates of between 22% to 25%, both on the music licensing, as well as films business.\n\nd8520b9f2f930a5a9b88b5f02cf427f5 --> Vikram Mehra: But on a long-term basis, I'm holding on to our guidance of music licensing growing between 22% to 25% and Films, Events and Series business on an annual basis, growing at 25%.\n\nd8520b9f2f930a5a9b88b5f02cf427f5 --> Vikram Mehra: But on a long-term basis, I'm holding on to our guidance of music licensing growing between 22% to 25% and Films, Events and Series business on an annual basis, growing at 25%.\n\ne21b8cd478fe5f7cb6a73fcb1652c707 --> Vikram Mehra: Overall between Films, Series and Live Events, we have done close to INR 100 crores in the first 9 months.\n\n8b6f95350627c8c96f2566b0418dff2b --> Vikram Mehra: I'll just repeat whatever I said earlier. We maintain our bullish stance on music licensing. We expect a 22% to 25% annual growth over the next 3 to 5 years.\n\n20ab185e4d7993d1198bc8bef05524d0 --> Mr. Speaker: The film, TV series, and the events vertical, I expect it to grow at 20%, 25% growth year-on-year, and we hope to make anything around 15% margin on this business.", "citations": ["e7710db9b6d4ff7c5ed9912c67992348", "cc6a886a3b748c10021cf6945f8a86f8", "2ad0f9465767db12cf5a37117538ec8a", "ceab43e38c560a05fa9bc863cb91b887", "d8520b9f2f930a5a9b88b5f02cf427f5", "e21b8cd478fe5f7cb6a73fcb1652c707", "8b6f95350627c8c96f2566b0418dff2b", "20ab185e4d7993d1198bc8bef05524d0"]}, "['Q3', '2024']": {"answer": "49f595ff89f9348e2afaf7790647a373 --> Vikram Mehra: The good news is that come quarter 4, the entire thing will be factored in. After that, we will be back on track to start achieving 25%, 26% revenue growth at the company level.\n\n85e0c8ff73d77ee291d656fc37bf8d5b --> Board Member: Once the OTT platforms start moving behind the paywall, I see catalogue easily managing 14% to 16% growth.\n\nb2c2e350d1081bdb7583deef2656b3c6 --> We are going to step up our investments in content not in an incremental fashion, but in a step jump fashion.\nThis means in the short run, the investments will go up very, very steeply, which will result into revenues, just about matching the content charge-offs that we are taking.\nGive it another 18 months or so, and you will start seeing that the incremental revenues we are getting from these investments will start far outweighing the charge-offs that we are taking corresponding to the newer content.\n\nc62f7e7dcd242913a4196ec262e943cd --> Speaker: All that we need to see now over the next 12 to 18 months is this base of users finally going behind a paywall and generating revenue for the platforms as well as labels.\n\n6c0a2591f9614ed88d3b22e6e8bd4102 --> Board Member: We believe over the next 5 years, we should be able to grow this vertical at a CAGR of 25%, And, in a stable state it should be able to give us a 15% margin.\n\na3b1b00344ad8b092030483acc6dbe08 --> [Speaker not provided] : If I look at the overall revenue for the company, excluding Carvaan, to continue growing at 25%, 26% CAGR over a 3–5-year period.\n\n5e006c9766cc354548443cda9ce08457 --> Vikram Mehra: So let me further clarify, when I'm saying 25%, 26% (excluding Carvaan), we are looking at 25% to 26% growth.\n\naf119f79f78aeb12e6ad3c218b9086d0 --> CA Garvit Goyal: Our top line guidance, sir? Like we were targeting a ballpark number of INR930 crores, INR940 crores for 2024.\n\n19712e24d61b2daa1ccd36d494eb7ffd --> Vikram Mehra: This is for the corporate level; we are giving a guidance of 25% to 26% CAGR over the next 3 to 5 years.\n\nbc15157683513dfa6f09a738e8519ad7 --> Vikram Mehra: The growth projection that we have been giving, is that we will be able to grow e company at, at 25- 26% (excluding Carvaan) and should be able to double our profits in the next 3 to 4 years.\n\n1094771d0ef652464664d8fbc377f36f --> Board Member: There's only one quarter left. After that, the entire impact of these 3 players is going to be wiped out. And we people start building -- once again, giving me the confidence that we should be able to grow the revenue of the company at a 25% to 26% CAGR over the next 3 to 5 years.\n\n24fba4327efe0d2d4d9b4f7ce964be33 --> Mr. Patel: We are targeting a 15% revenue growth in the next fiscal year by expanding our digital offerings and increasing market penetration.\n\n88c2bc010bf8a74a5c4dd66de66e7c91 --> Mr. Desai: Our goal is to achieve a 15% increase in revenue by the end of the fiscal year.\n\n9b90e3bf79681245398387c21d6a0a2e --> Vikram Mehra: And that's the reason I'm saying we are really growing at 25%, 26% on a sustained basis, that's where all these growth numbers are coming from.", "citations": ["49f595ff89f9348e2afaf7790647a373", "85e0c8ff73d77ee291d656fc37bf8d5b", "b2c2e350d1081bdb7583deef2656b3c6", "c62f7e7dcd242913a4196ec262e943cd", "6c0a2591f9614ed88d3b22e6e8bd4102", "a3b1b00344ad8b092030483acc6dbe08", "5e006c9766cc354548443cda9ce08457", "af119f79f78aeb12e6ad3c218b9086d0", "19712e24d61b2daa1ccd36d494eb7ffd", "bc15157683513dfa6f09a738e8519ad7", "1094771d0ef652464664d8fbc377f36f", "24fba4327efe0d2d4d9b4f7ce964be33", "88c2bc010bf8a74a5c4dd66de66e7c91", "9b90e3bf79681245398387c21d6a0a2e"]}, "['Q4', '2021']": {"answer": "99759b26ae3f1345912050e2811eb859 --> Vikram Mehra: Yes, we are maintaining the 23%- 25% guidance there and an operating income before content interest and depreciation number of 32% to 33%.\n\n1103803e43742a4693e20948066b8ffd --> I will repeat something I have said in the last quarter. Our growth rate track record of over 20% is a combination of the industry growth of 11% to 12% and increase in our market share.\n\ndca4fa0bbf82f6a8db359e3c50046ef8 --> Board Member: Hopefully Yoodlee on its own should be able to write 100 Crores of the topline in an year or two.\n\n116e015aef5a184fbacd932be0dfcaf5 --> Vikram Mehra: What I have been saying is that because of the investments we are making in newer content and inorganic purchases, the growth rate will move from 20% to 25%.\n\n116e015aef5a184fbacd932be0dfcaf5 --> Vikram Mehra: This will in turn result into music licensing revenue growing between 23% and 25% and I am holding onto that number.\n\n9c81cec46297b4482a9e22ee9768ea3e --> Vikram Mehra: \"If we are showing 26% growth this year on music licensing business, then obviously music streaming has also grown pretty significantly.\"\n\n5ff45cdd9efdee53b2532908c4c8d6b0 --> Vikram Mehra: But the 23-25% growth projection we are making for our licensing business is without considering any potential upside coming from subscription.\n\n28d5ff76f838350dfc5862c057b274eb --> Vikram Mehra: As shared in the presentation, the catalogue content is still showing above 30% growth year-on-year.\n\n18745167bb5faa319218a12ac9d8248b --> Vikram Mehra: We maintain our bullish stand on music licensing; we are looking at 23% to 25% revenue growth in this business over the next three to five years.\n\n18745167bb5faa319218a12ac9d8248b --> Vikram Mehra: The films and TV series vertical is expected to grow around 20% to 22% as we people go forward, and we are looking at a 15% margin in that vertical.\n\n18745167bb5faa319218a12ac9d8248b --> Vikram Mehra: Overall we are looking at a 22% to 25% revenue growth for the company with an operating income before content interest and depreciation levels of 32% to 33% as we move into FY2023.", "citations": ["99759b26ae3f1345912050e2811eb859", "1103803e43742a4693e20948066b8ffd", "dca4fa0bbf82f6a8db359e3c50046ef8", "116e015aef5a184fbacd932be0dfcaf5", "9c81cec46297b4482a9e22ee9768ea3e", "5ff45cdd9efdee53b2532908c4c8d6b0", "28d5ff76f838350dfc5862c057b274eb", "18745167bb5faa319218a12ac9d8248b"]}, "['Q4', '2023']": {"answer": "11dfff5a12a6b8db4baacb821b3a2a3c --> Bhupendra Tiwary: I believe it’s kind of prevail that we are looking at 20% to 25% growth in the licensing business going forward also.\n\n11dfff5a12a6b8db4baacb821b3a2a3c --> Vikram Mehra: So, we will hold on to this number of 22% to 25% only at this moment.\n\n4e1e589b7a31ea7f822f78d79edb5143 --> Mr. Vikram Mehra: \"We are expecting a 25% increase in our Carvaan sales in the upcoming fiscal year as we expand our distribution network and introduce new models.\"\n\nc7a3a208ad06e533e25cc2a77fd240c0 --> But at this juncture, we are very confident that we should be able to grow this business vertical at over 25% year-on-year and write- a profit.\n\nc273524e282e48fb5dce0c5fc505e8a8 --> The deal is that they will be paid 25% of all the public performance revenue that we create.\n\nc273524e282e48fb5dce0c5fc505e8a8 --> We are already seeing that the royalty hit that we will end up getting, because of this 25% of public performance revenue going to them, will be more than compensated by an increase in the public performance revenue.\n\n16c969879f902b7081423b3af0ab3759 --> Vikram Mehra: The only future numbers that we are giving here is music licensing revenue should grow anything between 22% to 25%, Films, Series, Events business will be growing around 25% during the year. Events business will remain under pressure, but the quantum is not going to be that big. Carvaan business will remain between a breakeven to a very small margin business. Our adjusted EBITDA for the company should be anything between 32% to 33%.", "citations": ["11dfff5a12a6b8db4baacb821b3a2a3c", "4e1e589b7a31ea7f822f78d79edb5143", "c7a3a208ad06e533e25cc2a77fd240c0", "c273524e282e48fb5dce0c5fc505e8a8", "16c969879f902b7081423b3af0ab3759"]}, "['Q4', '2024']": {"answer": "d61bb1d90038cecbeb3027ceb6165aa9 --> Vikram Mehra: And on a trailing month basis, we are giving the guidance that Saregama's consolidated revenue, excluding Carvaan is going to grow upwards of 30%.\n\n08bae46f90afc0628801307c61619764 --> Mr. Vikram Mehra: \"We are targeting a revenue growth of 15% in the next fiscal year.\"\n\n1815a6895c025cd73b88362368787a5d --> Board Member: \"So, from Q2 onwards, we will be back to the old growth rates that we saw in the audio OTT space a year ago.\"\n\n1815a6895c025cd73b88362368787a5d --> Board Member: \"But we have reasons to believe that starting June, the YouTube revenues are going to be on track and with GDP growth looking as positive as it is, YouTube will also maintain a growth trajectory for the entire year.\"\n\n937e12f617ede0f65e21d5b528d96a22 --> Lokesh Manik: Top line, they were growing any which way 20%, 25%?\n\nb97e1b0af33e59d3fef21e9dbe4e0347 --> Ankit Babel: \"First is, you guided for a 30% plus kind of a revenue growth, excluding Carvaan.\"\n\n6dfd202a5971fddccce208dac658d7ea --> Net-net, with our stated goal of acquiring 25% to 30% of all new music which is going to be released in India over the next few years, we are very confident that the music vertical( which is Licensing and Artist Management) should be able to double its revenue.\n\n51194a6b7e5d634c94b0762e46cf2c67 --> Board Member: Over the period of next 18 to 24 months, this will stabilize. After that, the content investment will go up only linearly, while the additional revenue that we have generated from the content we have procured over these last 36 months, will go up steeply. This means, the bottom line will grow much faster after another 18 to 24 months.\n\n51194a6b7e5d634c94b0762e46cf2c67 --> Board Member: Basis our track record of the last few years, we are confident that the catalogue part of our music will continue growing at a minimum of 12% per annum.\n\nddab33484c100af1f0c683930c3bf809 --> Board Member: This vertical is today close to INR540 crores. And we are confident it should cross INR1,000 crores in next 3, 3.5 years.\n\nddab33484c100af1f0c683930c3bf809 --> Board Member: As we go forward over the next four to five years, we are looking at this vertical to grow at a CAGR of 25%.\n\nc6b889fa437cce6593770b72a42927a7 --> Board Member: Overall, at the company level, we expect revenue, excluding Carvaan, to grow upwards of 30% in FY25.\n\nc6b889fa437cce6593770b72a42927a7 --> Board Member: Overall, at the consolidated company level, we expect revenue, excluding Carvaan, to grow at a CAGR of 25% to 26% and PBT to double over the next three to four years.\n\n5710a7d6fc017dfcbc3154ef8a5699fd --> Vikram Mehra: But immediate year, there is a 30% growth, excluding Carvaan.\n\na1c7fbafd12824194af3fea91db826fb --> Swechha Jain: Okay. Okay. So just a clarification. The growth guidance that you gave, a CAGR of 25% to 26% over three years, so what I understand, would that consider the paid economy, which we feel is going to really go up this way or that...\n\ncd9cb70e54ac1ba1bded1a6890a3bbcd --> Vikram Mehra: I'm saying subscription money that the platforms made in India. And they shared our percentage of that across with us. That number has grown by over 40% in FY '24 compared to '23, and it has now started touching double digits in crores.\n\nfb8cd1578fcb145f370b9fc0e58fb13a --> Vikram Mehra: I'll hold on to our 3-year guidance here that it's INR1,000 crores music content investment we people are doing. Our revenues at the consolidated level, all verticals combined, excluding Carvaan, we are looking at 25%, 26% growth rate as we go forward on a 3- to 5-year basis.\n\ne8867ac3667b8320f34079ef3d4c7cb4 --> Board Member: I hold my guidance that over the next 18 to 24 months, the subscription business is really going to take off, which is going to add to our overall profitability.\n\n5f906e9ad09dccae8505001672ddfd30 --> Vikram Mehra: We repeat our guidance that our FY '25 consolidated revenue excluding Carvaan should be growing upwards of 30%.\n\n5f906e9ad09dccae8505001672ddfd30 --> Vikram Mehra: On a three- to five-year horizon, we are looking at revenue, excluding Carvaan, growing at 25%, 26% odd, while our profitability to double in 3, 3.5 years.\n\n1d5a1eec9b41aa4f75195e69f18a76f1 --> Board Member: I've already told you that for Saregama, in FY 24, the money that we made from paid subscribers, non-YouTube paid subscribers, India operations grew by over 40%.", "citations": ["d61bb1d90038cecbeb3027ceb6165aa9", "08bae46f90afc0628801307c61619764", "1815a6895c025cd73b88362368787a5d", "937e12f617ede0f65e21d5b528d96a22", "b97e1b0af33e59d3fef21e9dbe4e0347", "6dfd202a5971fddccce208dac658d7ea", "51194a6b7e5d634c94b0762e46cf2c67", "ddab33484c100af1f0c683930c3bf809", "c6b889fa437cce6593770b72a42927a7", "5710a7d6fc017dfcbc3154ef8a5699fd", "a1c7fbafd12824194af3fea91db826fb", "cd9cb70e54ac1ba1bded1a6890a3bbcd", "fb8cd1578fcb145f370b9fc0e58fb13a", "e8867ac3667b8320f34079ef3d4c7cb4", "5f906e9ad09dccae8505001672ddfd30", "1d5a1eec9b41aa4f75195e69f18a76f1"]}}, {"topic": "Profitability and Margins", "['Q3', '2021']": {"answer": "9ff0ecfbf560412f3af78ee48b73f902 --> Mr. Amit: We are aiming to increase are profits by 20% next quarter.\n\nb574eea7d4d1a4942d6cc55df0b1ff2a --> Carvaan will remain at a breakeven number, if not positive, as we go forward.", "citations": ["9ff0ecfbf560412f3af78ee48b73f902", "b574eea7d4d1a4942d6cc55df0b1ff2a"]}, "['Q3', '2024']": {"answer": "2afc0ade88306299173c827d1af79f3e --> Board Member: The company has already undertaken cost rationalization measures to address the external advertising slowdown. We are confident that these efforts will yield positive results in the upcoming quarters.\n\nb2c2e350d1081bdb7583deef2656b3c6 --> The absolute numbers on profits are never going to dip.\nIn the short run, they will continue to go up, but they will go up far more steeply after another 18 months or so.\n\n767d2fd555c38a451f88c4e3d6580fa7 --> Board Member: The way our deal structuring is done, in terms of cash inflows and outflows, what I am happy to share with you is that a 15% margin will result into a 21% IRR on this business.\n\na3b1b00344ad8b092030483acc6dbe08 --> [Speaker not provided] : While we are investing heavy, we will hold on to our absolute profitability in the first 12 to 18 months. After 18 months, you will start seeing a steep increase in profitability. And from year 3 onwards, you are then looking at a step function jump and investment going away and a linear increase happening, the profitability should go up in a significant fashion.\n\na3b1b00344ad8b092030483acc6dbe08 --> [Speaker not provided] : And the overall profitability (PBT) of the company, to double in the next 3 to 4 years.\n\n1c48e353ee13694afe3746e4bd04ebfa --> Govindarajan: I'm just a little confused on the 1 statement that you made that you expect to hold on to profitability in the next 12 to 18 months.\n\nc6a90d7e91c114e7f5731498c9ad61db --> Vikram Mehra: But over a period of 3.5 years, you are talking of profitability also doubling as revenue also comes close to doubling.", "citations": ["2afc0ade88306299173c827d1af79f3e", "b2c2e350d1081bdb7583deef2656b3c6", "767d2fd555c38a451f88c4e3d6580fa7", "a3b1b00344ad8b092030483acc6dbe08", "1c48e353ee13694afe3746e4bd04ebfa", "c6a90d7e91c114e7f5731498c9ad61db"]}, "['Q4', '2022']": {"answer": "5b74ef2f1207dfd68846e491911eae66 --> Mr. Lee: \"Our objective is to cut operating costs by 10% over the next two quarters.\"\n\n13924e3f92b19557dd4f8d21207a58f9 --> Moderator: Our focus and our commitment again in the year is that we will not spend any major amounts of money on manpower or marketing till the time the market is not fully opened both on supply and demand side. And we will deliver at least a breakeven on the Carvaan front during this financial year.\n\n522948afc70b658fa81a2a3fd1746f74 --> Board Member: As we go forward, we continue maintaining OIBCID guidance in the range of 32% to 33%.\n\n1325d3b3414d02eb58c0eba570b6245c --> Vikram Mehra: Overall in the initial years, our projections for the live business is between 5% and 7% margin. It will take us some time to stabilize that and after that we can look at a 10% plus margin on the live event side.\n\n69e0fdc91b73f05eb2979e6ee3c9b10b --> Vikram Mehra: In light of the supply crunch on the chip side, we are gunning for a breakeven in the current financial year also.\n\nb94105a2ab79f8ea48d21bb0a7f9ce48 --> Vikram Mehra: We have already entered into live events this year. In the initial years we hope to deliver a margin of 5% to 7%. As we stabilize the vertical we may look at a double digit margin as we go forward.", "citations": ["5b74ef2f1207dfd68846e491911eae66", "13924e3f92b19557dd4f8d21207a58f9", "522948afc70b658fa81a2a3fd1746f74", "1325d3b3414d02eb58c0eba570b6245c", "69e0fdc91b73f05eb2979e6ee3c9b10b", "b94105a2ab79f8ea48d21bb0a7f9ce48"]}, "['Q1', '2021']": {"answer": "aa63095326fea949ff9ffc10b5e43672 --> Moderator: We are now standardizing that irrespective of how the content is bought, the marketing cost will continue to be charged right now in the year one itself while the remaining cost which is Rs. 80 will be charged up over a period of six years. 35% of that 80% right now get charged up in year one and remaining over five years so if I must say right now including the marketing cost if I am buying things for Rs. 100, Rs. 48 will get charged in year one and remaining gets charge off next five years.\n\n0b5226b871973c2f56041c88f619135e --> Vikram Mehra: Overall, the first year of the films business was the last year for us, last year was a profit, in-profit by profit and we see this trend continuing for us.", "citations": ["aa63095326fea949ff9ffc10b5e43672", "0b5226b871973c2f56041c88f619135e"]}, "['Q1', '2022']": {"answer": "b5aca3921d53427e595bec7bcb195c0c --> Last year was a breakeven for Carvaan business and in this year also it will atleast reach a breakeven.", "citations": ["b5aca3921d53427e595bec7bcb195c0c"]}, "['Q1', '2023']": {"answer": "5bce33c2483cfc9a21eecb91d3b47972 --> Vikram Mehra: I said in my last quarter call that it is an early stage. The first year is going to be more testing the waters, but in general events business is a 5% to 10% margin business for the next couple of years.\n\n44d91a37b73a06466c21664088ceb11c --> Vikram Mehra: I am saying year-on-year as we people go out for the next three to five years, the Film TV and web series business will be contributing 15% to 20% margin.\n\nbe4db0a9cf3e8bc99f110ad4ad5b56cd --> Vikram Mehra: This is a business right now which will generate 15% to 20% margin after writing off the entire cost of film or series in year one itself.\n\n94709b3647cd3808c6ffde712cf8d134 --> Vikram Mehra: \"Events verticals will slowly build up in terms of revenue, but in the initial years we expect it to contribute only 5% to 10% margin.\"", "citations": ["5bce33c2483cfc9a21eecb91d3b47972", "44d91a37b73a06466c21664088ceb11c", "be4db0a9cf3e8bc99f110ad4ad5b56cd", "94709b3647cd3808c6ffde712cf8d134"]}, "['Q1', '2024']": {"answer": "8c30e276f0aa494b5f0dbd1ec6957824 --> Vikram Mehra: The adjusted EBITDA margin at the company level is not going to be falling below 32% to 33% that we have always maintained.\n\naefe298fb7fd400f75a7dac01f7da575 --> Vikram Mehra: Second, we are looking at a 15% margin in this business minimum.\n\n3b18f8f1231e30642368c430a70c0fda --> Vikram Mehra: See, on the overall basis, we will never allow events to drag down our adjusted EBITDA below 30% to 33%.", "citations": ["8c30e276f0aa494b5f0dbd1ec6957824", "aefe298fb7fd400f75a7dac01f7da575", "3b18f8f1231e30642368c430a70c0fda"]}, "['Q1', '2025']": {"answer": "05691ce5e73ec86d37a02bc6474b0a0c --> Ms. Johnson: Our goal is to reduce our operational costs by 10% over the next six months.\n\n97ef122560f4b8d7792b1089dc0005d7 --> Board member: \"On the EBITDA side, we maintain our adjusted EBITDA guidance of 32% to 33% with the strength of -- the IP that we own, a long-term strategic thinking, adequacy of capital on our balance sheet and a fast-growing digital footprint.\"\n\n5dc39bc91af52b6b2f466e3c17a11c75 --> Mr. Vikram Mehra: Our EBITDA increased by 9% and is currently at 33% of the revenue which again is in sync with the guidance that we have been giving for our adjusted EBITDA.\n\ne7ac5294270cff81fcaab39e19ec3227 --> Vikram Mebhra: Within that, we hope that in the next 12 to 18 months, we will reach a situation whereby we should be able to generate 8% to 10% margins and a much higher IRR because most of the times when we are working in this space, that capital has actually come from somewhere else, and we don't end up putting all the capital as our own capital.\n\n0c178b4159d9b2de7027b1d2b2bd2923 --> Moderator: You will start seeing these numbers panning out. I'm also maintaining our guidance of adjusted EBITDA at 32% to 33%. I'm not changing that at all.\n\n63290d9e91bc3d7ae089fb5b46443e1c --> Vikram Mehra: We are confident that on a 3-3.5 year basis, we should be able to double the PBT that we wrote in FY '24.\n\n5e902eab598189946affd5c48dfd1e06 --> Ms. Rao: We are planning to reduce our operational costs by 10% in the next six months.\n\n7a32b953a451263943736e7a1313ca37 --> Moderator: There will be first 12 to 18 months, where profits may not grow at the pace at which top line is growing. But post that, profits will start growing at the same pace and eventually start exceeding the rate at which revenue is growing.", "citations": ["05691ce5e73ec86d37a02bc6474b0a0c", "97ef122560f4b8d7792b1089dc0005d7", "5dc39bc91af52b6b2f466e3c17a11c75", "e7ac5294270cff81fcaab39e19ec3227", "0c178b4159d9b2de7027b1d2b2bd2923", "63290d9e91bc3d7ae089fb5b46443e1c", "5e902eab598189946affd5c48dfd1e06", "7a32b953a451263943736e7a1313ca37"]}, "['Q2', '2021']": {"answer": "9ab58226eecc24eae3a2eeda06fb3009 --> Board Member: The aim is to be consistent in sales in these regions, so that by the end of the year, we can ensure that Carvaan is managing to break-even and I can happily say that we are on track to achieve that.\n\nf8bdcbf6171f50aa729f8ffafb240fad --> [Speaker Unknown] : You will see the clear direction going forward where we will return to our TV and films being profitable before the end of the year.\n\ndb4d55a4a0e4aa8259158ef5922e50fb --> Board Member: Films and television right now may be showing a loss but before the end of the year they will be able to recover the losses that we have incurred in the first two quarters.\n\n8bfcd1cd5a97d59c0c9c8955c11062e9 --> Vikram Mehra: Carvaan has to breakeven, if that the question you are asking me - yes, Carvaan was able to do a breakeven the first two financial years. Carvaan was not able to do a breakeven last year because of the fourth quarter, where numbers got wiped out. Q4 in normal cases would have ended up giving us 250000. We scored about 70000 number in that quarter.\n\n40579a91adb2df2bbcbe9b752ec851de --> Board Member: We will be managing our breakeven during the year on Carvaan.", "citations": ["9ab58226eecc24eae3a2eeda06fb3009", "f8bdcbf6171f50aa729f8ffafb240fad", "db4d55a4a0e4aa8259158ef5922e50fb", "8bfcd1cd5a97d59c0c9c8955c11062e9", "40579a91adb2df2bbcbe9b752ec851de"]}, "['Q2', '2022']": {"answer": "32b7bf2e6adff19d7ad74f15bb97eb1c --> Board Member: At the end of the year, I assure you guys, we will have at least a breakeven, if not a very marginal profit.\n\n84d476dc5481d205d99161e8fa8d6a7d --> Vikram Mehra: What I am assuring you is that, at the end of the year Carvaan will be in a breakeven situation.", "citations": ["32b7bf2e6adff19d7ad74f15bb97eb1c", "84d476dc5481d205d99161e8fa8d6a7d"]}, "['Q2', '2023']": {"answer": "4ff081d5a73e98e8be6180fcf3d87708 --> Vikram Mehra: I have stated in the past also that once the business gets stable it will be a 5% to 10% margin business.\n\n58b0efa5b6a4fcc59955e7515e8c1904 --> Mr. B L Chandak: \"Our focus will be on reducing operational costs by 10% over the next two quarters through automation and process optimizations.\"\n\n57107a0cdcd020ca0d027403bb38c7c3 --> Vikram Mehra: Sir right now I will still stick to 32% to 33% OIBCID margin number. I know the last two quarters we have done better than that but for this year I continue with that number. Let us have the chat at the end of Q4.", "citations": ["4ff081d5a73e98e8be6180fcf3d87708", "58b0efa5b6a4fcc59955e7515e8c1904", "57107a0cdcd020ca0d027403bb38c7c3"]}, "['Q2', '2024']": {"answer": "a333e84feaefd3b255910b0266725deb --> Board Member: We have taken it as a challenge upon us that we will stick to the adjusted EBITDA guidance of 32% to 33% that we have been making in the past for Saregama.\nThe combined numbers of Saregama and Pocket Aces should hold on to the same 32% to 33% adjusted EBITDA target.\n\n82f7c764b498e42fe5d5473fd284eeb4 --> Vikram Mehra: The comfort I can give you is, films and series business is going to be riding a 15% margin this year it’s not going to go below that.", "citations": ["a333e84feaefd3b255910b0266725deb", "82f7c764b498e42fe5d5473fd284eeb4"]}, "['Q3', '2022']": {"answer": "99126932e6a3dc0a47fc7142967b1bd8 --> Board Member: Our guidance to the market is that on an annual basis this number should be hovering in the range of 32% to 33%.\n\nfb8e4cee49943718fb7baffee74645fb --> We commit that like last year, we will be able to get at least a breakeven and possibly a very minor profit on Carvaan.\n\n6f6a5e65ee4b1313ea71db6d56b21e85 --> Vikram Mehra: As far as margins are concerned our guidance is that our operating income before content cost interest and depreciation that number should be hovering between 32% to 33%.\n\nab1539877c34a2f06e21d804a672132e --> Vikram Mehra: On the profitability, our guidance remains that operating income before content interest and depreciation should remain in the range of 32% to 33% of the revenue from operations as we go ahead.", "citations": ["99126932e6a3dc0a47fc7142967b1bd8", "fb8e4cee49943718fb7baffee74645fb", "6f6a5e65ee4b1313ea71db6d56b21e85", "ab1539877c34a2f06e21d804a672132e"]}, "['Q3', '2023']": {"answer": "6bd529300bcda29d0be80a329d098b4d --> Vikram Mehra: We have committed to a 15% to 20% margin. That's the only thing I've stated until now on the Films and Series business, and we are holding ourselves to that commitment.", "citations": ["6bd529300bcda29d0be80a329d098b4d"]}, "['Q4', '2021']": {"answer": "6fe0106c40d30cee86290adb786b8984 --> Board Member: And we will deliver at least a breakeven on the Carvaan front during this financial year.\n\ne49705a43d6b59fc552a65b44ba22d80 --> Vikram Mehra: Overall in the initial years, our projections for the live business is between 5% and 7% margin. It will take us some time to stabilize that and after that we can look at a 10% plus margin on the live event side.\n\nc9ab8ae83d58b01a4d07b04d638f6600 --> Vikram Mehra: So Carvaan is funding for itself right now. In light of the supply crunch on the chip side, we are gunning for a breakeven in the current financial year also.\n\n2772f10bbef1421e19c55a5867f44916 --> Board Member: \"But as we go forward we continue maintaining OIBCID guidance in the range of 32% to 33%.\"\n\n18745167bb5faa319218a12ac9d8248b --> Vikram Mehra: We have already entered into live events this year. In the initial years we hope to deliver a margin of 5% to 7%. As we stabilize the vertical we may look at a double digit margin as we go forward.", "citations": ["6fe0106c40d30cee86290adb786b8984", "e49705a43d6b59fc552a65b44ba22d80", "c9ab8ae83d58b01a4d07b04d638f6600", "2772f10bbef1421e19c55a5867f44916", "18745167bb5faa319218a12ac9d8248b"]}, "['Q4', '2023']": {"answer": "4e1e589b7a31ea7f822f78d79edb5143 --> Mr. Pankaj Chaturvedi: \"Our efforts in cost optimization and operational efficiency should lead to a 3% improvement in our operating margin in the next quarter.\"\n\n7684cdc9a6c0238ecd9002a71f7df208 --> Vikram Mehra: On to our adjusted EBITDA percentage of 32 to 33. Don’t look at this number on a quarterly basis. On an annual basis, adjusted EBITDA, we have been stating this is in the range of 32% to 33% and we stick to that.\n\nc7a3a208ad06e533e25cc2a77fd240c0 --> In the long run, as the reputation starts building up in series business too, we will very comfortably end up making a 15% margin.\n\nc7a3a208ad06e533e25cc2a77fd240c0 --> As we people go forward in the 12 to 18 months horizon, we will be able to start writing positive margins.\n\na9e78b652c89622579954542d8b07445 --> Bhupendra Tiwary: And in terms of margin when we say about will maintain the EBITDA before content charge of 32%.\n\n300e8621aa61c25c0fa961e3511e8131 --> Vikram Mehra: Our films business will remain a 15% to 20% margin business, but the good part is we are not allocating more than 18% of our total capital out there, at any particular time for the film business.", "citations": ["4e1e589b7a31ea7f822f78d79edb5143", "7684cdc9a6c0238ecd9002a71f7df208", "c7a3a208ad06e533e25cc2a77fd240c0", "a9e78b652c89622579954542d8b07445", "300e8621aa61c25c0fa961e3511e8131"]}, "['Q4', '2024']": {"answer": "76b3dfc9a6ccddb8ba876d14e84ef83c --> Vikram Mehra: The overall company, guidance, is 32% to 33% on an adjusted EBITDA basis.\nThe only thing which is left after adjusted EBITDA is the charge-off we are taking on new music.\nThere's nothing else left. Everything else is before that, that will give you an idea.\nSo, if I'm saying 30% growth on the overall basis, that doesn't mean we are reducing our guidance on adjusted EBITDA.\nWe can't afford to have a situation where an artist management vertical grows at a significant fashion but generates no margin for us because then I can't hold on to 32%, 33% adjusted EBITDA guidance.\n\n1815a6895c025cd73b88362368787a5d --> Board Member: \"As we get into FY '25, the revenues of Carvaan are going to see a decline, but we should be able to touch a single-digit mid-level profitability on Carvaan during the year.\"\n\n937e12f617ede0f65e21d5b528d96a22 --> Vikram Mehra: As we go forward, we have promised you that this year, FY '25, we will ensure that it turns breakeven or a very small profit at Pocket Aces level.\n\nc6b889fa437cce6593770b72a42927a7 --> Board Member: We maintain our annual adjusted EBITDA guidance of 32% to 33%.\n\nc4b82c48380813dd32539ba574800ae9 --> Aashish Upganlawar: Just a clarification, you said that EBITDA margins, you are comfortable, I mean, looking at maybe 31%, 32%.\n\nfb8cd1578fcb145f370b9fc0e58fb13a --> Vikram Mehra: Our guidance there is that our profitability at the PBT level is going to double in the next 3 to 3.5 years.\n\nfb8cd1578fcb145f370b9fc0e58fb13a --> Vikram Mehra: And our PBT is going to double over the next 3, 3.5 years and 32% to 33% adjusted EBITDA, that's my long-term guidance.\n\n5f906e9ad09dccae8505001672ddfd30 --> Vikram Mehra: Our adjusted EBITDA guidance remains at 32% to 33%.", "citations": ["76b3dfc9a6ccddb8ba876d14e84ef83c", "1815a6895c025cd73b88362368787a5d", "937e12f617ede0f65e21d5b528d96a22", "c6b889fa437cce6593770b72a42927a7", "c4b82c48380813dd32539ba574800ae9", "fb8cd1578fcb145f370b9fc0e58fb13a", "5f906e9ad09dccae8505001672ddfd30"]}}, {"topic": "Financial Health and Leverage", "['Q1', '2022']": {"answer": "b4776fd8f8d9e3a9acfcfae480b1463a --> Vikram Mehra: As we people will go forward two things that are clear- One that the entire investment in new content has to come out of the cash that will be generated by the music business. We have a very clear-cut commitment given to the board that we will not be raising debt to do content purchases.", "citations": ["b4776fd8f8d9e3a9acfcfae480b1463a"]}, "['Q1', '2023']": {"answer": "e9cb225281e456d15b11ca385c970c2e --> Vikram Mehra: See, 30% of 800 is 240 so it is that space right now. Now this is the first year for a company which has had a single-digit share of new content and it wants to move to a 30% to 35% share. In Bollywood movies the music of the film gets sold 12 to 18 months before the movie gets released. So, it will take us that much amount of lag right now to go back and build it up. But the space that I said would be in the range of 200 - 220.", "citations": ["e9cb225281e456d15b11ca385c970c2e"]}, "['Q1', '2024']": {"answer": "0b73b28cb1aea48051d68b5785556c31 --> Board Member: \"Overall, if I take both these segments together, films and series segment and the live event segment, as we have communicated to you, at any particular time the total capital that is deployed, in these 2 segments will never exceed 18% of total capital deployed.\"", "citations": ["0b73b28cb1aea48051d68b5785556c31"]}, "['Q1', '2025']": {"answer": "97ef122560f4b8d7792b1089dc0005d7 --> Vikram Mehra: \"End of the year, you will find Pocket Aces at a breakeven level. We are not there yet, but we will be there before the end of the year.\"", "citations": ["97ef122560f4b8d7792b1089dc0005d7"]}, "['Q2', '2021']": {"answer": "cc2595cc6e9030a6cd40ef9153491965 --> Jinesh Joshi: Secondly out of this Rs.200 Crores which we have envisaged to spend over the next three years is it possible to kind of share how much will it be for Bollywood and how much will it be for regional?", "citations": ["cc2595cc6e9030a6cd40ef9153491965"]}, "['Q4', '2021']": {"answer": "18745167bb5faa319218a12ac9d8248b --> Vikram Mehra: Again continuing our cautious approach on Carvaan side, the objective is to ensure that we control our costs and we will not be making any major investments here till the time the market is fully stabilized. We commit to at least a breakeven during the year.", "citations": ["18745167bb5faa319218a12ac9d8248b"]}, "['Q4', '2023']": {"answer": "c7a3a208ad06e533e25cc2a77fd240c0 --> Our internal policy is very clear on it that the total capital allocation, to Film, Series and Events business will never exceed 18% of the capital deployed at any particular time in the company.", "citations": ["c7a3a208ad06e533e25cc2a77fd240c0"]}, "['Q4', '2024']": {"answer": "f07db382f8fa1ec833a429a79e89088d --> Vikram Mehra: We need to look at a INR1,000 crores investment over the next three years. This includes some money that we will be paying to the film producer or the production budgets plus marketing money that will promote these songs.\n\n775fc0406bd3e3ef98a971aa7059a08f --> Vikram Mehra: This is a call that we people have taken in 2021, when we raised the QIP part as we people sit right now, I have mentioned this that the INR1,000 crores music investment that we will be making over the next three years will be funded completely through internal accruals and QIP money.", "citations": ["f07db382f8fa1ec833a429a79e89088d", "775fc0406bd3e3ef98a971aa7059a08f"]}}, {"topic": "Returns and Efficiency", "['Q1', '2022']": {"answer": "d328043e697dfa5abd7026e3fe6625c6 --> Vikram Mehra: The payback period target for all content investment during a financial year is five years.", "citations": ["d328043e697dfa5abd7026e3fe6625c6"]}, "['Q1', '2023']": {"answer": "449b24e8ff5a197d5d3cefebf24f20a5 --> The management team is now recommending that we should change the useful life of our music assets from 6 years to 10 years but unlike the global labels who follow a straight-line method, we are recommending a more conservative approach whereby there is a higher amortization happening in the first two years and then it goes on a straight-line method.", "citations": ["449b24e8ff5a197d5d3cefebf24f20a5"]}, "['Q1', '2024']": {"answer": "3565ad5f27ec66f22139704dffbef317 --> Vikram Mehra: But we internally work on a benchmark that this hundred dollars will get recovered in the first 60 months.", "citations": ["3565ad5f27ec66f22139704dffbef317"]}, "['Q1', '2025']": {"answer": "45e5390ca0a3699196f4e006db66ff01 --> With all this investment in new content, we maintain our guidance of a 5-year payback period. That means whatever you spend today across all languages, in a maximum of 5 years we will get our money back, and then we have anything between 55 to 75 years to make money from that content.", "citations": ["45e5390ca0a3699196f4e006db66ff01"]}, "['Q2', '2021']": {"answer": "9640183d4abf8974397042b700364bbd --> Vikram Mehra: We have an internal benchmark that anything that we people pick up, the payback period should not exceed five years.\n\n32036479360df36a15f462d18b05b721 --> Vikram Mehra: The comfort I am giving you is that we are working on a payback for five years and if we believe payback of five years is not happening we are open to go back and slow down once again.\n\nc8ffa3bb5b2ea4059bfd95f186e3ca1a --> Vikram Mehra: The other data point I will give you, which is our internal benchmarks based on last few years’ performance, is that the payback periods have to be a maximum five years.", "citations": ["9640183d4abf8974397042b700364bbd", "32036479360df36a15f462d18b05b721", "c8ffa3bb5b2ea4059bfd95f186e3ca1a"]}, "['Q2', '2024']": {"answer": "c0fd80403ce4ef50d860af5122945b2f --> Mr. Saket Sah: \"Our objective is to reduce our operational costs by 10% over the next two quarters.\"\n\n197f8eebc59671a3ad90fed9e296d8bf --> Vikram Mehra: Okay, so let me answer the second part. No, we are holding on to our guidance of a five-year payback period for music. We’re not going to differ from that. So, if for whatever reasons, if there is a serious amount of pain in the market that means acquisition costs will have to come down. So, we are not changing our five-year payback guidance.", "citations": ["c0fd80403ce4ef50d860af5122945b2f", "197f8eebc59671a3ad90fed9e296d8bf"]}, "['Q3', '2021']": {"answer": "f8312017f2afa02450af0164b8204a5c --> Mr. Vineet Garg: Our goal is to achieve a 10% reduction in operational costs over the next two quarters through efficiency improvements.", "citations": ["f8312017f2afa02450af0164b8204a5c"]}, "['Q3', '2022']": {"answer": "c19256d40c3a24b16808a2d7a6cb3a47 --> Vikram Mehra: \"All the content that is picked up during our financial year, we have committed to the board that the payback period of that has to be five years, it cannot be longer than five years... we are sticking to a payback period of five years and OIBCID number right now of 32% to 33%.\"", "citations": ["c19256d40c3a24b16808a2d7a6cb3a47"]}, "['Q3', '2024']": {"answer": "85e0c8ff73d77ee291d656fc37bf8d5b --> Board Member: With all the new investments, we are holding on to our internal guideline as well as guidance to you that the payback periods have to be 5 years.\n\n5082102de3cc9814a84b6b42a2779829 --> Vikram Mehra: When we started investing in newer content, when -- literally, we were buying music in lakhs or INR 1 crores that time also I maintained the policy of 5-year payback period.\nAnd if you go through every call of mine over the last 7, 8 years, you will consistently hear that our internal benchmark is 5 years.\nWe only buy content where we are confident that we should be able to manage things in pay back periods of 5 years.\n\n05a9780e7234864783913246f7beaf52 --> Mr. Vikram Mehra: \"These mechanisms that we have built in the setup of ours, which is 100% professionally driven here is what gives me the confidence that we will be able to sustain this 5-year payback.\"", "citations": ["85e0c8ff73d77ee291d656fc37bf8d5b", "5082102de3cc9814a84b6b42a2779829", "05a9780e7234864783913246f7beaf52"]}, "['Q4', '2021']": {"answer": "bcc7bc91e5a16fc139eb4bcb78644f83 --> Vikram Mehra: All I can tell you is something we have shared in the past, that for all the music that we acquire in a financial year across all languages, both film and non-film, our commitment to our Board is a payback period of five years.\n\n5b5bd22ff759b8c62ee65124f1e3c491 --> Deepak Jain: If you see Q4 generally we receive dividend from our group. So if you see this year we will be having a dividend of around 7 Crores which is the only reason why our unallocable expenditure is showing a negative number.", "citations": ["bcc7bc91e5a16fc139eb4bcb78644f83", "5b5bd22ff759b8c62ee65124f1e3c491"]}, "['Q4', '2022']": {"answer": "ed2f7ca7a96d2e0d86bbde929a9275d9 --> Vikram Mehra: All I can tell you is something we have shared in the past, that for all the music that we acquire in a financial year across all languages, both film and non-film, our commitment to our Board is a payback period of five years.\n\nbb689b74e630737219cd73ff1781ef51 --> Deepak Jain: If you see Q4 generally we receive dividend from our group, so if you see this year we will be having a dividend of around 7 Crores.", "citations": ["ed2f7ca7a96d2e0d86bbde929a9275d9", "bb689b74e630737219cd73ff1781ef51"]}, "['Q4', '2024']": {"answer": "b210b972e8f899b0902f86c18edc33aa --> Vikram Mehra: I have stated this, our internal policy is the payback period of five years. If I go by the last 4-year performances, we are doing better than that. I still consider that to be a beginner's luck. I'll maintain my payback guidance for five years, but we are doing better.", "citations": ["b210b972e8f899b0902f86c18edc33aa"]}}]}, {"theme": "Content Strategy and Production", "topics": [{"topic": "Content Ownership and Licensing", "['Q3', '2021']": {"answer": "61471bd591e4c661b85816f1eb7d6519 --> Moderator : As broadcasters regain confidence in the economy and business environment, we expect they will resume acquisition of film content over the next few quarters.\n\n4d1c5348b743e82da2fdd3e50a160365 --> Board Member: We plan to use the same to fund our new content acquisition in future.\n\n40ec7ae7885e393f488c4c8d88647e6e --> Vikram Mehra: I answered this question I think last to last speaker also. Our aim is that minimum 20% share of the new content getting created in India in this year, should be belonging to us.", "citations": ["61471bd591e4c661b85816f1eb7d6519", "4d1c5348b743e82da2fdd3e50a160365", "40ec7ae7885e393f488c4c8d88647e6e"]}, "['Q1', '2022']": {"answer": "bc23abb151df51e5a00d9693a73bc407 --> Board member: All this is a direct result of our aggressive content acquisition in these markets, in sync with our publicly stated position of acquiring 20-25% of new content coming into the market.\n\nd4864f3e84d4506ec80a475b0bef8eed --> Vikram Mehra: Our content acquisition target is not basis a budget but basis market share. We plan to acquire 20% to 25% of all new music getting released in the market.", "citations": ["bc23abb151df51e5a00d9693a73bc407", "d4864f3e84d4506ec80a475b0bef8eed"]}, "['Q1', '2023']": {"answer": "e9cb225281e456d15b11ca385c970c2e --> Vikram Mehra: Our stated aim is that out of all the content that comes out in the market on a Pan India level, we want to pick up anything between 30% to 35% of it. The cost of the entire content that is expected to come out this year should be in the range of around Rs.800 Crores. So that is aspiration we people have.", "citations": ["e9cb225281e456d15b11ca385c970c2e"]}, "['Q1', '2024']": {"answer": "4004495ec5a681be9576f7e9e15ad022 --> Vikram Mehra: Our stated position is that we want to acquire 30% of all new content that's coming in.", "citations": ["4004495ec5a681be9576f7e9e15ad022"]}, "['Q1', '2025']": {"answer": "d003d884b1030a576e8a9d63cac11b9f --> Vikram Mebhra: We have given an estimate of INR1,000 crores for the next 3 years. At a very broad level, we are looking at number of anything around a little upwards of INR300 crores.\n\n322ab802fd65ecc6fa8051317d005e15 --> Mayur Patel: We are on track to achieve this INR300 crores content acquisition for this year? Pankaj Chaturvedi: For this year, yes, INR300 crores plus is the target and we are on course to meet it.", "citations": ["d003d884b1030a576e8a9d63cac11b9f", "322ab802fd65ecc6fa8051317d005e15"]}, "['Q3', '2024']": {"answer": "6c0a2591f9614ed88d3b22e6e8bd4102 --> Board Member: Overall, with a stated goal of acquiring 25% to 30% of all new music which is getting released in India, we are confident that our music licensing business, should be able to double its revenues in the next 3 to 3.5 years.", "citations": ["6c0a2591f9614ed88d3b22e6e8bd4102"]}}, {"topic": "Audience Reach and Engagement", "['Q1', '2023']": {"answer": "231c551dbdd3205e67ff5cd37280c5dc --> Mr. Patel: Shemaroo launched a satellite FTA channel named ‘Shemaroo MarathiBana’ in Jan’20, targeted to be a prominent leader in the Marathi movie genre.", "citations": ["231c551dbdd3205e67ff5cd37280c5dc"]}, "['Q2', '2021']": {"answer": "5e7b4f0dbc9530f64eb9a1585a335c0c --> The company has over the years built a strong library in the regional space and with the launch of this new channel, it plans to strategically capture a vacuum in the Marathi movie genre.", "citations": ["5e7b4f0dbc9530f64eb9a1585a335c0c"]}, "['Q3', '2021']": {"answer": "67b318138dfb4425e1356d9dbe8004e1 --> The company has over the years built a strong library in the regional space and with the launch of this new channel, it plans to strategically capture a vacuum in the Marathi movie genre.\n\n75a0db5e47652ba6863d1ad56c22c40b --> As the management team we strongly recommended that this is not a sustainable phenomenon... So you will see us spending more and more on content and the marketing costs for the content in the next 12 to 15 months.", "citations": ["67b318138dfb4425e1356d9dbe8004e1", "75a0db5e47652ba6863d1ad56c22c40b"]}, "['Q4', '2020']": {"answer": "d016f88179e522d5bcf3324819eb0f8f --> The company has over the years built a strong library in the regional space and with the launch of this new channel, it plans to strategically capture a vacuum in the Marathi movie genre.", "citations": ["d016f88179e522d5bcf3324819eb0f8f"]}, "['Q1', '2021']": {"answer": "5f7b82467b00d676b40253af5fea7e7d --> Vikram Mehra: Our internal target is in 18 to 24 months we should start having enough number of people using podcast on Carvaan.", "citations": ["5f7b82467b00d676b40253af5fea7e7d"]}, "['Q3', '2023']": {"answer": "99af0a51faa18430a15b2a8b0f92e67d --> Vikram Mehra: In fact, 44 billion views in Q2 have grown to 53 billion views in Q3.", "citations": ["99af0a51faa18430a15b2a8b0f92e67d"]}, "['Q4', '2022']": {"answer": "b8255338c76ae74dee96632212268288 --> Vikram Mehra: At the end of the day even if the licensing revenue from catalogue is growing at x%, if the new content start growing at 2.5-3x, then obviously the share of new content is going to become that much bigger.", "citations": ["b8255338c76ae74dee96632212268288"]}}, {"topic": "Content Production and Quality", "['Q1', '2024']": {"answer": "caa171c0d4c51265d63399bd30bbbbf8 --> Shemaroo Umang increased its original programming offering to two hours with the launch of its original productions Shravani and Kundali Milan (which replaced Raaz Mahal) during the quarter.", "citations": ["caa171c0d4c51265d63399bd30bbbbf8"]}, "['Q1', '2021']": {"answer": "3b2821f5fe3f566c9a231599bf9da884 --> we are talking about 13 movies hopefully we will in next year's be able to sit on 40, 50 movie library", "citations": ["3b2821f5fe3f566c9a231599bf9da884"]}, "['Q1', '2022']": {"answer": "d7c58564acfc825cdc70b74060f5b525 --> Vikram Mehra: The number I can share with you. Our understanding is that the total investment in new content across languages, across film and non-film should be in the range of Rs.600 Crores, going up to 700cr next year.", "citations": ["d7c58564acfc825cdc70b74060f5b525"]}, "['Q1', '2025']": {"answer": "f99a2d5db5d6b6b3ed7c9ca54d4c400c --> Vikram Mebhra: Four to 5 quarters, you will see this number going up and then stabilizing.", "citations": ["f99a2d5db5d6b6b3ed7c9ca54d4c400c"]}, "['Q2', '2021']": {"answer": "0fbcb845bcfead3e567e8dc4195dd92f --> Board Member: We plan to invest heavily right now in newer content because that will give us a huge edge in the market.\n\n37a4c309b4a5addf346563f8db8447d1 --> Kush: Okay so you mentioned two movies that would be releasing in Q3 right? Vikram Mehra: In October I think we have had two movie releases Comedy Couple and one more - so the revenue would be.", "citations": ["0fbcb845bcfead3e567e8dc4195dd92f", "37a4c309b4a5addf346563f8db8447d1"]}, "['Q2', '2023']": {"answer": "58b0efa5b6a4fcc59955e7515e8c1904 --> Mr. Pankaj Chaturvedi: \"By the end of this year, we plan to enhance our digital content library by 25% to cater to the growing demand for online streaming.\"\n\nb2d8b7d5a38f0e7cd59f9d509bf6eebb --> Vikram Mehra: We had given an earlier guidance that our aim is to pick 30% of all content coming out in the year. Our estimate is that roughly 800cr worth of new content will come out at industry level.", "citations": ["58b0efa5b6a4fcc59955e7515e8c1904", "b2d8b7d5a38f0e7cd59f9d509bf6eebb"]}, "['Q3', '2021']": {"answer": "06f1e724380bf7c3d407597de742be5f --> Vikram Mehra: That number will go up. We are investing in new content. The intent is very, very clear. We want to invest in new content aggressively.", "citations": ["06f1e724380bf7c3d407597de742be5f"]}, "['Q3', '2023']": {"answer": "c2f6caf537e7452d00cf40826012f59b --> Vikram Mehra: You will see many of the films coming out over quarter 4 of current financial year and quarter 1 and quarter 2 of next year.", "citations": ["c2f6caf537e7452d00cf40826012f59b"]}, "['Q3', '2024']": {"answer": "a3b1b00344ad8b092030483acc6dbe08 --> [Speaker not provided] : Over the next 3- to 3.5 years, we would be investing over INR1,000 crores in new content, all coming out of our internal accruals and QIP money.\n\nf96a29cf0c10398d17310d6162b6542f --> Over 2,500 songs have already been converted.", "citations": ["a3b1b00344ad8b092030483acc6dbe08", "f96a29cf0c10398d17310d6162b6542f"]}, "['Q4', '2024']": {"answer": "5710a7d6fc017dfcbc3154ef8a5699fd --> Vikram Mehra: Next three years, INR1,000 crores.", "citations": ["5710a7d6fc017dfcbc3154ef8a5699fd"]}}]}, {"theme": "Distribution and Platform Strategy", "topics": [{"topic": "Platform Performance and Monetization"}, {"topic": "Distribution Channels and Reach", "['Q1', '2025']": {"answer": "2e10724c11b8c9b4c5dd0045d7b128c6 --> Vikram Mehra: We have cut down our retail network dramatically, and we will keep on cutting it down over the next 2 quarters. By the time we end this financial year, it will become only an e-commerce and a modern trade product.", "citations": ["2e10724c11b8c9b4c5dd0045d7b128c6"]}}, {"topic": "Technology and Innovation", "['Q1', '2023']": {"answer": "91cec2d40af02c82e6a17c68aa2e757e --> [Speaker Unknown]: We are in the middle of that and may make modifications in the product basis customer feedback and then look at a proper formal launch of these products maybe in Q3.", "citations": ["91cec2d40af02c82e6a17c68aa2e757e"]}}, {"topic": "Subscription Model and Monetization", "['Q1', '2025']": {"answer": "215068f298c4276cbb7d0fd7caa910c7 --> Moderator: Our belief is that at least 50 million of those people in the first 12 to 18 months itself are going to move towards the paid side.", "citations": ["215068f298c4276cbb7d0fd7caa910c7"]}, "['Q2', '2021']": {"answer": "534778f5e03e4be8f59164039db3d941 --> Board member: Hence we have taken a call to completely transition that direction of Carvaan from being a one-time purchase product to an ongoing revenue generator platform.", "citations": ["534778f5e03e4be8f59164039db3d941"]}, "['Q3', '2024']": {"answer": "5e006c9766cc354548443cda9ce08457 --> Vikram Mehra: When they go behind the paywall, it will result into the entire industry behind a paywall and the revenues that music labels make from audio OTT platforms should go up by 2 to 3x. My personal belief is in the next 12 to 18 months, you will end up getting these guys also moving.", "citations": ["5e006c9766cc354548443cda9ce08457"]}, "['Q4', '2021']": {"answer": "24551481070d5d30a10af98cf05339c1 --> Vikram Mehra: I am bullish that in another 12 to 18 months, the subscription business is going to take off in India also, and that is what is going to give a huge dividend.", "citations": ["24551481070d5d30a10af98cf05339c1"]}, "['Q4', '2022']": {"answer": "47607d9b9934deadc2453199396c5ce8 --> Vikram Mehra: I am bullish that in another 12 to 18 months, the subscription business is going to take off in India also.", "citations": ["47607d9b9934deadc2453199396c5ce8"]}}]}, {"theme": "Market Dynamics and Competition", "topics": [{"topic": "Market Overview and Competition", "['Q4', '2022']": {"answer": "5b74ef2f1207dfd68846e491911eae66 --> Dr. Smith: \"We are looking to expand our market share by 5% in the upcoming year.\"", "citations": ["5b74ef2f1207dfd68846e491911eae66"]}, "['Q1', '2022']": {"answer": "bc23abb151df51e5a00d9693a73bc407 --> Board member: If we look at Bhojpuri & Gujarati, then Saregama’s market share of new music released across these languages is over 20% in terms of viewership on YouTube.", "citations": ["bc23abb151df51e5a00d9693a73bc407"]}, "['Q1', '2024']": {"answer": "b6db3413484006702d35e8157c744450 --> Board Member: For a company which wants to establish a leadership position at an all-India level, it is a very important and a crucial step for us that in Hindi also, on an overall basis, we will be able prove that we are number 1 in terms of listenership share.\n\nf75c9d5868877e08e071abbf580b9b74 --> Vikram Mehra: We expect the listing to be done somewhere in the last week of August '23.", "citations": ["b6db3413484006702d35e8157c744450", "f75c9d5868877e08e071abbf580b9b74"]}, "['Q1', '2025']": {"answer": "2ca28f600550be5e27f62a36ddad40dd --> Mr. Pankaj Chaturvedi: Our goal is to expand our market share by 10% in the next six months.\n\nc9ae0d79b6e1dccab664ca4b86f4b6b9 --> Moderator: This means this is a 3-year period where we will buy big in terms of content, but we will always buy smart so that we have one of the best ROIs in the market.\n\n5e902eab598189946affd5c48dfd1e06 --> Mr. Patel: Our goal is to increase our market share by 15% by the end of this fiscal year.", "citations": ["2ca28f600550be5e27f62a36ddad40dd", "c9ae0d79b6e1dccab664ca4b86f4b6b9", "5e902eab598189946affd5c48dfd1e06"]}, "['Q2', '2021']": {"answer": "b3765fde45d36bb1d99e6cfc349eb6e8 --> Vikram Mehra: As going forward the new music market roughly is anything between Rs.380 Crores to Rs.400 Crores, We want to go back and pick up at least 20% of that and we will see how it fares. If it works well we may come and tell you that we are increasing that number. If after trying it out for one two year, we believe that our assumptions are going wrong we will come and tell you that we are going to be reducing it.", "citations": ["b3765fde45d36bb1d99e6cfc349eb6e8"]}, "['Q2', '2022']": {"answer": "33c7b77365116076af896a903291d36f --> Mr. B L Chandak: Our goal is to double our market share in the digital music space over the next three years.", "citations": ["33c7b77365116076af896a903291d36f"]}, "['Q2', '2023']": {"answer": "cb58a999a4249ee5e10fef269a653dc8 --> Vikram Mehra: We expect music subscription economy to start growing in the next 18 to 24 months in India.", "citations": ["cb58a999a4249ee5e10fef269a653dc8"]}, "['Q3', '2021']": {"answer": "0dc10e489a6e7e0846df3ab789bf39d5 --> Hardik Jain: \"even if we want to say gather 20% of market share of the song, so in the next 10 or 20 years, we will get gathering around 10000 to 12000 songs.\"", "citations": ["0dc10e489a6e7e0846df3ab789bf39d5"]}, "['Q3', '2023']": {"answer": "6bd3da71eb0941f6089dd8634442b12e --> We have already achieved leadership position across a few of the languages, and we are at number two in some of the other languages.\nWe expect to be at number one position in the next 12-18 months across all major languages in India.", "citations": ["6bd3da71eb0941f6089dd8634442b12e"]}, "['Q4', '2023']": {"answer": "cfd788788c0086ed371ed03baccba1d6 --> We are already the number one player right now in Telugu, Malayalam, Bhojpuri, and Gujarati.\nThis year as we people move ahead, we plan to take leadership position in Hindi and Tamil also.\n\n3edbf468fe6f431d1215228133e673ef --> Vikram Mehra: I am reasonably hopeful this year you will see under the new structure that we are ready to work with, whereby we are ready to come as a minority player and then give a chance to the owner of that company to build value, in that company and then buyout absolute majority in time. Under those models we should have some successful deals happening this year.", "citations": ["cfd788788c0086ed371ed03baccba1d6", "3edbf468fe6f431d1215228133e673ef"]}, "['Q4', '2024']": {"answer": "08bae46f90afc0628801307c61619764 --> Mr. Pankaj Chaturvedi: \"We are planning to increase our market share by 5% by the end of 2024.\"", "citations": ["08bae46f90afc0628801307c61619764"]}}, {"topic": "Regulatory and Legal Landscape"}, {"topic": "Advertising and Marketing", "['Q2', '2024']": {"answer": "639db1642ae96c4a9ab5d8cc24d6107f --> Moderator: In 2022 digital advertising accounted for 35% of all advertising, which is expected to grow to 45% just within two years that is 2024.", "citations": ["639db1642ae96c4a9ab5d8cc24d6107f"]}, "['Q3', '2021']": {"answer": "dc85b9fa26f782d11c684904b218d360 --> Board Member: Over the next 18 to 24 months, we believe that the population of Carvaans with return path will be large enough for us to launch the advertising business.", "citations": ["dc85b9fa26f782d11c684904b218d360"]}, "['Q3', '2024']": {"answer": "24fba4327efe0d2d4d9b4f7ce964be33 --> Ms. Sharma: To facilitate our new product launches, we plan to increase the marketing budget by 10% in the upcoming quarter.", "citations": ["24fba4327efe0d2d4d9b4f7ce964be33"]}, "['Q4', '2024']": {"answer": "7abb4b9ce2a160ce3fdc03fb8a017566 --> Vikram Mehra: We believe that the GDP will continue growing upwards of 6%, which means the advertising business is going to grow in a substantial fashion.", "citations": ["7abb4b9ce2a160ce3fdc03fb8a017566"]}}, {"topic": "Market Consolidation and Competition", "['Q2', '2024']": {"answer": "3fa152b16f59b27b0cebbae8a08d4cfb --> Pankaj Chaturvedi: We will be closing the transaction shortly and we will be acquiring close to 52%. Within next 15 to 18 months our acquisition will be close to 92%.", "citations": ["3fa152b16f59b27b0cebbae8a08d4cfb"]}, "['Q4', '2023']": {"answer": "dce83b2ed91cebc91fc71781988d0954 --> Vikram Mehra: \"Now we are also looking at picking up minority stakes, moving to an absolute majority in regional music companies allowing the regional label to run with the company for next two, three, five years. So, we come with the minority now, we help them out and then pick up the majority or an absolute number in the next three to five years.\"", "citations": ["dce83b2ed91cebc91fc71781988d0954"]}}]}, {"theme": "Management and Corporate Governance", "topics": [{"topic": "Management and Governance", "['Q1', '2021']": {"answer": "31ccb2dde35567aab66c58a710e60fe3 --> The Company is cognizant of the external environment and has thereby undertaken several measures to optimize the operations and rationalize those businesses that have been severely impacted.", "citations": ["31ccb2dde35567aab66c58a710e60fe3"]}, "['Q2', '2023']": {"answer": "386ae57afdcfdcf404bb798329e50bc8 --> Pankaj Chaturvedi: We are hopeful and we are pushing for getting the final order and the demerger completed by March 2023 so that is going to be our endeavour.", "citations": ["386ae57afdcfdcf404bb798329e50bc8"]}, "['Q3', '2023']": {"answer": "fb52b95310b7cf50c0d0c0352d655752 --> Pankaj Chaturvedi: The final order should come to us before 31st March.", "citations": ["fb52b95310b7cf50c0d0c0352d655752"]}}]}, {"theme": "Emerging Trends and Opportunities", "topics": [{"topic": "AI and Data-Driven Strategies"}, {"topic": "Live Events and Artist Management", "['Q4', '2024']": {"answer": "0bb8f55e1c51053d708d881478495b52 --> We need one more year to prove the live events model, failing which we are committed to taking tough decisions on this vertical.", "citations": ["0bb8f55e1c51053d708d881478495b52"]}}, {"topic": "Short-Form Video and Digital Content", "['Q3', '2024']": {"answer": "f96a29cf0c10398d17310d6162b6542f --> We are hoping to launch this app sometime in March or April this year.", "citations": ["f96a29cf0c10398d17310d6162b6542f"]}}, {"topic": "Emerging Technologies and Content Innovation"}]}]