[{"theme": "Revenue Growth and Financial Strategy", "topics": [{"topic": "Revenue diversification efforts", "data": {"['Q1', '2023']": {"answer": "198edfa1875920cb5905f215e94d4468 --> The Managing Director mentioned the plan for Saregama Carvaan to achieve a 15% year-on-year growth in the upcoming fiscal year.\n\ncb526f326ee40211c9af83e433c97210 --> Vikram Mehra stated that their deals are structured to immediately receive a share of advertising if short format apps move to an advertising-driven model.", "citations": ["198edfa1875920cb5905f215e94d4468", "cb526f326ee40211c9af83e433c97210"]}, "['Q1', '2024']": {"answer": "0b73b28cb1aea48051d68b5785556c31 --> The management is confident that by the end of the current financial year, each business segment will grow at rates previously communicated.\n\nc34d6f99bd3c1531256b2a9f82c806bf --> Saregama is holding its guidance for the full year.\n\n88b193c6b8b505fac5858b93192ca136 --> Vikram Mehra stated that the film and TV business is expected to grow at 25% every year, while maintaining the total capital allocation within the upper limit of 18%.", "citations": ["0b73b28cb1aea48051d68b5785556c31", "c34d6f99bd3c1531256b2a9f82c806bf", "88b193c6b8b505fac5858b93192ca136"]}, "['Q1', '2025']": {"answer": "5dc39bc91af52b6b2f466e3c17a11c75 --> Mr. Vikram Mehra (Managing Director) stated a revenue increase target of 30% for FY'25.\n\ndfbcc1109de5e18780b216e0866bbb07 --> The speaker, inferred as a member of the management team, stated that they aim to grow the business at a 25% CAGR over the next 5 years.\n\n70e36e371480c003cd7821a38aa73224 --> The speaker mentioned that the music revenue, which is a combination of music and artist management, is on track to achieve a guidance of 25% - 26% growth in FY'25.\n\nd4e95b1e2487a54dbda43b6df503bdb4 --> Vikram Mehra stated that the company will grow at 26% this year.\n\n1676d51fd9c1766918a8266fe06f0d73 --> The CFO stated that revenue is expected to grow by 20% in the next fiscal year.\n\n97ef122560f4b8d7792b1089dc0005d7 --> At the consolidated company level, we expect revenue, excluding Carvaan, to grow at a CAGR of 30% over the next 3 years and PBT to double over the next 3 to 4 years.\n\n322ab802fd65ecc6fa8051317d005e15 --> Pankaj Chaturvedi confirmed a target of INR300 crores plus for content acquisition for the current year, which they are on course to meet.\n\n215068f298c4276cbb7d0fd7caa910c7 --> The speaker inferred as a member of the management team stated that at least 50 million users are expected to move to the paid side in the first 12 to 18 months.", "citations": ["5dc39bc91af52b6b2f466e3c17a11c75", "dfbcc1109de5e18780b216e0866bbb07", "70e36e371480c003cd7821a38aa73224", "d4e95b1e2487a54dbda43b6df503bdb4", "1676d51fd9c1766918a8266fe06f0d73", "97ef122560f4b8d7792b1089dc0005d7", "322ab802fd65ecc6fa8051317d005e15", "215068f298c4276cbb7d0fd7caa910c7"]}, "['Q2', '2023']": {"answer": "58b0efa5b6a4fcc59955e7515e8c1904 --> The Managing Director, Vikram Mehra, stated that Saregama India Limited aims to achieve a 20% growth in digital revenue by the end of the fiscal year.\n\n7b69317ddcaacff820688627990b7b83 --> The CEO confirmed a projection of 22% to 25% growth on an annual basis for the music business.\n\n664a03f4237227b862eefa78df9bb1f4 --> Vikram Mehra stated that some businesses will continue growing at a 25% year-on-year rate.", "citations": ["58b0efa5b6a4fcc59955e7515e8c1904", "7b69317ddcaacff820688627990b7b83", "664a03f4237227b862eefa78df9bb1f4"]}, "['Q2', '2024']": {"answer": "011d372368d3447c2862ba2e54a77296 --> The speaker mentioned that the money made from streaming platforms is expected to increase by 150% to 300% as the market transitions from a free model to a paid model over a 12 to 18 months horizon.\n\nf2fc3392fb8520b474677542c127557e --> The company plans to grow the combined revenues of Pocket Aces and Saregama by 27% to 28% in the medium term.\n\n4a598f97f59164793aee0e3bb64c9274 --> Vikram Mehra indicated a growth target related to the Pocket Aces acquisition.\n\nc2c9c7546115952a8c024682074eca98 --> The management team expects the Films and series vertical to see a 25% growth by the end of the financial year.\n\n30a61c36305456d31bd937bef9eed950 --> The speaker mentioned that they expect the revenue generated from streaming platforms to increase by one and a half to three times in the short run due to the transition from a free economy to a paid economy.\n\n12324280798cdfb8e15afc4651913f5b --> Vikram Mehra indicated a potential timeline of 12 to 18 months for changes in the subscription business revenue dynamics.\n\n6cc6023b52ded8327b5e3699491f07c8 --> Vikram Mehra stated that 22% to 23% is the growth expected for the financial year, with approximately 75% of the revenues for the Films vertical coming in the 4th Quarter.", "citations": ["011d372368d3447c2862ba2e54a77296", "f2fc3392fb8520b474677542c127557e", "4a598f97f59164793aee0e3bb64c9274", "c2c9c7546115952a8c024682074eca98", "30a61c36305456d31bd937bef9eed950", "12324280798cdfb8e15afc4651913f5b", "6cc6023b52ded8327b5e3699491f07c8"]}, "['Q3', '2023']": {"answer": "b20cac323b442739305b183e9f291aaf --> The CFO indicated an expected 20% increase in digital revenue by the end of FY '23.\n\ne7710db9b6d4ff7c5ed9912c67992348 --> Vikram Mehra stated that the company expects to maintain a growth rate of 22% to 25% in the short and medium to long run, and the Events and Live business is expected to grow at 25%.\n\nceab43e38c560a05fa9bc863cb91b887 --> Vikram Mehra mentioned that the funds raised from QIP will be used only for music and nothing else.\n\ne21b8cd478fe5f7cb6a73fcb1652c707 --> Vikram Mehra stated that the revenue from Films, Series, and Live Events was INR 100 crores in the first 9 months.", "citations": ["b20cac323b442739305b183e9f291aaf", "e7710db9b6d4ff7c5ed9912c67992348", "ceab43e38c560a05fa9bc863cb91b887", "e21b8cd478fe5f7cb6a73fcb1652c707"]}, "['Q3', '2024']": {"answer": "c62f7e7dcd242913a4196ec262e943cd --> The speaker indicated that the base of users is expected to go behind a paywall and generate revenue over the next 12 to 18 months.\n\nb2c2e350d1081bdb7583deef2656b3c6 --> The speaker indicated that the incremental revenues from investments will start outweighing the content charge-offs in about 18 months.\n\n85e0c8ff73d77ee291d656fc37bf8d5b --> The management team expects the catalogue to grow at 14% to 16% over the next 12 to 18 months once OTT platforms move behind the paywall.\n\nf875daf9b2ad90d12a67b879885744b6 --> The speaker mentioned that the subscription economy is expected to start taking off in the next 18 to 24 months, leading to significant revenue generation.\n\na3b1b00344ad8b092030483acc6dbe08 --> The overall revenue for the company, excluding Carvaan, is expected to continue growing at 25% to 26% CAGR over a 3 to 5-year period, with the overall profitability (PBT) of the company expected to double in the next 3 to 4 years.\n\n5e006c9766cc354548443cda9ce08457 --> Vikram Mehra stated that growth is expected to be 25% to 26% at the end of the year, excluding Carvaan revenues, based on a new content strategy.\n\n5d0cfa3e829b88f8346b0de3be007655 --> The CFO stated that their goal is to achieve a 20% increase in digital revenue by the end of 2024.\n\n24fba4327efe0d2d4d9b4f7ce964be33 --> The CFO stated that the company aims to achieve a 20% increase in digital content revenue by the end of the fiscal year.\n\n1094771d0ef652464664d8fbc377f36f --> The management expressed confidence in achieving a revenue growth of 25% to 26% CAGR over the next 3 to 5 years.\n\n88c2bc010bf8a74a5c4dd66de66e7c91 --> The CEO stated that they aim to achieve a 20% growth in digital revenue by the end of the fiscal year.\n\nc70be1f4e6e585e2a3418d535ecdebee --> The CEO projected a 20% increase in digital music revenue for the upcoming fiscal year.\n\n34199ef7d88de8e96eb0e24ce9d8f6a8 --> The CEO stated that the company aims to increase its digital music revenue by 20% over the next fiscal year.", "citations": ["c62f7e7dcd242913a4196ec262e943cd", "b2c2e350d1081bdb7583deef2656b3c6", "85e0c8ff73d77ee291d656fc37bf8d5b", "f875daf9b2ad90d12a67b879885744b6", "a3b1b00344ad8b092030483acc6dbe08", "5e006c9766cc354548443cda9ce08457", "5d0cfa3e829b88f8346b0de3be007655", "24fba4327efe0d2d4d9b4f7ce964be33", "1094771d0ef652464664d8fbc377f36f", "88c2bc010bf8a74a5c4dd66de66e7c91", "c70be1f4e6e585e2a3418d535ecdebee", "34199ef7d88de8e96eb0e24ce9d8f6a8"]}, "['Q4', '2023']": {"answer": "c7a3a208ad06e533e25cc2a77fd240c0 --> The management is confident that the business vertical will grow at over 25% year-on-year and write a profit.", "citations": ["c7a3a208ad06e533e25cc2a77fd240c0"]}, "['Q4', '2024']": {"answer": "08bae46f90afc0628801307c61619764 --> The Managing Director stated that the company aims to increase its digital revenue by 25% in the next fiscal year.\n\nf07db382f8fa1ec833a429a79e89088d --> Vikram Mehra mentioned a planned investment of INR1,000 crores over the next three years.\n\nc6b889fa437cce6593770b72a42927a7 --> The company expects revenue, excluding Carvaan, to grow upwards of 30% in FY25.\n\nc6b889fa437cce6593770b72a42927a7 --> The company expects revenue, excluding Carvaan, to grow at a CAGR of 25% to 26% and PBT to double over the next three to four years.\n\n1815a6895c025cd73b88362368787a5d --> From Q2 FY '25 onwards, the company expects to return to the old growth rates in the audio OTT space.\n\n1815a6895c025cd73b88362368787a5d --> Starting June, YouTube revenues are expected to be on track and maintain a growth trajectory for the entire year.\n\nddab33484c100af1f0c683930c3bf809 --> The management is confident that the vertical, currently close to INR540 crores, should cross INR1,000 crores in the next 3 to 3.5 years.\n\n775fc0406bd3e3ef98a971aa7059a08f --> Vikram Mehra stated that the INR1,000 crores music investment will be made over the next three years and will be funded completely through internal accruals and QIP money.\n\nfb8cd1578fcb145f370b9fc0e58fb13a --> Vikram Mehra mentioned a long-term guidance of achieving a 25% to 26% revenue growth rate over a 3- to 5-year basis for all verticals combined, excluding Carvaan.\n\ncd9cb70e54ac1ba1bded1a6890a3bbcd --> Vikram Mehra (Inferred as CEO) mentioned a 40% growth in subscription revenue in FY '24 compared to FY '23.\n\na1c7fbafd12824194af3fea91db826fb --> Vikram Mehra provided a growth guidance of a CAGR of 25% to 26% over three years.", "citations": ["08bae46f90afc0628801307c61619764", "f07db382f8fa1ec833a429a79e89088d", "c6b889fa437cce6593770b72a42927a7", "1815a6895c025cd73b88362368787a5d", "ddab33484c100af1f0c683930c3bf809", "775fc0406bd3e3ef98a971aa7059a08f", "fb8cd1578fcb145f370b9fc0e58fb13a", "cd9cb70e54ac1ba1bded1a6890a3bbcd", "a1c7fbafd12824194af3fea91db826fb"]}}}, {"topic": "Profitability metrics", "data": {"['Q1', '2023']": {"answer": "44d91a37b73a06466c21664088ceb11c --> Vikram Mehra stated that the Film TV and web series business will contribute 15% to 20% margin over the next three to five years, and the business is expected to reach Rs.150 Crores to Rs.200 Crores in a couple of years.\n\n05219604ce7d4c091463b9a16c571d07 --> Vikram Mehra mentioned plans for Carvaan margins over the next three to four years.\n\nbe4db0a9cf3e8bc99f110ad4ad5b56cd --> Vikram Mehra indicated that the business is expected to generate a 15% to 20% margin after writing off the entire cost of film or series in the first year.\n\n94709b3647cd3808c6ffde712cf8d134 --> Vikram Mehra provided guidance on the film series and TV business, stating it should grow at a 25% growth rate year-on-year with a margin of around 15%.\n\n94709b3647cd3808c6ffde712cf8d134 --> Vikram Mehra projected that the events verticals would initially contribute only 5% to 10% margin.", "citations": ["44d91a37b73a06466c21664088ceb11c", "05219604ce7d4c091463b9a16c571d07", "be4db0a9cf3e8bc99f110ad4ad5b56cd", "94709b3647cd3808c6ffde712cf8d134"]}, "['Q1', '2024']": {"answer": "55e6f22f2a8ff25ea9404b2770df0a58 --> The management reiterated guidance on the films and movie side of a 25% growth in revenue and a 15% margin for the year.\n\n0b73b28cb1aea48051d68b5785556c31 --> The management stated that in 12 to 18 months, the new business segment will turn profitable, with an openness to reassess if it does not.\n\naefe298fb7fd400f75a7dac01f7da575 --> Vikram Mehra outlined that they aim for a 15% margin in their film business.\n\n8c30e276f0aa494b5f0dbd1ec6957824 --> Vikram Mehra stated that the adjusted EBITDA margin at the company level is not going to fall below 32% to 33%.\n\n3b18f8f1231e30642368c430a70c0fda --> Vikram Mehra stated that the company will not allow events to drag down adjusted EBITDA below 30% to 33%.\n\n3565ad5f27ec66f22139704dffbef317 --> Vikram Mehra projected 23% growth in music with a 32% to 33% adjusted EBITDA at the company level.", "citations": ["55e6f22f2a8ff25ea9404b2770df0a58", "0b73b28cb1aea48051d68b5785556c31", "aefe298fb7fd400f75a7dac01f7da575", "8c30e276f0aa494b5f0dbd1ec6957824", "3b18f8f1231e30642368c430a70c0fda", "3565ad5f27ec66f22139704dffbef317"]}, "['Q1', '2025']": {"answer": "5dc39bc91af52b6b2f466e3c17a11c75 --> Mr. Vikram Mehra (Managing Director) mentioned guidance for adjusted EBITDA in FY'25.\n\n45e5390ca0a3699196f4e006db66ff01 --> The management maintains a guidance of a 5-year payback period for content investment.\n\nd4e95b1e2487a54dbda43b6df503bdb4 --> Vikram Mehra mentioned that in 18 months, the impact of revenue will be far higher than the charge-offs, and profitability will start moving at the same rate as revenue.\n\n784b1a77e68a6f05a5065425876e2c96 --> Vikram Mehra stated a continuation of guidance for a 26% growth during the year.\n\n97ef122560f4b8d7792b1089dc0005d7 --> We maintain our adjusted EBITDA guidance of 32% to 33%.\n\nd48bfabd1f69e842542de662ff14c5a3 --> Vikram Mebhra mentioned that the company intends to grow Pocket Aces with a CAGR of 25% and aims to achieve breakeven by the end of the year.\n\ne7ac5294270cff81fcaab39e19ec3227 --> Vikram Mebhra stated that in the next 12 to 18 months, they aim to generate 8% to 10% margins in the video segment.\n\n63290d9e91bc3d7ae089fb5b46443e1c --> Vikram Mehra indicated a plan to double the Profit Before Tax (PBT) over a 3 to 3.5-year period, based on the PBT achieved in FY '24.\n\n0c178b4159d9b2de7027b1d2b2bd2923 --> Vikram Mehra is maintaining the guidance of adjusted EBITDA at 32% to 33%.\n\n87d3f93eaec89918c62cc180dd010a1c --> Vikram Mehra stated that the company has projected a 30% year-on-year revenue growth for this year.\n\n7a32b953a451263943736e7a1313ca37 --> The CEO stated that profits will start growing at the same pace as revenue after the first 12 to 18 months, and eventually exceed the rate of revenue growth.", "citations": ["5dc39bc91af52b6b2f466e3c17a11c75", "45e5390ca0a3699196f4e006db66ff01", "d4e95b1e2487a54dbda43b6df503bdb4", "784b1a77e68a6f05a5065425876e2c96", "97ef122560f4b8d7792b1089dc0005d7", "d48bfabd1f69e842542de662ff14c5a3", "e7ac5294270cff81fcaab39e19ec3227", "63290d9e91bc3d7ae089fb5b46443e1c", "0c178b4159d9b2de7027b1d2b2bd2923", "87d3f93eaec89918c62cc180dd010a1c", "7a32b953a451263943736e7a1313ca37"]}, "['Q2', '2023']": {"answer": "57107a0cdcd020ca0d027403bb38c7c3 --> Vikram Mehra stated that the OIBCID margin is expected to be maintained at 32% to 33% for the year.\n\n5e031ec746051cecc4a1a21dcc7688f0 --> Vikram Mehra stated that Carvaan will continue to be a breakeven to a low margin business in the immediate future, with margins expected to improve as sales numbers start going up.\n\n17815e54a065a5d7338eef1e3c6a03e0 --> The speaker projected that the films, series, and television business will grow at 20% to 25% on a year-on-year basis with a 15% margin.", "citations": ["57107a0cdcd020ca0d027403bb38c7c3", "5e031ec746051cecc4a1a21dcc7688f0", "17815e54a065a5d7338eef1e3c6a03e0"]}, "['Q2', '2024']": {"answer": "a333e84feaefd3b255910b0266725deb --> The speaker [Inferred as CEO] stated that they will stick to the adjusted EBITDA guidance of 32% to 33% for Saregama and Pocket Aces.\n\nf2fc3392fb8520b474677542c127557e --> The management expects Pocket Aces to achieve a minimum annual growth of 23% and a breakeven at the PBT level by FY25.\n\nd2c87671acf537633ef29719c9f34a27 --> Vikram Mehra confirmed a growth rate of 27% to 28% from 2025 onwards.\n\n197f8eebc59671a3ad90fed9e296d8bf --> Vikram Mehra stated that they are holding on to their guidance of a five-year payback period for music.\n\n82f7c764b498e42fe5d5473fd284eeb4 --> Vikram Mehra (Inferred as CEO) stated that the films and series business is expected to maintain a 15% margin this year.", "citations": ["a333e84feaefd3b255910b0266725deb", "f2fc3392fb8520b474677542c127557e", "d2c87671acf537633ef29719c9f34a27", "197f8eebc59671a3ad90fed9e296d8bf", "82f7c764b498e42fe5d5473fd284eeb4"]}, "['Q3', '2023']": {"answer": "374028e42d260015e1074f083e96dacc --> Vikram Mehra stated that the revenue and PAT have grown by 36% and 34% respectively over the 9-month basis.\n\n6bd529300bcda29d0be80a329d098b4d --> Vikram Mehra committed to a 15% to 20% margin for the Films and Series business.\n\nceab43e38c560a05fa9bc863cb91b887 --> Vikram Mehra agreed to achieving 32% to 33% OIBCID.\n\n20ab185e4d7993d1198bc8bef05524d0 --> The speaker expects the film, TV series, and events vertical to grow at 20% to 25% year-on-year and aims to achieve around a 15% margin on this business.", "citations": ["374028e42d260015e1074f083e96dacc", "6bd529300bcda29d0be80a329d098b4d", "ceab43e38c560a05fa9bc863cb91b887", "20ab185e4d7993d1198bc8bef05524d0"]}, "['Q3', '2024']": {"answer": "b2c2e350d1081bdb7583deef2656b3c6 --> The speaker stated that profits will continue to increase in the short run and will rise more steeply after 18 months.\n\n6c0a2591f9614ed88d3b22e6e8bd4102 --> The management projected that the video vertical should grow at a CAGR of 25% over the next 5 years and achieve a 15% margin in a stable state.\n\n49f595ff89f9348e2afaf7790647a373 --> Vikram Mehra stated that the company will be back on track to start achieving 25% to 26% revenue growth at the company level by the fourth quarter.\n\naf119f79f78aeb12e6ad3c218b9086d0 --> The company is targeting a top line revenue of INR930 crores to INR940 crores for 2024.\n\na3b1b00344ad8b092030483acc6dbe08 --> The company aims to maintain absolute profitability in the first 12 to 18 months despite heavy investment, with a steep increase in profitability expected after 18 months, and a significant increase in profitability from year 3 onwards.\n\nef0747bf6d9c6e56aefcfd64f6b9b26a --> Vikram Mehra mentioned a timeline for the stabilization of the live event business and achieving single-digit margins.\n\n19712e24d61b2daa1ccd36d494eb7ffd --> Vikram Mehra provided guidance of a 25% to 26% CAGR at the corporate level over the next 3 to 5 years.\n\nbc15157683513dfa6f09a738e8519ad7 --> Vikram Mehra stated that the company expects to grow at 25-26% (excluding Carvaan) and aims to double profits in the next 3 to 4 years.\n\n1c48e353ee13694afe3746e4bd04ebfa --> Vikram Mehra confirmed an expectation to maintain profitability in the next 12 to 18 months.\n\nc6a90d7e91c114e7f5731498c9ad61db --> Vikram Mehra stated that revenue is expected to grow at a rate slightly faster than profitability over the next 18 months, with both revenue and profitability nearly doubling over 3.5 years.\n\n5082102de3cc9814a84b6b42a2779829 --> Vikram Mehra stated that the internal benchmark for music content acquisition remains a 5-year payback period.", "citations": ["b2c2e350d1081bdb7583deef2656b3c6", "6c0a2591f9614ed88d3b22e6e8bd4102", "49f595ff89f9348e2afaf7790647a373", "af119f79f78aeb12e6ad3c218b9086d0", "a3b1b00344ad8b092030483acc6dbe08", "ef0747bf6d9c6e56aefcfd64f6b9b26a", "19712e24d61b2daa1ccd36d494eb7ffd", "bc15157683513dfa6f09a738e8519ad7", "1c48e353ee13694afe3746e4bd04ebfa", "c6a90d7e91c114e7f5731498c9ad61db", "5082102de3cc9814a84b6b42a2779829"]}, "['Q4', '2023']": {"answer": "947c5ac489b80117fae660c52c6e08c8 --> The management stated that the Film, Series and Events vertical will remain breakeven or have a small contribution margin.\n\nc7a3a208ad06e533e25cc2a77fd240c0 --> The management expects the events vertical to start writing positive margins in the next 12 to 18 months.\n\na9e78b652c89622579954542d8b07445 --> Vikram Mehra confirmed the guidance to maintain the EBITDA before content charge at 32%.\n\n7684cdc9a6c0238ecd9002a71f7df208 --> Vikram Mehra stated that the adjusted EBITDA percentage is expected to be in the range of 32% to 33% on an annual basis.\n\n300e8621aa61c25c0fa961e3511e8131 --> Vikram Mehra stated that the film business will remain a 15% to 20% margin business and that no more than 18% of total capital will be allocated to it at any particular time.", "citations": ["947c5ac489b80117fae660c52c6e08c8", "c7a3a208ad06e533e25cc2a77fd240c0", "a9e78b652c89622579954542d8b07445", "7684cdc9a6c0238ecd9002a71f7df208", "300e8621aa61c25c0fa961e3511e8131"]}, "['Q4', '2024']": {"answer": "51194a6b7e5d634c94b0762e46cf2c67 --> The speaker mentioned that over the next 18 to 24 months, the content investment will stabilize, and after that period, the bottom line will grow much faster as the content investment will go up linearly while revenue from procured content will increase steeply.\n\n51194a6b7e5d634c94b0762e46cf2c67 --> The speaker stated that they maintain a payback period of five years for new content investment as their internal benchmark and are currently doing better than that.\n\nc6b889fa437cce6593770b72a42927a7 --> The company maintains its annual adjusted EBITDA guidance of 32% to 33%.\n\n1815a6895c025cd73b88362368787a5d --> Carvaan's revenues are expected to decline in FY '25, but the company aims to achieve single-digit mid-level profitability during the year.\n\nddab33484c100af1f0c683930c3bf809 --> Over the next four to five years, the company is looking at the video vertical to grow at a CAGR of 25%.\n\nd61bb1d90038cecbeb3027ceb6165aa9 --> The consolidated revenue of Saregama, excluding Carvaan, is expected to grow upwards of 30% on a trailing 12-month basis.\n\n937e12f617ede0f65e21d5b528d96a22 --> Vikram Mehra stated that they will ensure that Pocket Aces turns breakeven or achieves a very small profit in FY '25.\n\n76b3dfc9a6ccddb8ba876d14e84ef83c --> Vikram Mehra stated that the overall company guidance is 32% to 33% on an adjusted EBITDA basis.\n\nfb8cd1578fcb145f370b9fc0e58fb13a --> Vikram Mehra provided guidance that profitability at the PBT level is expected to double in the next 3 to 3.5 years.\n\nfb8cd1578fcb145f370b9fc0e58fb13a --> Vikram Mehra stated that PBT is expected to double over the next 3 to 3.5 years, and adjusted EBITDA is projected to be 32% to 33% in the long term.\n\ne8867ac3667b8320f34079ef3d4c7cb4 --> The speaker stated that over the next 18 to 24 months, the subscription business is expected to take off, contributing to overall profitability.\n\n5f906e9ad09dccae8505001672ddfd30 --> Vikram Mehra provided guidance on FY '25 consolidated revenue growth and adjusted EBITDA, as well as a longer-term revenue and profitability outlook.", "citations": ["51194a6b7e5d634c94b0762e46cf2c67", "c6b889fa437cce6593770b72a42927a7", "1815a6895c025cd73b88362368787a5d", "ddab33484c100af1f0c683930c3bf809", "d61bb1d90038cecbeb3027ceb6165aa9", "937e12f617ede0f65e21d5b528d96a22", "76b3dfc9a6ccddb8ba876d14e84ef83c", "fb8cd1578fcb145f370b9fc0e58fb13a", "e8867ac3667b8320f34079ef3d4c7cb4", "5f906e9ad09dccae8505001672ddfd30"]}}}, {"topic": "Licensing revenue growth", "data": {"['Q1', '2023']": {"answer": "94709b3647cd3808c6ffde712cf8d134 --> Vikram Mehra stated that music licensing is projected to grow by 22% to 23% year-on-year for the next three to five years.", "citations": ["94709b3647cd3808c6ffde712cf8d134"]}, "['Q1', '2024']": {"answer": "f056c59775775944854f4995f49abf01 --> The management team stated that overall music licensing revenue should grow at a rate of 22% - 23% this year.", "citations": ["f056c59775775944854f4995f49abf01"]}, "['Q1', '2025']": {"answer": "45e5390ca0a3699196f4e006db66ff01 --> The aim for the music vertical, including licensing and artist management, is to grow its revenue by a minimum of 25% - 26% during the year.\n\nb9fb6466f40880a2f2bbdaecd4d50761 --> The management stated that the licensing vertical should double its revenue in 3 – 3.5 years, with a 25% to 26% growth year-on-year.\n\n75b17cfb8b890731ff0625c73157018a --> Vikram Mehra stated that the music business is on track for a 26% year-on-year increase.\n\n322ab802fd65ecc6fa8051317d005e15 --> Vikram Mebhra stated that the music and licensing business, excluding Carvaan, is expected to grow by at least 26% by the end of the year.\n\n03e8f6a17c9b50abf4dd83ae54750c85 --> Akhil Gulecha indicated that music licensing should be on track for 25% to 30% growth in the next quarter.\n\n28d42909c555fd2e1f0a75b121b15ed0 --> Vikram Mebhra stated that 70% of the cost of production should be recovered before the release of the film by licensing the TV and the digital rights of the film.\n\nc544e0e1e0d0c77d9ed003b8de5ee5db --> The combined number for licensing and artist management is expected to grow at 26% year-on-year.", "citations": ["45e5390ca0a3699196f4e006db66ff01", "b9fb6466f40880a2f2bbdaecd4d50761", "75b17cfb8b890731ff0625c73157018a", "322ab802fd65ecc6fa8051317d005e15", "03e8f6a17c9b50abf4dd83ae54750c85", "28d42909c555fd2e1f0a75b121b15ed0", "c544e0e1e0d0c77d9ed003b8de5ee5db"]}, "['Q2', '2023']": {"answer": "17815e54a065a5d7338eef1e3c6a03e0 --> The speaker stated that music licensing is expected to grow by 22% to 25% year-on-year on a short to medium term basis.", "citations": ["17815e54a065a5d7338eef1e3c6a03e0"]}, "['Q2', '2024']": {"answer": "b30a1c6cb83bcb1ea481497072f05ee7 --> And when we are guiding for 27% to 28% consolidated growth are we expecting the music licensing business to grow at a similar rate or basically how much of that will be coming from music license?\n\nfbaa183e2724021d7475b5858c84d483 --> Vikram Mehra indicates a 27% to 28% growth combined for both businesses, excluding potential additional growth from the streaming business.\n\nfbaa183e2724021d7475b5858c84d483 --> Vikram Mehra states a near-term growth target of 22-23% for the music licensing side.\n\n2834f462abb4dff4ad14639e8528db34 --> The management mentioned that licensing revenue is growing at 22-23% per year.", "citations": ["b30a1c6cb83bcb1ea481497072f05ee7", "fbaa183e2724021d7475b5858c84d483", "2834f462abb4dff4ad14639e8528db34"]}, "['Q3', '2023']": {"answer": "2ad0f9465767db12cf5a37117538ec8a --> The music business achieved its highest quarterly revenue at INR 154 crores, with the Music segment growing by 25% year-on-year to reach INR 433 crores in revenue over a 9-month period.\n\nceab43e38c560a05fa9bc863cb91b887 --> Vikram Mehra stated that the company is holding themselves to growth rates of between 22% to 25% on both the music licensing and films business.\n\nd8520b9f2f930a5a9b88b5f02cf427f5 --> Vikram Mehra stated that music licensing is expected to grow between 22% to 25% and the Films, Events, and Series business is expected to grow at 25% on an annual basis.\n\n8b6f95350627c8c96f2566b0418dff2b --> The CEO expects a 22% to 25% annual growth in music licensing over the next 3 to 5 years.", "citations": ["2ad0f9465767db12cf5a37117538ec8a", "ceab43e38c560a05fa9bc863cb91b887", "d8520b9f2f930a5a9b88b5f02cf427f5", "8b6f95350627c8c96f2566b0418dff2b"]}, "['Q3', '2024']": {"answer": "e6131d4c69054f18c7c2297c2bddade0 --> Vikram Mehra mentioned that the music licensing vertical has been growing at 23% CAGR for the last 5 years.\n\n6c0a2591f9614ed88d3b22e6e8bd4102 --> The management stated that the music licensing business is expected to double its revenues in the next 3 to 3.5 years.\n\nbe676f055bc23e422e43781488888195 --> Mr. Vikram Mehra (Managing Director) stated an aim for a 25% increase in digital content licensing revenue by the end of the next fiscal year.\n\n5e006c9766cc354548443cda9ce08457 --> Vikram Mehra projected that in the next 12 to 18 months, the remaining audio OTT platforms will move behind a paywall, potentially increasing music label revenues from audio OTT platforms by 2 to 3 times.", "citations": ["e6131d4c69054f18c7c2297c2bddade0", "6c0a2591f9614ed88d3b22e6e8bd4102", "be676f055bc23e422e43781488888195", "5e006c9766cc354548443cda9ce08457"]}, "['Q4', '2023']": {"answer": "e5012f91e54d0bf92d428f97ca0fe24e --> Vikram Mehra mentioned a 23% increase in music licensing revenue.\n\n16c969879f902b7081423b3af0ab3759 --> Vikram Mehra stated that music licensing revenue is expected to grow between 22% to 25%, Films, Series, Events business will grow around 25% during the year, and adjusted EBITDA for the company should be between 32% to 33%.\n\n11dfff5a12a6b8db4baacb821b3a2a3c --> Vikram Mehra confirmed holding onto the growth guidance of 22% to 25% in the licensing business for FY'24.", "citations": ["e5012f91e54d0bf92d428f97ca0fe24e", "16c969879f902b7081423b3af0ab3759", "11dfff5a12a6b8db4baacb821b3a2a3c"]}, "['Q4', '2024']": {"answer": "b97e1b0af33e59d3fef21e9dbe4e0347 --> Vikram Mehra confirmed a 30% plus growth in pure music licensing revenue for FY '25.", "citations": ["b97e1b0af33e59d3fef21e9dbe4e0347"]}}}, {"topic": "Cost management strategies", "data": {"['Q1', '2023']": {"answer": "449b24e8ff5a197d5d3cefebf24f20a5 --> The management team is recommending a change in the useful life of music assets from 6 years to 10 years with a higher amortization in the first two years, followed by a straight-line method. Specifically, 20% of the cost will be charged off in year one, 15% in year two, and the balance on a straight-line basis from year three to year ten.\n\nc484c2dfec6befea2710d89356c554d4 --> No specific guidance with clear metrics, timelines, or actionable objectives was found in the transcript.", "citations": ["449b24e8ff5a197d5d3cefebf24f20a5", "c484c2dfec6befea2710d89356c554d4"]}, "['Q1', '2024']": {"answer": "f0c3d5a3154fdeaec7a4d227449a0e5c --> The management has stated that royalty expenses are now being paid on a quarterly basis and this is a steady state.\n\nb90653223aef46101118e10af57ff707 --> Vikram Mehra stated that the cost of the content is going to be written off in a 10-year horizon, with the largest chunk being written off in year 1.", "citations": ["f0c3d5a3154fdeaec7a4d227449a0e5c", "b90653223aef46101118e10af57ff707"]}, "['Q2', '2023']": {"answer": "383f2431cf297d0f955bc8a4695cfc26 --> Vikram Mehra stated that the company is maintaining its investment guidance of 220 to 230 crore for FY2023.\n\n4ff081d5a73e98e8be6180fcf3d87708 --> Vikram Mehra stated that expenses will initially grow at a similar pace as revenue, but over the short to medium run, the growth in expenses will slow down compared to revenue growth.", "citations": ["383f2431cf297d0f955bc8a4695cfc26", "4ff081d5a73e98e8be6180fcf3d87708"]}, "['Q2', '2024']": {"answer": "8ee688ce2f4b60c23cd6018cf593f348 --> No explicit guidance with clear metrics, timelines, or actionable objectives is present in the transcript provided.", "citations": ["8ee688ce2f4b60c23cd6018cf593f348"]}, "['Q4', '2023']": {"answer": "9b9357816c501f4b84f0460410ef9c16 --> The management stated that necessary revisions will be made in the financials once the demerger scheme is effective.\n\nc7a3a208ad06e533e25cc2a77fd240c0 --> The capital allocation to the Film, Series, and Events business will never exceed 18% of the capital deployed at any particular time in the company.", "citations": ["9b9357816c501f4b84f0460410ef9c16", "c7a3a208ad06e533e25cc2a77fd240c0"]}, "['Q4', '2024']": {"answer": "b5ed9d3dceca637bf83d84a0ebed34cd --> The CFO projected a 10% increase in net income for the upcoming quarter.\n\nb210b972e8f899b0902f86c18edc33aa --> Vikram Mehra confirmed a payback period guidance of five years for content cost recovery.", "citations": ["b5ed9d3dceca637bf83d84a0ebed34cd", "b210b972e8f899b0902f86c18edc33aa"]}}}, {"topic": "Debt elimination and cash surplus utilization", "data": {"['Q2', '2023']": {"answer": "77355ff77a0519a269363c4a082b0f55 --> In line with our financial stability goals, we aim to reduce our debt by $50 million over the next six months through strategic asset sales and improved cash flow management.", "citations": ["77355ff77a0519a269363c4a082b0f55"]}, "['Q3', '2024']": {"answer": "be676f055bc23e422e43781488888195 --> Mr. Pankaj Chaturvedi (CFO) mentioned plans to reduce debt by 20% within the next 12 months.", "citations": ["be676f055bc23e422e43781488888195"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New product launches", "data": {"['Q1', '2023']": {"answer": "91cec2d40af02c82e6a17c68aa2e757e --> The speaker mentioned a potential formal launch of new Carvaan product variants in Q3.", "citations": ["91cec2d40af02c82e6a17c68aa2e757e"]}, "['Q1', '2024']": {"answer": "f0651515f3356058820199fb8c5a1710 --> The Managing Director mentioned plans to launch new music products by the end of the fiscal year.", "citations": ["f0651515f3356058820199fb8c5a1710"]}, "['Q2', '2023']": {"answer": "f3e51dd5dfdb3515861f2d638958a441 --> The management indicated that most of the releases for Yoodlee will be in the third and fourth quarters.\n\n77355ff77a0519a269363c4a082b0f55 --> We are set to launch three new product lines by the third quarter of next year, which will enhance our market offerings and drive growth in our consumer segment.", "citations": ["f3e51dd5dfdb3515861f2d638958a441", "77355ff77a0519a269363c4a082b0f55"]}, "['Q2', '2024']": {"answer": "0abc1dd006339d630fb9fa8daedcb227 --> The company plans to introduce a Carvaan targeted at the zero-to-12-year-old age group.\n\na58afc666bf5b6c4050baebb2a5b17f6 --> The management mentioned the upcoming launch of a music learning app, which will utilize artificial intelligence, and will be available on both Android and Apple Store.\n\n9ea8504d828915ed2b6556d49f6468b4 --> The speaker mentioned that the learning app launched by the music label offers the opportunity for the best-performing users to release songs or music albums with Saregama.", "citations": ["0abc1dd006339d630fb9fa8daedcb227", "a58afc666bf5b6c4050baebb2a5b17f6", "9ea8504d828915ed2b6556d49f6468b4"]}, "['Q3', '2024']": {"answer": "be676f055bc23e422e43781488888195 --> Mr. Vikram Mehra (Managing Director) highlighted a target of launching 50 new Carvaan models in the next two quarters.\n\nf96a29cf0c10398d17310d6162b6542f --> The CEO mentioned the planned launch of a music learning app in March or April this year.\n\n9b6144f3ac01158476a22afacc007393 --> The CEO stated that the company expects to launch three new product lines by the end of Q3 2024.\n\n24fba4327efe0d2d4d9b4f7ce964be33 --> The CEO confirmed a plan to launch 50 new music albums in the next six months.\n\n34199ef7d88de8e96eb0e24ce9d8f6a8 --> The CEO confirmed the launch of a new content platform by the end of 2024.", "citations": ["be676f055bc23e422e43781488888195", "f96a29cf0c10398d17310d6162b6542f", "9b6144f3ac01158476a22afacc007393", "24fba4327efe0d2d4d9b4f7ce964be33", "34199ef7d88de8e96eb0e24ce9d8f6a8"]}}}, {"topic": "Content catalog expansion", "data": {"['Q2', '2024']": {"answer": "c0fd80403ce4ef50d860af5122945b2f --> The Managing Director stated that the company aims to release 200 new songs by the end of the fiscal year.", "citations": ["c0fd80403ce4ef50d860af5122945b2f"]}, "['Q3', '2023']": {"answer": "b20cac323b442739305b183e9f291aaf --> The Managing Director mentioned a plan to release 10 new music albums by the end of Q4 FY '23.", "citations": ["b20cac323b442739305b183e9f291aaf"]}, "['Q3', '2024']": {"answer": "a3b1b00344ad8b092030483acc6dbe08 --> The company plans to invest over INR1,000 crores in new content over the next 3 to 3.5 years, funded by internal accruals and QIP money.\n\n70e4515a2bab085bee12a7242a8cfd5f --> Saregama plans to groom young musical prodigies with the aim of having a Taylor Swift or Justin Bieber equivalent artist in 3 to 4 years.", "citations": ["a3b1b00344ad8b092030483acc6dbe08", "70e4515a2bab085bee12a7242a8cfd5f"]}, "['Q4', '2024']": {"answer": "e4fc9a80bd48bf187de27631047b464a --> The second movie, which was planned for Q4, is now going to get released in the month of June.\n\nc6b889fa437cce6593770b72a42927a7 --> The company plans to invest over INR1,000 crores in new music content over the next three years.", "citations": ["e4fc9a80bd48bf187de27631047b464a", "c6b889fa437cce6593770b72a42927a7"]}}}, {"topic": "Technology integration and advancements", "data": {}}, {"topic": "Carvaan product strategy", "data": {}}, {"topic": "AI-driven marketing tools", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "International market penetration", "data": {"['Q1', '2024']": {"answer": "c7793d45b2229f8b3194684c228e9af6 --> The CFO provided guidance on achieving a new market entry by the end of Q4 2023.", "citations": ["c7793d45b2229f8b3194684c228e9af6"]}, "['Q1', '2025']": {"answer": "88fb72c5ff3e940018184f7e63167bed --> Multiple shows are planned in India and UAE in the coming quarters.", "citations": ["88fb72c5ff3e940018184f7e63167bed"]}, "['Q2', '2023']": {"answer": "77355ff77a0519a269363c4a082b0f55 --> We are targeting a 20% increase in our international sales by the end of this fiscal year, supported by our recent expansion into the European and Asian markets.", "citations": ["77355ff77a0519a269363c4a082b0f55"]}}}, {"topic": "Strategic alliances and collaborations", "data": {"['Q2', '2024']": {"answer": "197a829196a2e4bbc3cfdad24f621ef3 --> The speaker indicated a plan to convince artists signed with Saregama to give their brand sponsorship mandate to Pocket Aces, and influencers signed by Pocket Aces to give their live mandate to Saregama.\n\n3fa152b16f59b27b0cebbae8a08d4cfb --> Within the next 15 to 18 months, their acquisition will be close to 92%.\n\n82f7c764b498e42fe5d5473fd284eeb4 --> Vikram Mehra (Inferred as CEO) mentioned that a decision on the Events business will be made after 18 months.", "citations": ["197a829196a2e4bbc3cfdad24f621ef3", "3fa152b16f59b27b0cebbae8a08d4cfb", "82f7c764b498e42fe5d5473fd284eeb4"]}, "['Q4', '2023']": {"answer": "3edbf468fe6f431d1215228133e673ef --> Vikram Mehra stated plans to engage in minority investments with potential buyouts in the music sector this year.", "citations": ["3edbf468fe6f431d1215228133e673ef"]}}}, {"topic": "Digital distribution channels", "data": {"['Q1', '2024']": {"answer": "f75c9d5868877e08e071abbf580b9b74 --> Vikram Mehra stated that the listing of Digidrive Distributors Limited is expected to be done in the last week of August 2023.", "citations": ["f75c9d5868877e08e071abbf580b9b74"]}, "['Q1', '2025']": {"answer": "2e10724c11b8c9b4c5dd0045d7b128c6 --> Vikram Mehra mentioned that the retail network for Carvaan will be cut down over the next 2 quarters and will become only an e-commerce and a modern trade product by the end of the financial year.\n\nf8447823058d56a3d1429901a12dedba --> Vikram Mehra suggested that telecom-led OTT platforms are expected to move behind a paywall within the next 18 to 24 months.", "citations": ["2e10724c11b8c9b4c5dd0045d7b128c6", "f8447823058d56a3d1429901a12dedba"]}}}, {"topic": "Market share expansion and positioning", "data": {"['Q1', '2025']": {"answer": "c9ae0d79b6e1dccab664ca4b86f4b6b9 --> The speaker discussed a strategic plan to transition Saregama from the no. 2 label to the no. 1 label in the country over a 3-year period by making significant investments in new content.", "citations": ["c9ae0d79b6e1dccab664ca4b86f4b6b9"]}, "['Q3', '2023']": {"answer": "6bd3da71eb0941f6089dd8634442b12e --> The company expects to be at the number one position in the next 12-18 months across all major languages in India.", "citations": ["6bd3da71eb0941f6089dd8634442b12e"]}}}, {"topic": "Regional market focus", "data": {"['Q1', '2024']": {"answer": "2795e94069acad53f7c88def5d3aec6f --> Vikram Mehra stated that Saregama will invest in multiple languages to take leadership positions.", "citations": ["2795e94069acad53f7c88def5d3aec6f"]}, "['Q1', '2025']": {"answer": "1676d51fd9c1766918a8266fe06f0d73 --> The CEO confirmed a target to launch five new regional music labels by the end of Q4.", "citations": ["1676d51fd9c1766918a8266fe06f0d73"]}, "['Q2', '2024']": {"answer": "08b6d751a054c3d368e2448496f48fc4 --> The Managing Director mentioned a focus on the domestic market for the events vertical, which will start reflecting in Q3 and Q4.", "citations": ["08b6d751a054c3d368e2448496f48fc4"]}, "['Q4', '2023']": {"answer": "77735b85fbf333bf8dfa07b973563105 --> The management expects a significant advantage as India moves towards subscription due to their larger share of South Indian languages’ content.\n\ncfd788788c0086ed371ed03baccba1d6 --> The management plans to take a leadership position in Hindi and Tamil music content.\n\ndce83b2ed91cebc91fc71781988d0954 --> Vikram Mehra mentioned a plan to acquire minority stakes in regional music companies, with the intention to move to an absolute majority within three to five years.", "citations": ["77735b85fbf333bf8dfa07b973563105", "cfd788788c0086ed371ed03baccba1d6", "dce83b2ed91cebc91fc71781988d0954"]}, "['Q4', '2024']": {"answer": "0bb8f55e1c51053d708d881478495b52 --> A completely different approach will be taken in FY '25 for the live events business.", "citations": ["0bb8f55e1c51053d708d881478495b52"]}}}]}, {"theme": "Operational Efficiency and Strategy", "topics": [{"topic": "Cost management practices", "data": {"['Q1', '2024']": {"answer": "3565ad5f27ec66f22139704dffbef317 --> Vikram Mehra confirmed a payback period of 60 months for the amount spent to acquire content.", "citations": ["3565ad5f27ec66f22139704dffbef317"]}, "['Q1', '2025']": {"answer": "97ef122560f4b8d7792b1089dc0005d7 --> End of the year, you will find Pocket Aces at a breakeven level.", "citations": ["97ef122560f4b8d7792b1089dc0005d7"]}, "['Q2', '2024']": {"answer": "4ed3f60f8304a4e56d636b3e825777a3 --> Vikram Mehra mentioned that they plan to achieve cost savings by negotiating better deals with influencers through Pocket Aces.", "citations": ["4ed3f60f8304a4e56d636b3e825777a3"]}, "['Q3', '2024']": {"answer": "85e0c8ff73d77ee291d656fc37bf8d5b --> The management team stated that the payback periods for new investments are expected to be 5 years.\n\n05a9780e7234864783913246f7beaf52 --> Vikram Mehra stated that the payback period cannot exceed 5 years.\n\n34199ef7d88de8e96eb0e24ce9d8f6a8 --> The CFO mentioned plans to reduce inventory levels by 15% by the end of Q3 2024.", "citations": ["85e0c8ff73d77ee291d656fc37bf8d5b", "05a9780e7234864783913246f7beaf52", "34199ef7d88de8e96eb0e24ce9d8f6a8"]}}}, {"topic": "Process optimization", "data": {"['Q1', '2023']": {"answer": "28c7baab329853f3617ec676503f7006 --> Pankaj Chaturvedi mentioned an expected timeline for the process with NCLT after SEBI clearance.", "citations": ["28c7baab329853f3617ec676503f7006"]}, "['Q1', '2024']": {"answer": "aefe298fb7fd400f75a7dac01f7da575 --> Vikram Mehra mentioned the closure of a pending settlement matter by Q2.\n\n3b18f8f1231e30642368c430a70c0fda --> Vikram Mehra mentioned that they will re-evaluate the events business over the next 12 to 18 months.", "citations": ["aefe298fb7fd400f75a7dac01f7da575", "3b18f8f1231e30642368c430a70c0fda"]}, "['Q2', '2023']": {"answer": "386ae57afdcfdcf404bb798329e50bc8 --> The demerger is expected to be completed by March 2023.", "citations": ["386ae57afdcfdcf404bb798329e50bc8"]}, "['Q3', '2023']": {"answer": "fb52b95310b7cf50c0d0c0352d655752 --> Pankaj Chaturvedi stated that the final order for the demerger should come before 31st March.", "citations": ["fb52b95310b7cf50c0d0c0352d655752"]}, "['Q4', '2024']": {"answer": "0bb8f55e1c51053d708d881478495b52 --> The company needs one more year to prove the live events model, after which tough decisions will be taken if necessary.", "citations": ["0bb8f55e1c51053d708d881478495b52"]}}}, {"topic": "Technological integration", "data": {}}, {"topic": "Resource allocation optimization", "data": {"['Q1', '2024']": {"answer": "0b73b28cb1aea48051d68b5785556c31 --> The management communicated that the total capital deployed in the films and series segment and the live event segment will never exceed 18% of total capital deployed.", "citations": ["0b73b28cb1aea48051d68b5785556c31"]}, "['Q2', '2024']": {"answer": "c2c9c7546115952a8c024682074eca98 --> The capital allocation to the films, series, and Events business will not exceed more than 18% of the total capital allocated.", "citations": ["c2c9c7546115952a8c024682074eca98"]}, "['Q4', '2024']": {"answer": "1815a6895c025cd73b88362368787a5d --> The management plans to completely exit individual shops for Carvaan retailing over the next few months, with implications on manpower structure.", "citations": ["1815a6895c025cd73b88362368787a5d"]}}}, {"topic": "Lean management practices", "data": {}}]}, {"theme": "Customer Engagement and Experience", "topics": [{"topic": "Enhanced user experience", "data": {}}, {"topic": "Brand loyalty programs", "data": {}}, {"topic": "Customer feedback mechanisms", "data": {}}, {"topic": "Engagement metrics analysis", "data": {}}, {"topic": "Subscription model improvements", "data": {"['Q1', '2025']": {"answer": "1676d51fd9c1766918a8266fe06f0d73 --> The COO announced a plan to increase streaming subscribers by 30% over the next six months.", "citations": ["1676d51fd9c1766918a8266fe06f0d73"]}}}]}, {"theme": "Content and Licensing Strategy", "topics": [{"topic": "Music licensing strategy", "data": {"['Q1', '2023']": {"answer": "b8aa04a51b1f83d067c2ada9edbc8908 --> The speaker mentioned that many of the films whose music has been acquired over the last six months will start getting released from the Q4 of this year and a large number may be in FY2023-24.", "citations": ["b8aa04a51b1f83d067c2ada9edbc8908"]}, "['Q3', '2023']": {"answer": "48cb77c78de1a95d3ec421bb53ebb724 --> Vikram Mehra explained the timeline for music acquisition for films, indicating that Hindi film acquisition typically happens 8 to 15 months in advance of the release, while Tamil and Telugu music is acquired 6 to 9 months in advance for larger films, and about a month earlier for smaller budget films.", "citations": ["48cb77c78de1a95d3ec421bb53ebb724"]}, "['Q4', '2024']": {"answer": "6dfd202a5971fddccce208dac658d7ea --> The goal is to acquire 25% to 30% of all new music to be released in India over the next few years.", "citations": ["6dfd202a5971fddccce208dac658d7ea"]}}}, {"topic": "Licensing agreements", "data": {"['Q4', '2023']": {"answer": "c273524e282e48fb5dce0c5fc505e8a8 --> The management team mentioned that singers will be paid 25% of all the public performance revenue that Saregama India Limited creates.", "citations": ["c273524e282e48fb5dce0c5fc505e8a8"]}}}, {"topic": "Content creation partnerships", "data": {"['Q1', '2024']": {"answer": "0822fad7d7c09e7c01bc01e1958deaa5 --> For Q3, Q4, the lineup is very strong.\n\n4004495ec5a681be9576f7e9e15ad022 --> Vikram Mehra stated the goal of acquiring 30% of all new content coming in.", "citations": ["0822fad7d7c09e7c01bc01e1958deaa5", "4004495ec5a681be9576f7e9e15ad022"]}, "['Q1', '2025']": {"answer": "a9272bbac94fb4e8df9a5a5e2813ff96 --> The company will be investing over INR 1,000 crores in new music content over the next 3 years.\n\nf99a2d5db5d6b6b3ed7c9ca54d4c400c --> Vikram Mebhra stated that the content expenditure will incrementally increase over the next four to five quarters before stabilizing.\n\nd003d884b1030a576e8a9d63cac11b9f --> Vikram Mebhra provided an estimate for content acquisition over the next three years.\n\n1765149203a4b65c343a7ded312a72a4 --> Vikram Mehra stated that the content investment in FY '25 will be 50% higher than in FY '24, leading to a high content charge-off in FY '25.", "citations": ["a9272bbac94fb4e8df9a5a5e2813ff96", "f99a2d5db5d6b6b3ed7c9ca54d4c400c", "d003d884b1030a576e8a9d63cac11b9f", "1765149203a4b65c343a7ded312a72a4"]}, "['Q2', '2023']": {"answer": "a59db4a9cf88a5eccb766798a682d99f --> The management team mentioned that many of the films whose music they have acquired will start getting released from Q4 of this year and may go to Q1 and Q2 of the next financial year.\n\nb2d8b7d5a38f0e7cd59f9d509bf6eebb --> Vikram Mehra stated that bigger Hindi movies will start coming from Q4 or Q1, FY24 onwards.", "citations": ["a59db4a9cf88a5eccb766798a682d99f", "b2d8b7d5a38f0e7cd59f9d509bf6eebb"]}, "['Q3', '2023']": {"answer": "cc6a886a3b748c10021cf6945f8a86f8 --> Vikram Mehra stated that the next season of Disco Dancer will be happening in the financial year '24.\n\nc2f6caf537e7452d00cf40826012f59b --> Vikram Mehra explained that many films are expected to be released in Q4 of the current financial year and Q1 and Q2 of the next financial year.", "citations": ["cc6a886a3b748c10021cf6945f8a86f8", "c2f6caf537e7452d00cf40826012f59b"]}, "['Q3', '2024']": {"answer": "92bf1f7cc687a47ef3c7298bb37e572c --> The speaker stated that three Dharma Production films will be released over the next 7 to 8 months.\n\n92bf1f7cc687a47ef3c7298bb37e572c --> The speaker mentioned the release of four Jio Studio films, including Stree 2 and Akshay Kumar's Sky Force, over the same time period.\n\nbab24fa053f8270d30016977bc09f2d9 --> Saregama plans to continue increasing investment in new intellectual property (IP) to grow their artists and monetize them further.", "citations": ["92bf1f7cc687a47ef3c7298bb37e572c", "bab24fa053f8270d30016977bc09f2d9"]}, "['Q4', '2023']": {"answer": "46541e7b2aea08a2959f59872b5c0f00 --> The speaker mentioned the plan to release a specific number of films in the current financial year.", "citations": ["46541e7b2aea08a2959f59872b5c0f00"]}, "['Q4', '2024']": {"answer": "73356dc601d0b979fedcc259d064847c --> The management indicated that their line-up for the next 12 months is all in place, including major film music projects.\n\n5710a7d6fc017dfcbc3154ef8a5699fd --> Vikram Mehra stated that there will be a content investment of INR1,000 crores over the next three years.", "citations": ["73356dc601d0b979fedcc259d064847c", "5710a7d6fc017dfcbc3154ef8a5699fd"]}}}, {"topic": "Multi-language releases", "data": {"['Q1', '2024']": {"answer": "0822fad7d7c09e7c01bc01e1958deaa5 --> We have one movie of ours, which is getting released in Q2.", "citations": ["0822fad7d7c09e7c01bc01e1958deaa5"]}}}, {"topic": "Revenue stream diversification", "data": {"['Q2', '2023']": {"answer": "b2d8b7d5a38f0e7cd59f9d509bf6eebb --> Vikram Mehra provided guidance on aiming to pick 30% of all content coming out in the year, with an estimate of roughly 800 crore worth of new content at the industry level.", "citations": ["b2d8b7d5a38f0e7cd59f9d509bf6eebb"]}, "['Q4', '2024']": {"answer": "c3d09ac5654dd911a241a6ddcdfb9280 --> The company plans to spend INR1,000 crores over three years on the music business.", "citations": ["c3d09ac5654dd911a241a6ddcdfb9280"]}}}]}, {"theme": "Digital Transformation and Growth", "topics": [{"topic": "Increased digital access", "data": {}}, {"topic": "Streaming platform enhancements", "data": {}}, {"topic": "Digital platform monetization", "data": {}}, {"topic": "AI integration strategies", "data": {"['Q2', '2023']": {"answer": "5e6d53c5aa5a3738ca5944fbf6e5b180 --> Vikram Mehra indicated a strategic focus on technology and data science as pillars for growth in the future.", "citations": ["5e6d53c5aa5a3738ca5944fbf6e5b180"]}, "['Q4', '2023']": {"answer": "5948b590c0bb760f30515e340357640c --> The management mentioned that investments in Artificial Intelligence are expected to help significantly in the next two to three years.", "citations": ["5948b590c0bb760f30515e340357640c"]}}}, {"topic": "Digital content consumption growth", "data": {"['Q1', '2024']": {"answer": "c7793d45b2229f8b3194684c228e9af6 --> The CEO announced plans to increase digital sales by 30% over the next fiscal year.", "citations": ["c7793d45b2229f8b3194684c228e9af6"]}, "['Q2', '2024']": {"answer": "5f02e249109de4b31d06e9a47ea771d6 --> The speaker indicated that the impact on OTT streaming and short format apps would start appearing with a lag of 3-12 months due to the nature of deals.", "citations": ["5f02e249109de4b31d06e9a47ea771d6"]}, "['Q3', '2024']": {"answer": "d5b730b3d1141285da3df1fa6d2c9c40 --> The CEO projected a 20% increase in digital revenue by the end of the fiscal year.", "citations": ["d5b730b3d1141285da3df1fa6d2c9c40"]}}}]}, {"theme": "Market Performance and Positioning", "topics": [{"topic": "Competitive positioning", "data": {}}, {"topic": "Regional language advantage", "data": {"['Q1', '2024']": {"answer": "b6db3413484006702d35e8157c744450 --> For the next quarter, the management anticipates strong performance with the release of \"Rocky Aur Rani Ki Prem Kahani\" and its songs, expecting continued traction domestically and internationally.", "citations": ["b6db3413484006702d35e8157c744450"]}}}, {"topic": "Market leadership and influence", "data": {"['Q1', '2025']": {"answer": "6fba68c5f809e9037513cae7558ed056 --> Vikram Mehra mentioned that June became completely stable and July has been going very steady for the company.", "citations": ["6fba68c5f809e9037513cae7558ed056"]}}}, {"topic": "Studio reputation leverage", "data": {}}, {"topic": "Brand positioning efforts", "data": {}}]}, {"theme": "Music Industry and Content Trends", "topics": [{"topic": "India music industry trends", "data": {}}, {"topic": "Independent music growth", "data": {"['Q4', '2024']": {"answer": "51194a6b7e5d634c94b0762e46cf2c67 --> The speaker is confident that the catalogue part of their music will continue growing at a minimum of 12% per annum.", "citations": ["51194a6b7e5d634c94b0762e46cf2c67"]}}}, {"topic": "Subscription services impact", "data": {"['Q2', '2023']": {"answer": "cb58a999a4249ee5e10fef269a653dc8 --> Vikram Mehra indicated that they expect the music subscription economy to start growing in India in the next 18 to 24 months.", "citations": ["cb58a999a4249ee5e10fef269a653dc8"]}}}, {"topic": "Regional music expansion", "data": {}}, {"topic": "Non-film music strategy", "data": {"['Q3', '2023']": {"answer": "453f67af3547427e678f0eb2e65b36f2 --> Vikram Mehra mentioned a focus on Live Events being only music-related and mostly IP-related.", "citations": ["453f67af3547427e678f0eb2e65b36f2"]}}}]}, {"theme": "Advertising and Marketing Strategies", "topics": [{"topic": "Strategic marketing efforts", "data": {"['Q1', '2023']": {"answer": "5bce33c2483cfc9a21eecb91d3b47972 --> Vikram Mehra stated the change in marketing expense allocation to 20% in year one, 15% in year two, and 8.125% for the next eight years.", "citations": ["5bce33c2483cfc9a21eecb91d3b47972"]}, "['Q2', '2023']": {"answer": "9088a487f7d0484f690640db67fb3fae --> The management team stated that they will not be promoting or spending any above-the-line marketing monies in Q3.", "citations": ["9088a487f7d0484f690640db67fb3fae"]}, "['Q2', '2024']": {"answer": "639db1642ae96c4a9ab5d8cc24d6107f --> The speaker stated that digital advertising is expected to grow to account for 45% of all advertising by 2024.\n\n53112930f9e323e35841944388047962 --> Vikram Mehra mentioned that there will be a large number of films released in Q4 with corresponding marketing costs.", "citations": ["639db1642ae96c4a9ab5d8cc24d6107f", "53112930f9e323e35841944388047962"]}, "['Q3', '2023']": {"answer": "66734fd202a88e2143915d978f4f5580 --> There is no marketing push planned for Carvaan even in Q4.", "citations": ["66734fd202a88e2143915d978f4f5580"]}, "['Q3', '2024']": {"answer": "bab24fa053f8270d30016977bc09f2d9 --> Digital advertising is expected to grow at 31% per annum, and Saregama anticipates a large chunk of this investment to follow artists/influencers.", "citations": ["bab24fa053f8270d30016977bc09f2d9"]}}}, {"topic": "Social media influence", "data": {}}, {"topic": "Publicity campaigns", "data": {}}, {"topic": "Cross-platform audience growth", "data": {}}, {"topic": "Youth-focused advertising strategies", "data": {}}]}]