[
    {
        "type": "CompositeElement",
        "element_id": "6578901572c6f6c492fe678f99cb473d",
        "text": "Vikram Mehra: Thank you Bhupendra. Good evening, everyone. Q1 of FY2023 saw operating revenues of around Rs.169 Crores and a PAT of Rs.41 Crores which results in a 61% year-on-year increase in our operating income and a 52% increase in our PAT income something that we are very proud of. This is in continuation with our last year’s numbers, which had seen a 31% increase in operating revenue and a 35% increase in PAT. At the risk of sounding repetitive I will say that this is not an aberration. Quarter after quarter you are seeing Saregama’s positive results. This is just another small step in Saregama’s resurgence story that started a few years ago. We started rebuilding the foundation of the company between 2015 to 2018 and what you see now is the building rising in its full glory. This is a company which not only thrives on the richest IP catalogue that it owns but is also a company, which is building the IP for tomorrow. This is being done so that 30 -40 years down the line Saregama will continue being the number one IP company of India. Our operating income before content charge interest and depreciation was at Rs.64.7 Crores which means a 54% growth compared to last year. As you know our business is broadly divided into three verticals. The most important vertical, which is the music business, grew by 38% on a year-on-year basis in this quarter. Now this is significant, may be even better than what most other music labels in India or globally have reported. This growth\n\ncomprises of both the licensing as well as the Carvaan business.\n\nLet me start with licensing. We have been growing at over 20% on an annual basis for over three years now. This is the fourth year, and I am very happy that the growth story continues. During this quarter, we released all the songs of the super hit movie of Mahesh Babu called Sarkaru Vaari Paata. I am happy to share that the cumulative audio and video\n\nPage 2 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 2,
            "orig_elements": "eJy1VtuO2zYQ/RXCQN4sQTfbUt6SFC0WSNpts0hRbIMFJY0tdiXRJal1jKD/3jOk7L1004cgARZre0gOz8w5M8PrzwvqaaDR3ah28VIssraut2WeRlW+zqJCZpuorJImWldlmlZFU1FdL5ZiMZCTrXQSZz4vGq1Nq0bpyPrfvTzqyd10pHadgyXLkgRnZvNBta6DNd14616r0fG56+u0WscwVdUmzj8uxel3ulllceINRVnF+XOWcAaWhT1aRwPHcqk+Uf9+Lxta/IOFlhw1TunxpumltTd7o2tsS+LNJq9SbNiqntxxT/7s5buFhzzuJrnzcV0vaNwt+Io9LDfjNNRkODp27ugTR7r4oG6NHMQ76ox8Ka46Od4KRC1ed9OextbIWPykdSvojkY17pb8xRz1SLH4NRV6K378I0uyXFh5EHpPRjrsEoa3T2R5gzR6Glvxm43TdSXeGG1gl7BIcfnqindgqUhPK4dONR0c2Kl3VqgR29bpC3EkaSI9RvwJa2NIWuJlPZkHF2NFDzS7X2Uv/rOVr5w3WfxzHZ9ynXTigGOGBIcnkOqpBbQYGVFA4YE0esQdk2RKxEG5zjsENc6j+3PKkrSyIuTZLudIOtkKS8Rx5OkTPE/zNePOV4/3AXMsXjnAJGGUveWcWU5qOLonp5y6I3EBVH0PKo4hIjdjH7WDZyEBy3j04G6SxpERcsv//55/MfGcA+Bl1+/xfScHeYpsr224aGbnPjt/TZav0EBohB0ko3C0Z/BPnfBZs6OxwTVOmxmqdYyAg9/SwacTGtnpWPxO5zVD9aT6NhBGYssZCGQgH2wBq3s5HkVN7sAZx4Ur4TR/lj61B76Kg0SAyMqBofPBs19kN6hIKIhvOyGOXQ+Q95HK8y2BXs6tHnsOwyA1UPw489R0hKRcXIoGbafXO9DrQ1U4cBgtLnXeYW/1vdeTapQVj4KFm602CGbQxujDPZ7aM9WiICGJcEGeiKhI5iS2uMt76BW2nMgIQpkFTbMT3hXEK9gdI59DRX4voDb0gl+eq7aagI28OzRm0XQSBGMRkiKvi1a0tDfUqLl2JMJ2XPbrIt48LvyB5MhZXhUvxA6Roso8CgMBgMpztaEgrKfylnnkQqwncEc2ZMVo2YKUVt2pFieBhZNjyNe3Uw2yzjkkMWg4VMNeGyeB/bT6gAdOywDfzfmGJZBBpfVR5OULJlw+bk+1tKFj+AKciysWPwPoqSSt2o1qi5tGtxSDZM36Fsva5UoEkWOQqwcYCiug6FHHvXfvORGQBTRao+aOaDa+OjkaameRhCzycDjNirfKugueORgET+dp2uSU1HIbbctiExWrZBtV26aKsnaVFFm1SvJ0893m6SrbhPlZ5GFang3rch6fKSTzBYs/9L8T9VsMTFYj2kSYbTWImaurodH3Dmj7QCguGZTzRpo7CS5P2okfEnGlXE/PsZA0bZtvZBbJqkwivGLwLU3KKF3nTbUu22yVVd+RhSzeIKFlhuoMLAQDnlTzO6dYlV+whENf966psk2WfyOa3hJKZ54dYVifKfJDxVdKzVOC68MThzJD+WNahJrmP0z7fi5nbr9+PbSR0F3Hh614HkoGd/Hq0je+C4HXlX9TdHK/Pw9mOjW3MANPnRhN6YfJhGZ83zqW/DYxUAjeAxiREBc7sHrc2dPos3itGdEp7hd3itj8TmIAdeK1rCeMoL7HUbT/W2km8UFKo8SlhHLigHAGp4Xt+AFwRtlMw9RLP/Tl1CrtY+Keqh/q+GfpHxZ3dMXZf0bPdSIranMZ1UldREXW5FG1ztZRVldJnqTbomzT76bnzXod47mcJfgsWawnQ5rM6q2KLM6eM4QjX6fmfL0uVt9IzZdYEhmzmq6eaSAf/wUAP0QK",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "We have been growing at over 20% on an annual basis for over three years now.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: We have been growing at over 20% on an annual basis for over three years now."
                ]
            }
        ],
        "actuals": [
            {
                "data": "Vikram Mehra mentioned that Q1 of FY2023 saw operating revenues of around Rs.169 Crores and a PAT of Rs.41 Crores, resulting in a 61% year-on-year increase in operating income and a 52% increase in PAT income.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: Good evening, everyone. Q1 of FY2023 saw operating revenues of around Rs.169 Crores and a PAT of Rs.41 Crores which results in a 61% year-on-year increase in our operating income and a 52% increase in our PAT income."
                ]
            },
            {
                "data": "Vikram Mehra stated that the operating income before content charge interest and depreciation was at Rs.64.7 Crores, which means a 54% growth compared to last year.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: Our operating income before content charge interest and depreciation was at Rs.64.7 Crores which means a 54% growth compared to last year."
                ]
            },
            {
                "data": "Vikram Mehra noted that the music business grew by 38% on a year-on-year basis in this quarter.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: The most important vertical, which is the music business, grew by 38% on a year-on-year basis in this quarter."
                ]
            },
            {
                "data": "Vikram Mehra mentioned the licensing growth of over 20% on an annual basis for over three years.",
                "theme": "Content Strategy and Production",
                "subtheme": "Content Ownership and Licensing",
                "evidence": [
                    "Vikram Mehra: We have been growing at over 20% on an annual basis for over three years now."
                ]
            }
        ]
    },
    {
        "type": "Table",
        "element_id": "05219604ce7d4c091463b9a16c571d07",
        "text": "g Saregama India Limited August 02, 2022 Moderator: Thank you Sir. We take the next question from the line of Shubham Ajmera from SOIC Investments. Please go-ahead Sir. Shubham A jmera: Sir my first question is regarding the advertisement revenue, so as you mentioned in your opening remarks that we are seeing some trend in the downward stages for the Y ouTube revenue and advertisement so are we seeing same trend in the streaming company Sir? Vikram Mehra: We are not seeing that impact hurting us on our music business at all. What is hurting right now is the fall in the advertising revenue on TV channels because South TV serial business runs on advertising running on Sun TV itself. Shubham A jmera: Got it so do you have any idea regarding the slowdown in the revenue score in the streaming company as much? Vikram Mehra: Our streaming business is not dependent on advertising at all. Streaming business on the free side -we have a protection through a per stream rate and on the pay side we get a share of the subscription amount. So, in fact the audio streaming business for us the way our deals are structured is not dependent on advertising at all. Shubham Ajmera: Got it and my last question is regarding your plans for the Carvaan for like the next three to four years like if you can give me some broad idea regarding on the margin side which you are targeting in the next three to four years?",
        "metadata": {
            "text_as_html": "<table><tr><td>g</td><td>Saregama India Limited August 02, 2022</td></tr><tr><td>Moderator:</td><td>Thank you Sir. We take the next question from the line of Shubham Ajmera from SOIC Investments. Please go-ahead Sir.</td></tr><tr><td>Shubham A jmera:</td><td>Sir my first question is regarding the advertisement revenue, so as you mentioned in your opening remarks that we are seeing some trend in the downward stages for the Y ouTube revenue and advertisement so are we seeing same trend in the streaming company Sir?</td></tr><tr><td>Vikram Mehra:</td><td>We are not seeing that impact hurting us on our music business at all. What is hurting right now is the fall in the advertising revenue on TV channels because South TV serial business runs on advertising running on Sun TV itself.</td></tr><tr><td>Shubham A jmera:</td><td>Got it so do you have any idea regarding the slowdown in the revenue score in the streaming company as much?</td></tr><tr><td>Vikram Mehra:</td><td>Our streaming business is not dependent on advertising at all. Streaming business on the free side -we have a protection through a per stream rate and on the pay side we get a share of the subscription amount. So, in fact the audio streaming business for us the way our deals are structured is not dependent on advertising at all.</td></tr><tr><td>Shubham Ajmera:</td><td>Got it and my last question is regarding your plans for the Carvaan for like the next three to four years like if you can give me some broad idea regarding on the margin side which you are targeting in the next three to four years?</td></tr></table>",
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 10,
            "orig_elements": "eJztWO9rG0cQ/VcGfZZlW1ZqK4QUE2gxNDggN6GYYFZ3I91Gd7vX/SFFhPzvfbN7J9mOExxo05bki2zt7szOvHnzdtD1hwHX3LAJN7ocPKXBgqdq8mQxPWB1vDiYnEyeHKhpcXownh49OZ5MyuJsOh8MadBwUKUKCjYfBoW1rtRGBfbpe622NoabivWyClgZj4+OYNMtb3QZKqwen6bV1moTxO76enw0Hp0OaXxyNjp9O6T++/H0ZJIXjifTk9HJQyvZBisDv/WBG8nllX7P9axVBQ8+YqPkwEXQ1twUtfL+pnV2jmNHo5/OzqbYX+iaw7blZPrq5SBFbJZRLVNa1wM2y4Hc0GLlxsRmzk7SkCQCvw83yt9UoanF/llQ85qfPwsVqxJ/nPz7fPnsEJ/y30w5XqpG0YUptaLfdKMDl3Qel9EHOhojoaPxOB8/FOvD3tPcltvOYfn8pS3ZqWDdUxwo09JVpcyKADTNtBvRG6agVviomAyCpD8jewGBFs42abnWhskuaFbFeaUaOn/XwGnen11evECMa9gISfyIXtWsPNPSHiiJKN2SL09xdoHtfFFytg8Px6nZ0kI7fysW7UnwEBItU0yqXLML2idqYm/NJvKQvCXlU3KyDktgpo0sOLItGzF33Ci38nCjAm3gyjF5ZtnytgESjk2ykntKuzEb3Es+SJlpYV1a/4NsvIpz7q8mBZu7QUkscL3Ze1f3vXt8U43sFbZpldkKWj9/itZrvXIA6yVXt6F6k2M3NvQ3pJQ0PBWBqohQsBY9AUABoIleFzTHp2HvCUdVXYMBycjvDJw0JbxuZFGiXOBYH3GfYgYypw73V6+pAK8M157mXKgIBszQy5XseHZa1fuLXTQppju+oknFwfIsJn86eK4XX0OdXwGETriXNnGgUmspzJZ0yeoegXxtN1LcPrE+GV9YYPrZ+oBdTSyqR9foErjvvewgALJStpLByVLIcg+OvjazT01tDm3hGPEhMToAw3KmBMXqJAxnnI3LSha5D4EgBZmpnZNWbbMPuFgy7iRfCaXQ7Cn9OPeF021yqBobTUBIdijwLIRjiRGx1PahHKVVYmbQBvcIA1EGECQ1XHCxCNFJfz4Oiy8Q4WEeSJ5QEkj554QkyUILDd/39Qvl1kqZ9L3Wt3URgALxYLEFqy0r5/MJvUhkK2C11CgDmjzpyNxZyN896nXAQ4GWADFjX+miSi4EmIAdTn3YcfBzlz+agqKooO1FJgl0TB4SeKg1uyFuZwPqO6FAyYUEFKScygHEpOtdLB0yQzm40VCETBUAvdEhxT+iX5JqI2rRPdyp4LKROmjvRZ7TSYfJQNfIK2ysW8FNBKuuEMawt5SPBi+woOlj29ZbURdtspu9whSVbn0+LgxSa/iVZ1XcIeqeaRIsMA1Z4Z2kD2naeZHGlyJKD9jMGmWi8Ds67rQBWXU90QIYL3jkhzmHsL8HOiHXpLfRmr6TcMu51yBIIT3kNEsb19vcTIKnAu2lugm/QtgjRLGt2GvAc2mK1KRzRtXWnIU+VGAzWr5EJ+Uu2iBUVW4Te/k9BMtnKUCC3UO3tEkALXhWr+Rv4t1c8BBm6d1L3vWFwFHBb5IcTHCm0H0L71ylMsLD12j15UqkJwPczyMQbtHWB9zsiD2/w+xzBFdEhxc1gCJ9BwkVdrEh5jI/AfvM8mYukcizcN7uCD6ii4TmOxm0GrvuJCiB/S6azApREtBA3o/M8K/J/XfIHOpsbZmT97eND7sB7jAPiGkwleFRhsb9NHdvFntKd1r/G+4+bk6lf2PopP/LKPnPTZL0XYyI9C0HP/ox0f1dEx19J4Ma/ZjAfkxg32YCoy/NVfRfmpfo0ylIflDrf1+7EhYNPr79C5I8P/8=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "5bce33c2483cfc9a21eecb91d3b47972",
        "text": "No, nothing.\n\nRavi Jain: Sir on the newer content if you can just again summarize maybe I missed it? What was it earlier? What did you charge in the first and second year earlier and what is it now?\n\nVikram Mehra: There is no change in charging of marketing expense, Earlier, also 100% straight away was charged off in the month one itself, the same is followed now as well, so there is no change to that 20%. On the remaining 80% it was 35% in year one and then 13% for the next five years. Now what we are changing it to 20% in year one, 15% in year two and then it goes to 8.125% for the next eight years. It is a very small change right now. The net impact of that on our PAT is only Rs.1.7 Crores.\n\nRavi Jain: But I think a lot of the contents will be back ended so the benefit will come from the next few quarters? Is that true?\n\nVikram Mehra: Yes. See what we are doing here is to come in sync with the global practice because our policies were not so earlier.\n\nRavi Jain: Got it and on this live concert business can you give a sense of what is the revenue contribution this quarter?\n\nVikram Mehra: I said in my last quarter call that it is an early stage. The first year is going to be more testing the waters, but in general events business is a 5% to 10% margin business for the next couple of years. We are running the events business for profitability but more importantly to reinforce our position on the music creation and acquisition side because it is\n\nPage 6 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 6,
            "orig_elements": "eJy1V1Fv2zYQ/iuEgbxZgkRREtWXYhu2IcPaBW2xYgiKgJJONheJdEkqjlv0v+9I2kmaGkMQxH4xeOLdUfd99/F0+XUBI0yg3JXsF6/IomirLqNDnbQAZcIK0SdNnrGkaLucdS2tOWOLJVlM4EQvnECfr4tOa9NLJRzYsB7FTs/uag1ytXZooTTL0Gdv3srerdGa18G60VI573d5WdIqzZekyXnafFqSuzUr4rqqWMqOrMN+NCzszjqY/HtcyFsY329EB4tv+GCQI7jdBsKjizeLcBq1msUqHPlyAWq18BE2aLlS89SCQXvlfR3c+pdYvNVLorRbS7VKfYBDvA/SjSHL41oOfU4L3vVJ3fIsYXVVJ4JVfdI3rByGum0yXpyslpRVaY21aXha+1rt13lWZ9GQs7JK6TFL9PnfevbgoHNSq6tuFNZebYxucVuWVnnGqxcq+DtxI8kfQqpX5L00RCvi1kAUbMGQTiuHlSZyIFgI0glF/p2tI2KF+4mdp0kY+QXIJHYtkHMySWuhJ9K9Jh/XwpGtsLggIMwoweyNvexjtLUwKyAyJhyk8YFVTyxgWtyCXgfPYN96ZxkCKr19/ZAcf0rrzn0Nj/CjqPKe85omuWAiYXzosNcGmgwtLXrGgBcFPSE/aOBDTsu0iASJhqKqYnchHeq0OGqJTs9jSFmVnL4QQ/6W10ZM5A2sjXhFPqzBgMdBaQ+hihAGMLFniR6QDeYanF/A7QaUhSX5NeK4JGK0GpshOyPWGeGrScRW7AJTIiF6DDEcWDEhAdfISczhLIzDMlitmMIJBj2OeoseyAeCAbYwjkuCCdyPZ3TeigSi2VlK/orRDUzIY39QjgeSka9FeeazB/r5xJ56uFkhQmeY0ezb49YhZW8g7LMpeYsnCATdogfmDll9ZIyKqWn2XVAE90EWt9X3WXD/SoP1TjxFBjzKGQh4SHoe+kGQGzA7Yicxjoe3NWEbliX1eKEr7pyQNc7jE+qAfa5nQy5++uBjaDXuyDub5mlNfjHagE2f2l8t9BVveZ1ULAPUX1omXGQiyZpGlAWlgtP8dP1VZv7uyhmlewE+GBqaZndyWx63BKfn9RfPeM5eXoF/nh3KqL/9rhHXUe/xgoMSI8clooxi24rumoDqkf2R8GhUMHgS+x2dxhYZjJ4e0BW25PMsjANjX5NzG3ngzAxP1tKhHnjTDmVSllmbMJrnieAVS6hgHRVFM/Tl6bEuGY9AHgxVzh9creVRS3R6HtY1xd9JtPQf7DPyHuA76ei1142DgqEOBCz9fbtTHaKLgugxXY26FSPZGOxq2Xn4OzFbCF290aPsJHhFxCg4TnmO7O/SJzf20A6UlwBJU9M6YT0i3raiSErRlnktsrIW5cnBrupif3HuDTWjj6D90RKdngk2jrvFyzf274iBjPNNmLAQ2dFfH9jXHRhH2tlKBdaGGctPRyv/VOAwpDymw930E++tG1BzFAUj29m/R4y57+8nNzRrIWtRoRPOG/wQqYsm4X3Okqxg3dDxouXVcMLhqAxzTt3Uh+EoGhrE8V6q2VFLdHqmeFN0P0lDn+NsguMtNuu0I5jUHRBBXFGVg+LKeGur0JB4bzsMHq/pOAOHmQB3rIIOYP+3fg7CPsZ6h6nKU2ArvIwvkTfOZ1uh9htUA08MvCTu2BTGA5whnB+6zvxkhkPJ/ePvRotOz5sxcG0/XnyMemRmpQ5pH8f3AbCseO2IVo7S7cKBwmlx3tDGCeXwHTG9Aalwd3cQKCsDa/efGxMG7EhnQASrbxPRfZ7lfpeV/b3Ahfo9leA13vJFiV/aIq+Q4JxliSjxc7sfqo6W3ZB3RX8ygqOWeM2iGf4HhToY8iyPjG9Qu+gxQ3R55tdhVtDyheh9gY9I5UmRlw9r/pvWSMDFt0//AcAgNrg=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "The events business is expected to have a 5% to 10% margin for the next couple of years.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Vikram Mehra: I said in my last quarter call that it is an early stage. The first year is going to be more testing the waters, but in general events business is a 5% to 10% margin business for the next couple of years."
                ]
            }
        ],
        "actuals": [
            {
                "data": "Vikram Mehra mentioned the impact on PAT due to changes in charging of marketing expense.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Vikram Mehra: Now what we are changing it to 20% in year one, 15% in year two and then it goes to 8.125% for the next eight years. It is a very small change right now. The net impact of that on our PAT is only Rs.1.7 Crores."
                ]
            }
        ]
    },
    {
        "type": "Table",
        "element_id": "504eceb6f918c4141a22db865161f776",
        "text": "Saregama India Limited August 02, 2022 the same bunch of top singers who are also contributing to the biggest songs as well as are active on the live circuit. Ravi Jain: understand that, but eight events will that like contribute to a few double digits in Crores in terms of revenues? Vikram Mehra: Let the year get over first. Maybe I will be able to give you a better idea then. All I can tell you that it will not be a loss-making thing. That is all the comfort I can give you. Obviously, we believe it should contribute significantly to the topline. It is the first quarter’s irst event. Give us four quarters and we will be able to go back and share more specific details with you. Ravi Jain: Okay and the last question as on date Y ouTube views there is a significant increase every quarter? Is this to do with user generated content being a larger part of the growth or is it Saregama channel alone contributing the growth? Vikram Mehra: As regards the growth rate, the biggest contributors are the Saregama’s official channels. But in reality, it doesn’t matter where the view is coming from, as we make similar monies Tom a view from our own channel and user generated content. The growth rate it is coming more from our own channels because of the amount of new content that is being put up. Ravi Jain: Lastly if I may just squeeze in on this Instagram deal it was a fixed deal? It did not depend on the number of streams that we..? Vikram Mehra: cannot talk about specific deals. Ravi Jain: No, you had mentioned that it was a fixed deal? Vikram Mehra: n general, short format app deals are fixed fee deals. Ravi Jain: t has not come up for renewal yet?",
        "metadata": {
            "text_as_html": "<table><tr><td/><td>Saregama India Limited August 02, 2022</td></tr><tr><td/><td>the same bunch of top singers who are also contributing to the biggest songs as well as are active on the live circuit.</td></tr><tr><td>Ravi Jain:</td><td>understand that, but eight events will that like contribute to a few double digits in Crores in terms of revenues?</td></tr><tr><td>Vikram Mehra:</td><td>Let the year get over first. Maybe I will be able to give you a better idea then. All I can tell you that it will not be a loss-making thing. That is all the comfort I can give you. Obviously, we believe it should contribute significantly to the topline. It is the first quarter’s irst event. Give us four quarters and we will be able to go back and share more specific details with you.</td></tr><tr><td>Ravi Jain:</td><td>Okay and the last question as on date Y ouTube views there is a significant increase every quarter? Is this to do with user generated content being a larger part of the growth or is it Saregama channel alone contributing the growth?</td></tr><tr><td>Vikram Mehra:</td><td>As regards the growth rate, the biggest contributors are the Saregama’s official channels. But in reality, it doesn’t matter where the view is coming from, as we make similar monies Tom a view from our own channel and user generated content. The growth rate it is coming more from our own channels because of the amount of new content that is being put up.</td></tr><tr><td>Ravi Jain:</td><td>Lastly if I may just squeeze in on this Instagram deal it was a fixed deal? It did not depend on the number of streams that we..?</td></tr><tr><td>Vikram Mehra:</td><td>cannot talk about specific deals.</td></tr><tr><td>Ravi Jain:</td><td>No, you had mentioned that it was a fixed deal?</td></tr><tr><td>Vikram Mehra:</td><td>n general, short format app deals are fixed fee deals.</td></tr><tr><td>Ravi Jain:</td><td>t has not come up for renewal yet?</td></tr></table>",
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 7,
            "orig_elements": "eJztWN9v2zYQ/lcOfnYcx0mapAhSdHsYPLRrsQYDhqwwKPEkcZZIjaTieEX/931HWbGb/pjbhxYF+hBbpnjH77777njIzZsR19ywjQujR49pdFwcH5/nF3zw6JiLg5NHs+lBdnF+dqB0cXI+PTnNptn5aEyjhqPSKirYvBnlznltrIoc0u9arV0XFxWbsopYmc2mU9hslldGxwqrR2dptXXGRrG7uZkdnU/OxjSbnk6OX4/p/vfRKb5l4ejkYvqRlWSDlVFYh8iNxPLS3HH9qlU5j97ihebIeTTOLvJahbBovcuwbTo5PX90NsOGwtQc1y0n25fPRwmyLTtVprhuRmzLkRzRYmVhuyZjj3WcPop8FxcqLKrY1GJ+GVVW89VlrFhpfHl5vLo8lA/8vVKeS9UomlttFD0zjYms6WlXdiHSdCbxzGb99sNk/MAB/FJQDVPW2bwiV1B0LQVjS/aBVpUjnECqDo5yZ6M3WRfxErtITDNTIqZIwdkykIIF17V8JyuQdMvkbNpay3NufN6ZONlBdDiEljm93gDUV7+rW0O/KmMfY4NOS53VwBSV1fCn4hiQIyVlEN9CeDjc4HB5h8OWvAXMAldRwSvSrgOfpE1pYGAs/eyd5/QU2TdBGPDiruPwpD96y5u++sMsvWroOVdebZE945hCXLPyVOKHu2VPhQHaCT1X64xp3oPDk+RT8JTCB3QMYBlHHE5GsxI/dkJPsXdOuRJUeJRtKS4Tez/WxeSLahfCQaOWKScVPid0nTYiBYkMoaEpnI8bf8OxE3qR3RrXhXo9RtbgrTaIW04IletqvUtfMKU1hYF9rNdD7iGU2lie0DwdJ0spZPqnUx7x/NXNpkcXoFbWUoYm9Iuc3gUqXOeHfUCKlALCeww5ylS+TK9DJYpqkCsKLecChlCHytSS9lilkN7P1wdk9GKp1tSLCKJUCS8kjHIW3eIT3YjpT3LddQcwt4ZXKTicLKTucgHV5J5VYAnPr4eAntBcLIQTB8H1+LrAog3LXkmFCrlgBOFK5pBH5VFx1MJBKkJgK71bwdB5ORdpua/1vFLWMsqsdpYflOW93d7ifRpI/Hoddk8VlON3Svz+HOf78paXA6Yh164AM0bVA8YwoZ864QlnqNpEaA2RaMfB9iaRGpXEv0oMi09hXEKGbiWkwrtm3LcW7F2KGBsDuiAGa1C5164Bf8lItpIoy63sliWk+sPkS6m8E7Bg2x6cxPYhlwFZyxV8DplSjetsypsFiiG1cVOHfYpb0NC1+0n0GVSJOjMFaraBWv+WZh4gU/6XhcvUUeF5btEOS8kpOkedmoO0XpThHaKUtSdSnNro1DA0twwyNv24v3YEdIhIThN6wCueTPbWDopAHEdVo0oz3Mm7xYlLY79wf3Pj1OEqpUkmCJQi622/exjSvuDsJuP1WDoa6gpdEGIj1bY9uqTi3nHB/DmII7CGxCm0gobWim9IHOlHHtYcP5dBuTQwvbh7/sLQ3fYDlBSyQksS4tzWXaYCOlUNMc3T9bCU1IdNrCmIiJKyDxq8dDOZAXKWopN33LfLJDMpqKEANvnZZif1O/TDO8SxuYY/0jJR8FbshcHwkMK4c4et5Hn+IDosyfU/l2x6UJaqt0gy0u6+t4hNasIm5LgpcVe9xMRFZ6L6o9MdZg8308dhP26lMU9GMRnBtnTTOzmkr/xiv1mPvtFEh1R8/QGNfkxen5q8iq83etGeY9X3PlXR9z4upYHm+5mX6JvPQn31fnrMoc8cYYD2i4YTieD/Jo8t3k8MFdj0Y2T4gpFB/pUz/GfnWprl6O3r/wBqFJwH",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "68abed248819810c5e27cc42bc85727c",
        "text": "now that we believe, with the funds raised, that our music acquisition is going to see a significant step jump. With that in mind, over the last many months, we have reassessed our capability on multiple fronts. On the content acquisition side, we have reinforced the teams in each of the languages so that people sitting in Mumbai are not taking decisions of what content to acquire in the Bengali or other regional languages. It is strong teams with proficiencies in regional languages that are taking the calls on what content to pick up. The head office gets involved only from the data analytics perspective giving them enough ammunition about the past track record of the artist whose music we are picking up. So, a lot of work happening there on building that team, data analytics capability and our marketing relationships across. This includes partnerships with radio channels, TV channels, digital platforms, social media influencers etc. If we need to have the largest share of new content, we should equally be equipped at marketing and monetizing that content in a very effective fashion. As part of this initiative another thing we did was to re-assess the useful life of the new music content that we were acquiring. We have been sharing with you now for many quarters on how the revenue from music that we acquired in 1960s, 1970s and 1980s is still growing at a significant pace. It is not that the revenues have started to settle at all and hence we started questioning our current definition of the useful life of music which until now was six years as per management assessment. The question that was asked, “is this the right assessment of the useful life of that asset”? We asked E&Y to do a bench marking of how all the global music labels are defining their useful life of their music assets. The report has come to us which defines that almost every major label of the world has useful life definition between 10 to 25 years of the music that they have acquired. Based on our",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 4,
            "orig_elements": "eJx1V9uO2zYQ/RXCQPvkNWxnr30pkiIPfUgTNEGLYhssxtJIYlYiFZKy4gb5954ZSraz3QK7gEWLczlz5sz4/uuCW+7YpQdbLn4yix2Vd+uKbi6u+IYuLncvqgvaUnFxuyvuLjdXvL188WKxNIuOE5WUCHe+LgrvQ2kdJY763NLBD+mhYVs3CSfb7XqNO9PxaMvU4HRzo6e9ty7Jvfv7q+12dbM0L65vV+uPSzM/b26vr1c3crC5vN6urp47yXdwsoiHmLiTXN7ZL9y+76ngxTd8UXLiIlnvHoqWYnzog9/htfXq9u4aXhaVbTkdetar794sNGJXD1RrWvcLdvVCPPQ4eXBDt+OA80uxnfiLJLpwfjSpoWRGNjtuLe95aUabGpyyqQZXRhPIRi6X+T0/BNMN0RaGis+DjVYCNDaaGrDUJnkTmQ2ZaGtnK1uQSwb59ebT0PUr82c2DUPWmc46mPV7DuoNSSbTkTuYzrvUxKUE1dCeTWDkz/gr1X9BPe1sa9PBwHc3tMn2LaINuBZX5q1TcwWewJPv4oy25HOz1lU+FDArFxJTFyUupqIxvpqCmhA10efAe/biDRaTZIz33wBasoYCG+eTSfQoX5RcwK13UUyNcnOOCCBpUHjf5lhfoVTUWuOD8XgOCK3GVWpP/lfm1yQ4x4Q06ylYrRR4AaAtO/xr/P+9nCOXAKfgFCBq2ygIPg2ut8WjGVCtD3irYQLqFTywqTmJg71v91IK1x4E9E6tSXMZgtdDskUESiH2Ql/gXNv95LMz7PxQN4a6bnC5JrRDk6mJXgiQAsF74AItOheBQrL4amx85Il9I2s6EqrYlmjf+yWI16ICArgPj6hy37ObfONteNsNti3zCZIWFJdPQz+jF7nMuI7CI2u5A7ckYcfG9hFlDD5GAcoKMEU7lAC7R7wO+esrWqJApfWmaMg5bkHsD3+cPZS2tgnV6mEZdOxwFH1hcdJxaQl2q3ZAdWHRcCpAhErSdyy89ZnKmaoBpUa7NYIMMHA8zmVV0sfGD21p+POAyh/Q7/LRAqLSUDrLUbJGC+LhnyNSMz1ALzLo2IPhqprqWxFS9W5lXubcc9kUEZSY9B1ymdg4h0kEU9rSjBQlg8AXub81jSFyNYC7tuK5/pJILvuRpZNmjVLW3EywC32ZWnvH7BQI9SYlgJQbUTsgnEUGKIQkmIIVjcqgKMKe3cCZ1dnj7Gnq2FIQ2Nxdr1Glzd3NOipam7tbfNLutG1r6uBHBTI9UULR9rmRVSqUhCfHMUcfk4RWZjVNCWojlmBYfDVCBS3n9NZn3BNKikeVxyEEwajkyk49NuH4BNqpkxoLuRscIleApCjRfjEHJoBD2sqCGHSkUz3VUsnHLBCz+wkpkjuPMi/+HrbrDTQwc0GzlPl6ZuB/4spihbeSmih/lrKqUfP6x78ElRIKiho7BC601cwrraKgJCbr1u+kgzTFljDbogpGBiUrgg3PkM0e55sEEHOOgXsPXjdIrvAdSwhDnJBTi0eJbTuPFmTtkI4+gWzqfM4UsoQOFDvnns8qteM0Cnc3a3GyvZrKMF0/oyQeD5ktMzNX5hXpiHRKAz+6WdnKGQ6FbEJsmS2eCitimIk5qv52OD1J5Uk/RLlqfq5wZ8uBgpf76HrKAfkgq/x5B8kfXGsf+bxaU52g82jTtpVyyrwjoc1FC5ShiKnx5XKW/+/CJIhW0LkfOewn2ekxHWWcjzIAdodpECBLMg3MgtqEW1A6VfWziTFN5soGGUqjn/vB6bKAlSdh5WFVj+eDVDkkbBNfIOxOzQPyAyaWqu8oRk66chLq3+Pqdg3bwGukUMbTIgPX+HL73ZdH1V6Z13uxOO9uoplPynNEPxd+lvtCGHu+wWEwoMYYJjr4je10DiVuDzKZwI8zCgTo2dtMTg18abbrH45NPIoaPjXnNAoAh1Vsc/XD8UBAlhzBBBKJewbZHUU7sSpfaQJrN+rTZp27NXkZp7aD2h4lZor4ecGhc9bmysPNNCC0W3WeIMHN6sb8EoRmvZedcq9hvnv54TR6OioVmXjaW6W94jO+l5mxsnJBYXQ908UVkWNAPTL3ExNlUz7NeFnBoLnZqgzBCeUu73Z4vxrSIIMRt2S5EznSmes1mVxivBYPrph3SGAlzJSYZfVZ5o4RAmdUWH4KDL3sgMqaaUFAUWWiCoJFIz9B5l8kv1EI2oMf5KfGt4//AmSG2YQ=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "We have been sharing with you now for many quarters on how the revenue from music that we acquired in 1960s, 1970s and 1980s is still growing at a significant pace.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Board Member: We have been sharing with you now for many quarters on how the revenue from music that we acquired in 1960s, 1970s and 1980s is still growing at a significant pace."
                ]
            },
            {
                "data": "The report has come to us which defines that almost every major label of the world has useful life definition between 10 to 25 years of the music that they have acquired.",
                "theme": "Content Strategy and Production",
                "subtheme": "Music Content and Strategy",
                "evidence": [
                    "Board Member: The report has come to us which defines that almost every major label of the world has useful life definition between 10 to 25 years of the music that they have acquired."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "e9cb225281e456d15b11ca385c970c2e",
        "text": "Saregama India Limited August 02, 2022\n\nThank you Sir. We take the next question from the line of Vimal Gohil from Alchemy Capital Management Private Limited. Please go-ahead Sir.\n\nVimal Gohil: Thank you for the opportunity, Sir. I am not sure if you have answered this so sorry if I have made you repeat it, if you can just highlight what is the kind of investments that we are seeing in content over the next one year or maybe if you have any long-term guidance if at all?\n\nVikram Mehra: Our stated aim is that out of all the content that comes out in the market on a Pan India level, we want to pick up anything between 30% to 35% of it. The cost of the entire content that is expected to come out this year should be in the range of around Rs.800 Crores. So that is aspiration we people have. We do not know whether we will be able to acquire the entire share in a single go. Even if we acquire, it may so happen that the movies may not get released until the end of the financial year. Though the deal may happen now, the movie may get released in the next financial year but broadly this is the aim.\n\nVimal Gohil: Okay, so this year possibly you are looking at somewhere near Rs.400 Crores of content investment pool that will be a fair assessment if at all assuming that the entire you are able to take whatever entire pie that you are looking at?\n\nVikram Mehra: See, 30% of 800 is 240 so it is that space right now. Now this is the first year for a company which has had a single digit share of new content and it wants to move to a 30% to 35% share. In Bollywood movies the music of the film gets sold 12 to 18 months before the movie gets released. So, it will take us that much amount of lag right now to go back and build it up. But the space that I said would be in the range of 200 - 220.\n\nVimal Gohil: Understood. Thank you very much Sir. All the best.\n\nModerator: Thank you Sir. We take the next question from the line of Bhupendra Tiwary from ICICI Securities. Please go-ahead Sir.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 11,
            "orig_elements": "eJy1V11v3LYS/SvEAn2zBH1QX3kpkqAoDDStUefePgSFMZJGK3YlUSUpbxbF/e93htpdb1IXN9fwwrEDDYfkcOacM+SnvzY44IiTe1Dt5o3YyLYri7LsgjTqZCDrWgY1YBnEhYyjpMq7UlabG7EZ0UELDmjOX5tGa9OqCRxa/z3AQS/uoUe17R1ZkiSKaM7RvFet68kaF946azU5nvfpUxwnSVjciCSPw/z3G3E2pGkapt4gszLMnzGsU8iysQfrcOSz3KnPONzP0ODmPzTQosPGKT09NANY+zAbXZNbFOZVUUly6NSA7jCjn3v3YeNDnrYLbP25Pm1w2m54i5ksD9My1mj4HDGv7vAzH3VzDwa3MIK4nVoF4ic1KoeteLtsF+tElFCoUZLw2qetPio3+Ai/rkWZVyWkcRR0eZIGEuMuqJsCg6KLGmyhKWtZXK0WWZKFKSW6kGHBiT5+S5mv35T4PMyeMawzXlaJIo/y5LUq8bGHaSfomOJemVD8hsLBjv70KCZyEX8uaDkI0Rk9evOgJhS6E/9WIwziR92rYR18OzQ9jgfxHmblaOgDTLQxl0rcGfVIyT4VOhR3A4JFsdUB9Ait3/yy3D+DMeDUI37kOJ8pe5y3ILs6DaI6g0B2DQRVDllQlmkSp3XUlWl+tbInaR6SKYuiMOOqHr/zTIblmW/FM4Z1xsvKXhZV/GoEvCjeG/GEgU4bX2M9z9q4ZVLucLMC41bAKCbthF0MCtV59x4eUcBk92iIva5XVlhN/4w5sMvt6jBCi97d4IzghHI3pwUamMQfTPmeKjBwFcS+Zxfrw9ipqWWoqemRUMjVZzuN72lbCsMiqmlLw6LRk2Og6Uc0T+DVhNQDghF0rBEO9deBH8Sgp23g0Ixiu6gWpsa70A4wDN9fAvInZd0tV+wZLKZdU6URRgHWURnING6CGrsq6JKqarK6yLoMrofFpGTsFRH957G4fldVtmIzlrnXpL8Z1hkvlKC0LLLXw+LOELg+YG/gjfhlMcI64HYAalyRQPWgJDASqCy+vKd6+7FGj2i9ByGBR0cwO+TyCxB3BLG1ywz4iMMNY2cPPFWLWTU7scyMBAIvIalGt0ecRBp9x+Np9p2HnwuJI7yp9UHwFrS5Ml/FQbHi55kyxmTQPiwflSeGx6Ht9TK0goG4RmooW15NweiFwP6rDcsoEu+NNmhDca/PK4OdFUsiHYpOMKOeB/Q49qLdak/O3aT3xCCkpY0/qKJ80W5QkzOFBM2fC4d9cQLbM5MUp8pSCgYW5VD88EhZICYw0dY5xFnHJGKG9zDPOK2h+XzrR0UV4FGOYku5N+gVvhULbTMcN2xP2esI+FOjSII4LZxdvWx7P9QiWXml4yZ0opunTfzIF+sfE+n5/uWyoqbc10ZDOxzWGhxlhXAVfiu347osIcqaIMayCmRb1kGdVDLourhr6gYLifKKfSZlpsZRlhzJfTTETOEjmSOm+zOWddILe01Ey1yl1/yyA2opVl+QYtbWqppqxMrMYBy03jEbCV2WOER4NlxgciV6yDM9GEwn/j11CFpOD8cucUK/6EAZYpBFa73PWePZuIy82RnMR16cgjlRx1+LuDkht5ij06xwnfj30L+5eyRVVORZI4O0yZtAFikGdR5z98BW1rJJ2jK5OsLI/0uEyZPhdGN9xrJOeuklNs/T63SQeySxYgUnfLCYEs4SGTHmlDv3E8shCuOvHCQxofiZlPNSJDplSO09QPlWBCznM18Z9r1qelInS7/tk2q2akvLr2pKG0+4P4MTSPhojLuOZSiRkq1qfNln/Ey6Z03inR6Gw17r9qSrXv0Wq5on+RxGVkG+blE7iRNeJC7Jf3K9JchTxHghmt71pJjcVbyYe3p4WC/HpIwLnQxG6kS+zw2wfcoQb7HVogZqmXygelGDP9Yyh+LdsnJnzapf61ZYUK3Y/1PDI4CKgHH6zVLcyTbOoIyDqOroyt9EVVBmJbGlLJqo7WSR19d76SWp5At8LIuzFK+GLEqOTzt6lf2DZZ300nd39GqPvS+U+F9TiwRxwll48QIgcTusOPDX/rfH+1ZN6vrNhSohhw7TIogrKAKZJ3VQFWkbZEUhAZOkTbG9XqFk7AUsI5FaC3U05El5oV/PW9ZJL1Q0mSSvpmgfNBUHnDaXr7P/94X+rl/oBtUaEB/VHqiu3uP2Pf2QSDaLUU7xLfN/Pcafav37fwGQrPnI",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "Saregama India Limited aims to acquire 30% to 35% of the content coming out in the market on a Pan India level.",
                "theme": "Content Strategy and Production",
                "subtheme": "Content Ownership and Licensing",
                "evidence": [
                    "Vikram Mehra: Our stated aim is that out of all the content that comes out in the market on a Pan India level, we want to pick up anything between 30% to 35% of it. The cost of the entire content that is expected to come out this year should be in the range of around Rs.800 Crores. So that is aspiration we people have."
                ]
            },
            {
                "guidance": "Saregama India Limited plans to have a content investment pool in the range of Rs. 200 - 220 Crores for the current year.",
                "theme": "Financial Performance",
                "subtheme": "Financial Health and Leverage",
                "evidence": [
                    "Vikram Mehra: See, 30% of 800 is 240 so it is that space right now. Now this is the first year for a company which has had a single-digit share of new content and it wants to move to a 30% to 35% share. In Bollywood movies the music of the film gets sold 12 to 18 months before the movie gets released. So, it will take us that much amount of lag right now to go back and build it up. But the space that I said would be in the range of 200 - 220."
                ]
            }
        ],
        "actuals": [
            {
                "data": "Vikram Mehra mentioned that the company aims to move from a single-digit share of new content to a 30% to 35% share.",
                "theme": "Content Strategy and Production",
                "subtheme": "Audience Reach and Engagement",
                "evidence": [
                    "Vikram Mehra: Now this is the first year for a company which has had a single digit share of new content and it wants to move to a 30% to 35% share."
                ]
            }
        ]
    },
    {
        "type": "Table",
        "element_id": "3985e250b4aafa03184de2099b0c882c",
        "text": "Vikram Mehra: Sir as I have stated earlier, whenever we decide to start investing in Carvaan, we will share it with you. First there was a demand issue, with retail network shut. Then, there were massive supply chain issues because chips were not available. Things are still getting sorted out because even if we go and manufacture the rest of the parts in India chips are still coming from one of these Asian countries only. So, we want to first come on top of it. Once we believe that this product is now ready for expansion then we are going to talk to you about our investment plans and how the financials are going to work out. Shubham A jmera: Okay sure thank you so much. Vikram Mebhra: And currently you are not going to find any investment going from our side on Carvaan. It is just moving at this juncture on its own demand. Shubham A jmera: Understood thanks.",
        "metadata": {
            "text_as_html": "<table><tr><td>Vikram Mehra:</td><td>Sir as I have stated earlier, whenever we decide to start investing in Carvaan, we will share it with you. First there was a demand issue, with retail network shut. Then, there were massive supply chain issues because chips were not available. Things are still getting sorted out because even if we go and manufacture the rest of the parts in India chips are still coming from one of these Asian countries only. So, we want to first come on top of it. Once we believe that this product is now ready for expansion then we are going to talk to you about our investment plans and how the financials are going to work out.</td></tr><tr><td>Shubham A jmera:</td><td>Okay sure thank you so much.</td></tr><tr><td>Vikram Mebhra:</td><td>And currently you are not going to find any investment going from our side on Carvaan. It is just moving at this juncture on its own demand.</td></tr><tr><td>Shubham A jmera:</td><td>Understood thanks.</td></tr></table>",
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 10,
            "orig_elements": "eJztWO9rGzkQ/VcGf3Ycx3GapJQeoXBH4EoKTluOUIK8O/aq2ZX29MOuKf3f7420aydpWlK4693RfnFiSTOaefPmafDVxwHX3LAJ17ocPKXB4mQ8Hk+enOxNjyane9PJwXTvdHy42JuPp9Pjsjg6Lo6OBkMaNBxUqYKCzcdBYa0rtVGBffpeq42N4bpivawCViaT8Rg23fJal6HC6sFxWm2tNkHsrq4m48noeEiTw5PR8bsh9d8PTg+neeFgeno4OnxoJdtgZeA3PnAjubzSH7ietargwSdslBy4CNqa66JW3l+3zs5xbDx6cnJyiv2FrjlsWk6mr14OUsRmGdUypXU1YLMcyA0tVq5NbObsJA1JIvCHcK38dRWaWuyfBTWv+fmzULEq8cfJv8+Xz/bxKf/NlOOlahSdm1Ir+l03OnBJZ3EZfaDxBAmNJ5N8fF+s93tPc1tuOofl85e2ZKeCdU9xoExLl5UyNwSgaabdiN4yBXWDj4rJIEj6M7IXEGjhbJOWa22Y7IJmVZxXqqGz9w2c5v3ZxfkLxLiCjZDEj+hVzcozLe2ekojSLfnyFGcX2NYXJWe78HCcmg0ttPO3YtGeBA8h0TLFpMoVu6B9oib2VmwiD8lbUj4lJ+uwBGbayIIj27IRc8eNcjceblSgNVw5Js8sW942QMKxSVZyT2nXZo17yQcpMy2sS+t/kI2Xcc791aRgczcoiQWu1zvv6r53j2+qkb3CNq0yG0Hrl8/ReqNvHMB6ydVtqN7m2I0N/Q0pJQ1PRaAqIhSsRU8AUABootcFzfFp2HvCUVXXYEAy8lsDJ00Jr2tZlCgXONZH3KeYgcypw/3lGyrAK8O1pzkXKoIBM/RyJTuenVb17mIXTYrpjq9oUnGwPIvJnw6e68W3UOc3AKET7qVNHKjUSgqzIV2yukcgX9u1FLdPrE/GFxaYfrE+YFcTi+rRNboA7jsvWwiArJStZHCyFLLcg6OvzexzU5tDWzhGfEiM9sCwnClBsToJwxln47KSRe5DIEhBZmrnpFWb7AMulow7yVdCKTR7Sj/OfeF0mxyqxkYTEJIdCjwL4VhiRCy1fShHaZWYGbTGPcJAlAEESQ0XXCxCdNKfj8PiK0R4mAeSJ5QEUv4lIUmy0ELDd339QrmVUiZ9r/VtXQSgQDxYbMFqw8r5fEIvEtkKWC01yoAmTzoydxbyd496HfBQoCVAzNhXuqiSCwEmYIdTH3Yc/NLlj6agKCpoe55JAh2ThwQeas1uiNvZgPpOKFByIQEFKadyADHpehdLh8xQDq41FCFTBUCvdUjxj+jXpNqIWnQPdyq4bKQO2nuR53TSYTLQNfIKa+tu4CaCVZcIY9hbykeDF1jQ9LFt642oizbZzU5hikq3Ph8XBqkV/MqzKu4Qdc80CRaYhqzwTtKHNG29SONLEaUHbGaNMlH4HR132oCsup5oAYwXPPLDnEPY3QOdkGvS22hN30m45cxrEKSQHnKapY3rTW4mwVOB9lLdhF8h7BGi2FbsNeC5MEVq0jmjaivOQh8qsBktX6KTchetEaoqN4m9/AGC5bMUIMHuoVvaJIAWPKtv5G/i3VzwEGbp7Uve9YXAUcFvkhxMcKbQfQtvXaUywsO3aPXFjUhPBrifRyDcoq0PuNkSe36H2WcIrogOL2oARfoOEipsY0PMZX4CdpnlzVwikWfhvN0SfETnCc33Mmg1dtVJUAL7fTSZFaIkoIG8H5nh35L7a8gc6mxtmZP3t433uwFuPw+IaTCV4VGGxt00d28We0p3Wv877j5uTqV/Y+ik/8so+c9NkvRDjIj0PQc/+jnR/V0THf0ggxr9nMB+TmDfZwKjr81V9F+al+jzKUh+UOt/X7sUFg0+vfsLQOA+zg==",
            "is_continuation": true,
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "37ece7fb5a490ea10b566f2e435fde58",
        "text": "Saregama India Limited August 02, 2022\n\nVikram Mehra: I cannot get into specific deals but please understand if we are growing our music licensing business at over 20% and last year, we grew over 26%. This quarter the growth is even more. Clearly it is coming out of both. variable deals with minimum guarantees as well as fixed fee deals. All of them get renegotiated in a very big fashion and the numbers are becoming significant because we are investing in new content aggressively.\n\nRavi Jain: This Gaana thing is that going to be a negative because if it gets acquired by someone, there is news about it getting acquired so there is consolidation on your customer side, so that will be a slight negative for you?\n\nVikram Mehra: Let me answer this way. I will not answer to the specific brand name that you took but in general consolidation does not affect us because the customer is going to listen to a song. It does not matter to us whether the customer is listening to the song on platform A or platform B. We get paid on an average Rs.0.10 paisa. It does not matter which platform are you going to.\n\nRavi Jain: If you have minimum guarantee on both the platforms?\n\nVikram Mehra: You have asked the right question. The days of we people not hitting a minimum guarantee were six years back. Now the actual revenue frequently touches the MGs, and in many of the cases there are overflows coming in.\n\nRavi Jain: Thank you and congratulations for a good set of numbers.\n\nVikram Mehra: Let me add further, if you ask me, if any of the platform’s folds, it is also a signal to the other platforms that they should move towards paid services. It is high time and I have been saying this it is time that the streaming platforms, start making a significant push towards paid subscription. That is going to be great news for their financial viability and also means lot of money to be made by music IP owners. It will be a positive news if this transition happens.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 8,
            "orig_elements": "eJy1V22L3DYQ/itiId/Oxpbf86Wk/VCuJCWkoaWk5RhLY1ucLW0s+TZL6X/vSPbu5WULx5GFg1uNNdJIz8yjZz78s8MRJ9TuTsndS7ZDKaBumyQquxqivCpE1OZNG2GZlxnPsSuLbHfDdhM6kOCAfP7ZCWNmqTQ4tGE8wtEs7m5A1Q+OLJwnCfls5oOSbiBrWgXr3ijtvN+HD2nK0zi7YbxM4/LvG3Y2ZBmPm2DIizouLxhWF7Ls7NE6nPxZ3qpPOP62B4G7f+mDRIfCKaPvxAjW3u1n09K0JK6quuQ0oVMjuuMeg+/bN7sQsu4X6MO5PuxQ9zu/xZ4sd3qZWpzJXvvFHX7yJ939BjP2MAG71VIBe60m5VCyV0u/WMcS2oYnnPulTzu9V24MAX4NRYklxy6HSPC0iPK2qKIGWoyggjzPZNa1QlwNCp7lcUX3XNE/f8/buDiN07xM4uSCYfV4HhB1UZf1dwLid3U/w8Te4DDDS3bLBGhtHOvRMTqkYXaPQnVKMIkwWtYuju1HBIts0RJn60BLpjp2QEaQsn42B6V7ZpaZTYslv1EJ1NbbWhprtJaBY+YBZ4L4BfPudDrHjgjzjV+mn/GwfS9fxOz9oCz7uMDsyOKGdQs3MLLiA2o2mRlj9hPFNI9Hppz/IMy0BkEbdaw1bojZA8wK2hG3gxwUrUGz1LRMjK5sBu0QKTb6hOPo/3cEh2Qdbi4xe0V2Wo+CmMIFzaixN06BT12lGTCK+sha1bMO7EDIheP5oNfLt+GOWtzis6rX/m5pa2+EhW51u0elH9A6P4nW1XQhwlB8NA96uh9r1QOOx/jz+nitrLv1iXShRIA3IqnTJkJRd1EuGioRrLpIpGktkzyVmLXXK5E8cFPJmzgLJbKOq5yfKqIo4+KCYfV4ZonUZfq9uOodPCj2Cyj9ck3GnwE0EKoBHUs/KJ9740dULy3hR4D14AiiM6pUICoUFWWA+LiomRKmPTJrJjQab3yKeNCth5qmtD5zV4eQA2cfax6nUkZYMyrCyyca/R190QniT1p1puSStHBwoPgOinI3xGZHj99jiJ2ZvecPT82lRoLoeF1EZdOIKJdZFdWYJFHB20a0aVryPL9iLuWePKumjJM1l8K4OY1PqfONYfV4Lt1W2VXY9jVxyESYaHsI3EagHuAYEwsHuDwPn74F3B/JuJ09sWgg7wAvXRvNMfeBn4kxemKmGcavckQaIriwatfRUdlizwnqVz+nDsVxzueRUoFYln5R6hjdU3TucaEJnFvDo7UOA/rk/GatdYltvXAM48lZ00MCjtJvYq8YJeF59GPM/sBAsHtQkgUWZUDUSvfK3tk4idPEf7JwMZjDoMTwuJpnU389pxM9mTR5XpGQq+pIlqWXeIJIM2tklKaV5DLLEKsr6oqCTnnD0qTgW6afDHWyZXbSBKlxyRKcninySHfl3584b7sAwkAwfvvqeoj9Ix2S4wScfTIjZQlv67qACAuS4TmINqoryKKEizZLasCi41dkJB7uPCXhV6yUtBp4Xn9JQRcsq9Nz1XhyHVb684QT2Htc1cscnoyPi5ckRntNRpoIjtarIRIsezSkCUMNDmp7sS6gfPAPl1WfgtQj6gFxH7NfzSFsAcItRFiz13QLvUoz0nbakaRzZhED2jDrzc/2Jmgq4rgJ9HGTY6Ra7TpjXuWTl4/daA5nKaj0k+s+BeTQAEYVpQ6lU5JGLYc6SmWRcyiLAnh5xXQK3UGaJelJLW2GLNnUUep/XbYEp2emU1E2V6j79wPo+1D6HjV6jvoZ3DKG98gG7QHEzIaUDQatvunkJ4OVcVkKrBLq+6AisEjjNrkk7EoJ1GJJwdtrgpWv2NT52mWfDCUvtsb8VOnfWlanZ4JVV+X3AuuyJJHU+CyzL6gbL14DgPaePoXhZ5V3ouu/Fp6kjYd0lFSjax9GXVPQDdTnUG1vr78JIuFM86uAIRvJ4cEso6SOjsjHmQPM0q4SwOL8QG2kDe89rTsQUMypoJ0kyaVAVy2STrFwDM+811JrDGHaaQ9m3YwQGOEcAIlkR90l8cn9ylyft2X7xQ5fxbK0Vsxqf2JCcF/opTY0sOBWJe8TnLZVMzWTGrRQdA0P1IaqUbljCD5c0YSk89hoQglM1BEct6UmkOgbhbWVvn3LzEH78vD38Cjp98aqoOXDnqpbj++Idr2dHtcB9ntqwv+nqv7+D9o6/B4=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "Saregama grew its music licensing business over 26% last year.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: I cannot get into specific deals but please understand if we are growing our music licensing business at over 20% and last year, we grew over 26%."
                ]
            },
            {
                "data": "Saregama gets paid on an average Rs.0.10 paisa per song regardless of the platform.",
                "theme": "Content Strategy and Production",
                "subtheme": "Content Ownership and Licensing",
                "evidence": [
                    "Vikram Mehra: It does not matter to us whether the customer is listening to the song on platform A or platform B. We get paid on an average Rs.0.10 paisa."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "2cae38b542dda21b5fa37a5152626da7",
        "text": "Saregama India Limited August 02, 2022\n\nviews and streams on the Saregama’s official channel for this movie have crossed 550 million and this movie was released in the month of April only. It shows multiple things. One, we are picking the right content and then we are putting the right marketing muscle to go out and make this content really big. And it is not just large movies that we are picking up. We in fact released another small film called Ittu Si Baat and the great thing about that film was that it had songs from Arijit Singh, Jubin Nautiyal, and Vishal Mishra - the who’s who of the music industry were part of this film. Our film buying or music buying is not just based on picking high profile properties. A lot of thinking goes right now on the back of data modeling to tell us that which of the large, medium and small sized films music we should pick up and the success is there in front of everyone. We also continued our investments in Bhojpuri, Gujarati, Telugu, Malayalam, Tamil, Bengali and devotional music. I think a song that absolutely stands out during this quarter, which I would like to mention is a Bhojpuri song called Nathuniya by Khesari Lal Yadav. That song in this short duration of three months has already crossed 150 million YouTube views. Now this is a massive benchmark for a language, which is not the primary language of this country. Bhojpuri is spoken by a large belt in North and Eastern India and a song in that language getting 150 million is a big achievement, which also revalidates the fact that we are the number one guys now in Bhojpuri and Gujarati.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 3,
            "orig_elements": "eJy1VV1v20YQ/CsLPUuESMmS3DcbKAq3iRvARovADYwluRLPPvLU+5DCBvnvnTuKspr2qWgfDIvL3duZnbnl05eJaGml88+qnnxHk6sNl7woNrOilvVsuVxvZ+WceVbW12VerNbbvMonU5q04rlmz6j5MqmMsbXq2ItLz5p7E/xzI2rXeESKYj5HzSl8VLVvEM3XKbo3qvOx7ukpz4tlhlixyrPVpymdA4vFIlukwPJqk63+ITCUIDJxvfPSRi4f1GfRD3uuZPIVL2rxUnlluudKs3PPe2tKpM2zTb5aFkjYKi2+30uq/fB+kiB3u8C7xOtpIt1uElvsEXnuQluKRXwRD/fyOTKdPLCVHbdMd12tmN6pVnmp6SbsgvM0R5tiXhTx6LHTo/I6AfxWitX1fFvkvJpty43MluVmPePrdTmTxbIqykWRy/Xyf5PiqsizBea8XmbrOOfTc54vNkMgX67mUZq/R4aafyfF9bLY/FdSHJQcHXFXk/NWuHVkOvKN0KjRb6GY59cIb7eqUqyparjrRNPWWCQqR63BIdTwQaiyxjkoeXU1p1ZpDfDp7Iu8Izuy0JBjnhp6tabzDTrQzd4qDQS6z+jOk2sMwLVBe7XXEk/pdi6jnzuZ0lEICGmvqldE0zE2ykcVDoM/Tn2lO2cG7/+a2bJ9lRRrg6tiA0M7Q9A8Fbf8KgPy8UgMSOueSrXL6AYZyhPedsbTSzSuZruTgaZDIftvQYZ9Rr9KZL3lyr+NgXFEI5Zci/MJsrZU4Rfe3Hkf6EHRLfOZEe2Aww/TIC4j3NQs1cXxpidgaxiqGoyMtta0dGPVC6IPKGum9GMogeOeg1c962k6/BflGij8Hv8s0yw1OzZmtAB+RpGSYsGpCkRq8LY9eEaWbP3wHkOJYKBUsAOsMvQRLSwzVJ6eL6dXplHAMOO0GohEMH20efy/F+sxWYyetBk7dSl1ZzDxQdTOHEcLl1y9xrR47yFLLTrpb8gLxhxGjRpVNSOvJOGUWqlVaIdrkTRx6g+Ai1TciQGkhT2DrhNeSHuWx4WqEuciuajqoLeFhWITOYjtTSfJCKydSeZSXYjcMS3VHcT5uOBcrLttzMs+WDWlH8ILW/b49Sgai3JK7xkLCn8tQozbNqVbXHjWKiGp5WDi8oCeCTAu1DAv4mSKgTyXzuiAefS4/yhzyf01OqYMUPg9QFax09Oc7uiYSGv1mu5LRBpvOTL5jHZocLLwPfsmdDAZlT391IhjJLwDrI9YyIeMHiOOVJC2AQ7CXG0CwenoJI2V05pwsDV6adyBuj8vnPxi4Xw04TGUQmm1ZXQPQ6RjE8QWm1RhU5XSVU1cAGmPMY2Lc+R5cmbUEzsJif055ezxyoQO7s/eeEfwe/OKpQOufFoIpWgfud2DVZO0+Z6x8m13+vzFCF9MgP1bq50MS+uSX+KBHURcNQp+ihKMsJOjrBzggjp+3hKBtGwu91EMDp8DXBU0Cb1L9+bCcAnV6Lns8lN8zzbGDvIYPyFfP/0JXaMRig==",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "Views and streams on the Saregama’s official channel for a movie have crossed 550 million.",
                "theme": "Content Strategy and Production",
                "subtheme": "Audience Reach and Engagement",
                "evidence": [
                    "Board member: Views and streams on the Saregama’s official channel for this movie have crossed 550 million and this movie was released in the month of April only."
                ]
            },
            {
                "data": "Bhojpuri song called Nathuniya by Khesari Lal Yadav has crossed 150 million YouTube views.",
                "theme": "Content Strategy and Production",
                "subtheme": "Audience Reach and Engagement",
                "evidence": [
                    "Board member: I think a song that absolutely stands out during this quarter, which I would like to mention is a Bhojpuri song called Nathuniya by Khesari Lal Yadav. That song in this short duration of three months has already crossed 150 million YouTube views."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "89a5744733f56c82661017ad0ae0704a",
        "text": "Page 10 of 15\n\nModerator:",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 10,
            "orig_elements": "eJy1ks1u2zAQhF9F4NkUliIpiXmDHlIEaG5GIFDkyiagP0h0EiPou3cpJ4URGD20jW4znFlyP2j/xrDHAcfYBM/uMmaVBCU6zWuhKq6glrwVMknbqdoZQR/bZWzAaL2NljpvzE3T4sNoI66b7u15OsXmiOFwjOQUBQB13u2X4OORXFFt7jyFMabefl/pKpe7rICyzKunXfbbECBymQyjIde3jEuFHLae14hD2uUhvGL/Y7YO2U868BjRxTCNjevtujbzMrUUg1wqBYYCXegxnmfcug/3bHvyeDjZw7bXnuF4YOmKmZxmPA0tLmkPSNMjvsatSGdkZVOXCZ1GfEz8bpfFxvCMjylJlc/onXNFB8Zy9L7kytQdN16W3JWqEoTeOVV+GfqCOJJlihwS1ndZ1FVeJq1lcUtv8b+EXoL4B+bimvk15m8DBW/h1aBl5aDg0kDNlfaKt7UB7rrWdaZ2gPpr8dK6stK5+OBLWgFctKw33p/1Jf9HwP8F4P3kkX7Oabm7RvkYYk+XPP0Cr6sx0w==",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "9c9ce5abf5bfb0c75b4f392519d76a6d",
        "text": "blocks. Last year also everything came out in Q4. This year also you will find most of the Yoodlee releases happening in Q3 and Q4. The TV serial business continued its steady performance in terms of TRPs. The only downside we saw this time was a slowdown in the advertising revenue. A significant amount of our revenues that come from the TV businesses come on account of advertising both on Sun TV channel and in YouTube. We expect this to be a short-term trend and everything to come back on track the moment festival season starts. This quarter we finally saw the launch of the new business line of live music. We launched it in partnership with the biggest live music star of this country, Diljit Dosanjh. He is the one music-based artist right now who draws the maximum number of paid tickets in India and abroad. In fact, we in this quarter completed six successful events, two in India (Gurgaon and Jalandhar) and four in Canada. Four of the six shows went completely houseful, so we are very, very happy with the way this business has started. With time this business will not only contribute more to the topline and bottom line but also add power to our music acquisition vertical.\n\nSo overall ladies and gentlemen, it was a very good quarter for us which saw significant growth both on the topline and the bottom line along with growth of newer verticals. Music business was the biggest contributor to this growth in this quarter. Happy to take questions from you people.\n\nModerator:\n\nThank you Sir. We will now begin with the question-and-answer session. Ladies and gentlemen, we will wait for a moment while the question queue assembles. Thank you. We\n\nPage 5 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 5,
            "orig_elements": "eJy1V21v2zYQ/iuEP22AJejFkux+G1Z0L1iHbglWFEERnKiTxUYiVZKqYhT977uj7MTtsmEtkg+OrRPveC/P85C5+rjCHgfU/lo1q2dilTXtpijKKqqasog2VZFH0NZ1lBRtlSdYVDuUq7VYDeihAQ/k83EljbGN0uDRheceDmby1x2qfefJkmVJQj5H86wa35E1rYJ1NEp79ru6KrIyTtdiV5Vx8nYtTs9pmZRxxYZ0U27j3UOWxYcsK3dwHgeu5ZW6xf5iBImrT/SiQY/SK6OvZQ/OXY/W1LQsiXebNCtoQat69IcRg++rl6uQst5PsA91Xa1Q71e8xUiWaz0NNVqyFxzc4y1Xuqp7I29cLH4D58UBwQronRH4Ae3Bd0rvhYQBBfVBKC3+2MTislPubCW1SMyq70WrdCMGQ2FMK3yH4o0xTY8oLE0MHDrRwTii5pgcKhdADktEFJd/CYdWQS/qySmNzglptFd6wkYo7wQ1CZqDGNG2xg6gJXIUj3ZwvOHln6/cEsno/iAaM2unGhQzCgcz5UNJe0WVzOAECNebmdeEGOQEDRXslePkLBVP28biB+HUXqtWSdBewGAmHYozkz0toqAdeEqVIrfWDCEY1XIqAt3yzmgBUp4CnO9WG9/x64tJs6PsQGvsQ28otzdmupxqyuU1CrwdCQ/HUoyokevojPURd0F4i+TDfmfDo3Vh/xrkDe/iLf/gJAfDLBItOq8+UNsdzYgWOA/Wu+OU30/0gJabSNOFnhq7NBNFD5OW3WnUGuf7ufX0xS969YG2IasM6S8eYZpc2UihNVrXqZHwQz3gOLXaE3b9mWtIaNlGcS+pg/awFs9V/47iPDcO9LsuFj8TGlwIYfTRM6oJdNQQbrQXlqkttJnF3BnRWJiX5QPcqmEaxMIO3mgE1RBU5A0S6ijRX3SjIPQVamugickiWpB+zX0J+DlrFXV7JFbSxk7dCjdJSS1pp56HQrKxFn4291G/+2mye2BwUPhfgdjbdGC/D48tw4xW/gialCsWL/j52O8QuzNUw8xDPG1K8+nM5JD2WwviJuUHFgXDYR3+Bgoe7vs9w2FJ/254HbgFA0iFvg7rmDWfLwp818YvXGOeWlVPnkFF2xHmOLY3Y0AC10Ig90SO8EwLF+WAphGjmalp5MHFLQMH+X4iarDwiUATCX3M2naSut/BWiDQ4iVrGInZl2eCbLf5ti2TqMiSbbQp6zYCmZVRLsuNTBB2VZs/3ZmQbuOKFb9M4jIcCkfDNi2WU4KOgCLOH7QsTt94KiRZ/kiHwgXNg1pPhCfWNopEjIe4pw6HPq+ZwouOBlDtSejvCEDqLCaCSKdIHlgtzjV0b81MkDpp3pcwCRJwBhXoDWlYQOvRk/BPWkPbnJBBUvUywOYenOA+05I7eBq7QJOQfIz2BXlJRgI9eBXcIJlZHI12i7TzSTcipYtfB8eNbPN0i1WUVm0SbbZQRLt6KyOooUqbosgkPh0csyIJV5JtlS1YuzPsqsWQb5M4edAQXP4TjI8BtpemIajRdJ6dd/VSEdYe6uY2b5Mc8jJqMMNokzYlCT0xvKqrOs1K3ECbPuGF78jcUzdPBrqSxflC5WKh+z8t/6Of/0rubVHuto/U8Eu6YtwENF8oG47mo57TGY574sTd8XAiQETkpI9j4tGVxpGJb4wPKcN8jDYDaQRrAZxuGqQIPX4Wln9MxHK6Jg11j+HWcUyN0/oqkqV109Rluol2WV3S/wEEi50sZURgriTIpC3b9slgUZXh3p8lLOM885MhTY4g2G2yOHvIsLh8GyiKXb5JHwkUr+iVKFhf0+K88S+MIWVcfXr7N2GwYTk=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "This quarter we finally saw the launch of the new business line of live music.",
                "theme": "Emerging Trends and Opportunities",
                "subtheme": "Live Events and Artist Management",
                "evidence": [
                    "Board Member: This quarter we finally saw the launch of the new business line of live music.",
                    "We launched it in partnership with the biggest live music star of this country, Diljit Dosanjh.",
                    "In fact, we in this quarter completed six successful events, two in India (Gurgaon and Jalandhar) and four in Canada.",
                    "Four of the six shows went completely houseful, so we are very, very happy with the way this business has started."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "b8aa04a51b1f83d067c2ada9edbc8908",
        "text": "The strategy of investing in new content is clearly paying off. All the financial numbers I am sharing with you are a testament to that. It is not only allowing us to grow our share in the new content category space but in fact it is also helping the growth of the catalog. Remember people who start following Saregama social media accounts, YouTube accounts, and Facebook accounts on account of the new content- are also sampling a lot of hits of Lata Didi or Kishore Da on our channel. We had raised Rs.750 Crores with an explicit mandate to invest in new music content and we are completely on track. As mentioned, we are using data mining and predictive modelling to decide on what content to invest in. Many of the films whose music we have acquired over the last six months will hopefully start getting released from the Q4 of this year and a large number may be in FY2023-24. Some of them are Karan Johar’s next directorial film Rocky Aur Rani Ki Prem Kahani and another Dharma film called Rola. Also, we have picked up music of Maddock film starring Vicky Kaushal & Sara Ali Khant., Chiranjeevi’s Telugu film Godfather which also has Salman Khan’s song in it, Malayalam superstar Prithviraj Sukumaran’s next movie Kaapa, and Punjabi superstar Ammy Virk’s next film Oye Makhna. There is a lot of content that we have picked up and these are just some of them. The list is very long across film music in Hindi, Tamil, Telugu, Malayalam and now also Kannada and Punjabi. While the company started investing in new content from 2017, we initially experimented at a smaller scal. The real growth that we are looking at becomes serious from this year onwards. It is\n\nPage 3 of 15\n\nSaregama India Limited August 02, 2022",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 3,
            "orig_elements": "eJy1Vk1v20YQ/SsDHXqSCJHUZ29GgrSpk9axjRaBGxhDciWuteSy3KVkIuh/75ulpCptemjaHAxLo52vN+/N7sPHkTKqUrV/1MXoWxrN0yLJlvN0ovKYJ7NkOp+s1iueZMkii5ez5ZLni9GYRpXyXLBn+Hwc5da2ha7ZKxe+G+5t5x9LpbelhyVJplP4HM0HXfgS1ngZrI3VtRe/h4d5sojiMcXxehotPozpbFivF9FUDPFsvojmn7UMTjCNXO+8qqSbG/2szF3DuRr9jh8K5VXuta0fc8POPTatzXBsGq1nSbzGgY02yveNCr43b0eh6Hrb8TZ09jBS9XYkKRpYHuuuylQLeyrBvXqWXkf3pSLnW4Cx7cluSNd75byut/hEtTpQbmsPwEk7yo3i1vTUcC8H7GYT0ZUx5BFjA0DrXLOhIY+j18QVuZJbOXvQviTgSdwqYgL0nmWO5C3c2Uf0OqSorSdbIwcbYw/i2Tk5s23tgWzXhoBKapOkl/Xl0oJte3ICIGWdl1MbzvE/hGbjLJXKNBJVvCUmqkLT8g3+bOw2olsQTDqgRtnGKDqUFghx62ljT0XdoYgtV0zOhp4rVWgmznPbgR1jem+7+y5TFxauC3qFwjJrd2czWj19PpVx0dJkAEvKdlw1RhIzGRvOllrcN/QGZdNLXWiyLV1rV1r4vGSJLHDlJde1MhH9oqjkglrWThV066LlfEovWpx2w3C4JvWMJDnQqlAt4BTgBz6cyFB1TudnyKWngwpV5hYFgq+YHDKDT/kO3HAkMwaDVTE+nUQE9CFipErXoSeEaVogCLLvFVW2UCY0i/SFynWhJOYBLDlnviwsordc9yf8oInKycycOlZ7kM73MovfOo00ZPcYrpyFqjw5/YyUtS8FB5C5tI3adAaNDEPfKh/k0GLzsGC3aW0V3N/NhqTgVg9hhD4wH2636igCANlTFuj66n0yTdJJMovozlbqWG4VILnmFuj/YEHtX7tkGq+hA8iTCpSbe9sKw6QvurX5rqcrzPWWa41x002LGNdcyteQHwIqkfglYoGewSuHlmTm1rDo1dnxGZNG5zv81DVHrFDVWy4KpBlcBYKg35+1ZL7mDvoz9I0IgBELNSC1j8b0otRo4kmpvT71cK9Mt+2GQN/ZYsOhskOp8/IoRnYIZMC2EObk5+ywfbQfoxqsYfyhlK7BVkE96Bl83SPdE911u64S9D7BrbJ7Lahyw4Pwbrr6iTN9EeOqqno01e4+cQyl/tQrpN2VNdDCdpRt4/7U3ZmBQse/wyjZ0KYbuP7UCcEuxh0iktEubCTwsEdckUDeWueG/MMk0P/3ui70mO650mZ8RPMSEclVYy0GLK+hc1xxl+1C9CVuiGG7QZ+iksBplPqPaz6wG5AsA0kgUA/2QQzYDarVImd4o3Wsvkp4hY0Mfg19tQrcOG7VEz4Cg8HOC0L3EAMqwcpxCGax2o9iOknI1gduC3e8DeRCO91vP4KILPvhXi4u3GB/fQqskmw6T/EUyJJ5MpkVxXyy5pwny4LzWZat18WCv9pTYLmYR+kYuC0W0Uru+ZMhnsZRKgbc2VHyOcPg8mUPgXS1WsT/00PgBj9RKkSN5/8K+DRfJ2o5W084nc0ns3i1nHAeZ5OMk+lqOZutVVp8NeDjOEkicDVZxMMb7GRI03TAGS+uVbT4jGFw+TLgl8v19D8AP7sE/vyWeF3LI+KNrrRo7Apqx5qYBo4kyeVI7rU3KPDDH+eYpEE=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "We had raised Rs.750 Crores with an explicit mandate to invest in new music content.",
                "theme": "Content Strategy and Production",
                "subtheme": "Music Content and Strategy",
                "evidence": [
                    "The strategy of investing in new content is clearly paying off.",
                    "All the financial numbers I am sharing with you are a testament to that.",
                    "It is not only allowing us to grow our share in the new content category space but in fact it is also helping the growth of the catalog.",
                    "Remember people who start following Saregama social media accounts, YouTube accounts, and Facebook accounts on account of the new content- are also sampling a lot of hits of Lata Didi or Kishore Da on our channel.",
                    "We had raised Rs.750 Crores with an explicit mandate to invest in new music content and we are completely on track."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "44d91a37b73a06466c21664088ceb11c",
        "text": "Ok.\n\nVikram Mehra: And we believe that is the range that we will be in. I am not attributing any profits from the second round of licensing that happens typically in this business because your license on the first round may be of three, five, seven or 11 years and then comes the second round of licensing. The cost is fully written off in year one itself. All that I am keeping separate. I am saying year-on-year as we people go out for the next three to five years, the Film TV and web series business will be contributing 15% to 20% margin. In terms of the size of the business we crossed Rs.100 Crores last year and we believe in couple of years we should be hitting the range of Rs.150 Crores to Rs.200 Crores.\n\nBhupendra Tiwary: If you could talk about the web series or the films which are lined up for the next?\n\nVikram Mehra: I can only tell you right now what has been announced. There is a Sunil Shetty web series that is already licensed out. We will recognize the revenue post making that delivery. The series should get released sometimes this year. There is a Malayalam film with a big star called Nivin Pauly expected to release in September. There is a Punjabi film with the big star in Punjabi, Ammy Virk, called Oye Makhna which is expected to be released in the month of November. We have also started to shoot with the Malayalam industry’s biggest star called Prithviraj Sukumaran which may get released this year or next year. These are things in public domain. But we are working on many more – series concepts and films but all that information is still not in public domain.\n\nBhupendra Tiwary: Sure, thanks a lot.\n\nModerator: Thank you Sir. We take the next question from the line of Gaurav Chopra from Union Asset Management Company Private Limited. Please go ahead with your question Sir.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 12,
            "orig_elements": "eJy1l9tu3DYQhl+FWCB31kLng28KJ0ALA3Fi1G564QYGJY1WzOpUivJmG/Td+w+lXduNEQSGfRHHGpLD4fzDb+ibbytqqKXO3KpydSpWUZWXFOW+E1PpOmFZpk7m++RkOVESybAoY7k6EauWjCylkVjzbVX0vS5VJw2N9ruR+34ytzWpTW1g8X3XxZrFvFOlqWH1EmsdetUZXndzE/nx2jsRkeuuo88n4vjtR8t3nD35befDsBr3o6GWz3GpvlJzNciCVv9ioFINmf1AdujyYmWj6TaT3NiQb1bUbVbsYYDltpvanDSH6PNiQ1/5FKuP2zUvPPi5Vqax3v+fQ4rSMKU4d8qyQA4pDJ00T0ond6s8LLykyLz81XLou/46QU6SZB1wjpbvzPPXLn97YYLfnjDMK36YxZIMFUb13W3RyHG8HXSfY5q7jqMwiV8qzZ/UVstWXFCt5ak460qxI5FTo+iOhKmlEWrE/yQ0XC8WzNippsE0obq1OBdw0PVGSGO0yiejuo2Q3V4g4kqZUVS6b62PkYoeO+h+ws++Eo0qqBt5uvVby2HAt8ChVCGbZg/3GEEA+YRZNOIXKuQ0koAuellOou+s90rp0SzOW7nn8LCHqTXRCQbv8HPEqTrRa+F5Yk9Sj4iz5MWdKPqWxh9HuRbXGC760SalmjjCnVbGsM+q4mjZKeJBYsxITbUWZ8iTPZzN0pZo4OOONEiN6luSN8o9W3mx03eOdSJHzvNA/dCQ2PQChSgqRM4RdhBvPpgwvT3afJoTO/qralpx/ckebUc5NtOKHuTwoB1Oea+XF71hX777BrnTG6sr0kq6HecsIi/qHzr8fu8MfnQ/jlSK38e157rine41tkPNmjkd8nFRKc71xKeCr1kEjI51PzUlh1UjoXNJHIoO89h3dPSNQGHwj5s9IsV7NZpzvlJPwEKCFlVeZWCtnzth7geOTGXukJdkfu5mWeqnrweLYGZBHM4sOHxnwQwPL4ijdfCUwa54HiwiN0r9l4LF23rCBS21FNdqJ/X+VJxXfBVZUIhnZLMVMudKZfEe1N5StwgC5bSrVVELqQk3q0PdTMOjwv7lZ8Uss7QI4kA6kVewmEnl5EFOjhukMgrLIIOeryemlzLpPTc8qLkYQt9b1AuZ8U9a5kXPpL8fJunr0P9cFBIk64A1Q2AEK6s5L6D7DrJZRDODwTvZdeBjQaWFIrQEEaW4mjrViKuajNk/1P/QSGSjSZb7A7lLptpa/Ln0Ew3wbjqmjL37zOoJCGTetnJ7bBMlQHJHej/jeNlh4ceG0AFQJpKdj0C6UTPWsTmz5lG0FxIy419rCxMxGJSlyBX4bMAtbkHw8kHdAVmXckJa6OsAVWAEgZZtmGdXNEBFJPiR+8up+yJz9cC5JefBPTudZ5yIs7bdi09Kb08Ou37cE+Lb1p1c7gtcPtw9p/tzqrn/teB5zbD80N8t0SCztQRzZTP2dtdlNbKFfn2M6T4Rqiun0ej9X5PvetnI0aKezKOEXKLl1XdKyy/QezuhXaBq5iC57T6S4Jh4RoBtW0cVkDpmAGZ0m5HPMEw56kKUfSu5/byd7EuD5+x6beVHo2/5YdEC+sKGGBz0RzMroMLc0GfOoLPh4Ev7VR0Y00q+UZzK0XDB8aPlu41/Fj+o/SyOi8gJAj9BQ6HCSbPKd8IiyLzY89I4fL3H+9I7QJSlVxwMkbvAJvFm1nxnmJc8Dz6BH7wYe75vJleTJn7CyG7L96fpzc+L4RVVlQSVU7pQJKzw55TMk8DxglCmsaSkivzXEyO0r34viuKlFyyG2E8Pz34MhU9a5kXPkyMJvOyl5LjoS8KTtNenuJxQwNL/Ss0QMXJL9y/PvycggS/S8WHPjZzJ85uctLwT7+p+gK52+I+OZ57hhWjAmQ4RsGziXd8OfJUBkzsIIN6rVhnuJpczVfHilTV6xQwp+9w/bstRPV0Yn/8D/1vstw==",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "The Film TV and web series business will be contributing 15% to 20% margin over the next three to five years.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Vikram Mehra: I am saying year-on-year as we people go out for the next three to five years, the Film TV and web series business will be contributing 15% to 20% margin."
                ]
            },
            {
                "guidance": "The size of the business should be hitting the range of Rs.150 Crores to Rs.200 Crores in a couple of years.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: In terms of the size of the business we crossed Rs.100 Crores last year and we believe in couple of years we should be hitting the range of Rs.150 Crores to Rs.200 Crores."
                ]
            }
        ],
        "actuals": [
            {
                "data": "Vikram Mehra mentioned that the business crossed Rs.100 Crores last year.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: In terms of the size of the business we crossed Rs.100 Crores last year."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "449b24e8ff5a197d5d3cefebf24f20a5",
        "text": "own data and global benchmarking, the management team is now recommending that we should change the useful life of our music assets from 6 years to 10 years but unlike the global labels who follow a straight-line method, we are recommending a more conservative approach whereby there is a higher amortization happening in the first two years and then it goes on a straight-line method. As an explanation, typically when we acquire content, Rs.80 go towards content and Rs.20 go towards marketing. Even with the new useful life of 10 years the marketing cost is going to be charged off immediately, so no change there. Of the Rs.80, 20% of that will be charged off in year one, 15% in year two and balance on a straight-line basis from year three to year 10. The total impact of the change of the useful life of a music asset in this quarter has been Rs.1.7 Crore positive on PAT. We have made these reassessments of the useful life, more to prepare the company keeping in mind the large investments we will be making in future and whatever we do has to be in sync with practical reality, where an asset ends up getting monetized for a much",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 4,
            "orig_elements": "eJx1V01vGzcQ/SuEgPQkC5Jqy3YvRVLk0EOaoDFaFG5gULuzWsZcckNytVaD/Pe+GXIlxXUBG9BSy/l48+bN6P7rjCx15NKDqWc/qdntFW0v6836YrNZrS4uN3p7sa1odVFd3+C8rlbL681srmYdJV3rpHHn66zyPtTG6URRnq0++CE9tGR2bcLJer1c4k45Hk2dWpyuruW098Ylvnd/f7VeL67n6sfNzWL5aa6m59XNZrO45oPV5Wa9uHrpJN/BySweYqKOc/lgnsh+7HVFs2/4oqZEVTLePVRWx/jQB7/Fa8vFze0GXmaNsZQOPcnVD+9mErHbDXonad3PyO1m7KHHyYMbui0FnF+y7URPnOjM+VGlVic1ktqSNbSnuRpNanFKqhlcHVXQJlI9z+/5IahuiKZSuvoymGg4QGWi2gGWnUpeRSKlVTQ7ZxpTaZcU8uvV56HrF+rPbBqGjFOdcTDr9xTEG5JMqtPuoDrvUhvnHFSr96QCIX/CXy3+K93rrbEmHRR8d4NNpreINuBaXKj3TsxVeAJPvoszmprOzRrX+FDBLF9IpLvIcZGuWuWbElRBVEWfA+/JszdYTJwx3n8HaLVROpByPqmkH/mLmiq49S6yqZFvThEBJAkK75sc6xuUSlujfFAezwGh7XBV25P/hfo1Mc4xIc1dCVYqBV4AaEMO/xL/fy/nyDnAEpwApK2NjODz4HpTPaoB1brDWy1poN7AA6kdJXaw93bPpXD2wKB3Yo2bS2l4PSRTRaAUYs/0Bc47sy8+O0XOD7tW6a4bXK6J3qLJxETPBEhBw3ugCi06FUGHZPDV2PpIhX0jSTocKtvmaD/6OYhnUQEG3IdHVLnvyRXfeBvetoOxdT5B0ozi/HnoZ/TSLjOu0+GRpNyBrOawY2v6iDIGHyMDZRiYyg41wO4Rr0P+8oqUKOjaeFW12jmyIPbdH2cPtdmZhGr1sAw6djiKvjI46ag2GnYbO6C6sKgoVSBCw+k7Yt76TOVM1YBSo91aRgYYOBqnsgrpY+sHWyv6MqDyB/Q7fzSAqFY6neXIWaMF8fDPEamJHqCXVujYg6KmKfVtNFL1bqFe59xz2QQRlFjLO9plYuMcJhFMbWo16sgZBLrI/S1pDJGaAdw1DU3150Ry2Y8sLZo1cllzM8Eu9KW09pbICRDijUsAKVesdkA4iwxQCIkxBStakUFWhD25gTKrs8fJU+nYmhFY3W6WqNLq9noZBa3V7Q0+SXcaa9Uu+FGATM+UkLV9amSRCiHhyXHM0cfEodVZTVOC2rAlGGZfLVNBylne+oJ7TEn2KPI4hMAY1dSY0mMFx2fQlk5qDeRucIhcAOKiRPOkDqQBjpZWZsSgI53oqZSKP2aBmNwXpDTfeeR58fewXq6ggZkLkiXP1zMD/xNXFiu8lcRE/TOXVYyqtz/8xajUUFDU2CFwpq1k3kgVGSU2ubN+yx0kKVqN2RZFMDIoWRFMeIFs5jjfOICYcwzUe/C6RXKV74hDGGJBTiweJdZ2Hi1I0iGd/gyyifMpU8gSOpDtnHs+q9SW0sjcXS3ZyfqqlKFcP6MkHg+ZLRMzF+qNlhHphAZ+dJOy1RMcAllBbJ4tngrLYpiJOYr+djg9SeVJP1i5dvRS4c6WAwEv99Gm5IB8kFX+vIXkD86aRzqvVqkTdB5tai2Xk+edZtpcWKAMRUytr+eT/H8XpoZoBZn7kcK+yE6P6cjjfOQBsD2UQYAstWphFtTWuAWlE1U/mxhlMjcm8FAa/dQPTpYFrDwJKw+JerwcpMihxjbxBGF3Yh6QHzCxRH1HNnLSlZNQ/x4XN0vYBl6jDnU8LTJwjS/X3315VO2Fertni9Puxpr5rDxH9HPhJ7mvmLHnGxwGA2qMYSKDX5lO5lAie+DJBH6cUSBAz95nckrgc7Vevjo28chq+NyckygAHFax1dWr4wGDzDmCCZol7gVktzqawqp8pQ0k3ShPq2Xu1uR5nJoOanuUmBLxy4Kjz1mbKw83ZUBIt8o8QYKrxbX6JTDNes875V7C/PD67jR6Ol0LMvG0t3J7xRd8zzNjeeWCwsh6JosrIseAeiTqCxN5Uz7NeF7BoLnZKg/BgnKXdzu83wxp4MGIW7zcsRzJzPWSTC4xXosHV007JLBiZnLMvPrMc8cwgTMqxD8Fhp53QGFNWRBQVJ6ojGDV8k+Q6RfJbzoE6cE7/qnx7dO/gyzZKQ==",
            "is_continuation": true,
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "The management team is recommending changing the useful life of music assets from 6 years to 10 years with a specific amortization plan.",
                "theme": "Financial Performance",
                "subtheme": "Returns and Efficiency",
                "evidence": [
                    "The management team is now recommending that we should change the useful life of our music assets from 6 years to 10 years but unlike the global labels who follow a straight-line method, we are recommending a more conservative approach whereby there is a higher amortization happening in the first two years and then it goes on a straight-line method."
                ]
            }
        ],
        "actuals": [
            {
                "data": "The total impact of the change of the useful life of a music asset in this quarter has been Rs.1.7 Crore positive on PAT.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Board Member: The total impact of the change of the useful life of a music asset in this quarter has been Rs.1.7 Crore positive on PAT."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "91cec2d40af02c82e6a17c68aa2e757e",
        "text": "longer life then older assessment of six years.\n\nPage 4 of 15\n\nSaregama India Limited August 02, 2022\n\nComing to Carvaan, it saw an upswing in this quarter. We touched sale of 98,000 units compared to the 45,000 units in Q1 last year and this came entirely out of customer pull. There is no change or shift in our marketing strategy on Carvaan. We are still playing a passive role and allowing the market to create and generate its own demand. It is the opening of the retail network which is helping this growth. In this quarter, we also initiated test marketing of two new variants of Carvaan in the last 10 days of June. Music bar, which is the sound bar with a karaoke system, and a mobile phone. It is still very early days. We will keep on assessing the feedback from the markets. We are in the middle of that and may make modifications in the product basis customer feedback and then look at a proper formal launch of these products maybe in Q3. We will keep you updated as we go forward. The good part is that these products are being manufactured in India so that we are not overly dependent on supply chains emanating out of China. I want to reiterate there is no marketing push backing any of these products.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 4,
            "orig_elements": "eJy1Vk1v3DYQ/SuDPa8EUavVSr0VPqVoCgcJ0IMRGCNqtCIskSpJWVkE/e+dkbKOmxpBEcQH2+CQ8/HevBn57vOOBhrJxnvT7n6BXYNlUZywTTLsiqRQTZNUOaoESdcZnVRTHw67PexGithiRPb5vNPO+dZYjBTW84AXN8f7nsy5j2zJ8yxjny/mxbSxZ6s6rdbJGRvF7+7umJep2oOqqiI9fdzDk6HO6s1QV9XLhs2FLbtwCZFGwXJrPtHwfkJNu7/5ojMDxctE69Xt291akT3PeF7LvtuRPe8kwsSWezuPDXm2F+Ib6ZMA2Q3OnsnDYDqC2JMFN7R8xhAoBKERXAfBfIILoQ+p5Lim/GDisBbyLeX6xKSqU5006kRJkZddUjWYJ23b6PpYo65ekfJTuTKcZ/y3EkKvBpWp9LAyXORp/pJhc/ku5S1F0tE4e68H5uh+8q7hZ1la5Iey/Ek9ueUrKIR4dXxO+B/oPUbzSB/k4QvE52XVqKLUiVa1SooGjwlW/Ks+dAXquiybon414pXKi5RteanSUmi9Gg6Hw8azKo5VWr5g2Fx+jPhK5Yfqx4k/Pif+PXo644jwxrYG4Xczmkgt/Dqf5xAhWzWS5/9rBlSVF0VHWaIzPCWFrosEi04ldVVkSjdtXunyFdfOMT0wz6enrbOe61w98V6mxxcMm8ePNaIuyqz+SY24caOxZ4gObtA/Ito9mAgBF0AL8xQWuTWWN5YJ8NeMPpJP4U9eYW7WPbcs4EAyQHW1z7IMZmtiAO3GiTvcSlzedVAcn11ytHcKGFJcVx0narfwGkcCbqzxNFyAiZe4mgXhRl6U0zwMKXzoyRPwY+tA94yWk3sIvemiBHazhxH9A0WpO0SeYjpzLHuFt9bOpfGdGQaYuMPyEmFiinngwTvGIyXhMLgVvQDYYgoc7Yljri/OZEkSgKByi4WWRran8CZKheLnJrISg4HI0bMGzQCW4uL8Ayy90b087WmYtlR8OHu3xJ6j/Jv1PSycdgiOcZpoUOaF5Ruf4ZUsi+PwCzyiN2ilru4KfWsjbcyrDFq8rNe/zZZSeDsHo6FByXMtS14HNzNUtsNiYs9EPaBH98AXq273G1cwuobVCFPvJNhGwEbxI/kLcJ+5pZJxbcAiFw9Ek3Rm+wJeme6I2gb1A3Tejc+4D0+d+wJjNG27SS/2GNcyRrzwD9c2utZ0RqNMT7g68Py0s46MJYjYrrp6SrjpkD/Mg3N8iiIKzw3kJ86PODBxs2Vitl6Gp4BB8jZrXe8O38Dj9cFT1K7NwiAdPDsJt6BvVzHz2bUsPv9FMpz2m+ACuSGhh8U1d6jjLJPF2bbdGdzmtmzsWMdjw5wL3cTqa9f/LCyEeZrYxjNjmBIRKm6a2cbspudtyI2DhVUjOvfEG3lVd3w2cl+1Ns2hB+FtHR97+S8t6Xe+qB//AYLIRt8=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "We are looking at a proper formal launch of these products maybe in Q3.",
                "theme": "Distribution and Platform Strategy",
                "subtheme": "Technology and Innovation",
                "evidence": [
                    "[Speaker Unknown]: We are in the middle of that and may make modifications in the product basis customer feedback and then look at a proper formal launch of these products maybe in Q3."
                ]
            }
        ],
        "actuals": [
            {
                "data": "Carvaan saw an upswing in sales this quarter, reaching 98,000 units compared to 45,000 units in Q1 last year.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Board member: \"We touched sale of 98,000 units compared to the 45,000 units in Q1 last year and this came entirely out of customer pull.\""
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "be4db0a9cf3e8bc99f110ad4ad5b56cd",
        "text": "Bhupendra Tiwary: So, my question is basically on the web series and movies part, if you could talk about what is our overall pipeline of things that we are looking to do over the next 12 to 18 months number of web series lined up, the movies because I think that piece is getting bigger and second followup to this is what is our kind of margin profile that we are looking to get there in this segment? Thank you.\n\nPage 11 of 15\n\nVikram Mehra:\n\nSaregama India Limited August 02, 2022\n\nThis is a business right now which will generate15% to 20% margin after writing off the entire cost of film or series in year one itself.\n\nBhupendra Tiwary:",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 11,
            "orig_elements": "eJy1Vt1vpDYQ/1dGSPe2RtjYfOSlah8qRbqrIiXqS3SKDB5YK4ApmOytTv3fO4bNaa/ZVlV6+wTzw/Pt+Q2PXyPssMfBP1kT3UCUpdrUqW6YKGrBJNeKaW0My2WSy9Ikypg02kHUo9dGe006X6PaucnYQXucV7nTR7f4pz3adu8JESJJSOcEH6zxe0J5vqKjs4MPeo+PQmZxvgOeFTxOP+/gG1AUIs4DwKXK4/QisikRFM3H2WMfsrmzX7C7H3WN0Z/0waDH2ls3PNWdnuencXIVHUviIpOC04HGduiPI666d5+iNeihXXS7ZvYY4dBGwcVIyNOw9BVOIRMerHv8EpKNftkvIw5m0vBgD3o63sC920F/hD8WnIN3sDNUera17rojkOz3CAesYMbJ4gx6MNC7l/A66snvwDZAlYPaLZ0Br7tn0BVVEg577YMxt0zgXnAiezDaETs7ILiG7NqhnelBxw4IekLonHsmELwD41al1ftAsQMXAeYFOR/8foYtv2DoLLhg28Ay7la9U5gV1nqZEW5Xl8+bx9FijSG8Fr0PPivbtmQvpDdj7ejRuK5zh2UMfklzDqfPk6JQTfDf66m1A1C/Qof+KSHyE4Ii0A6buRnbcLd/goe9prCoiHHo6WuLP9rZ34arQu37+yDwxFQ8rTWTpaBBSIqK6aYuGU8RlUqaWtb51QYhpztd7EAkWbbd8leAJ6fJKFUSq0vApvK+MZBcyeJHjcEdfSMotI+r86r/6pyn8xdq3gguZVMlLK+kYpIoh1VNmrIyT1WjOOZNeb2aCyogcUCaq5iv3LPJMkk2WQoVJ2/l7fy/1vu95RTn5fzdPk+6h0+4n/TNeTkfrO/wUjVzqXPkdcpkVjZM1k3DKkwkE1WpUiNKnfPyatXkXIhA3SLjcbby9AlI03S7sETcRZxdADaV993gLFHlj6r4PdFLq3sNt4OxGj7a3nqivp+Xdpk9JCIMmxD/qRUVXWuhSsF0VmRMFmXJtNA5EyYvK1UUmJbN1VqhToXP5cYlJ1nK7NsGzQJ1vAE2jfc1Ii/+F5N814iH02bQUC0zrZ95hinUAAZ3oHVh6z0cLK2+FgfagR65+hDWgUg+vC4O3RDjwGGy6x5yTbMuL+qPpWVRO2onsRTF2oObXhcdqR1R0/qjXWr9jF3z3e74TU/ky77gQ4jyQs+lNlmKOmVpajj9SSnDygJrhrLmdclpoeAV/6Q28lJEVuqMzBRx1ioTJYRReyOv569PZm9+kS5M0ee/AAQ9N/I=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "The business will generate a 15% to 20% margin after writing off the entire cost of film or series in year one itself.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Vikram Mehra: This is a business right now which will generate 15% to 20% margin after writing off the entire cost of film or series in year one itself."
                ]
            }
        ],
        "actuals": [
            {
                "data": "This is a business right now which will generate 15% to 20% margin after writing off the entire cost of film or series in year one itself.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Vikram Mehra: This is a business right now which will generate 15% to 20% margin after writing off the entire cost of film or series in year one itself."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "28c7baab329853f3617ec676503f7006",
        "text": "Pankaj Chaturvedi: So, we have been resolving all the queries that come from either the stock exchanges or SEBI. Most of them have been done and during this quarter as well there were some questions that came in relation to this, and we have responded to that. We now await the final clearance from SEBI post which we will then obviously file our application with the NCLT. We cannot put a very specific date, but yes normally these things do take six to eight months from the time of filing with NCLT. We are pursuing this matter and seeing to it that any kind of questions or any kind of steps that are required to expedite are being followed upon.\n\nSaket Mehrotra: Got it thanks a lot. That is, it from my side.\n\nPage 9 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 9,
            "orig_elements": "eJy1Vdtu5DYM/RXCz7Hhu+w8dtEWATbFAlmgD8FiQNv0WB1b8kryXLDYfy9lZ9K0SIEi3bzMWIcieXhI2o/fAhppIuV2sgtuIRBpLdIMRYh9F4d5WTQhdkUWZpVokrwu2zzB4AaCiRx26JB9vgWt1qaTCh3Z9TziRS9uN5DcD46RNI1j9nmCT7JzA6OJWNFZS+W83+NjmlYRQ0kR51H85QaegSoTUeaBJBflvyCbE0OBvVhHk6/mkzzT+DBjS8F3NnTkqHVSq107orW72eiGr8WRyIq84Au9HMldZlp9P90HK2m1X3C/VvYYkNoHPsXMyE4tU0OG8doHd3R2qx+qA/4BHwZ0izlSJ2/hQd/AiWDAI0FDpMCQ1eNRqj3gOIIbCL4uZCRZfkYHrZ4IeqMnIMlGs96wTrcHoHM7MCO+qQ08/PzTXQT32jrQvb80vcjRaUWAqoNuMT6TG6TlNGgcB0TLhLbUhviRf6xPyjSsF+hKBBmTnu+IHgan1zg3a+BrSVzNrFVH3WZGF8HvBEqfAE8o3cq+5/EYoR0JDar2qTrPH2ZP/zTIdvABT3JjpUA3R6kXO17AdwX0wqzneZTtxuTEyqyRf/vw8fOasEWltIN5cYBwJHMBO1Mre9kCTyrdQMOWCyuntJlY94t3t+QLUnvLeoHDA+sgz76OdXZh0soNdmPrkznJgrDWTMlrupJ4JoCs4rwYuzzLPaFb1WaxLNEKa1gVYXFRXeAg2cTx/tJdm78ZeJLnp2b48Ia+LtJsStN55ulyW95mjd7rcdQnNi/ckMiP73WaP0rr7vxW8Kj+c+c7rIuuSfuwj5s0zLNShHWaJrz9cVVWdVW19XvufBkJv9B1et35DajTZNvwWlSvA5vL2za+iLnCH7TxDzw2Du5pMNoZvIVfeQq3JquD5VkcNW/EZ99CvzlsWcdp4vmUHf3nLjUiabI8zsO+zZowF7UIm9gfmzoRSZV2NSbv1iVRlhHLlcb8L3wPrkASX5uSp1H6GrC5vK1LWVZW+Q97L+8Jar9TSfFS81+05h19TfG2FknNH4aw73LeC0FFWBVtFQrMCfsCk/gdFU+L2H/W6mxT8+mYViIq/bnI0tfO6/U3as1f9/+hdRK/FPulwHcTXwy+f/kTO96emQ==",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "Table",
        "element_id": "427c0abfb041b205d123f020d6cc2e0e",
        "text": "Vikram Mehra: cannot get into specifics details. Ravi Jain: just wanted to get into basically I think these deals has taken significantly ever since we signed the deal and because it was fixed deal do we expect like a significant increase when it comes up for renewal that is all what I wanted to get at but I appreciate if you don’t want to disclose. Page 7 of 15",
        "metadata": {
            "text_as_html": "<table><tr><td>Vikram Mehra:</td><td>cannot get into specifics details.</td></tr><tr><td>Ravi Jain:</td><td>just wanted to get into basically I think these deals has taken significantly ever since we signed the deal and because it was fixed deal do we expect like a significant increase when it comes up for renewal that is all what I wanted to get at but I appreciate if you don’t want to disclose. Page 7 of 15</td></tr></table>",
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 7,
            "orig_elements": "eJztWN9v2zYQ/lcOfnYc26ubtghSdHsYPLRr0QYDhqwwKPEkcZZIjaTieEX/931HWbGb/pjbhxYF+hBbpnjH77777njI1ZsR19ywjSujR49opM6yxTyfZifT6SI/uTeb80mmZsXJ4myhdZarBwXfH41p1HBUWkUFmzej3DmvjVWRQ/pdq63r4qpiU1YRK/P5dAqb3fLG6FhhdXaWVltnbBS7q6v57MHkbEzz6WLy0+sx3f6eLfAtC7N7D6cfWUk2WBmFbYjcSCwvzA3Xr1qV8+gtXmiOnEfj7CqvVQir1rsM26aTxYP7Z3NsKEzNcdtysn3xbJQg27JTZYrrasS2HMkRLVZWtmsy9ljH6aPIN3GlwqqKTS3m51FlNV+cx4qVxpeXx4vzU/nA3yvluVSNoqXVRtFT05jImp50ZRciTecSz3zebz9NxnccwC8F1TBlnc0rcgVF11IwtmQfaFM5wgmk6uAodzZ6k3URL7GLxDQzJWKKFJwtAylYcF3Ld7ICSddMzqattTznxuediZMDRKdDaJnT2x1AffFSXRv6TRn7CBt0WuqsBqaorIY/FceAHCkpg/gawsPhBofLOxy25j1gFriKCt6Qdh34JG1KAwNj6RfvPKenyL4JwoAXdx2Hx/3Re970xR9m7VVDz7jyao/sKccU4paVpxI/3DV7KgzQTuiZ2mZMyx4cniSfgqcUPqBjAMs44nAympX4sRN6gr1LypWgwqNsS3GZ2PuxLiZfVLsQThq1Tjmp8Dmhy7QRKUhkCA1N4Xzc+RuOndDz7Nq4LtTbMbIGb7VB3HJCqFxX60P6gimtKQzsY70dcg+h1MbyhJbpOFlKIdM/nfKI569uPp09BLWyljI0oV/l9C5Q4To/7ANSpBQQ3mPIUabydXodKlFUg1xRaDkXMIQ6VKaWtMcqhfR+vj4go+drtaVeRBClSnghYZSz6Baf6EZMf5LrLjuAuTa8ScHhZCH1kAuoJvesAkt4fjsE9JiWYiGcOAiux9cFFm1Y9koqVMgFIwhXMoc8Ko+KoxYOUhECW+ndBobOy7lIy22t55WyllFmtbN8pyxv7Y4W75NA4tfrcHiqoBy/U+K35zjfl7e8HDANuXYFmDGqHjCGCf3cCU84Q9UmQmuIRDsOtjeJ1Kgk/k1iWHwK4xIydCshFd414761YO9axNgY0AUxWIPKvXQN+EtGspVEWW5j9ywh1R8mX0rlnYAF2/7gJLYPuQzIWq7gc8iUalxnU94sUAypjbs67FPcgoauPU6iT6FK1JkpULMN1Pq3NPMAmfK/LFymjgrPS4t2WEpO0Tnq1Byk9aIMbxClrD2W4tRGp4ahuWWQsevH/bUjoENEcprQA97wZHK0dlAE4jiqGlWa4U4+LE5cGseF+7sbpw5XKU0yQaAUWe/73d2QjgVndxmvx9LRUFfoghAbqbbt0SUV944L5s9BHIE1JE6hFTS0VnxD4kg/8rDl+LkMyqWB6cXd8heG7nYcoKSQDVqSEOf27jIV0KlqiGmZroe1pD7sYk1BRJSUvdPgpZvJDJCzFJ28475dJplJQQ0FsMvPPjup36Ef3iCO3TX8kZaJgrdiLwyGuxTGgztsI8/LO9FhSa7/pWTTg7JUvUWSkXa3vUVsUhM2IcdNibvqBSYuOhPVzxYHzJ7upo/TftxKY56MYjKC7emmd3JIX/nFcbMefaOJDqn4+gMa/Zi8PjV5FV9v9KIjx6rvfaqi731cSgPN9zMv0Tefhfrq/fSYQ585wgDtFw0nEsH/TR57vJ8YKrDpx8jwBSOD/Ctn+M/OpTTL0dvX/wGNb5zV",
            "is_continuation": true,
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "97b8952da0e0b05c8ff4106a0341378d",
        "text": "Saregama India Limited August 02, 2022\n\ntake the first question from the line of Ravi Jain from 2Point2 Capital Advisors LLP. Please go ahead.\n\nRavi Jain: I have just got a couple of questions. One was on the royalty expense that seems to have fallen both Q-o-Q and Y-o-Y, why is that?\n\nVikram Mehra: Sir, royalty expense is more on account of the past catalogue of ours and it typically depends on the mix. There is some content where there is a royalty expense and there is lot of content that we people acquire only have one-time payment. So, the mix changes a bit here and there and royalty expense will keep on changing.\n\nRavi Jain: It has got nothing to do with the accounting change, right?\n\nVikram Mehra:",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 6,
            "orig_elements": "eJy1llFvpDYQx7/KiOc1AmMM5KU69SlVrs01p0qn6BQNMF7cAN4Db5LVqd+9Y3Y3jS6r6hRl3/DfjD2e358xt98j6mmg0d/ZNrqAyGSprtMyETpPjFCJTkWdJ5lICRtMlNFJjtEKooE8tuiRY75HjXNTa0f0NC/jHndu6+86suvOsyJlknDMQX60re9YTYtF3Tg7+hB3e5umUsbFCqROY/11Bc9ClmVxtggqL2N9QtiHsBLNu9nTEM5ybZ+ov9lgQ9E/PNGSp8ZbN941Pc7z3WZyNb+WxLmUVckvGNuT321oib3+GC0pj+strpdz3UY0rqOwxYaVu3E71DSxrsPinp7CSaMbnGiNA8Ll2FqEKztYTy182K63s4dEcqaJlGHp406fre+XBH9EoU1aZKZARpFKoWqtBZKsRFtL2VS1SWtjzoYiT8ul8IWKi1Dnw1ipMk4OdddxfkLYR7wNhE7SqnonEB7vCXxHYOzElf+2pTlsCWZyw6L3diRwBv7EBwu/oT1MyetQBAm/4sZ67OFD+2BnN81wdXUdw3VPOBOsHWBH2MYvQf6O04TePtDnkMIJoDlSiQkaUWR1JZRRuagqo0VVtIlKC8Wnb88GVKo8zphXVe6BHsZ5IV/wUyeEfcTbgBa5rtQ7AX3mdAGX0OEDwd/hk1o7DwiN2276BecR9BzDHwz4EWdg6gH45HbY+x3Q04bGOZgDPcxEwwze7Vc02Pc0Qu18B5+EE58Axxa+8NOXFTx2O7DzEvbLS+5XdvaXoTAnkFcmV5WpjMgaKoSSOSNH7q6kS8pVTbrW+RmRq5glLfN9rzyMizJ97p1F8MArYR/xRuTZuxH/y95POMBH6ia8gBs7rV4xZB6DmyggxoZNMPrggUB7g2yOhkvau/V2cYbb8lcceFoPnJptGPYOWuKV2meTDPYphs8dTcvasxuIvTV6Jsr8g+qPc/gqmbD283TvllSOwYvZHjktcsGo2Hzb2iVvTmGxnhtJeDuExHfBQDHcuNUxJWg6Lh6FTWvOftnjv93C04+5PNq+h3uiTTjYEm3HdfyztjVGlop/BEQl61JwI1CiUgZFWaSyafK2UXV2PttmKlw1ZXa4eo5jrQ6NKc3K00L29qtH6Tw/R6diWNyBQpMauakwg9BrWsd8uMUEugfbhpk9ZDZ5KNjPtxiUmNQ1CaNLvlUKXQkM6IpUI6WZbOokPR+rPInTFVT8d1AtrA5jle3H3PFCy3k1Xt7/X1Lv3kBO/HN9/Rcr4Vth",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "198edfa1875920cb5905f215e94d4468",
        "text": "“Saregama India Limited Q1 FY2023 Earnings Conference Call”\n\nAugust 02, 2022\n\n0 ICICI Securities\n\n::::::: S\n\nANALYST: MR. BHUPENDRA TIWARY – ICICI SECURITIES LIMITED\n\nMANAGEMENT: MR. VIKRAM MEHRA – MANAGING DIRECTOR – SAREGAMA INDIA LIMITED MR. PANKAJ CHATURVEDI – CHIEF FINANCIAL OFFICER – SAREGAMA INDIA LIMITED MR. PANKAJ KEDIA – VICE PRESIDENT – INVESTOR RELATIONS – SAREGAMA INDIA LIMITED\n\nPage 1 of 15\n\nSaregama India Limited August 02, 2022\n\nModerator: Ladies and gentlemen, good day and welcome to the Saregama India Q1 FY2023 Earnings Conference Call hosted by ICICI Securities. As a reminder all participant lines will be in the listen-only mode and there will be an opportunity for you to ask questions after the presentation concludes. Should you need assistance during the conference call please signal an operator by pressing “*” then “0” on your touchtone phone. Please note that this conference is being recorded. I now hand the conference over to Mr. Bhupendra Tiwary. Thank you and over to you Sir.\n\nBhupendra Tiwary: Thank you Seema. On behalf of ICICI Securities, we welcome you all to Q1 FY2023 results conference call of Saregama India. From the management, we have Mr. Vikram Mehra, who is Managing Director, Mr. Pankaj Chaturvedi, who is the CFO and Mr. Pankaj Kedia, who is Vice President, Investor Relations, so without much ado, I will hand over to Vikram. Over to you Vikram.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 1,
            "orig_elements": "eJy1V2Fz2zYS/SsYfbwxOQAIgqC/qTKd8GLJrqS4k0kzHpAAJVwoUkdSdt3O/fdbgJSjJmpaO1Yyo/Eud4HFe2+X4Mc/RrrUG111d0aNztGIM0VioZSHCc89JqT2BOXYiznFeYiVCDgenaHRRndSyU5Czh+jvK4bZSrZ6dbZpXysd93dWpvVugMPpRhDzuB+MKpbg5dEzrutTdXZvI8fI0J8cEG0jz+dob0diMjn1o5FfMzu48Exah/bTm/sOW7Mb7pcbGWuR/+DB4Updfe41e7RzXTkqqlWO7lyJX8c6Wo1sitswXNX7TaZbmyJNrfTv9lDjGzSfo10A3F25a/xk7nkTBDlMVoUHlMZ80QMJiGKiYgDhkqfDL9ACIsHE6zHb7A55X5kbRLg444+47sIKt3pvDN1dZeXsm3vtk2dQRj2AxLz4JUg/nVHMckXstEruZEorZSR6MpsTKcV+pmgyw8U0wAlsqlMtWrRpK4K3egq12giy9Klq0OeZrJpZGfu9dLucISvgsocS8Y9u7DHoqDwsiBiYHKV4bCI46w4GV+cY4t+ZEmwdOxtPtgEM+GzYw6X8TK+aCQYfSW+xrvVru0QprYJKX0W8jTAMdF54YU8U7ZTlJcR+1MElMEfOObydMiHDumYBn7gkO9tgu3EGZCmFulvPX3OyacNRukE/qOFzneN6Qxk/pP5UwhZ0IwFHgZZe4yQ2BOk0B6PIh3RUGZ5rE6GKiGhG9hxyAfM9o4nAQdhdNzhUk6O6nn/Dy0OwXxf5XD0Vd2Y37X6K7lqIiTPM+2FhACwPAelighGfMS54ELoPDrdYKcs9AMrxv1k3ztIxHzicGRh6NOjHvwDw52KgMavNSxm46sPi+U5ms599NPb9zfJ7GI+Rsv0l/H8A3KzO9iLPpm8n6fLNFmgq3SaLpOLZ40WmHAkjGQAXGXcYwH8ZDImXhZSmsW0wHnGTsdVEDhqKBF+7LgaHCEeyHPMHPf0SS98EQf41biaAllvkmkyG+i6Td/Nx1M0Td4CYwNVLiadvUEX6TyZLK/n+weL8Tx5M56OUTq7SMd7Bt06N+PZu/G/0eTtePl+fptcpPucyds0uUSX6Ww8m6TjK3R9eZlOkmcs+S6xD4bwW8hFN/NkkV7AEZ60NbtNFrbOeXI1XqbXs8X3l3+W5nRINclBaVFUEI+FgnoxTAlPc57FUU6iUJxuPsAM8ol9B3PaX+z2DoIHRwwvL3rM0ae8THE8jvlrKe4GHiGC6gLa4lnAEx5nAtPQIzSEcaxxBsAL7kkYAtBOYRxl2QnfeJTYxqWc9J8ke0cQ0L77obWFz484+pQXAh/RH2l1egj8X9y2v3O1W5quPHr5YErFAj4SPYkj+HjUQeDFIhAeY5GW8IrUivHTzV3qrnCM4F7ggx3tBU8YF0cdfcbLiIhiQdkrETGtlQap1805upIKLnxIVgqtAF4H8hla1bVCSj46/4Mu83qjUVejbq3RVyz+/bcSWtet5Tl7/Oai6aMx7I0avTEVlIRs9FY2ncnNVlYdKk0FxT0YcGcamcoVUBpYrvLqqnxEGziJKxIeNPopUlao3m7rpttVpntERd0g4NSeQLaf0X93urUQw9ZFB7vaRbeNbuH80vpRXld5uVO2vsW63pXKZVegKshvYXtpz6bgENXKZedfTpy7M5Rathq1ZlXJsq+mB9yCYLdqbWb/Dfqv/lvSrlMNLjy4oBTYGAqsd/m6qysocw2/8Cbq16/qDmhZyw5+THtYBViZtns0OgfRa+WjFMIf0HoA6zC4vrcg1GjawG1pvdvqSjUSLc2DbB59tISUzw4Am7qPtfbCNP5ht14BMqmV9bGGpVjHRIZegDXzGHzsehIGmBcFPBdBHIShik94URJ+BP0YsqFhezve2zAouR8ecfQZL2tYEYVB9EoN+zUr5wesLLTeSB9dV8D4WpaFfbF93Wdn0MRPfeyoBJECi1+aFzS5K7v2GyXDYn9ueB9dNvXGSWgjKyjZkuzWX8t77TR0az43coOmet1IeLKurRynNtgq8sKAJqEVzlzsDRxD/gdNQMS75l4r85Rgd5hcXjvVHUS+g5gvq94aKPQGijfKlZFW99Db0GdzXbpehqO3NcyFDvq4QxvoIyRVDYH9rFgfarqvG6A80PjgOy7zT/8HxXc7yg==",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "Management plans to increase revenue by 15% in the next financial year.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Mr. Vikram Mehra: We are targeting a 15% increase in revenue in the next financial year through strategic partnerships and product diversification."
                ]
            }
        ],
        "actuals": [
            {
                "data": "The company achieved the set financial goals for Q1 FY2023.",
                "theme": "Financial Performance",
                "subtheme": "Financial Health and Leverage",
                "evidence": [
                    "Mr. Vikram Mehra: \"We have met our financial targets for the first quarter of FY2023 as outlined in our strategic plan.\""
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "cb526f326ee40211c9af83e433c97210",
        "text": "Moderator: Thank you Mr. Jain. We take the next question from the line of Saket Mehrotra from Tusk Investment. Please go-ahead Sir.\n\nSaket Mehrotra: The first question I have Vikram, you mentioned this 550 million plus impressions of Sarkaru Vaari Paata from April to August, so this is across YouTube and other apps or was it just YouTube?\n\nPage 8 of 15\n\nSaregama India Limited August 02, 2022\n\nVikram Mehra: This was from Saregama’s own YouTube Channels and audio streaming apps. We do not include user generated content or any of the other short format video apps. . .\n\nSaket Mehrotra: Okay, the second question I had Vikram recently we saw this development where Meta announced that they are starting monetization of music on their videos, so would you like to comment anything on that? Has that gone live for India or is it just a global announcement that they are going with?\n\nVikram Mehra: I will not comment on a specific company, but in general I will reiterate what I said earlier. If we talk about short format apps in India from Instagram to YT shorts to Josh, Moj, Chingari the nature of the deals is a fixed fee deal with a clear understanding that as their business model evolves and they get into an advertising driven business then the fixed fee nature will change and will become a variable with a minimum guarantee. We saw how big that became on a platform like YouTube. We believe the other guys will also go in that\n\nSaket Mehrotra: Alright so as of now it is still in an evolutionary phase is what I understand?\n\nVikram Mehra: That is why we all are protected ourselves with a fixed fee. But our deals are structured in a fashion that if they move to an advertising driven model stuff and they offer a share of advertising to any label globally, we also end up getting it immediately.\n\nSaket Mehrotra: Got it and any timelines on clarity on the demerger? Can we expect it anytime this financial year?\n\nVikram Mehra: Pankaj will answer that.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 8,
            "orig_elements": "eJy1WGtv4zYW/SuEP0eG3o9+GcwW6G6KBhtggi6K2SK4Eq9sTiTRS1HxeIv973tIyXlM3SJwY8zAiK54KYrn3HMu9fm3FXfc82DvlVx9J1YJJ0UY502Qy7AI0jhug1o2HMiEoigvy1Y2+epKrHq2JMkScn5bNVobqQayPPrrjg56svdbVputRSSOwxA5S3ivpN0iGhU+utNqsC7v8+c4C9fRlcBzonXy65V4ChRZMgeiNMvX2cnInITQajyMlnv3NrfqK3efdtTw6n+4IdlyY5Ue7puOxvF+Z3SNYeG6qKooxYBWdWwPO/a5tzcrv+hhM9HGv9nnFQ+blXvEDpH7YeprNoiXbnLLX927rm60ZENWm+/E3ZaGB4GXFjdmLX4kNazFv1hYesDPlsWAFPGfiUe3JtEa3ftwpwYWuhWfMM6KG94abQ3N9++m8UFcD4/IcaitxW3HNLLY6IC2TFJ8Umbt1n18jZ/UaK/ddmCN34Kdl3WZ51kTlGlTAew2DKiVMohlHLYt5VmWXxDsNF0jFJVhtI482EugisN1uEBbrvOTkTnpPLDLLMyzdwL7NUQOcRatMuMLWK/Flh5Z/KweDPVXng0OAtxiCbjVKLIsFL3qOjd6102jUP3O8Djiepx5YB7ITOJnIqPELQGJmQwfd0Z1wmrxcdpMo70So55nxH9qjB5H8Yue7qaaBQ1SaJDLCNrtMKsRe8I4K74g8Tjqw1uJU1R5XWayDKhuoyAtywbEyWQgyyQs6kJGTZtejDhFnjtRiIHiLAHHQBQuslGl8To+FZhTzqNNmhbVO7HmFrdE6aCNspdb/oPWFqNPbHjShmGYFTLgqMmx4WkS1GkjgyTLoqhOOaQoudiGR1HsKzPOo3Xuy3AJJMmzCPu6/F1gTjlvw/Mqic7f8Op1mRreUE9QTqlI/KR6ZVF9c9mI0FMjjl9CcadsxyeRCIuc8qoIilIykCjKoMzwIxuKcmBU5zK+nGYm5brANhfLNi/XaZqviyczTE8E5owzzTEqyuSdgJhV0AumV0sIldMhr2ZHkP49xWFUQaP2w5N8fQ8nHbgbvY7RJJUWozVMvRo2XtG8sUotBm2FGppukiymEXK34cHZMdBu9GCBo9M+Gg6u+pzZzqI4brWxotWmJyselWS9zIp/bxXFquA0xE+QNxWY0dRpQHmdB3lbN4WUMkmKy4li7CrvSmTh4pTLdZ4Vx4JEJZ4KzBlnOmlR5O9Woa+N9J8PdLjyAI0M4ORrP5WLnQrDDQDoDmKPgbSf3U/yI3d656ARe6DLmBeWCQbpaWi86wJlzH0QoByIRMY6HvWwZKv+S/4xoEc/jaoR+BtDlZlpMXqT3eupk97KO+V6OQ1y9f55YBbWgMl8GtkP4h/gt3/gBtNjPHoB8GxRIvyhnm2YxKbTNXVPS/VTvl7tRrvZ98pu3+zWdVTWWVJUATVhGaREWVAlJQVhHsZZnVaQs/JyxIxzJ1FFWC7EnK+rsjy2dLn3kt8F5owzJSsusr/Q4v2JZF1j67vOy8wRciBNYtxxo1rQBdEdSHAl6skp0aI/3THRMJzH6RGYCVivwVolBZPpFOOMcN06JlvqHgTV2NjXwuRbN8w5c8eL5vUA+m7cAkHCX+7m8aO7+FGP2ytxo79cQT3BGdc7+kMH2cnwUf4kUzf3i+hbv6I2Wp6DnmKINjhfGDENONTgSXgw2OcZ6Wnt6qJGmQxoV1E/kjvBj7rD8cQrtWftht1GYEWEjZKPjGIb3SzSoBaG53QM9qX2YiHLWv3ONbCAzdzI+usautDjWjzizaju+LhieILqp14AZkOQfPbe4NRhq/eiVsv6kU/I9+jtOrJuj+dyXkzHp9UMYB75hVVspsM4rwA7p1GPDhE349vLMa2TvGWUIzVBWtQU1BVau7hCF5dmBcd1fcFTly+/KMTJuphPXUugPJ6x4qr8o4hPOq8k0SMV8YXM4mNn3DY4ZSZ/YhoANEQVtIZnACkgBPI5Zk5ubWQOYrd1x2bXf8x1+MzwN+tqmiVZ3qAfrzhsg7RNAWTDaVC26A2TtIYKhRcEMvSn5ShJ19kM5ByI0ychRe8Xn4zMSWdqa4gW+ELtINkZEe/n5EoM1Y8nu6VAEvRkRvbispT6k1Ksxd8glri/CNrs62ZqnH5Ij79oadyqxZaFamdx6vWj9+/T2jQr2mintn3WM9227hgNqaVZR18m+qkOoiMIx+LmHczAvw7oyZhk2jlJ9B2H4yhMBGpuuTu8udNsmRIqqzxoowIKUsYJDuKQkbIEerms0iq7oIIs3+SS8JuPdE+nEtAsW1enI+Ff+EgXZfl7nUO+VZC/u2ODnU8XgM+qnt1XuNHZA5ZhlD0sjSAI1rPZsPkgvgdpACx/hfcv6QeXOXehLfZ6aBSc9AAHfbOohDXHlOB8z0lbB+iFiqBmjoKUcwqrKkniorjgKSL0Qp/Gy/nxKQDh8BLiPrwlJwM+5Txkk7jKLiMptzQ80JfFrodxj8J15f8Hlfbr/wFEBDDf",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "Saket Mehrotra mentioned this 550 million plus impressions of Sarkaru Vaari Paata from April to August.",
                "theme": "Content Strategy and Production",
                "subtheme": "Audience Reach and Engagement",
                "evidence": [
                    "Saket Mehrotra: The first question I have Vikram, you mentioned this 550 million plus impressions of Sarkaru Vaari Paata from April to August, so this is across YouTube and other apps or was it just YouTube?"
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "c484c2dfec6befea2710d89356c554d4",
        "text": "Saregama India Limited August 02, 2022\n\ndelighted with the numbers that we are seeing in Q1 because Q1 has never matched our Q4 revenue ever before.\n\nCA Garvit Goyal: Understood. It means it is better to look year-on-year?\n\nVikram Mehra: You have to look on year-on-year basis because there is seasonality in our business.\n\nCA Garvit Goyal: Understood and what are the developments on the Carvaan platform side basically you were mentioning your annual report vis-à-vis getting advertisement type of revenue also from Carvaan platform once it gets commissioned, so what are developments on that side?\n\nVikram Mehra: As the new generation Carvaan is going to come in, that is where advertising and subscription business will be built in. We are still sometimes away. Like I mentioned to somebody else earlier, whenever we are ready for the product, which may need investment from our side, we will talk to you, but it is still sometime away. Till that time there is no marketing or manpower investment going on in Carvaan.\n\nCA Garvit Goyal: Understood and Sir basically we are looking for the new acquisitions from the music side and what is our specific target when we are acquiring the new music? Are we looking towards targeting a particular A group or what is basic approach I am 23, so your focus will be on our side or on our parents’ side so that is basically my question?\n\nVikram Mehra: New music will be all talking to your age group. I am the age of your dad and have no wish to get into music acquisition. There are younger people under the age of 30 who decide what to buy and what not to buy. We are very particular about it. Nobody senior is listening to music and taking a decision. In fact, we sometimes joke that if I like a song at my age, that means that song will not work. It is better that a 20 plus youngster choose and decide the songs to acquire.\n\nC A Garvit Goyal: Right and thank you very much Sir.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 14,
            "orig_elements": "eJy9V01v4zYQ/SuEz5FAUdTXXopgD4sA7aLtblsU2yIYSZTNWiZdkYprFP3vnSFlr7dJgSCNewhiDTVDct6bN6NPf67UqHbK+Hvdr96wVVYOJXRZlww8g0RCLZO6UlmSt5WseC6LWmSrG7baKQ89eECfP1edtVOvDXjlwvMIRzv7+43S641HixCco89iPujeb9CaVcG6t9p48vv0KcuESKsbJsosLX+9YWdDnudpHgx4gLR8whBd0LJyR+fVju7yrf5DjR/20KnVX7jQK686r62570Zw7n4/2RZf42khKyHwhUGPyh/3Kvh++80qHNmsZ1iHe31aKbNe0RZ7tNybedeqie4hKbpXf9BVVx9gUmvYAbszvQb2td5pr3p2O69n5xnHfQQXgmKftvqo/RhO+E8sVJ/Vec57RGAgLHKVtGXZJwJkk/GsrhqAq2FRLJmvijSjRC/PUjbnxJdp9oQherwMiTLPRPNaSPRqpDtj8g/ab5jfKBbfdPgbPDsohlgxp5Q2a6YN+y5jrepgdop+bsAxox7UxHbguw2GsfPEvpNsQqOZFQtrrRrspNJLPN/DNIHXD+ojHeQJXIuyrpuiIiD7IZFdWVONiaQBUYqhE1kG8mq4ilwGHJsqwrY8F+IEI69lyp8wRI8X4lrx+rVgfXvL3sH0oD17Z48wvmE/mB4x9db2KbvzbKfAOIbL2iE63iNI3rLR2i07KpgSaxL6/9UlZF9r5+/oTk+glbcyawWHJIe6TGQteFJLIROB9df1iF6pxPXQknUAo+YpD2jF55KfwMkrFMInDNHjpVXYyFerwh/1doId+0ZtJnjDfrYzFtaDOkNizReosBZcwC2WIdYsViganAJnDYzaH6lSqRLb2WmjnEufCyQfWpTTvElykReJzHJIQA5dUvR13+a8Rau6IpA8AFfKE5DhuaqqC/WUTxiix8uArOqqlv9D3TEwKLKkqSSoJLQ9iuNo95R9RxiT7S16Axi2H8GjaO6Y070KgHcwjkeGGURNxgDkhbchVT4S0mDMDCPq7t5Onj1ol/wyc654gj/ZGkuc3oQe5dhrFxBndFtmh7NWw+gsGya7e3wKazpFcoGBHOvsbqedw91Vf8PQ53yrxzfCBbrBs4UECqGgryGpWlknkrdF0qKwJGrI8hpaXkq4opDknGS+zkXaRNkPzxlHA498KwMjH1uiz8sYiAVXvNpo9aWU3LrY0tUBoTOKWi7CcoKXmGGJFyg0CCoibG4iZrhyCLJyYkxgDxLYza3rJr0PcU7qgrPDOKIeoUGP6GxS9tMyN3hacRjb651yDA5wTHHe2yp2d6IwDg24P73T2v7I1Iiahio3ajXd0CnifLEMIhOy48iQk+FemMJ+7jy9prsNziBHvCrG0+ZBOR9IHvhMBUI0vKEw4bAexi1ti4y4wWP7pRd+ed7luB+DA6UlGM96ayzuOG1VKC1LI5DZWyzOy+1jfjFX+pz2Z2tx1ghopeRJVnQ8kVXbJPWQ4a9aSoXjeF2J6oq1UEam12VaxWKIBiHlifpFRV30CUt0emk14Mzwf+nxBz1diOvCMeq5hNqJZVQ90P0+YxXQgV3kFK3ssAC6KNFndUdiBLrtVacHXPUwoWoGIp82CMGmUHhL+BDoK3aLi4fPB/D2AFPvlhChBNkesBy7ecQx4JatJzvviXqnncNdGOwxm4AFccdQCkQeRDp0icF28+dyteZcGRRkecQdSL9/mQXPmriI7v5yh5Ct3ZH9PiPPMSXPlncpe6xPmSVZX1UJ0gWSpsz7pKhyAJVxVPlrynsd5Fx8HuujoZAicvys748t4j9M9lXW1FcS+Pcn8pxBhUXdFl2Pw8FaRa6kkRJEO7Jh8w/rPcRyCFMnytpBuw05E3ExfXbZ4qIIUBVjf8A/DGHWKHt7ZfejYjOV2OUWOUd+WhwOOuJSoCqGbOfj56Ix9mQ7tw4U/eMl26G1QaZT9t6GRuGU0cha5OSIjFNmufByVIzsYRtrhnZ24dB3hg0QGoa66Eq/2a1aCD5ggkZqT4Dr5OyJ53iRpTHGD6c419B6yDqd/mCnbfi0uviiCmMRExznKKy6kCZHC93GWhclY0kKZYviObpBlAf17D5R8aZuAGSCxdPhp3LfJ9BmBf3q8qYougHya38qZ0UjT30iGkqxdIW6CR9bjw3R5YWfX3WZF6/WJdg/28T3lIVIog2YbRi7AyF3M8oqdo1/AefXvwHLZFYs",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "e61a6c14d8606382f8a16e30b7a2b4f9",
        "text": "Moderator:\n\nThank you. On behalf of ICICI Securities that concludes this conference. Thank you for joining us. Ladies and gentlemen, you may now disconnect your lines.\n\nPage 15 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 15,
            "orig_elements": "eJy1lMFunDAQhl/F8nmNbIMN5NpTpaZdKXtbRasBD+CWtVdgmqyivnttNmmrdttDlYiTv/E/zPwzsH+iOOIRXThYQ28Ireq2E8pIpotcsQJ0w5pOAatVnWsELUAouiH0iAEMBIiaJ9p6PxnrIOC8nkc4+yUcBrT9ECKRkvOoecYP1oQhUlGu9OStC0m330vFM7EhgmuRyfsN+QkqfQF5JbL8KlglkdD5PAc8pl629hHHuxO0SL/FQGdHDOcTrqHtLV0rcv0C/Vr2nqLracpwiuTglmODUypTJXHAx9QJvfUGJwh+ukn6l3Q7G8b1Jb/bWde8a2oDrCxVzQrR1axpO8U4NKrJBaBQ8s3sVFI/28kznsx6ASLnWZmAKFS52vcnuYj+aajBgG2w3h3aEeb5cJp8E6/xrCp1XbyW47sB3BcSW83IJ0caHGDsiO/I+3fxIXfYLpMNFmcSBgik9a4dF7Me7ZyOHU7oWszIj0Sk8xP5HH2yrifLnJEPYFICcIb0cXbrBDfrzSOcifMPxNg5pnKx3YQnMlqHc/brCnyEKe6F/Yq7VPeVVSiA5yWiYhVyzoqaIwPdSaZAmlZAoXXRvNkqlHGq1YZIrovLKrwAweVl8HX81NQ1cJH83yKUMtf5ay3CNsYiSrO//IP+Yv39d97FcK4=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": []
    },
    {
        "type": "CompositeElement",
        "element_id": "d416f839cfda3e87c6bc755d5c900d1d",
        "text": "Saregama India Limited August 02, 2022\n\nVikram Mehra: Sir, typically my understanding is many of the deals that we are doing, are with global guys - I will not take specific names - but if you think of all the major licensing companies, they are all global companies.\n\nPankaj Chaturvedi: We do have partners who are based out of India, so just from a classification point of view, the revenue from these partners is classified under “International Revenue”\n\nVikram Mehra: As a normal Indian, living in Bareilly and Jodhpur they will say that YouTube is an Indian company, but the reality is a bit different.\n\nGaurav Chopra: Got it. Thanks for the clarification.\n\nModerator: Thank you Sir. We take the next question from the line of CA Garvit Goyal from Nvest Research. Please go-ahead Sir.\n\nCA Garvit Goyal: Good evening, Sir. Sir my first question is as NFTs are coming into trend so how is to going to be an opportunity for us and how it can shape our topline going forward any views on that?\n\nVikram Mehra: So, we are very seriously exploring it. We believe NFT is a great way to unlock the value of what we people own. We just want to get our product proposition right because we believe, if we are launching an NFT it should not be for gimmick value. There should be a genuine value we offer to the customer then only the business is going to become significant. You will see very soon an announcement coming from our side in this space. For us it is a serious business opportunity and not a gimmick.\n\nCA Garvit Goyal: Understood Sir and my second question is Q1 financial year FY2023 music segment seems to be muted if we are comparing it to the previous quarter, so what are the reasons for the same? Is it due to any downside in the platform revenues like OTT, broadcasting, video screening or social media and how you are seeing it to be in upcoming quarters?",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 13,
            "orig_elements": "eJy1WG1v3DYS/ivEfrYWen/JlyItkMCHppe7+O5Q5ApjRI52GUukKlK7WRT332+G0tpu4wKG6wUMWxpxyCHnmWce+vNvG+xxQONvtdq8ERvV1VmTdWXUFXUX5RXIqFGYRFXXQds1calksrkSmwE9KPBAPr9tpLWT0gY8uvDew8nO/naPerf3ZEnTOCaf1XzUyu/JmlTBOlptPPt9/pwkab4lW1om2/KXK3FvyLJsmwVDXtTb8gnD4kKWjTs5jwPv5aP+iv2nESRu/kcfFHqUXltzK3tw7nacbEvD4m1RFAlNsel0j/40YvD9+GETQja7GXZhX583aHYbXmIky62ZhxYn3kfGs3v8ylvdfIIJdzCAuDZKg/hRD9qjEm/n3ey8iFMKNU5Tnvu81I32fYjwj7lApYq8qjFqm6aJcsA4gjbJo7KpGsoTNE16uVykRbxN6KCr9aDX97xu7g++2mZPGBaPl2WiTqqkfq1M/FvfTTCID7if4I34pKcrQXNqCX1/EsNJzEbh5DxQnsxOaCcGMCdhO+H3KBRC7+gJvDiioJwKRWezuwqPR+33YtfbFnqxm09OROKajH0vjPXCwx0KN6LUnZbCwIA8oJ290J2gU6dZtbnjhSiSsNgAX+wkei3ROI5F2mEEo9Fd8edTWJPHrkvef94+htGP2vlrPu8nkFSqulUqSyNVpwUhqUqiGossSqu8a2TTVKqTl0ZSkSe/Q1KZ5NtqBU65LZ4wLB4vQ1IZ16+HpI9g7uCL+IHQME8HVPqN+A8DQuzhgGKEyRtCkjjubUhVC44qng6Fcxxo4Eo4K74wAXSTHQSIEC3jAzh4EU6LRx80HkPSxYQHNDMuDmRwjxYirJ4noIUCjsV/5zRO5LXxOJkwKQHln8sc4ZN6LlZaBXFXZFVUIVRR3sZx1JZ5ESU5tEWVJ2kDcDms5IHvy7JcoLC+V1n9CBrJE4bF46X8X6aXIZ23jnJt7DRQMgIQzBWV+SHwjRHfE1g0kxFRkPibVftxnpaCD1zi4LQQ0M92vplb5LSDWedZSeB0FYhlAQz02p/CKNFqL5TuOpwosc+miSxu6Cikioo2oYZTyzJqcoCoSiVWTUEoyqrLpT6tQ6qbeE398l6n6fLexPTw7fsy/mWJz9Msq14r8+9hnuBAJGFHTv176gTab8XNnsjDic6G1HLdTvd1/+zEyArruJVFJOs4KAGI6oqVQCe7WLVpLFV2wZpMuK/X90pgeW/y8vd0/Y2h/gtKIK/iLH+t1HywxJDg7fRmSUfowiQItkzjoV1zagyNFr/O6AIln3mX6tUgU/MPb8V7mA5UWO/tieo5DPjpQMOJZx3CJPdb8bFHIn+xsxHsEVRY5LlJxjzDpizaKFUtRnlZkfRuiYe7JCuaUlYdlN2lm3TTrLy6viekwLfp46R+a1l8Xij44jxJXivNf8gQ16BVgntgUG4h4fSLtV+nSfk9JJs504mf3t240MCJWxeK9lZ4YlDF7XtvjzyOTDtWgvxAnExMbMfRTn42TL5c5rMLhB7GeyFphNvDSBhidrdjwNMyBY0+wqQE607u/E5QLEz53z0XM3HR5pgpooMYVZR3oKKa6jBqMJEoq0LF6oKYyYLgT5KyWRBxNuRJfGaCMmYSf8KyOL1Q3BVNeqGO/clenQX/AaeTcDhpOztq0vh17O0UcOEDcbTYawIXw2ZpujtqwXRd4LZtSZX1Vt4FBjlAPwcKOa7XiREJBmQ5mjBREIZHIAXI4EIfkEKbVbP0/He0TgeYTpwgWlfCTCRzvA/him8Wa9Q9zEbuOUwCXgjNE/7s3KtwOSHIMkZ3ehg0hRdC4yZFQuE8jFFNYZiZgbrEfuTwSUxwgKGLUcR2wNDSqABMfwrmdqbrC7ogUB8VCZUTTa53JjQ+0iOsaFaNg+dztrQ/4B9jaQMB4+c6DEzLZ+K0QhZOdIFydMMinGzFu6XiaJchB2u+HkJ5XJ1clnwIcN7/s7k5VVXXxXkd5RK6KM9BRnWZVFEZZ0VNNdhg1l6wzrKlrO5V8Wooz1rofPd+wpL/BWFcZ3nzapeob9j5X8v9mzmaWZmTM3DBSUtPj6n5HwnxtQEjNbXdE3Va8e7nNE4zMVCSJXnsAloIS4NbaXmY+Z8uD1UR1PJavGcQj3TFClj5daaLFU7hkhZKlD1WSe2seRBvju7y34nrgDZFZUETMXUrKuQHaNLEPXhyGc53OEcagjTG329uSK1PFpQE2hu3pAN5WeHkhKFHCVrH2bDNAfm/R+c+wnqFg6ItPuyhDQvO41ol6y7cn/SOX/4PXLBBYw==",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "CA Garvit Goyal mentioned that Q1 financial year FY2023 music segment seems to be muted compared to the previous quarter.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "CA Garvit Goyal: Q1 financial year FY2023 music segment seems to be muted if we are comparing it to the previous quarter, so what are the reasons for the same?"
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "469532128cfb9c263960d7c9687eb4f5",
        "text": "Vikram Mehra: So, let us answer the part one first. Please look at our numbers for the four quarters for the last five years. You will always see Q1 as the lowest quarter. In general, Q4 becomes very high because a lot of our international publishing revenues hit us only in Q4. A lot of society revenues hits us in Q4 and our policy with these revenues is that we will recognize them only when the cash hits our account, so Q4 is always on the higher side. Q3 becomes higher typically because of the Carvaan sales as it is a festival season. We are very, very\n\nPage 13 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 13,
            "orig_elements": "eJy1VO9r2zAQ/VcOf46NfyvutzEYFFZoKWyMMsLZPseiipRJctJs7H/fyU5Lx7ov3fohAT29O917d+e7HxEp2pH2G9lHFxCJhtalKIq4boosLou8itdNJuI07wT/8nWHFK0g2pHHHj1yzI+oM8b2UqMnN58VnszkNyPJ7egZyfM05ZgzfJS9HxnNxIzujdQ+xN3d5XmWFCvIalEkxdcVPAFNXiZpALKy/huyBDEUuZPztAtqruUDqds9dhT95IuePHVeGr3pFDq32VvTMi1NhEhFzYRBKvKnPc2x11fRXLTeTridld1FpLdReGLPyEZPu5ZsUFKE7J4egtjok7y3uIMrGi1ewK1ZASeFyQFqdyQLfiTYo/VgNMEgrfMJXCtCR6CMuQfkm8nCkt3BYJaQIYDfJg58jrIOz0kOBCdC6xL4YiY4SqUA1RFPDhwR3GSAbqGbI3HAOU0Clxq2pMmiWsFNCS11ZkcODmRPMHL3AoITV4YcynUNc2ncMLLcbnYSFeynVkk3Sr0FSwfSEycY5azYaHViNqdO4N1jBmc6yS7/RnaBPRPZpX5+ZG+U7E6sxY+hdK7hKUAGMWzTkRaplsveavmdAnG3vHocSc+SO3Tj8kTIil1nJu1XXEV4jDOdfTILO4jmHjnZUwI3xZMjZ5yHQ3aoOP+jMSwoxL1He0DU4FAxm91mA0JyGNhveWCbHHfY6AQ+s5mWZotX83+Ysseh+yidvwzDywP1x2r2bV8NNMSiKzAu07yO22rAuMjXVT60a+x78WarKSqRrFeQp3WdiLB3j0CWZsuuNlWaVC8BS8jrFrNo6lz8r8W85juGQsuy6rnrH4zhgX7J86psuyxFiktMW/4clkW8LrosTqmqm0rw5TC83eeQDWSoyZcv3fmYr0VSh3NV5C+dZ/or3Wa7m39wu3zu9nODL3dMjH5+/QXPDQD2",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "Vikram Mehra mentioned that Q4 is always on the higher side due to international publishing and society revenues.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: In general, Q4 becomes very high because a lot of our international publishing revenues hit us only in Q4.",
                    "A lot of society revenues hits us in Q4 and our policy with these revenues is that we will recognize them only when the cash hits our account, so Q4 is always on the higher side."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "821ac49c9ee6e18efa49a0446b28e5cb",
        "text": "Gaurav Chopra: Congratulations on a good set of numbers. I just had a small question. I was going through your annual report, I could see the revenue from India last grew by just 4% in the music licensing business, while revenue from exports grew 71%. So, could you highlight like why would that happen? Like why would India business revenue growth would be just 4%?\n\nPage 12 of 15",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 12,
            "orig_elements": "eJy1Uk1vm0AQ/SsjpNwM4mMxOJcccqgspZWl9GZF1gBj2BZ26e4Sx4ry3zsLcZSoOVXtCfHmvXkzO2//HFBPAyl3kE1wDUFZZlRvijwk0VAoiqIIK6wx3KzTQpRHIeJ1EqwgGMhhgw5Z8xzUWptGKnRk5/8ez3pyh45k2zlG0jSOWfMKn2TjOkaTYkZHLZXzuv0+FXHEULIu+fuwgjegzMqo8EAi8nWUfoosIoYCe7aOBr/NTj5Rfz9iTcELFxpyVDup1aHu0drDaHTFtDgqRSoKJhxlT+480qzdfQ3moVU7YTtvtg9ItYG3GBk5qGmoyPhNUt/d0ZNfNviCk8FHuO30aPAabrVqDbqpR+9sQStAaLVuwJIDfYSljY1gCz8m66DDhhl2wL6HXxNZL/PFE1rWSdWC64ye2g74OQ2gUhP2YGjUxq2YV+up982JecT4I6mJ4Gj0AFvVSATe3UFr6ATVebEUVyDVTB8mK2voZU3KequK/xVZu4JTx4/zsR09eU+79CqSqwju9erVn2eDju/f+wxww5/EHc5wmouuQ7/nOJK6gbuPtWXGi++bYWv0yXWvnIouc9/4G11Odiet2/rT8zn+CHaRVqlI6hDLOAsFZZxpQRjmdZ5U2GRJnMX/LdhFXkTZCtJ4vV5SewGSOIkyD2zyOMo/AxbJ38U6yzflv0r1jmsM+cAm+ftH/4aG4y0f6btnvjz8Bl7IWR8=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [],
        "actuals": [
            {
                "data": "The revenue from exports grew by 71%.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Gaurav Chopra: I was going through your annual report, I could see the revenue from India last grew by just 4% in the music licensing business, while revenue from exports grew 71%."
                ]
            }
        ]
    },
    {
        "type": "CompositeElement",
        "element_id": "94709b3647cd3808c6ffde712cf8d134",
        "text": "Moderator: Thank you Sir. Ladies and gentlemen that was the last question for the day. I now hand the conference over to Mr. Vikram Mehra for closing comments. Thank you, Sir.\n\nVikram Mehra: Thank you. We maintain a bullish stance on music licensing. We are projecting a 22% to 23% growth year-on-year for the next three to five years. This will happen irrespective of consolidation on the platform side. In fact, as I said earlier, if there is a consolidation happening it is good news because that means with less platforms more and more people\n\nPage 14 of 15\n\nSaregama India Limited August 02, 2022\n\nwill be looking very seriously at the subscription-based business, which is great news for both parties - the platforms as well as the IP owner. The advertising downturn may not impact us significantly because of the way our deals are structured. I think if at all, it will be a marginal impact. We hold on to a 22% to 23% growth rate in music licensing business over the next three to five years. We will continue with the investments on content across the multiple languages, both on the film and the non-film side with the target being people under the age of 30. We continue with our cautious approach on Carvaan, and the focus is going to be on the margins and not on revenue. The film series and TV business should keep on growing at a 25% growth rate year-on-year with a margin which is around 15%. Events verticals will slowly build up in terms of revenue, but in the initial years we expect it to contribute only 5% to 10% margin. As a management team, we are very bullish on the business. We have built the right foundation and year after year after year and quarter after quarter, we are proving it to you that the foundation that is being built is strong enough to keep on sustaining the growth rate that we have seen over the last three years. Thanks a lot, gentlemen, good evening.",
        "metadata": {
            "filetype": "application/pdf",
            "languages": [
                "eng"
            ],
            "page_number": 14,
            "orig_elements": "eJy1V01v2zgQ/SuEgdwsQd+yeysWu0CAZhGgQfcQFAEljWxuJNElKbtGsf9931Cyk7TGYpE2hyDSiMMZvvc4M77/tqCOehrcg2oW78RCrqJ4Xa/rYBVFMsjaKAsqKsogTdq4KKN1uoqzxVIsenKykU7C59ui1to0apCOrH/v5FGP7mFLarN1sCRJFMFnNh9U47awxqW37rQaHPvd3ydZFsKEQGWYfl6Ks6HMVmHEhjjLizC9aJmcYFrYo3XU82lu1VfqPu5kTYt/8KEhR7VTenioO2ntw87oCsuisIzXGb63qiN33JF3vb1Z+JyHzSg3/mD3Cxo2C46wg+VhGPuKDB8k480dfeWzLm50Q0Y6bd6Ju60cHgUOLT4qE4oPslFkhRwasQHiHnfhttKJg7R4IIGsnPgykuUkRauNtzbyGIprMeiD2LIz22o9tGRoqEnoPWGdFjcI8Uk9GtmLG9oa6f3rTls1bLC+Z5Zt+JTU0mfFhzyd+YOy7pqhw3m+F0ZSFHEsKQ6qnOogy1NIJGmTIM7bIqvqLKK0eTthpIXXwSpKw9ILYzasi+gsg9LL4EfL5PQ6YayyVb7+Vcp4Ts4zcYTiLxK9xGHxJ6Soxq5Tdiusk57eQfSjVbXoVE0Dk+kdpCGBNP/mvMGvBJZXrIIkvRIbow9uK44kTaCHgP+fxTQgGTwYIl7dqj35dV4YyoqD6jqobLeDNJUxZHccAIt0y5qzulNgl9WpB7/frpMOe/fCqoYgU8hW1m4poOhrYaVqBHbvFJmlUC17IG/Ekd/tNoXkkyjH3zdaN8j1YEVFtRwtTRelJzlwkjhdR9aeo1vRa2zMt8M/7EjvOvq/2l4nadtQBUWXTRFkUZmj6JVtUDarKGmbBlWvfDNtl5DpaimSqCgmbZ8McRRPVXCdR2F+yTC5vE7Z2Spe/Sph3+IbTKyROH8O+h9aO6y/AHlKdVlQkgZxU+dBRkkTVCtCx1nnxaqgOkmI3gzyOE6SsASARRwWvlbMhjRNJ4RRPFZhccEwubyymERRnP8E5vlzzD+iAGxkL3HjGiXFB9UrR414P25G9JAoYXkkyXMy7hRazkUu4igv14kMCtm2QRanFFTrdRO0KyIqsqRq0urNuMiTIowBdJlN6p/f4yjKT8hzRb9kmXxex8U6LdKf0f8LLnzRrNC+tX7kEoaGfBSWjNKj7Y5COl8p7VjZ2qgdpxNU0oKtCoV9QB1bisNW1Vtf+Axhva98XLIrjVK3k8bx5BC8qLiWa+yBEHqeHq5vhT4MZLiUoxY2SMMp3/0b2N1o0EnkEXMEKmwPiJwYLcr2ZlCtqiUGkuO52GpfqjGXHIUejWhIdta3HOvMWGMrangkcVuFHoa6jpRl1y25eJ/AkAhmNlBIN0fzbWuru8a3Dn2xZWFwQnv4oeOdgZqHnf/sY4jic0CDQWscaWoX7KOGPUYrPwdxDrwAz0LWRtsJwn7snELnEGcRLCcK5m4HufTiNIMN4NEbuPU9RXE4NjlAwIlPjUiMQzPnzaUS6KaRT/Rljgw18HesG4GGaLSsfejfpNlLOSzPoVtdY4nvkxwFCFR0ynGCfZozmWuYDe0JUSZhTClDnfMsevfpCV671SMIeiTasR+z4qcLx2zlL2l6MV74/E+UP6lZGo2j47pcheL3vQfeq7JmPXmWbKcPLLxRIe64Y/LRMiBugDSnDQpG5z94DpVT0JQnG/IX9JVHFFYeUGA8jcJyRgPb5l5gcXQ1ZxaK99anOYAHFgKCyX7J+7C6/cU9zV8znCdsJvnKPflcpyttuNiBDJxxGmMYT4+HbHGKHx/x+cuI20wn8/x2zgCc7+cpCInzTwc/90ycn8N4m7KzxqZ88IrLqfFOgx43W/Y/8WjREzBceqlgp+csTr8/5pNZwth3vmL+18h0xc4jImZWBrDTGPHOP2KW07jGbPF4+rzp/CkNwuB23nGt/Ofzv0n5rBQ=",
            "filename": "tmpvq2kcvpu"
        },
        "guidances": [
            {
                "guidance": "Saregama India Limited is projecting a 22% to 23% growth year-on-year in the music licensing business for the next three to five years.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: \"We are projecting a 22% to 23% growth year-on-year for the next three to five years.\""
                ]
            },
            {
                "guidance": "The film series and TV business is expected to grow at a 25% growth rate year-on-year with a margin of around 15%.",
                "theme": "Financial Performance",
                "subtheme": "Revenue Growth and Trends",
                "evidence": [
                    "Vikram Mehra: \"The film series and TV business should keep on growing at a 25% growth rate year-on-year with a margin which is around 15%.\""
                ]
            },
            {
                "guidance": "The events vertical is expected to contribute only 5% to 10% margin in the initial years.",
                "theme": "Financial Performance",
                "subtheme": "Profitability and Margins",
                "evidence": [
                    "Vikram Mehra: \"Events verticals will slowly build up in terms of revenue, but in the initial years we expect it to contribute only 5% to 10% margin.\""
                ]
            }
        ],
        "actuals": []
    }
]