[{"theme": "Financial Performance and Metrics", "topics": [{"topic": "Profit margin trends", "data": {"['Q1', '2025']": {"answer": "18727383d92633c03a28a03867ff319d --> 15% NIM is anyways a much higher number than what we have kind of communicated or guided for. We would like to be around the 14% number, 13.5% to 14%. And we have passed some benefits to the customers in April, starting April 1, where we have reduced 1% for customers who are in 6 cycle and above.", "citations": ["18727383d92633c03a28a03867ff319d"]}, "['Q2', '2024']": {"answer": "491c2007d27721f85a3f71226140763f --> We expect to achieve a revenue growth of 10% in the next fiscal year.\n\nbc6b91c9ebba7329b9c284a9bb5f8f90 --> We expect to achieve a 10% increase in revenue by the end of the fiscal year.\n\nb7397c4d63aa686324ebbf7ea829d87f --> Shalabh Saxena [We had said that it will be sub of 2% we are below that where this is a pain of one quarter which we had to take because the model in our wisdom had to be made scalable which we kind of walked that path.]\n\n24786d8af93a8163c30bf74986403265 --> Shalabh Saxena [We will be sub of 2% that we are very confident of meeting.]\n\n60e5b72f7f2b6e0a3e3c5a3340c6d57a --> If our gearing goes to a 4 which it will eventually. One has to operate at a 3.5 to 4 X, the NIMS should settle anywhere at about 12, 12.5 add about 2% of credit cost and cost of operations so you are talking of roughly about 4, 4.5, 5%.\n\n0cf0f48c0bfb1c1208c584c51cba8835 --> Shalabh Saxena [I do not think we will take more than six quarters to kind of get to 12% across all states and the highest will be a 12% and the rest will be below.]\n\n0cf0f48c0bfb1c1208c584c51cba8835 --> Shalabh Saxena [If you go back to the commentary that I said we said that exit 25 none of the states will be more than 12% so which means two state Odisha and Madhya Pradesh have to come down from the current 15 to 12%.]", "citations": ["491c2007d27721f85a3f71226140763f", "bc6b91c9ebba7329b9c284a9bb5f8f90", "b7397c4d63aa686324ebbf7ea829d87f", "24786d8af93a8163c30bf74986403265", "60e5b72f7f2b6e0a3e3c5a3340c6d57a", "0cf0f48c0bfb1c1208c584c51cba8835"]}, "['Q3', '2024']": {"answer": "e7c78f5e58ff3528eb31e5c1988802a3 --> We will aim to get this in the range that I have just spoken, which will be a combination of the increase in the overall denomination or the denominator in the other states, plus selectively closing down a few pockets in these specific states, which are not profitable for us.\n\n4cd0eaf94f00c42b323a949254518162 --> We are working towards reducing it to sub 12%.\n\n57992d590e33995c5b847af5ab85bc1b --> by the end of this year itself, we shall be below 2%\n\ndd6476f8c9bfa5d91f2a3ade4a7ddcff --> Portfolio cost credit 0ss is what is on a sustainable basis has to be monitored and has to be looked at, which we are currently at 1.4%, and hence, our confidence that we'll be under 2% in the future as well.\n\nd48a4e28f4248fa752b5e1a808c94ce7 --> What is the projection of loss rates for the next year on this? Under 2% is what we are saying.\n\n895e55946dbfd50f712a0c65df9b5316 --> Our ROEs should be anywhere between 17% to 19%.\n\n895e55946dbfd50f712a0c65df9b5316 --> We want to aim that a state should not -- a single stage should not contribute or should contribute in the range of 11% to 13% and no more.\n\n895e55946dbfd50f712a0c65df9b5316 --> Currently, our top three states are 42%. We are wanting to get them to 35% to 36%, which will be a good outcome.\n\ne723b0bddb12c4014132b229bc896589 --> Shalabh Saxena [We are saying 2%, and it will be under 2%, which we are reasonably sure that is how it is going to play off.]", "citations": ["e7c78f5e58ff3528eb31e5c1988802a3", "4cd0eaf94f00c42b323a949254518162", "57992d590e33995c5b847af5ab85bc1b", "dd6476f8c9bfa5d91f2a3ade4a7ddcff", "d48a4e28f4248fa752b5e1a808c94ce7", "895e55946dbfd50f712a0c65df9b5316", "e723b0bddb12c4014132b229bc896589"]}, "['Q4', '2024']": {"answer": "e7b3cb8e841d7612c752407cf0150d65 --> Shalabh Saxena [Q1 and Q2 will be slightly soft because that is how the industry functions. We are reasonably sure that over the next two quarters, we will kind of ensure that this part is very well taken care of.]\n\n4842299c37b6b1b2963721dfcd48f48e --> And going forward, we are very, very comfortable in a number which is anywhere around 22% to 24%.\n\n99eff0fe131f9b3d38b6f06f955139ff --> Shalabh Saxena [ROAs of upwards of 4.5% is very much doable and that is what we have been delivering.]\n\ne3a08dff0fe693453f537fcbc751fb14 --> By FY’25 end, we should be below 6.5%, the way we have looked at it earlier.", "citations": ["e7b3cb8e841d7612c752407cf0150d65", "4842299c37b6b1b2963721dfcd48f48e", "99eff0fe131f9b3d38b6f06f955139ff", "e3a08dff0fe693453f537fcbc751fb14"]}, "['Q1', '2024']": {"answer": "9a90feb26905e6f6012f15b867e4165e --> 99% is what we are targeting in the short term.\n\na521384c9a9eec11133bdb29df79a41a --> We have a clear plan to get them down to 11%-12%.\n\n19aa8ca0814649eca6a30d24413be6e7 --> Shalabh Saxena [So we should end the year at about to INR11,750 crores to INR12,000 crores, roughly, that is the number that we are looking at, which works out to in my mind, more decent Y-o-Y growth for FY.]\n\n57501484f7ab6dc3897fac41c4509b7b --> Our comfort is 13.9%, 14% NIMs, cost-to-income of what I said, 35% to 39%.\n\n57501484f7ab6dc3897fac41c4509b7b --> On a steady state, what we were confident of is what we told you, the 4.5% that we spoke about. And if it is more than it is good, but that much we'll deliver for sure.\n\n065990f9c32e130f4d9a37d682dd9022 --> The sweet spot is more than north of 35% south of 40%. So once the things are stabilized, a 37%, 38% is a good number to kind of operate in. Anything less would not be fair on the employee and anything more is not fair on the balance sheet. So that is what, is our view. So 37%, 38%, any number, which is between 35%, 36% to south of 40%. I mean any number starting with 35% or until 39%, is a good number as for us.\n\n72abb71ec3a346e63a7a1e4f1fe2c24d --> We expect to achieve a revenue growth of 10% by the end of the fiscal year.\n\nc6c148fb4e569f123f5650d3f5a623cb --> Shalabh Saxena [By end of FY '25, if all goes well, all the big ones should be anywhere in the range of 10% to 11%, at best 12%. That is our comfort zone. So comfort zone is 12% max contribution from a state.]", "citations": ["9a90feb26905e6f6012f15b867e4165e", "a521384c9a9eec11133bdb29df79a41a", "19aa8ca0814649eca6a30d24413be6e7", "57501484f7ab6dc3897fac41c4509b7b", "065990f9c32e130f4d9a37d682dd9022", "72abb71ec3a346e63a7a1e4f1fe2c24d", "c6c148fb4e569f123f5650d3f5a623cb"]}, "['Q3', '2023']": {"answer": "2405433a3602e4454494e94e426f9f53 --> By end of this quarter, I think it should be down to sub-5%.\n\nbca405f8a1ce291a8ff4f76c1b26ccfe --> Ashish Damani [It may take another couple of quarters for it to come in line with largely the industry pricing.]", "citations": ["2405433a3602e4454494e94e426f9f53", "bca405f8a1ce291a8ff4f76c1b26ccfe"]}, "['Q2', '2023']": {"answer": "ec0acf7c716de4f01610defd9ffbe099 --> We have a book of as I said now of 5782 Crores of which 4730 Crores which is 82% is giving us a net collection efficiency of 97.5%. This is slated to improve over the next couple of quarters.\n\nbd967a82a91829d45c1864d42bb89c97 --> Shalabh Saxena [Inferred as CEO] [by end of the year, I think the pre-March 2021 books should be a lower single digit.]\n\n0c34fb5688c5a10f06c985ad981ea4f5 --> Ashish Damani [we aspired to be in the range of 4% to 4.5% kind of a ROA when the leverage and everything will play out that is the kind of ROA we are looking at.]", "citations": ["ec0acf7c716de4f01610defd9ffbe099", "bd967a82a91829d45c1864d42bb89c97", "0c34fb5688c5a10f06c985ad981ea4f5"]}, "['Q1', '2023']": {"answer": "5dc69b1cac8a3b7a6db9f5339e028f5d --> We in a steady state we should achieve 4% to 5% ROA there is no problem with that.\n\n5bebc7744618473ff7f75697f6a69ebd --> Q3 and Q4 is where we will see all the numbers by which time the entire distribution plus the system would have seasoned.", "citations": ["5dc69b1cac8a3b7a6db9f5339e028f5d", "5bebc7744618473ff7f75697f6a69ebd"]}, "['Q4', '2023']": {"answer": "a810775e16e9f6df2afd8371c0898f82 --> Another -- we have eight quarters to go, but you will start seeing the downward slide starting third quarter, fourth quarter.\n\n8fc180566755bf4e7d0b459c17336023 --> For the full year, it should more or less be flat.\n\nfe56ea0663f243d125ee01dfb24f0d73 --> 4.5% should be the BAU ROA for us. And we are very positive that by the last quarter, for sure, it should start stabilizing at the 4.5% ROA.", "citations": ["a810775e16e9f6df2afd8371c0898f82", "8fc180566755bf4e7d0b459c17336023", "fe56ea0663f243d125ee01dfb24f0d73"]}, "['Q4', '2022']": {"answer": "717b5e6eaf5f4e6787717d7ecbd16b22 --> Achieving an ROA of closer to 5% in FY2025 with 22%, 24% ROE customer base which you are talking about is approximately around 40 lakhs\n\n0968c3a4b53c0337717a189a21b61000 --> Q3 and Q4 is when we will be reasonably confident of the fundamentals in place for us to really launch ourselves to get a decent FY2023 number so this is it will be a back-ended growth but it will be a growth which will be backed or which will rest on strong fundamentals and robust infrastructure both from a, be it tech perspective, be it from a risk mitigation or control perspective.\n\n1e4bf6f80ddec1a25ced7a5aacbdf3b3 --> Ashish Damani [Yes, that is right it will be back ended 2% is what we expect it to be at on a closing basis so we may have a situation where there will be some cost that we kick in, in the earlier part of the year but then there will be recoveries and eventually we lead to something like 2% on the overall basis.]", "citations": ["717b5e6eaf5f4e6787717d7ecbd16b22", "0968c3a4b53c0337717a189a21b61000", "1e4bf6f80ddec1a25ced7a5aacbdf3b3"]}}}, {"topic": "Loan portfolio growth", "data": {"['Q2', '2025']": {"answer": "dc60fa2e3e1c05894195ddb09f81b1e4 --> I think another month, month and a half, I think we should be in a a decent position to at least come to a place where we, apart from the branch manager, we start seeing incremental results on the loan officer side as well.\n\n7bbdfddd891b77ab13e30b5406ff3fea --> Given that the weighted average maturity at least for let's just Spandana in terms of the portfolio is only 8.6 months, if this origination is improved, at best two more quarters or three quarters you should be able to refine the entire book.\n\nc64d38ece2bb1c3847a20de676ae150c --> Ashish Damani [But if one has to just go by the previous experience, then it can be anywhere between 20% to 30% in terms of recoveries, despite this thing.]", "citations": ["dc60fa2e3e1c05894195ddb09f81b1e4", "7bbdfddd891b77ab13e30b5406ff3fea", "c64d38ece2bb1c3847a20de676ae150c"]}, "['Q1', '2025']": {"answer": "a720573c5fd8f74b26703b42c3f9449d --> We have taken a number of steps to improve portfolio quality, which should help us course correct in the current quarter.\n\n48345c1d4a0e735c45027fe32f65d4be --> We expect to see an improvement in the portfolio quality. So we believe these challenges are transitory in nature and operations should normalize within the next 3 to 4 months.", "citations": ["a720573c5fd8f74b26703b42c3f9449d", "48345c1d4a0e735c45027fe32f65d4be"]}, "['Q2', '2024']": {"answer": "c46fdbf6a62910bacdfbe9ac83b7fbf4 --> This will entail disbursing about 3000 Crores and 3500 Crores in Q3 and Q4, which we are confident of meeting.\n\n67ffbef0991c5410e7c4d88d0c858694 --> We will see some compression as we continue to increase our leverage. We have made this position earlier that south of 4x is something that we would be comfortable with. So anywhere 3.5 to 4 and once we hit that we start looking for growth capital.\n\n4c5cef75d9f6262bcdd9225b8b3ab211 --> If you go back to my Q1 earnings call we had said that our desire is that single lender and a one plus one should be a 38, 39 equivalent, so about 78, 79 should be one or 1 + 1.\n\n21a61f4e9a2601a61dc323a2176bf578 --> Shalabh Saxena [However, for the next year when we continue to pursue our customer acquisition led growth. By design we offer our customer a first cycle loan at 35,000 you will see that number being stabilized at 36,000 or thereabouts.]\n\n21a61f4e9a2601a61dc323a2176bf578 --> Shalabh Saxena [One year hence when currently our proportion of new versus vintage customer is about 50:50. The day we start coming down to a 30% new and 70% existing that is when the 36 will start inching up and that will eventually play out say about six quarters from now.]\n\n9ae92687b927f6baa657bfa12ff896ce --> Shalabh Saxena [Inferred as CEO] - \"This will immediately in the short term hit in the neighborhood of about 380 to 400 borrowers per loan officer which next year we are targeting of 440 to 450 number.\"\n\n60e5b72f7f2b6e0a3e3c5a3340c6d57a --> We have a perfectly valid reason that for unsecure micro finance lending 4, 4.5, 5% is a very much doable levels and limits that we are at.", "citations": ["c46fdbf6a62910bacdfbe9ac83b7fbf4", "67ffbef0991c5410e7c4d88d0c858694", "4c5cef75d9f6262bcdd9225b8b3ab211", "21a61f4e9a2601a61dc323a2176bf578", "9ae92687b927f6baa657bfa12ff896ce", "60e5b72f7f2b6e0a3e3c5a3340c6d57a"]}, "['Q3', '2024']": {"answer": "a2dd87aafb958d8d4e90fd28c0097561 --> We should tip over the 100 number, 120 might not happen. But next year, we are targeting 150 number, next year, next year. But this year, we are at a reasonable position to cross the INR100 crores of recovery across all buckets, all the GNPA.", "citations": ["a2dd87aafb958d8d4e90fd28c0097561"]}, "['Q4', '2024']": {"answer": "4da42bdfe3612dae9a36e7015e2d5286 --> In Quarter 4, 21% of the disbursement was contributed by the weekly branches.\n\n57462295438105e34ca4d3273ad89ef6 --> A sub-South of 25% growth rate is a good number to target.\n\ne7b3cb8e841d7612c752407cf0150d65 --> Mahrukh A dajania [So, most of the Parivartan related stress will be done by the second quarter, as in forward flows.]\n\n4842299c37b6b1b2963721dfcd48f48e --> We have added this year, while we are projected that we will do, we will end up with a 4 million base by end of next year, we are already at upwards of 3.3.", "citations": ["4da42bdfe3612dae9a36e7015e2d5286", "57462295438105e34ca4d3273ad89ef6", "e7b3cb8e841d7612c752407cf0150d65", "4842299c37b6b1b2963721dfcd48f48e"]}, "['Q1', '2024']": {"answer": "bbdc200f204066f4ed3fa315c34be78e --> We had envisaged a non-micro finance loan book of over INR2,000 crores by FY '25 and are taking concrete steps in that direction.\n\ne6678c7e930c6570cf39f0bfc61187db --> If you're in stock, what are you allowed? You are allowed INR1,50,000 at a household level of the installment. That's the max.", "citations": ["bbdc200f204066f4ed3fa315c34be78e", "e6678c7e930c6570cf39f0bfc61187db"]}, "['Q3', '2023']": {"answer": "6eab74afdc64957e7de76928b9d7ab2a --> Our personal ambition is to take the one lender plus the one plus one, which is two lenders, which is currently at about 67%, 68% to about 80%, which will take about two quarters, 2.5 quarters, but then that is where it will be.\n\n87233da5b9a89e2fc4bf78690266ffb2 --> We've built 2% in our growth until FY '25. Our anticipation is it will be lower than that for sure.", "citations": ["6eab74afdc64957e7de76928b9d7ab2a", "87233da5b9a89e2fc4bf78690266ffb2"]}, "['Q2', '2023']": {"answer": "4f583a5958c99a465bc87f2271d4b61b --> Any benchmark forget a pre or a post a microfinance book has to or should deliver upwards of 98.5% minimum. So that is the number that we are targeting at a books stage. Any number that starts with the double nine is what we aspire to, I think we should see those days very soon when we hit a quarter four or towards the end of quarter four.\n\ncbc55b43da8b8fed8c4cd5fa1d4ea26b --> Ashish Damani [So as you go forward you will see this number kind of improving because the book which has been disbursed in this quarter like I said was disbursed primarily towards the end of the quarter we will see its dues and recoveries in the coming quarter only.]\n\n0c34fb5688c5a10f06c985ad981ea4f5 --> Shalabh Saxena [We said in the first quarter we will disburse 1200 to 1300 Crores, the second quarter we will discuss 1400 to 1500 Crores, quarter three will be 2500 Crores, quarter four will be 3500 Crores. This was the narrative, this was the quantification of the plan that we had and we are sticking to the plan.]\n\n4cda8d4de3376b70ecb60b98fa431a27 --> Shalabh Saxena [Inferred as CEO][We are targeting this quarter and the next quarter for all of whatever I have said anything beyond because now COVID is kind of done and settled there we have a book which is now 82% so there is no reason for us to really hit that number]\n\n059d615bbfa692d06f6636652306fffd --> In a short-term right now what we have done is that the thousand loan officers we have kind of allocated we have slightly operational but we are in the branches and the portfolio which is doing good we are trying to hit a borrowers per loan officer in the range of about 450 to 500 that is the destination model. So we have it and separately I can take to take you through the numbers, but it is a detailed one what we are trying to do is to ensure that in the next few quarters we start we get to an enterprise level average of about 1.25 to 1.3 Crores and then onwards into 1.5.", "citations": ["4f583a5958c99a465bc87f2271d4b61b", "cbc55b43da8b8fed8c4cd5fa1d4ea26b", "0c34fb5688c5a10f06c985ad981ea4f5", "4cda8d4de3376b70ecb60b98fa431a27", "059d615bbfa692d06f6636652306fffd"]}, "['Q1', '2023']": {"answer": "d7b26d5ea6b35e51bb70706783633a66 --> Ashish Damani [May get this from Q3 onwards in fact Q2 should also be in line we do not see any reason for it to be higher than the BAU.]\n\nead27ffac8376fcd3e1f69121d0cb5be --> We will have to raise about 5800 to 6000 Crores to meet this disbursement of the remaining disbursement of about 7000 Crores rest will be internal accruals because we are a positive cash flow on a month on month basis and that is the reason your requirement in terms of borrowing should be slightly lower.", "citations": ["d7b26d5ea6b35e51bb70706783633a66", "ead27ffac8376fcd3e1f69121d0cb5be"]}, "['Q4', '2023']": {"answer": "43fe15b20f6e889322b1ca285cc53af9 --> Our focus for this year on the borrowing side will be threefold: continue to reach out to like-minded vendors who are still not associated with us; increase the relationship depth with the existing lenders; and most importantly, to work on decreasing the cost for incremental borrowings.\n\nc85b9d670ca0e30801ca11402531d550 --> We expect to increase our loan disbursements by 20% in the next fiscal year.\n\n7b333f0866febdbe05abbc2a8bf4da1a --> Shalabh Saxena [Inferred as CEO] [Our ticket size, our anticipations will be in the range of about INR4 lakhs to INR6 lakhs and ideal is about INR3 lakhs to INR5 lakhs.]", "citations": ["43fe15b20f6e889322b1ca285cc53af9", "c85b9d670ca0e30801ca11402531d550", "7b333f0866febdbe05abbc2a8bf4da1a"]}, "['Q4', '2022']": {"answer": "fff97d5b2d481264bd9ed459668fcd0d --> if I were to holistically take a view on where does Spandana grow in the next three years FY25 vision is 15000 Crores from the current 6500, 6600 Crores\n\ne30242c5b8ce6a1581d07a416931ce19 --> [Inferred as CEO] So on the restructured book our positive trend continues it is in line with the Q4 collection efficiency, so Q1 restructured book collection efficiency is at 63%.\n\ne30242c5b8ce6a1581d07a416931ce19 --> [Inferred as CEO] The non-restructured book has delivered a 100.3% in quarter four with a positive trend in June quarter, the collection efficiency is 103% for the June quarter.\n\n9dc6c46db7e028a5a8388b09ac774b57 --> The next quarter will be regularizing these customers and hence are optimism that all the numbers that is reeled out in terms of 2% loss for FY23.\n\nffb08396b11487b6fc51ef9718cfaa37 --> Shalabh Saxena's statement on collection efficiency and provisioning for the restructured book.\n\n102ec983aa9bfdda09d1b2ed8bc8e74f --> Our attempt is over and above the 15000 Crores, about 2000 to 3000 will come out of the various lines articulated of the total book, our attempt will be to get anywhere upwards north of 10% on the secured line.", "citations": ["fff97d5b2d481264bd9ed459668fcd0d", "e30242c5b8ce6a1581d07a416931ce19", "9dc6c46db7e028a5a8388b09ac774b57", "ffb08396b11487b6fc51ef9718cfaa37", "102ec983aa9bfdda09d1b2ed8bc8e74f"]}}}, {"topic": "Interest income developments", "data": {"['Q1', '2025']": {"answer": "ca857fbe6a14501974e9a4a5154dd046 --> Our stated position on NIMs has been that we will operate in a range of about 14,-14.25 anywhere around that range.\n\nc25c582e6b68d46ffbe8818cfc9a03d0 --> Ashish Damani [We are saying on a steady-state basis one should look at a NIM of 13.5% to 14%, more like around 14% to be a standard steady-state NIM for us.]", "citations": ["ca857fbe6a14501974e9a4a5154dd046", "c25c582e6b68d46ffbe8818cfc9a03d0"]}, "['Q2', '2024']": {"answer": "9a27bf2031032e832a3560d6a6c1855e --> Ashish Damani [What is important is to look at what is coming from the BAU or the book that we have created in the recent past or the book which is going to continue in the balance sheet and that is stacking at about 1.4% right now and I think this can be improved from here on.]", "citations": ["9a27bf2031032e832a3560d6a6c1855e"]}, "['Q3', '2024']": {"answer": "8cd13c462dda2cde22c1d186a80b426e --> Ashish Damani [Inferred as CFO] [However, what we expect is on a BAU basis, a NIM of over 13.5%, which we should achieve in -- I mean we are not very far off from that number. So we should be able to achieve it in the coming quarters.]\n\nc12e66d126511fb921935b5d2476c4ab --> We are already in the process of reducing the interest rates for customers with cycle 6 and above.", "citations": ["8cd13c462dda2cde22c1d186a80b426e", "c12e66d126511fb921935b5d2476c4ab"]}, "['Q4', '2024']": {"answer": "cb71175ca7488445c0126cb5a59bea75 --> End of this year, we anticipate this 52 to move to anywhere upwards of 65% and that is going to drive our cost south on the borrowing side.\n\n179876f613ac7194417692cc67bf5e9b --> Shalabh Saxena [Starting the 1st of April, we have already for customers who are cycle six and above, we have given them a benefit in terms of the reduction of the interest rate from 50 bps to 100 bps.]\n\n4e41eb1e423c4b9f4db53e1708eb9e64 --> My normalized cost of borrowing should be about 11.9%, definitely lower than 12%.", "citations": ["cb71175ca7488445c0126cb5a59bea75", "179876f613ac7194417692cc67bf5e9b", "4e41eb1e423c4b9f4db53e1708eb9e64"]}, "['Q1', '2024']": {"answer": "064b4d193e4f95aee2731f36278aa293 --> Ashish Damani[Yes, there is a quarter or two more for our NIM's to see at least around the same number or small expansion as well, primarily on account of yield probably inching-up a little bit more given that we've been lending at 25%, there is a little headroom there. We are presently at 24% yield and you would never hit the 25%, but there is still a little bit of headroom there. So a quarter or two, you may continue to see some inching up.]\n\n57501484f7ab6dc3897fac41c4509b7b --> Our yields have gone up to 24%. They will stabilize at this number now because we had increased our rates. I think, next quarter might be a slight delta up and then, it will stabilize.", "citations": ["064b4d193e4f95aee2731f36278aa293", "57501484f7ab6dc3897fac41c4509b7b"]}, "['Q3', '2023']": {"answer": "bca405f8a1ce291a8ff4f76c1b26ccfe --> Ashish Damani [Our endeavor would be to ensure that the NIMs are protected and 13.5%, I mean, we will try to keep it north of 13.5%.]\n\n45a73a97a9d048cde25800643de58e48 --> Yes. There will definitely be an improvement of another 50 to 75 basis points from here. Given that our loans are now priced at around 25%. But the book will have to be kind of completely churned out and new books should get created. But I think if we have to look at over a period of next 4 quarters, 5 quarters, then it should definitely give us an improvement of anywhere between 50 to 75 basis points.\n\ndee858263250d169de902df428aa1315 --> Ashish Damani [We would take maybe 2 more quarters to get that refinement in terms of our cost of borrowings.]", "citations": ["bca405f8a1ce291a8ff4f76c1b26ccfe", "45a73a97a9d048cde25800643de58e48", "dee858263250d169de902df428aa1315"]}, "['Q2', '2023']": {"answer": "ef61dd29bd8872b182765a335354c59e --> We are looking at NIMs to the north of 12.5% and this should continue.\n\nef61dd29bd8872b182765a335354c59e --> We increased our rates by 1% more and we intend to stay put now for the next couple of quarters.\n\nc9955b2756f272f8d42321eae38ef4d1 --> Ashish Damani [Our new disbursement will be at a higher rate of interest in H2.]\n\ne28b2b3b921c9f107882960ab8aa7f19 --> Disbursements is going to be at 25% rate of interest, and this should start playing up by Q4 and should have a positive impact on the yield which will also drive your ROA.", "citations": ["ef61dd29bd8872b182765a335354c59e", "c9955b2756f272f8d42321eae38ef4d1", "e28b2b3b921c9f107882960ab8aa7f19"]}, "['Q1', '2023']": {"answer": "466c8a68623379d3fcf184520cd1a302 --> Ashish Damani [The leverage is something that is likely to change I do not have the math right now with me but NIMs like I said should be 12% to 12.5%. In terms of our leverage we should get to maybe something like 3x by end of the year but the timing is something that we are still calibrating.]\n\n7faa4be7d1f6fa05c33aa6ab65fc4fb5 --> Ashish Damani [we see that on a steady state basis maybe by Q3 and Q4 we should have NIMs which are north of 12%.]", "citations": ["466c8a68623379d3fcf184520cd1a302", "7faa4be7d1f6fa05c33aa6ab65fc4fb5"]}, "['Q4', '2023']": {"answer": "3d4c3d3cfb3383325a3a6168d0627d79 --> Our normalized yield on the portfolio has improved to 22.8% from 21.2% in quarter 3.\n\n3d4c3d3cfb3383325a3a6168d0627d79 --> Normalized NIM has improved to 13.86%. That is up 38 basis points over last quarter.\n\nab4c5ece42fa022b1748485d8d39b3c3 --> Ashish Damani [Presently, it is 22.8% in terms of the yield, Shreepal. However, if you would have recalled, we have changed to 25% as our interest rate starting October, we charge 25% interest rate, plus 1% as processing fee.]\n\n760e7c30b6a76155c5005ffaff9a3a52 --> We have targeted a 13.5% kind of NIM. We are already there. There may be a slight improvement from what we are targeting. But I think 13.5% will be something that one can take as a BAU or a stabilized kind of a NIM.", "citations": ["3d4c3d3cfb3383325a3a6168d0627d79", "ab4c5ece42fa022b1748485d8d39b3c3", "760e7c30b6a76155c5005ffaff9a3a52"]}}}, {"topic": "Asset under management (AUM) targets", "data": {"['Q2', '2025']": {"answer": "205a86cc574f839ec4253bb76a0aca57 --> The day we are confident that this will happen, which we believe is not very far, the AUM will be stepped up. And by the end of the year, we should be slightly more than what we ended the last year with, from AUM point of view.\n\n0b0e99eb45a06cf768438152f4000a3c --> [Inferred as Aviral Jain] [you mentioned that you expect to end up with an AUM which is higher than what it was when you started the year with.]", "citations": ["205a86cc574f839ec4253bb76a0aca57", "0b0e99eb45a06cf768438152f4000a3c"]}, "['Q1', '2025']": {"answer": "2cbdb1812fc0093ed8b8fa77cfc49f41 --> We expect these 2 lines of business to scale up to about INR500 crores by end of the current financial year.\n\n96e4cf1571432203bf6a00223ca6d1ad --> Given the temporary disruption, we expect to close the financial year with an AUM of around INR14,000 crores, and with a slightly elevated credit costs that we've been speaking about, we could end of the year, have a credit cost in the range of about 3.75% for the full year.\n\n18727383d92633c03a28a03867ff319d --> So on a cadence basis, if you see, 25% of our disbursement is weekly. On an AUM basis, obviously, AUM operates at a lag, it is about 15%. So this will continue, Renish. And in parallel, we will start moving the customers on weekly. However, not straight away at a wholesale 48% or 50% type of a portfolio, we will move center by center, branch by branch, so that things remain under control.\n\nbf8b3728e630221f0a7580c776cbd1df --> I think another 2, 3 months, we should be fine. And we believe that that's what the belief of the team that while this quarter could see some more flows, obviously, but not to the extent of whatonewould believe. So that's the reason when I said the 3.75, that was the number that we said. And then Q3, Q4, I think we completely should be fine.\n\n58c6c80f2251515b6b33a8d8945afc5e --> You have cut your AUM growth guidance for this fiscal year based on what you saw in 1Q, you've also increased your credit cost guidance to 3.75% versus 2.5% until last quarter.", "citations": ["2cbdb1812fc0093ed8b8fa77cfc49f41", "96e4cf1571432203bf6a00223ca6d1ad", "18727383d92633c03a28a03867ff319d", "bf8b3728e630221f0a7580c776cbd1df", "58c6c80f2251515b6b33a8d8945afc5e"]}, "['Q2', '2024']": {"answer": "c46fdbf6a62910bacdfbe9ac83b7fbf4 --> We will end the year at about 12,000 Crores of AUM.\n\ne9f8647f96598cb4ca186d5800c50a89 --> By end of the year, we should be 26% and end of next year this will be in the range of 41 to 44%.\n\ne9f8647f96598cb4ca186d5800c50a89 --> End of next year, our endeavor is to ensure no state is more than 12% of the total AUM.\n\ne9f8647f96598cb4ca186d5800c50a89 --> Currently our biggest states are in the range of about 15, 15.2, 15.3. However, we have another six quarters to really moderate these and get the big ones down to 12%.\n\n9ae92687b927f6baa657bfa12ff896ce --> Shalabh Saxena [Inferred as CEO] - \"On the AUM side, we are currently at a 1.2. We are targeting a 1.4 to 1.5 over the next three to four quarters.\"\n\n60e5b72f7f2b6e0a3e3c5a3340c6d57a --> I think on AUM basis I think we should settle anywhere on a long term basis at about 5, 5.5% and add another on the credit cost you will have 4.5 to 5% of ROA.\n\nfd91f0dba94880c35501c36822da3521 --> I think we should do about roughly 75 Crores to 100 Crores by the end of the year.\n\n63862d456d6e19728cee9dc11161f77b --> Shalabh Saxena [We are targeting upwards of 100 Crores which is another 50 odd Crores in the balance.]", "citations": ["c46fdbf6a62910bacdfbe9ac83b7fbf4", "e9f8647f96598cb4ca186d5800c50a89", "9ae92687b927f6baa657bfa12ff896ce", "60e5b72f7f2b6e0a3e3c5a3340c6d57a", "fd91f0dba94880c35501c36822da3521", "63862d456d6e19728cee9dc11161f77b"]}, "['Q3', '2024']": {"answer": "c7d2d1badb689c705f56b5839f342d43 --> We will end the FY'25, which is next year in thereabouts of INR15,000 crores, which is what we've been speaking to all of you about, with an asset quality of sub of 2% or rather credit loss of under 2%; ROAs of 4.5% and above; and NIM's of 13.5% and above.\n\n98388d5ea0675c87e9e8127aecf8b1f2 --> We will end this year anywhere between INR11,500 crores, INR12,000 crores of AUM.\n\n800c77e3584449e9f4b637e61eff4a7a --> Ashish Damani [We do have about INR60 crores more that will come in this other part. Of course, it will come over a period of next one, two or three quarters maybe.]", "citations": ["c7d2d1badb689c705f56b5839f342d43", "98388d5ea0675c87e9e8127aecf8b1f2", "800c77e3584449e9f4b637e61eff4a7a"]}, "['Q4', '2024']": {"answer": "d259586838e63b250e00dadac722e477 --> We will grow about 20% to 25% this year to take the number up to about closer to 14,500 to 15000 crores on AUM basis.", "citations": ["d259586838e63b250e00dadac722e477"]}, "['Q1', '2024']": {"answer": "97472d7a1aa7b0c8089a9adf10bf6a6a --> Our goal defined this year and next year, which is INR15,000 crores in FY '25 is fixed.\n\n19aa8ca0814649eca6a30d24413be6e7 --> Shalabh Saxena [If all goes as per plan, we will hit the INR10,000 crores number in either the last month of this quarter or the first month of the next quarter.]\n\n69e0f0ac185155d33d1bffc1fc8b9182 --> We are committed to giving more than 4.5% ROA in stabilized or a BAU basis. Currently, the number anyway is trending higher than what we have committed for. I think, the way business is shaping up. We are very well placed to meet the guidance of 4.5% and the AUM of INR15,000 crores by FY'25.\n\nc6c148fb4e569f123f5650d3f5a623cb --> Shalabh Saxena [So this year, in those seven states, we will end of the total AUM, we will have about 23% coming from these seven states. End of next year, which is FY '25, that will go about 44%-45%.]", "citations": ["97472d7a1aa7b0c8089a9adf10bf6a6a", "19aa8ca0814649eca6a30d24413be6e7", "69e0f0ac185155d33d1bffc1fc8b9182", "c6c148fb4e569f123f5650d3f5a623cb"]}, "['Q3', '2023']": {"answer": "45a73a97a9d048cde25800643de58e48 --> Definitely no further capital will be required for the 5 quarters that you talked about. Mid-FY '25 or late FY '25 is when probably we will have to evaluate. But till then, from a comfort perspective, we will be in that comfort zone only.", "citations": ["45a73a97a9d048cde25800643de58e48"]}, "['Q2', '2023']": {"answer": "ec0acf7c716de4f01610defd9ffbe099 --> By end of quarter three, it will be upwards of 90% and onwards.\n\n3f8d8a793656df425d3f5e10d894a583 --> We have in our past through various interactions with all of you we have kind of articulated that we would want to take this number to a number starting with 7. So we are on track for that.\n\n09f2cabb6865f990ad8a83d90f2efe95 --> So we had very clearly said that this is the pace that we will take which is about 1300 to 1500 Crores in quarter two and then 2500 and 3500.\n\n95a12921ee2dddac0365bb563b8297d7 --> gearing will be at any number south of 4x is a good enough number for us directionally that is the thing this is right until FY2025.\n\na86cf09facc97ecb0da594116709887c --> Internally we have a conscious decision that will stay put liquid from a balance sheet standpoint and the idea is to maintain cash in bank of anything north of two months of our obligation.\n\n4cda8d4de3376b70ecb60b98fa431a27 --> Shalabh Saxena [Inferred as CEO][the next two quarters we have planned to recover about 40 Crores minimum we will do more than that]\n\n6424046193d0e48f35ba137838dd4035 --> AUM is likely to close north of 8000 Crores anywhere between 8000 and 8500 Crores by year-end.\n\n03024b0837e9adb251c0e9a934012b1a --> This together from a 67% as an enterprise in the next two to three quarters we would want to take it to an 80% which means you will have to definitely take up the 33% to a 38%, 39%, 40%.", "citations": ["ec0acf7c716de4f01610defd9ffbe099", "3f8d8a793656df425d3f5e10d894a583", "09f2cabb6865f990ad8a83d90f2efe95", "95a12921ee2dddac0365bb563b8297d7", "a86cf09facc97ecb0da594116709887c", "4cda8d4de3376b70ecb60b98fa431a27", "6424046193d0e48f35ba137838dd4035", "03024b0837e9adb251c0e9a934012b1a"]}, "['Q1', '2023']": {"answer": "3bc789bd16ef27becc46aafdb450607a --> We have hence decided to write-off 702 Crores in the quarter which is predominantly the pre March 2021 book.\n\na8eb12521b03850c9c13131eb091f24a --> For the year we have a target to take the base to 2.8 million which will be 4.5 lakhs for the year.\n\n986bf60aa6cb1a6f0b6a21497fb41321 --> So we are talking we have given a quantum of about 2000 to 3000 Crores in a 15000 Crores over and above the 15000 Crores steady state book of FY2025 in the various product lines that we had articulated the right time or at the last time around.", "citations": ["3bc789bd16ef27becc46aafdb450607a", "a8eb12521b03850c9c13131eb091f24a", "986bf60aa6cb1a6f0b6a21497fb41321"]}, "['Q4', '2023']": {"answer": "4f1f16e527ae8eef05f5b67825a41311 --> We plan to end this year, FY '24 with an AUM of about INR11,500 crores, which will once again be slightly backloaded because there are a few agendas that we have to do in quarter 1 and quarter 2.\n\n39785eecc96c56a38b6066fe15e0469b --> Shalabh Saxena [We had articulated a total INR18,000 crores AUM for our company by end of FY '25, of which the mix would be JLG INR15,000 crores and about INR2,000 crores to INR3,000 crores is what we had indicated on the two businesses, one is the loan against property and the second one was the Nano MSME enterprise business that I spoke about. The first one is obviously a secured line, which should be in the range of about INR1,500 crores to INR1,700 crores. The Nano MSME, it is unsecured loan. Non-JLG business, it will be in the range of about -- similar about INR1,500, INR1,600 crores to about INR1,800 crores.]\n\n92289335b72cd641e4d8769c0bc38c9b --> We are at 65.3%, another eight quarters to go, reasonably confident that we'll be there.", "citations": ["4f1f16e527ae8eef05f5b67825a41311", "39785eecc96c56a38b6066fe15e0469b", "92289335b72cd641e4d8769c0bc38c9b"]}, "['Q4', '2022']": {"answer": "376bfbc57be4d0e7a069fdaf8bb9d930 --> We are looking from the current states even if we were to get a market share of about 2.5%, 3% we will get to an incremental AUM of about 6000, 6500 number one.\n\n341c547001b407371875bed28e28392d --> With today’s disclosures I think we should start seeing a normalized second quarter in terms of the supply side.", "citations": ["376bfbc57be4d0e7a069fdaf8bb9d930", "341c547001b407371875bed28e28392d"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New financial products", "data": {"['Q1', '2024']": {"answer": "50aebfce40189a7d2ef6c287bbccea61 --> We will launch the Nano enterprise, which is the small ticket loans to retailers. A 60,000 ticket size is the number that we will start with it is a non-JLG business. That should start in this quarter.", "citations": ["50aebfce40189a7d2ef6c287bbccea61"]}, "['Q3', '2023']": {"answer": "0ff777d145ef64e39e2ae850bdf8a474 --> With the senior management team largely in place now, we would be soft launching our non-microfinance business, which includes MSME and LAP loans during quarter 1 of next year.", "citations": ["0ff777d145ef64e39e2ae850bdf8a474"]}, "['Q4', '2023']": {"answer": "4f1f16e527ae8eef05f5b67825a41311 --> During the year, we will be launching the Nano Enterprise or the bottom of the pyramid MSME loan product as well.\n\n3142759e9f44b168b0b510cd72c5b023 --> And as Shalabh mentioned, we are targeting little less ticket size and unlike the market practice of INR7 lakh to INR10 lakh, we will be having in the range of INR3 lakh to INR4 lakh kind of ticket size to start with. And gradually, once we have the good experience, we'll progress toward that.", "citations": ["4f1f16e527ae8eef05f5b67825a41311", "3142759e9f44b168b0b510cd72c5b023"]}}}, {"topic": "Digital lending platforms", "data": {"['Q4', '2023']": {"answer": "804268f0177a8454202a55a330b60519 --> We have re-launched the LAP business and implemented a new software solution. We are starting operations in Rajasthan with 10 branches, and this quarter, Q1, you will be finding a lot of traction on this.", "citations": ["804268f0177a8454202a55a330b60519"]}}}, {"topic": "R&D investments", "data": {}}, {"topic": "Technology advancements", "data": {}}]}, {"theme": "Operational Efficiency and Optimization", "topics": [{"topic": "Process automation", "data": {"['Q1', '2025']": {"answer": "04925015b9a299e486555c4d1399e3d0 --> We have not moved away from weekly into monthly, because we are very sure and we are convinced that weekly is a model to go. It is just that we will not really implement it at a wholesale level. We will go one step at a time. So instead of a 3 months, 6 months, it could probably take 1 year, 1.5 years. So be it. But obviously, at this stage, we cannot, hazard a wholesale conversion from a monthly to weekly. We will do it at a loan by level, center by center, branch by branch.", "citations": ["04925015b9a299e486555c4d1399e3d0"]}, "['Q2', '2024']": {"answer": "23e64cd7b388e7d1794c6de6a5b66f70 --> So Q2 was the time when we said we will modify the distribution model.\n\nb7397c4d63aa686324ebbf7ea829d87f --> Shalabh Saxena [So hence we chose July and August month to kind of execute this so that we can cover up by the month of March of this year.]", "citations": ["23e64cd7b388e7d1794c6de6a5b66f70", "b7397c4d63aa686324ebbf7ea829d87f"]}, "['Q3', '2024']": {"answer": "7c15c40a5b159432c6eaaa3c5953cc20 --> We wanted to alter the above model to make it more distributed across the month, convert the repayment to a weekly cycle, and most importantly, ensure that all the three things core to microfinance, that is new member acquisition, disbursement and collection, happen on all days of the month and not on selective dates or days.\n\n7c15c40a5b159432c6eaaa3c5953cc20 --> In this, the repayment was changed. So what we did was we changed the repayment from dates to days, which means instead of the installment date of first, second, third, fourth, we said now your installment will be either on a Monday of the week or a Tuesday under specific time.\n\n54e2fb624a3006cd5083da09931e5f9f --> Moving to a weekly repayment from the current monthly is the end game for all of whatever we are doing.", "citations": ["7c15c40a5b159432c6eaaa3c5953cc20", "54e2fb624a3006cd5083da09931e5f9f"]}, "['Q4', '2024']": {"answer": "4da42bdfe3612dae9a36e7015e2d5286 --> The collection efficiency continues to be above 99% in those branches.\n\n0422fd4fcefd82d516d156996f99f1ee --> This year is all about optimizing our channel and unlocking productivity across the organization. We intend fast pacing this between this and the next year.", "citations": ["4da42bdfe3612dae9a36e7015e2d5286", "0422fd4fcefd82d516d156996f99f1ee"]}, "['Q1', '2024']": {"answer": "bbdc200f204066f4ed3fa315c34be78e --> We anticipate a 15% to 20% improvement in efficiencies in the current distribution metrics that we operate and over the next two quarters to three quarters, we will see the benefits play out.", "citations": ["bbdc200f204066f4ed3fa315c34be78e"]}, "['Q3', '2023']": {"answer": "7dc206a45cd8eb3c96d1258ce3793949 --> And now starting the quarter 1, we are just waiting for the year to play out. While we've already started taking the baby steps, but the big steps will come from April, where we'll start completely driving the efficiencies and optimization.", "citations": ["7dc206a45cd8eb3c96d1258ce3793949"]}, "['Q4', '2023']": {"answer": "06ae54d7362ff1f2f4213acef948d1a7 --> Ashish Damani [we have tweaked the model to ensure that 70% kind of coverage is there.]", "citations": ["06ae54d7362ff1f2f4213acef948d1a7"]}, "['Q4', '2022']": {"answer": "3bb9b695ce90a97d913473cc7384726e --> The current process of a loan which takes about three to five days... it comes down from three to five days currently into may be 60 seconds or a 90 seconds.", "citations": ["3bb9b695ce90a97d913473cc7384726e"]}}}, {"topic": "Cost reduction initiatives", "data": {"['Q2', '2025']": {"answer": "9af3f2c25b73d42e22967fc28aeb1bea --> We expect cost to income to be about 45% by end of the year.", "citations": ["9af3f2c25b73d42e22967fc28aeb1bea"]}, "['Q2', '2024']": {"answer": "491c2007d27721f85a3f71226140763f --> We are aiming to reduce operational costs by 5% over the next six months.\n\nbc6b91c9ebba7329b9c284a9bb5f8f90 --> We are planning to reduce operational costs by 5% in the next quarter.", "citations": ["491c2007d27721f85a3f71226140763f", "bc6b91c9ebba7329b9c284a9bb5f8f90"]}, "['Q3', '2024']": {"answer": "895e55946dbfd50f712a0c65df9b5316 --> On the opex side, we are currently at 6.6%. Our steady-state guidance has been that we will be under 6%. So anywhere between 5.5% to 6% is what we will operate at.\n\n895e55946dbfd50f712a0c65df9b5316 --> On a cost to income, I think in the mid-30% -- so 35% to 38%, 39% in a steady state is what we'll continue to deliver.", "citations": ["895e55946dbfd50f712a0c65df9b5316"]}, "['Q4', '2024']": {"answer": "a5df2a522acd04a7d8cfadd13acf56a1 --> Shalabh Saxena [You would be happy with cost-to-income of anywhere south of 40 and upwards of 35. So, that's the number that we should be happy with. We should be happy with the cost with the OpEx to AUM of anywhere around 6- 6.25.]", "citations": ["a5df2a522acd04a7d8cfadd13acf56a1"]}, "['Q1', '2024']": {"answer": "3fa84fdf0f0034d02b517feffe18bac8 --> Shalabh Saxena [Our IT cost is about INR75 crores split into a capex of about INR20 crores and the balance is opex. We have budgeted this adequately until FY '25, and we will do another three years excise next year when we'll kind of bake the future years as well into this.]", "citations": ["3fa84fdf0f0034d02b517feffe18bac8"]}, "['Q4', '2023']": {"answer": "4ab1e5f09ab011cffee006ace4d274cd --> Shalabh Saxena [We will be looking at decreasing the cost and ensuring entry into public sector banks, expected to start flowing in two to three quarters.]", "citations": ["4ab1e5f09ab011cffee006ace4d274cd"]}}}, {"topic": "Technology integration", "data": {}}, {"topic": "Operational progress", "data": {"['Q2', '2025']": {"answer": "216c3efddc95746bf284494b860ea88a --> the incremental benefits of all the people that we have recruited and all the people who have been in the branches where we have taken, we will see the incremental benefits only this quarter.\n\n9754d2721c9b3fa811d31d47ace83582 --> our recovery team, which has now been set up, we already have some 300-odd people, and in the next or rather this month and max by mid of next month, we will have around 500, 550 people who will approach these customers and we will start the recovery initiatives.\n\n048411d0e105a1d26451c405d7da473c --> We continue to believe that these challenges are transitory and expect operations to normalize by the end of the current financial year.\n\n5dff568834f7cc2b758674067a2ee40c --> We anticipate things to regularize by end of this year. Until then, our job is very clearly to lend right and to collect right.", "citations": ["216c3efddc95746bf284494b860ea88a", "9754d2721c9b3fa811d31d47ace83582", "048411d0e105a1d26451c405d7da473c", "5dff568834f7cc2b758674067a2ee40c"]}, "['Q1', '2025']": {"answer": "a720573c5fd8f74b26703b42c3f9449d --> We believe these challenges to be temporary in nature and expect operations to normalize in the second half of the current year.\n\n26d9e2a4ec22a2a81af262efa61c5790 --> Shalabh Saxena [We had said that by end of quarter 1, mid of quarter 2, I think we should have normalized, which I think, barring very small bps, some 50 bps, 60 bps, I think both the branches are at par.]\n\n3fd3e14a19ad38d6e1a8ef0a96031928 --> I think the last month, which is July, while we're still not out of July, but we are seeing -- I mean, between July and August, I think we should be normalized on the attrition front.\n\n84df59405f44715d9c7351db89bb2600 --> We've said that by September end, we will have 50% of the branches have these additional support.\n\n84df59405f44715d9c7351db89bb2600 --> We've already started putting people and creating an additional bench of 20% at every of the critical branches, which is almost about 70%, 75% branches, where we'll have additional bench strength of about 20% additional.", "citations": ["a720573c5fd8f74b26703b42c3f9449d", "26d9e2a4ec22a2a81af262efa61c5790", "3fd3e14a19ad38d6e1a8ef0a96031928", "84df59405f44715d9c7351db89bb2600"]}, "['Q2', '2024']": {"answer": "c46fdbf6a62910bacdfbe9ac83b7fbf4 --> All distribution led initiatives will be completed by end of Q3 beginning of Q4.\n\n3af765e693102e22d8a2654f0cf06c67 --> Shalabh Saxena [exit 2025 or end of FY2025 Spandana will be 80% weekly, not 100.]", "citations": ["c46fdbf6a62910bacdfbe9ac83b7fbf4", "3af765e693102e22d8a2654f0cf06c67"]}, "['Q3', '2024']": {"answer": "72bef2c4f2bf5088eb3d6fb780ec8613 --> We have to refine a few pockets and are confident that in the next three to four months, we would have regularized the situation.\n\n72bef2c4f2bf5088eb3d6fb780ec8613 --> We will only do it once we are completely regularized on this -- the current set of 730 branches, which, as I told you, will need another at best three to four months.\n\n1e19235e6674239eff7d33f103ab6cf8 --> And you will see this quarter, we would have already taken those steps. So the next time when we come to you, we would have already executed those.\n\n800c77e3584449e9f4b637e61eff4a7a --> Ashish Damani [The Parivartan branches are likely to settle not in four quarters. We've said four to five months. So at best one or two quarters, we should see this kind of settling down. It should not extend beyond that.]", "citations": ["72bef2c4f2bf5088eb3d6fb780ec8613", "1e19235e6674239eff7d33f103ab6cf8", "800c77e3584449e9f4b637e61eff4a7a"]}, "['Q4', '2024']": {"answer": "99eff0fe131f9b3d38b6f06f955139ff --> Shalabh Saxena [Another two to three quarters as an institution, we should stabilize. Four quarters hence, you know, I think, this will be an absolute BAU.]", "citations": ["99eff0fe131f9b3d38b6f06f955139ff"]}, "['Q3', '2023']": {"answer": "518946c6d13e0bbe8567c5306e9bb2e3 --> As an institution, by end of this year, we should be close to about 11,000 employees.", "citations": ["518946c6d13e0bbe8567c5306e9bb2e3"]}}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Rural penetration initiatives", "data": {"['Q2', '2025']": {"answer": "5204ece284c2a51902c34aadd6573e8d --> For all the customer acquisition that we are going to start doing now, if there is a borrower who is new to Spandana, we will not be the fourth, even though the guardrails allow you to be the fourth, we will be only the third. If we are the fourth, then we will regretfully not do the case.", "citations": ["5204ece284c2a51902c34aadd6573e8d"]}, "['Q1', '2025']": {"answer": "c0d5bb90d89b9f6065124969d8aba827 --> We continue to maintain that weekly is a good model. The only difference is that instead of the 48% of portfolio, which we attempted to convert into Parivartan, we will now go slow, step-by-step, center by center, branch by branch district by district. And any new loan which is given, we will encourage the customer to move to a weekly. This is what was our plan. This continues.", "citations": ["c0d5bb90d89b9f6065124969d8aba827"]}, "['Q4', '2024']": {"answer": "a5b3a79ef933834e9c51db9294ae7062 --> The primary challenge is 62% of our flows are contributed by branches which are into the Parivartan mode. And that is likely to kind of start showing or start yielding results in starting this quarter onwards.", "citations": ["a5b3a79ef933834e9c51db9294ae7062"]}, "['Q2', '2023']": {"answer": "4fb8452913de5d98c8ed90a5234acc18 --> We will continue this journey because that is where the tier three, four, five, or rather the Bharat of India, which we have already articulated is very much a part of our vision 2025 where we plan to grow.", "citations": ["4fb8452913de5d98c8ed90a5234acc18"]}, "['Q4', '2023']": {"answer": "5371808be29461a6585adde9bcdd12c2 --> We, as an organization, were offering INR42,000 as a ticket size for the first loan. But in the new branches that we have started, we are offering the INR35,000 and slowly we'll kind of spread this around.", "citations": ["5371808be29461a6585adde9bcdd12c2"]}}}, {"topic": "Emerging market entry", "data": {"['Q2', '2025']": {"answer": "982aa379a334d4cceb1b900a4a5eff26 --> we have said that new-to-Spandana, we are going a step ahead. We will not be the fourth lender, so effectively we are stopping at three.\n\nd0bd13a708c14b6e624c7b338fcca79c --> Shalabh Saxena [If it is a new-to-Spandana customer, then we are stopping one short of what is agreed upon by everybody, which is we will not be the fourth lender, we will stop at three.]", "citations": ["982aa379a334d4cceb1b900a4a5eff26", "d0bd13a708c14b6e624c7b338fcca79c"]}, "['Q2', '2024']": {"answer": "491c2007d27721f85a3f71226140763f --> Our goal is to expand into three new markets by the end of 2024.\n\n4c5cef75d9f6262bcdd9225b8b3ab211 --> Our focus will be on moving into geographies where we increase the single lender relationship because single lender relationship also is a factor of our existing customer base and how much they want. So given the fact that we have normalized our operations, you will see a lot of these things, the 33-34% touching the 38, 39, 40%.", "citations": ["491c2007d27721f85a3f71226140763f", "4c5cef75d9f6262bcdd9225b8b3ab211"]}, "['Q4', '2024']": {"answer": "77fa576774a3c17281b211196d61ff34 --> The focus this year was on testing the product and process in one state, establishing technology solutions, hiring talent, creating the right distribution network and then to expand to other geographies.\n\n0422fd4fcefd82d516d156996f99f1ee --> The new business lines will scale up this year as our desire is to capitalize on this opportunity, which the market presents, but of course, this is new for us and hence, we will be very careful and cautious.", "citations": ["77fa576774a3c17281b211196d61ff34", "0422fd4fcefd82d516d156996f99f1ee"]}, "['Q1', '2024']": {"answer": "72abb71ec3a346e63a7a1e4f1fe2c24d --> Our goal is to expand into three new markets over the next two years.", "citations": ["72abb71ec3a346e63a7a1e4f1fe2c24d"]}, "['Q4', '2023']": {"answer": "8ed25b6e0568f89e4d3b5a680f4211ad --> End of quarter 2 or beginning of quarter 3, we will launch the MSME business.\n\n3142759e9f44b168b0b510cd72c5b023 --> And maybe next two quarters is very critical for us. As I mentioned, we have selected Rajasthan as a state, we'll go a little deep, understand the market and enter into three, four new states that we have identified during the financial year.", "citations": ["8ed25b6e0568f89e4d3b5a680f4211ad", "3142759e9f44b168b0b510cd72c5b023"]}, "['Q4', '2022']": {"answer": "8a0e204398ba5e16346450356f20223c --> Pursuing quality, growth to these seven states for the 6000 to 7000 incremental AUM that we are talking about is I am not saying easy but I am saying we will be able to sort of pick and choose and get to the quality growth that we are desiring to.", "citations": ["8a0e204398ba5e16346450356f20223c"]}}}, {"topic": "Partnership development", "data": {"['Q2', '2023']": {"answer": "93bc73fb7968702dcf523468d29fd8d6 --> We would want to improve on the exposure with the banks. We would want to take it closer to 75% over a period of next couple of quarters and the capital market exposure should come down to around 25% or so.", "citations": ["93bc73fb7968702dcf523468d29fd8d6"]}}}, {"topic": "Market share growth", "data": {"['Q2', '2024']": {"answer": "bc6b91c9ebba7329b9c284a9bb5f8f90 --> Our goal is to expand our market presence in Europe over the next two years.\n\nbdfcbe91972250512cd5f913aed4497a --> We have acquired 6.1 lakh customers in the first half of the year, well on course to cross 3 million customer base by end of the year.", "citations": ["bc6b91c9ebba7329b9c284a9bb5f8f90", "bdfcbe91972250512cd5f913aed4497a"]}, "['Q4', '2024']": {"answer": "07cece5856cc544934f301362b9b8865 --> Our focus on customer acquisition led growth continues. All along we have been maintaining that growth will come more through new customer acquisition and had accordingly projected a 4 million customer base by the end of FY’25.", "citations": ["07cece5856cc544934f301362b9b8865"]}, "['Q1', '2024']": {"answer": "bbdc200f204066f4ed3fa315c34be78e --> By end of the year, we intend acquiring more than 1 million new customers, thus taking our customer base upwards of 3 million or thereabouts.", "citations": ["bbdc200f204066f4ed3fa315c34be78e"]}, "['Q2', '2023']": {"answer": "7243dc6156b467c185ddf7a6931aa179 --> We are planning to add another 752000 loan officers in the current quarter.\n\n93bc73fb7968702dcf523468d29fd8d6 --> The one thing which should also play out in the second half of the financial year is a lot many more PTC transactions and DA transactions is what we feel will help us improve the share of the banks.", "citations": ["7243dc6156b467c185ddf7a6931aa179", "93bc73fb7968702dcf523468d29fd8d6"]}, "['Q4', '2022']": {"answer": "3bb9b695ce90a97d913473cc7384726e --> Our estimate is that we will scale up our customer strength or customer number from the current 2.3 million to 4 million.", "citations": ["3bb9b695ce90a97d913473cc7384726e"]}}}]}, {"theme": "Customer Engagement and Retention", "topics": [{"topic": "Client retention programs", "data": {"['Q4', '2024']": {"answer": "f086ebd722768fa9d2747ec1dd6dffae --> Our sense is that by quarter two, we have to ensure, and that's what we have been discussing with customers. What we have done is a lot of analytics in terms of the centers, ensure that you reach out to the customers and bring them back into current state. So, Q2 is a reasonable estimate, where we should be done as far as this part is concerned. And then it is pretty much BAU.", "citations": ["f086ebd722768fa9d2747ec1dd6dffae"]}, "['Q2', '2023']": {"answer": "4fb8452913de5d98c8ed90a5234acc18 --> We will continue to pursue this for the next two quarters. We anticipate reasonable upsides in this, and we have clearly articulated plans on how to engage with these customers and bring them back into the mainstream.", "citations": ["4fb8452913de5d98c8ed90a5234acc18"]}}}, {"topic": "Customer satisfaction metrics", "data": {}}, {"topic": "Loyalty programs", "data": {}}, {"topic": "Customer service enhancements", "data": {"['Q4', '2024']": {"answer": "52259a0f895a441853809ff5f19e0a8e --> ANA [So, over the next two to three months, that is what we are going to do, which is calibrate the cycle of the customer with the corresponding pricing.]", "citations": ["52259a0f895a441853809ff5f19e0a8e"]}}}]}, {"theme": "Strategic Vision and Leadership", "topics": [{"topic": "Vision 2025 roadmap", "data": {"['Q3', '2024']": {"answer": "e7c78f5e58ff3528eb31e5c1988802a3 --> Our aim, as elaborated in our Vision '28, the maximum contribution of any state should not be more than 11% to 13%.\n\n98388d5ea0675c87e9e8127aecf8b1f2 --> Next year, we are targeting as per our Vision 25, INR15,000 crores.", "citations": ["e7c78f5e58ff3528eb31e5c1988802a3", "98388d5ea0675c87e9e8127aecf8b1f2"]}, "['Q1', '2024']": {"answer": "fb0485eef5ac14cd4f1f01ea91a56fb2 --> As long as the framework, if you are able to deliver in that framework, which you came out with under the Vision '25, we should be fine.", "citations": ["fb0485eef5ac14cd4f1f01ea91a56fb2"]}, "['Q2', '2023']": {"answer": "0853099f4f6a14590eff86a28202ee6f --> if you go back to the Vision 2025 we had laid out along with the quarter four deck, we had very clearly said that our growth story will be customer acquisition led, we are conservative or we will be conservative on ticket sizes, we are still not there we will be walking towards that, but this 66%-67% which is a single lender relationship and a one plus one relationship we as a company want to take it to 80% to 81% then one plus one plus one will be another 11% to 12% and then the rest will be single digit.", "citations": ["0853099f4f6a14590eff86a28202ee6f"]}, "['Q1', '2023']": {"answer": "07ebce3da60d2b8f534de0d0bca9e13b --> Shalabh Saxena [We are reasonably confident that we will deliver the numbers not just FY2023 but which is a FY2025 vision of a 15000 microfinance book.]", "citations": ["07ebce3da60d2b8f534de0d0bca9e13b"]}, "['Q4', '2022']": {"answer": "b2dba81869709d7ce5be2fb6d131e3dc --> As a team we have articulated a vision 2025 for Spandana where we are planning to scale up our business to an AUM of 15000 Crores levels which is upwards of 2x from the present in the next three years.", "citations": ["b2dba81869709d7ce5be2fb6d131e3dc"]}}}, {"topic": "Long-term growth strategy", "data": {"['Q2', '2024']": {"answer": "c872651d9bc7d884935266aee79579f0 --> We can safely say that end of FY2025 about 80% Spandana should be weekly.\n\nb7397c4d63aa686324ebbf7ea829d87f --> Shalabh Saxena [So, all these initiatives in our wisdom have to be taken if you really want to take Spandana to 17,000 Crores and a stable and a robust model is what we have kind of planned for and this is a step in that direction.]", "citations": ["c872651d9bc7d884935266aee79579f0", "b7397c4d63aa686324ebbf7ea829d87f"]}, "['Q3', '2024']": {"answer": "b71fa4fc35e4db5013aec4f299b84d91 --> We are doing it because we want to take the company to an immediate 15,000 and an eventual 28,000 by FY'28.\n\ne120ee01c45b43acbc50f32c9de96e19 --> In the meeting, we also articulated our Vision 28 and the theme was 28 by 28, that is a portfolio of INR28,000 crores by FY 2028.", "citations": ["b71fa4fc35e4db5013aec4f299b84d91", "e120ee01c45b43acbc50f32c9de96e19"]}, "['Q4', '2024']": {"answer": "d259586838e63b250e00dadac722e477 --> We had come out with a theme of 28 by 28, which is 28,000 crores of AUM by FY’28, which works out to about 22% annualized growth.", "citations": ["d259586838e63b250e00dadac722e477"]}, "['Q1', '2024']": {"answer": "f404e7cd14d7e6547815c99c3e008f05 --> Our focus now is on setting-up employee centric people practices with the aim to make Spandana a preferred employer. We have started work on this already. And in the next two quarters to three quarters, we intend to make progress on this key agenda item.", "citations": ["f404e7cd14d7e6547815c99c3e008f05"]}, "['Q3', '2023']": {"answer": "0d69c3fabc8903eb5dc737f4d0eb290b --> From a management point of view, we are completely focused on the delivery that we have, and the next few quarters is a time when we'll kind of start churning the growth engine apart from managing the quality agenda as well.\n\n7f201506c6abbfab840c0cdad4f6617e --> So we will be in the growth phase. So you will see a bit of a spike, but it will stabilize quarter 3 onwards of next year.", "citations": ["0d69c3fabc8903eb5dc737f4d0eb290b", "7f201506c6abbfab840c0cdad4f6617e"]}, "['Q1', '2023']": {"answer": "7e9f9e3ecd20a24508cb5c51ff05cbb9 --> Culture obviously we will take about two quarters to internalize this amongst the people from an initative perspective we will kind of do itby the quarter.", "citations": ["7e9f9e3ecd20a24508cb5c51ff05cbb9"]}, "['Q4', '2023']": {"answer": "3e385ee4da374c386786e32e590d912d --> We laid out a plan about four quarters back, we will stick to the plan. It was a three-year plan, of which we are 1/3 down, which is one year out of three years gone. Overall, I think we are in line from an execution point of view, we are in line.", "citations": ["3e385ee4da374c386786e32e590d912d"]}}}, {"topic": "Forward-looking statements", "data": {"['Q2', '2025']": {"answer": "0b0e99eb45a06cf768438152f4000a3c --> Shalabh Saxena [two to four quarters if we were to discuss, we are reasonably optimistic that once we reach the end of this year I think we will be in a much better shape.]", "citations": ["0b0e99eb45a06cf768438152f4000a3c"]}, "['Q1', '2025']": {"answer": "c00b32e9ad8b6505ae9242ae32f5000f --> And we'll take a quarter to recover post which then I think things should be BAU.", "citations": ["c00b32e9ad8b6505ae9242ae32f5000f"]}, "['Q2', '2024']": {"answer": "06a8dc5e6668cd26686975226a203505 --> However, we are very confident that this is temporary and in the next three to four months we will stabilize and even out the variances.\n\n97dd385c4a0aa26114dccfb452a0e912 --> I think what we believe is in another three to four months you could see this again normalizing and going back to levels where we were in the past.", "citations": ["06a8dc5e6668cd26686975226a203505", "97dd385c4a0aa26114dccfb452a0e912"]}, "['Q3', '2024']": {"answer": "ae3195f0c68029fcdc272993d0d1958e --> our confidence that we'll kind of regularize this in the next 3 to 4 months.\n\nae3195f0c68029fcdc272993d0d1958e --> So hence, we have temporarily paused it, we will take a look at it maybe 3, 4 quarters down the line.", "citations": ["ae3195f0c68029fcdc272993d0d1958e"]}, "['Q2', '2023']": {"answer": "95a12921ee2dddac0365bb563b8297d7 --> we will continue this approach for the next right until FY2025 and that is how we kind of projected our numbers.", "citations": ["95a12921ee2dddac0365bb563b8297d7"]}, "['Q4', '2023']": {"answer": "4ab1e5f09ab011cffee006ace4d274cd --> Ashish [In two quarters from now, you should see more benefits accruing from this particular vector.]", "citations": ["4ab1e5f09ab011cffee006ace4d274cd"]}, "['Q4', '2022']": {"answer": "3bb9b695ce90a97d913473cc7384726e --> Another two months we should be getting that license.\n\n2db77e77204dcea7f2ad83f0395a8747 --> [Unknown][we do hope and we are pretty confident that we will be able to regularize this book in the next two quarters.]\n\n341c547001b407371875bed28e28392d --> I think now another max one quarter we should be good.", "citations": ["3bb9b695ce90a97d913473cc7384726e", "2db77e77204dcea7f2ad83f0395a8747", "341c547001b407371875bed28e28392d"]}}}, {"topic": "Leadership experience impact", "data": {"['Q3', '2023']": {"answer": "362339c77dbb38c84ac60cf5aa1c4e09 --> Shalabh Saxena, Managing Director and CEO[We are pleased to share that almost all the identified senior and middle management roles have been filled, and we expect the balance a couple to be closed by the end of the quarter.]", "citations": ["362339c77dbb38c84ac60cf5aa1c4e09"]}}}]}, {"theme": "Risk Management and Compliance", "topics": [{"topic": "Regulatory compliance updates", "data": {"['Q3', '2024']": {"answer": "3d07dd7a68c9f34d9f1cbac01a4295c7 --> The regulation of the existing BAU business will take 3, 4 months.", "citations": ["3d07dd7a68c9f34d9f1cbac01a4295c7"]}, "['Q1', '2023']": {"answer": "e8ce67fa010b68cbe57fed5db9fc6463 --> To summarize we have moved to the new regime of lending as per RBI beginning July to all new lending which will happen, will happen or is happening in the new regime which is the income assessment etc.", "citations": ["e8ce67fa010b68cbe57fed5db9fc6463"]}}}, {"topic": "Credit risk assessment", "data": {"['Q2', '2025']": {"answer": "c180dd9f128a85c8f2b1821e6af29c8d --> As a matter of abundant caution, we have announced internally that the organization will not be the fourth lender to new-to-Spandana borrowers. So, any borrower which is new-to-Spandana, we will be the third lender, although the guardrail allows fourth, but to begin with, we are saying that we will be the third lender.\n\nc50ad89a2bf7d36fc4e7f1324e502b30 --> we will not be the fifth lender for the existing borrowers, or if we are going to originate a new customer then we will not be the fourth lender.\n\nac35cd3e22d8e3f18778765bd2a12477 --> We will consciously stay away from, this will be one of the criterias of deciding the loan, which is more number of lenders will probably shy away.", "citations": ["c180dd9f128a85c8f2b1821e6af29c8d", "c50ad89a2bf7d36fc4e7f1324e502b30", "ac35cd3e22d8e3f18778765bd2a12477"]}, "['Q4', '2024']": {"answer": "f086ebd722768fa9d2747ec1dd6dffae --> We had said that we will be in the range of about 2% credit cost. This could mean some bit of stress here. At best, even if I were to speculate, would add what, about 50 bps max, in a short term. In a long term, by Q3, Q4, I think we will be back to the 2% that we have been saying.\n\n99eff0fe131f9b3d38b6f06f955139ff --> Shalabh Saxena [We will be in the neighborhood of about 2% credit loss, right? So, immediately, we could see 25-50 bps here and there. But four quarters from now, I think, we hold to that number or that steer that we had given. We should be able to stabilize our operation two quarters from now.]", "citations": ["f086ebd722768fa9d2747ec1dd6dffae", "99eff0fe131f9b3d38b6f06f955139ff"]}, "['Q1', '2024']": {"answer": "9a90feb26905e6f6012f15b867e4165e --> we built in all our financial credit cost of 2%, we anticipate the number to be lower, a 1%-1.25%.\n\n9a90feb26905e6f6012f15b867e4165e --> Any company and not just us.any good company if it runs its model well; it should not deliver a credit loss of1.5% or maybe 1.6%, that's it.\n\ne6678c7e930c6570cf39f0bfc61187db --> This is a practice that I have heard that people have started increasing the tenure of the loans to kind of fit into this. Once again, not a great fan of this idea. This is an unsecured lending, unsecured lending 24 months is the max that one should look at. And at this point in time, we will hold on to this these.", "citations": ["9a90feb26905e6f6012f15b867e4165e", "e6678c7e930c6570cf39f0bfc61187db"]}, "['Q1', '2023']": {"answer": "3bc789bd16ef27becc46aafdb450607a --> We do not as management anticipate any material incremental written-off, from this portfolio in the current financial year.\n\nd7b26d5ea6b35e51bb70706783633a66 --> Ashish Damani [Yes on a BAU basis and a steady basis the business should not give you more than 2% kind of credit cost and we continue to believe so. On an ongoing basis on a quarter-on-quarter if we have to look at it yes you are right we will not see more than 0.5% in terms of the credit cost.]", "citations": ["3bc789bd16ef27becc46aafdb450607a", "d7b26d5ea6b35e51bb70706783633a66"]}, "['Q4', '2023']": {"answer": "8ed25b6e0568f89e4d3b5a680f4211ad --> We will be very cautious in the first two quarters on the LAP business.\n\n8e11fa8f123d6b36cb20e18be0ed8bca --> Ashish Damani [Ina BAU, we have budgeted for a 2% kind of a credit cost.]\n\n8e11fa8f123d6b36cb20e18be0ed8bca --> Shalabh Saxena [So, after four quarters, we'd relook at this 2% assumption.]\n\n6d1eeb7154206d043744a323a7194352 --> Guidance for a 2% credit cost\n\n38d6f95407840b79d97bda6c3588119b --> The way we are looking at it is by end of this financial year, we should be in that range of 2% kind of credit cost.\n\n3142759e9f44b168b0b510cd72c5b023 --> And typical our LTV, it will be like 40% to 50%, 55%. So, we'll be very, very conservative in that.", "citations": ["8ed25b6e0568f89e4d3b5a680f4211ad", "8e11fa8f123d6b36cb20e18be0ed8bca", "6d1eeb7154206d043744a323a7194352", "38d6f95407840b79d97bda6c3588119b", "3142759e9f44b168b0b510cd72c5b023"]}, "['Q4', '2022']": {"answer": "517aeda82c4d7ae2a10b697e5af9017b --> Projecting a 2% kind of a credit cost for FY2023", "citations": ["517aeda82c4d7ae2a10b697e5af9017b"]}}}, {"topic": "Portfolio diversification", "data": {"['Q4', '2024']": {"answer": "07cece5856cc544934f301362b9b8865 --> We are on course to maintain our target of no single state to be more than 13% by the end of FY’25, which is this year.", "citations": ["07cece5856cc544934f301362b9b8865"]}}}, {"topic": "Provisioning and risk management", "data": {"['Q4', '2024']": {"answer": "a5df2a522acd04a7d8cfadd13acf56a1 --> Sumil [So, your overall provision is more than the GNPA as we see as of 31st March’24.]", "citations": ["a5df2a522acd04a7d8cfadd13acf56a1"]}}}]}, {"theme": "Geographic and Branch Expansion", "topics": [{"topic": "New branch openings", "data": {"['Q1', '2025']": {"answer": "3e54e71c7acbbdede76172d37b6b2570 --> Credit level resources have been put in about 20% of the branches. This will be scaled up to 50% branches by September 2024.\n\n3e58e8269b76f8414fe01b727ebe2d06 --> Shalabh Saxena[After a year, they become eligible for a branch manager promotion.]", "citations": ["3e54e71c7acbbdede76172d37b6b2570", "3e58e8269b76f8414fe01b727ebe2d06"]}, "['Q2', '2024']": {"answer": "842d804c3ddc706d455cc4c1bc10ff35 --> On the branch expansion, I would just want to detail during the course of this calendar year, we have operationalized 292 branches already. There are 110 branches which are ready to be operationalized over the next three months thus taking our tally to over 1500 branches. This completes our plan of having 1500 branches by FY2025 as articulated in the vision 2025.\n\n842d804c3ddc706d455cc4c1bc10ff35 --> We will now have the full 12 months of next financial year to deliver growth from the branches.\n\nc872651d9bc7d884935266aee79579f0 --> If you remember, we had said that all the new branches that we are going to open will be weekly branches and we have a plan from now until exit 2025 of converting the current monthly branches into weekly.\n\n23e64cd7b388e7d1794c6de6a5b66f70 --> So, we changed the model in Q2 in 700 branches, which covered about 1.5 million customers.\n\nfd91f0dba94880c35501c36822da3521 --> Our plan is to take the number up to 50 branches by end of this year.\n\n3af765e693102e22d8a2654f0cf06c67 --> Shalabh Saxena [rough and ready about 370 to 380 branches should be weekly, when this all gets over, I think we should be at about 450.]\n\n3af765e693102e22d8a2654f0cf06c67 --> Shalabh Saxena [these branches which I said will take about three months, max four months and then we will be sorted.]", "citations": ["842d804c3ddc706d455cc4c1bc10ff35", "c872651d9bc7d884935266aee79579f0", "23e64cd7b388e7d1794c6de6a5b66f70", "fd91f0dba94880c35501c36822da3521", "3af765e693102e22d8a2654f0cf06c67"]}, "['Q3', '2024']": {"answer": "7c15c40a5b159432c6eaaa3c5953cc20 --> So accordingly, we picked 730 branches Pan-India, which had about INR5,500 crores. Portfolio is about 53% of the book, across 1.6 million customers where we launched Parivartan in across the months of July and August last year.\n\n72bef2c4f2bf5088eb3d6fb780ec8613 --> Next year, probably the same period, we will have upwards of 40%, 45% of contribution from these branches, if not more.", "citations": ["7c15c40a5b159432c6eaaa3c5953cc20", "72bef2c4f2bf5088eb3d6fb780ec8613"]}, "['Q4', '2024']": {"answer": "4da42bdfe3612dae9a36e7015e2d5286 --> In our endeavor to move to the weekly based JLG model of microfinance, we opened 429 new branches during the course of the year which had a weekly repayment model.\n\ncb71175ca7488445c0126cb5a59bea75 --> On FY’25 deliverables, during FY’25 we plan to expand in these five states taking the total branch count to about 100 in the same business line and grow organically to reach a book size of anywhere between 400 to 500 crores.\n\n07cece5856cc544934f301362b9b8865 --> We had set a target of 1,500 branches end of 2025. We are already at 1,642 branches, which is 142 branches more.\n\n1a379d16e3e12e15834adffc94c52df2 --> ANA [We will go 2, 2, 3, 3, 10, 10 branches not immediately but in the next two to three quarters when we start that journey, but this time we will not do any wholesale changes.]", "citations": ["4da42bdfe3612dae9a36e7015e2d5286", "cb71175ca7488445c0126cb5a59bea75", "07cece5856cc544934f301362b9b8865", "1a379d16e3e12e15834adffc94c52df2"]}, "['Q1', '2024']": {"answer": "a8be331d77e1f56cbd6b331214f62a79 --> Our plans for having 1,500 operational branches by end of FY '25 is on track.\n\n79be92c2608415fbeaad6ace02b0692b --> The new branches, Renish, that we are opening irrespective of the states will be weekly.", "citations": ["a8be331d77e1f56cbd6b331214f62a79", "79be92c2608415fbeaad6ace02b0692b"]}, "['Q3', '2023']": {"answer": "2c7e33c5525f925b0f2d0086f1da0243 --> We are now pivoting our business from consolidation to growth. We had an original plan. We have pulled forward our expansion plans in light of the progress made so far and the encouraging support received from all our stakeholders, including our employees. Plans are afoot to open roughly 100 new branches in identified geographies during the current quarter, which will be in the states of Rajasthan, UP, Bihar and a little bit of West Bengal.\n\n2c7e33c5525f925b0f2d0086f1da0243 --> We intend to complete most of our branch network expansion in the next financial year. These were the number of branches. If you recollect, we have said that we are going to open about 1,500 branches from our current network, of about 1,100. We need a clear runway of about 4 to 6 quarters. So in all likelihood, we'll complete all the branch expansion plans in -- by quarter 2 or quarter 3 of next financial year.\n\nd0f832e772caa682eaea85ebb2b9fc25 --> Our stated mandate is to take the customer base to 4 million over the next 2 years by adding people and branches. And like Shalabh was explaining, in the immediate future, we are looking at 100 branches. And mostly would like to prepone the other branch rollout plan also into the next financial year, we should be done with all of the branch openings.\n\n381505b197c8a813bfc172266877ddd9 --> Shalabh Saxena [We have ambitions to open between this quarter and the next quarter, we should have opened roughly about 250, 300-odd branches, 200 - 250]", "citations": ["2c7e33c5525f925b0f2d0086f1da0243", "d0f832e772caa682eaea85ebb2b9fc25", "381505b197c8a813bfc172266877ddd9"]}, "['Q2', '2023']": {"answer": "7806b70a7a77886a126314f669a28e28 --> We have already a plan to open branches between Q3 and Q4 all put together we have projected roughly about 400 plus 160, 560 branches all put together from now until FY2025.\n\n7806b70a7a77886a126314f669a28e28 --> Now for branches to deliver we will have to ensure that we kind of open all of them max Q1 of FY2025 for which we will have to start the effort now.\n\n03024b0837e9adb251c0e9a934012b1a --> So all the new branches for example that we are going to open this quarter and the next quarter will all be only in customer acquisition.", "citations": ["7806b70a7a77886a126314f669a28e28", "03024b0837e9adb251c0e9a934012b1a"]}, "['Q4', '2023']": {"answer": "df01bc27e577938975f64e615228ae80 --> Our target now is to have about 1,500 operational branches by the end of this year.\n\ndf01bc27e577938975f64e615228ae80 --> By end of FY '25, we'll have 1,500 branches, but we will open all those branches this year.\n\nc85b9d670ca0e30801ca11402531d550 --> Our goal is to open 50 new branches by the end of 2024.\n\n8fc180566755bf4e7d0b459c17336023 --> So yes, so we will see a bit of a spike, but then it will normalize as we progress during the quarter and the year. This is a standard flow. A typical microfinance branch takes about five months to breakeven on its own and 11 months to come into a full black. So that's the reason why Jignesh, we are trying to open the branches as early as possible so that we have a clear runway.", "citations": ["df01bc27e577938975f64e615228ae80", "c85b9d670ca0e30801ca11402531d550", "8fc180566755bf4e7d0b459c17336023"]}, "['Q4', '2022']": {"answer": "34ef0885511ff4c9ec0ba34ad69d5d38 --> The number of branches we are projecting an increase from 1120 to 1500 results of that is about 380 more branches\n\n96b1cd5142dda2c1a92b0c789f492b3d --> Our branches will remain flat at 1120, 1123 kind of a number.", "citations": ["34ef0885511ff4c9ec0ba34ad69d5d38", "96b1cd5142dda2c1a92b0c789f492b3d"]}}}, {"topic": "Rural and semi-urban penetration", "data": {"['Q1', '2025']": {"answer": "8ddb1c5890e3351090daad4bb752fdcb --> Member acquisition has been paused in about 223 branches.", "citations": ["8ddb1c5890e3351090daad4bb752fdcb"]}}}, {"topic": "State-level dominance", "data": {"['Q4', '2023']": {"answer": "90b78b3690b12b420e48a2dd8f36d287 --> Shalabh Saxena stated that 30% of the loans this quarter have gone to those seven states and as they progressively keep on moving ahead, by the end of this year, the total share of these seven states will be about 22%, 23%. By the end of FY '25, they should be in these seven states, about 40% of their AUM.", "citations": ["90b78b3690b12b420e48a2dd8f36d287"]}}}, {"topic": "Geographic concentration limits", "data": {"['Q1', '2024']": {"answer": "79be92c2608415fbeaad6ace02b0692b --> The very big branches are at some 285 or 286 numbers, our of the 1,100, 1,200. Those branches, we will not touch this year.", "citations": ["79be92c2608415fbeaad6ace02b0692b"]}}}]}, {"theme": "Technology and Digital Transformation", "topics": [{"topic": "Technology adoption", "data": {}}, {"topic": "Digital lending platforms", "data": {"['Q4', '2022']": {"answer": "43ac67c99218aab66b0cfb2eb47553eb --> We are going to scale up to deliver an end-to-end paperless customer experience over the next four quarters.", "citations": ["43ac67c99218aab66b0cfb2eb47553eb"]}}}, {"topic": "Technology-driven operations", "data": {"['Q1', '2023']": {"answer": "2130c633248d7c918c1ddc101e2ace1b --> This company will move to a paperless organization with all escalations on risk metrics on control on audit the triggers will be technology so it will be a IT led initiative company where we will supervise all execution of processes through tech and all supervision will be the primary driver will be tech between Q2 and Q3.", "citations": ["2130c633248d7c918c1ddc101e2ace1b"]}}}, {"topic": "e-KYC implementation", "data": {"['Q4', '2022']": {"answer": "f46f6a727f294c0f947c3e7aee60c184 --> Shalabh Saxena [We are moving to a thumb based e-KYC/validations/KUA model that is expected to compress a three to five day process into a 90 to 180 second process, significantly increasing the green time available for loan officers.]", "citations": ["f46f6a727f294c0f947c3e7aee60c184"]}}}]}, {"theme": "Stakeholder Engagement", "topics": [{"topic": "Investor relations updates", "data": {}}, {"topic": "Customer feedback mechanisms", "data": {}}, {"topic": "Community engagement activities", "data": {"['Q2', '2024']": {"answer": "82d4c44d041a0843af4eeb3d827e478c --> Organizing town hall every quarter, which is a two-way communication with employees to communicate the progress of the company", "citations": ["82d4c44d041a0843af4eeb3d827e478c"]}}}, {"topic": "Shareholder communication", "data": {}}]}]