[{"theme": "Operational Strategy", "topics": [{"topic": "Branch network optimization", "data": {"['Q1', '2024']": {"answer": "4036c2a8b8a5b44e666af41496493bb6 --> We will look to significantly scale up these branches over next one to two years.", "citations": ["4036c2a8b8a5b44e666af41496493bb6"]}, "['Q4', '2024']": {"answer": "8364986c09c4763cb85d5344165f0e23 --> So, this year we have a plan for opening around 150 odd branches. I mean, the number could be plus minus based on getting property, getting property in time and those type of things. But around 150 odd branches we expect this year. Out of that general banking branches around 60 odd will be general banking branches and the next 90 plus will be our micro-banking branches across the country.", "citations": ["8364986c09c4763cb85d5344165f0e23"]}, "['Q3', '2024']": {"answer": "54ac7ad250367c8760abdb2d582ad565 --> We plan that we will have around 150 plus branches open during next FY from now till FY 25.", "citations": ["54ac7ad250367c8760abdb2d582ad565"]}, "['Q2', '2024']": {"answer": "4a27ef4ba2c7607f7221dfc0cb778fdf --> We continue to build our banking franchise and opened 20 new branches in Quarter 2 FY24.\n\n0e8ad63e2959136a6b81d66e5aeac644 --> We have been investing in our growth engine and the rollout of 133 branches, our headcount increase all gets loaded with a time lag and this Quarter 1 and Quarter 2, we have got this cost loaded in the expenses post which we are generating aforesaid pre-provisions operating profit which up 15% YoY.\n\n2de9f6a774271e1d90c9837b8f8f04d9 --> We expect around 125 odd branches getting opened in the next calendar year. From October till March, the number will be around 12 to 15 only.", "citations": ["4a27ef4ba2c7607f7221dfc0cb778fdf", "0e8ad63e2959136a6b81d66e5aeac644", "2de9f6a774271e1d90c9837b8f8f04d9"]}, "['Q2', '2025']": {"answer": "ff6f66d9428b33f9cc05362fcf09f9b3 --> Our target is to open 50 new branches by the end of the year.\n\ne7136b24619d177e425701a298195ef3 --> Our target is to open 50 new branches by the end of 2024.\n\n9f5408e9ee7cb7c61b70eb66af27b182 --> Our goal is to open 50 new branches over the next two years.", "citations": ["ff6f66d9428b33f9cc05362fcf09f9b3", "e7136b24619d177e425701a298195ef3", "9f5408e9ee7cb7c61b70eb66af27b182"]}, "['Q1', '2025']": {"answer": "27c11fe1ac2a0e87399315dcf2a677c2 --> Our target is to open 50 new branches by the end of 2025.\n\na116aef7164eed465321d7f7870e2018 --> So, we have plans of opening 60-odd general banking branches which are liability led branches and more than 100 micro banking branches.\n\na116aef7164eed465321d7f7870e2018 --> So, we will end up having at least 150 plus branches during this financial year.\n\n03fd2d9cc9a7d4b7439829b76ee4db0d --> We are going to see these activities being completed in this quarter.\n\nff48e0c20d16808c7e60e5d9152c4792 --> Our target is to open 50 new branches by the end of 2025.", "citations": ["27c11fe1ac2a0e87399315dcf2a677c2", "a116aef7164eed465321d7f7870e2018", "03fd2d9cc9a7d4b7439829b76ee4db0d", "ff48e0c20d16808c7e60e5d9152c4792"]}}}, {"topic": "Retail and wholesale lending focus", "data": {"['Q4', '2024']": {"answer": "88316b0a0466d973705031474eb766d2 --> Puneet Maheshwari[Wholesale lending, which is at about 10% now would remain at about 10%-11% in terms of portfolio composition.]", "citations": ["88316b0a0466d973705031474eb766d2"]}, "['Q3', '2024']": {"answer": "15afceb0762b5f4d7f7ae326a2e68d81 --> If you look at the quarter 4, I think quarter 4 should be much, much better. I mean in the entire year it will be the highest in terms of disbursement under the retail loans for the bank as a whole. So you will see a significant improvement and jump in the disbursement in the quarter 4 for all the retail loans.\n\n0cf44f47e6895f0fff3b6bfbff6f860f --> We are not going for the large fleet operator also because we don't want to increase the ticket size in a big way. One or two cases, definitely we are doing where we are also going for INR1.5 crores to INR2 crores.", "citations": ["15afceb0762b5f4d7f7ae326a2e68d81", "0cf44f47e6895f0fff3b6bfbff6f860f"]}, "['Q2', '2024']": {"answer": "64098c8e77b1cd5aa4177991fa1f0615 --> we are maintaining our overall loan book growth guidance for FY24.\n\nd027c0c54fdcea1cdae325336e781adf --> Our sense is that the current range should be maintained in the next 2 to 3 years’ horizon also. I think 9.2% upward should be possible in NIM.", "citations": ["64098c8e77b1cd5aa4177991fa1f0615", "d027c0c54fdcea1cdae325336e781adf"]}, "['Q2', '2025']": {"answer": "ff6f66d9428b33f9cc05362fcf09f9b3 --> We aim to increase our loan portfolio by 20% over the next fiscal year.\n\ne7136b24619d177e425701a298195ef3 --> We expect to increase our loan book by 25% over the next financial year.\n\ne7136b24619d177e425701a298195ef3 --> We aim to improve our net interest margin to 5% in the next quarter.", "citations": ["ff6f66d9428b33f9cc05362fcf09f9b3", "e7136b24619d177e425701a298195ef3"]}, "['Q1', '2025']": {"answer": "27c11fe1ac2a0e87399315dcf2a677c2 --> We aim to increase our loan book by 20% in the next fiscal year.\n\na116aef7164eed465321d7f7870e2018 --> we presume that we continue to have the NIMs, Of course, we have mentioned it's going to be upward 9%. But I think we will be in that trajectory at 9.4% as we go along.\n\na116aef7164eed465321d7f7870e2018 --> So, what Sarju mentioned is for NIMs for this year -- I mean overall 9% plus in a medium term what we had mentioned in past also and in the range of 9.4% for this financial year is on the card.", "citations": ["27c11fe1ac2a0e87399315dcf2a677c2", "a116aef7164eed465321d7f7870e2018"]}}}, {"topic": "Micro banking initiatives", "data": {"['Q1', '2024']": {"answer": "14150d7efb2b48e185f42260b4fcf7c5 --> 20% is coming from micro banking part and because in other asset classes our base is low so the growth rate for those asset classes would be higher.\n\nbb44050b93e951267ae248375759babb --> Puneet Maheshwari[We would see microfinance lending yield improving by at least 100 basis points from where we are as of now in about nine months to a year time.]\n\neccabee4d4f793d7d80d2eac53866d40 --> In the case of Bihar we expect that around 3% to 4% decline in our geographical mix for micro finance over next maybe one to one and a half years...", "citations": ["14150d7efb2b48e185f42260b4fcf7c5", "bb44050b93e951267ae248375759babb", "eccabee4d4f793d7d80d2eac53866d40"]}, "['Q4', '2024']": {"answer": "62a8e46ec049e50d46f49de100a4039a --> From the current quarter, we are planning to introduce a differential rate of interest for our JLG customers basis asset quality, vintage curve etc., which will help us implement risk-based pricing in micro-banking lending more effectively.\n\n301b6698d92e180710cda5b8d2a7bfa5 --> Micro LAP is one product which we intend to focus upon. We have already got a team and obviously we expect some good traction during this year.\n\n88316b0a0466d973705031474eb766d2 --> Puneet Maheshwari[This is our expectation for financial year 25 as well, so maybe share of micro-banking will come down by 3% to 5% anywhere between 57% to 59% for financial year 25.]", "citations": ["62a8e46ec049e50d46f49de100a4039a", "301b6698d92e180710cda5b8d2a7bfa5", "88316b0a0466d973705031474eb766d2"]}, "['Q3', '2024']": {"answer": "320a44c6029fa5da75c29290b20ae17d --> We have started keeping one day buffer in every fortnight which is a non-centre meeting day so that field staff can reach out to borrowers who could not pay on centre meeting day.\n\n54ac7ad250367c8760abdb2d582ad565 --> So around 20%-22% for microfinance and overall around 30% for FY 25.\n\n22705ccd5716b85cb02b66bd606a4c57 --> For the current year, we have taken 1.5% of our microfinance loans as on March ‘23.\n\n22705ccd5716b85cb02b66bd606a4c57 --> We intend to raise at least 2.5% of our microfinance book.\n\n2dadacdeef4dd31d020791d013076357 --> And also, we continue to maintain that in the near term, in the near to medium term, our microfinance book would come towards 50% or so, right?\n\n2dadacdeef4dd31d020791d013076357 --> Yes, so the way we mentioned that currently we are around 62% or so and in next three years or so, we expect that microfinance book will be close to 50% and 50% will be contributed by the non-microfinance book.", "citations": ["320a44c6029fa5da75c29290b20ae17d", "54ac7ad250367c8760abdb2d582ad565", "22705ccd5716b85cb02b66bd606a4c57", "2dadacdeef4dd31d020791d013076357"]}, "['Q2', '2024']": {"answer": "64098c8e77b1cd5aa4177991fa1f0615 --> micro banking disbursement for the month of October 2023 were about 30% higher than monthly run rate for quarter 2, FY24, which gives us confidence that MB loan book growth will also pick up in H2 FY24\n\nedbdf8a57c50cfcc9bf432b37fbd79ca --> Now we are seeing pickup in microfinance and there should not be much decline in terms of the ratio between microfinance and secured from here till March 31st. And to that extent, basically both yield and margins are going to be a little bit positively impacted.\n\nedbdf8a57c50cfcc9bf432b37fbd79ca --> Portfolio yield can go up in microfinance from 23 to 23.6.\n\nfd4c71069634f7a005bb635c5a958a57 --> Puneet Maheshwari [Microfinance it will go up at least by 80 to 90 basis points from where we are currently.]", "citations": ["64098c8e77b1cd5aa4177991fa1f0615", "edbdf8a57c50cfcc9bf432b37fbd79ca", "fd4c71069634f7a005bb635c5a958a57"]}, "['Q2', '2025']": {"answer": "6039ff9dab1e0e34b0fde6f95170e664 --> As we mentioned, while the aberrations in terms of the guardrail and the leverage systematic risk that has emerged, we already were in the move to factor of moving more to the secured book. This was in our plan for the coming years, and therefore at a point in time when we had a 90% micro banking heavy, we are today at 57%, which is a trajectory, and that is what is going to continue.\n\n2606d1d97f76739f71109e210b027f03 --> And we do expect that not in the foreseeable future, in the next few months, we should see a good improvement in overall JLG or at least the pain, whatever we are seeing, should be over.", "citations": ["6039ff9dab1e0e34b0fde6f95170e664", "2606d1d97f76739f71109e210b027f03"]}, "['Q1', '2025']": {"answer": "5361e1d8f80c07a39d24e32307332363 --> While these changes may have transitory impact on business growth over the next three to four months. As per our assessment, impact for us will not be much, would be in a single digit.\n\n053a45a2541ca1981900481e88f2b216 --> 20% growth for microfinance should not be a problem for us.", "citations": ["5361e1d8f80c07a39d24e32307332363", "053a45a2541ca1981900481e88f2b216"]}}}, {"topic": "Consumer banking strategies", "data": {"['Q2', '2025']": {"answer": "8691a23990518d72b952218b35290220 --> So, gradually we are seeing that those customers are getting weeded out. And that's why I am confident that next 1 to 2 months' time you will see that the situation will improve from here.", "citations": ["8691a23990518d72b952218b35290220"]}}}, {"topic": "MSME and housing loan focus", "data": {"['Q4', '2024']": {"answer": "832fc9edffda0a8ac48675adde8ab29c --> Rural Housing we will see next 2-3 months’ time that will also get launched by end of Quarter 1 or maybe beginning of Quarter 2.", "citations": ["832fc9edffda0a8ac48675adde8ab29c"]}}}]}, {"theme": "Digital Transformation and Technology Integration", "topics": [{"topic": "Mobile banking adoption", "data": {}}, {"topic": "Digital onboarding progress", "data": {"['Q1', '2024']": {"answer": "c279d5d94996d0744ce7c50ef0b4de8b --> More than 95% of customers are onboarded through digital onboarding in Q1 of FY2024.", "citations": ["c279d5d94996d0744ce7c50ef0b4de8b"]}}}, {"topic": "Fintech partnerships", "data": {}}, {"topic": "E-sign and e-KYC implementation", "data": {}}, {"topic": "IT infrastructure upgrades", "data": {}}]}, {"theme": "Customer Experience and Engagement", "topics": [{"topic": "Service delivery improvements"}, {"topic": "Feedback-driven improvements"}, {"topic": "Engagement channel optimization"}, {"topic": "Customer satisfaction metrics"}, {"topic": "Cross-selling initiatives"}]}, {"theme": "Regulatory Compliance and Governance", "topics": [{"topic": "Adherence to banking regulations", "data": {}}, {"topic": "Risk management frameworks", "data": {}}, {"topic": "Compliance enhancements", "data": {"['Q1', '2025']": {"answer": "03fd2d9cc9a7d4b7439829b76ee4db0d --> Now, all the formalities, which is to actually get the scheme approved, which is the conclusion of the entire scheme in the realm of the regulatory requirement will happen in this quarter.", "citations": ["03fd2d9cc9a7d4b7439829b76ee4db0d"]}}}, {"topic": "Capital adequacy requirements", "data": {"['Q1', '2024']": {"answer": "a5095e48459638bf01b6c4a11928c408 --> Certainly now RBI says that 26% you have to achieve in 15 years time so there is much longer window from RBI side also, so currently no decision has been taken at either of these places.", "citations": ["a5095e48459638bf01b6c4a11928c408"]}, "['Q2', '2024']": {"answer": "b4ed1fb4790a74c70d3f519a02263481 --> In terms of the one key ratio, capital adequacy ratio that the regulator and Investors keep eye on, we are at a really comfortable adequacy of 24.8% as of September 2023 providing adequate headroom for our follow-up growth plans.", "citations": ["b4ed1fb4790a74c70d3f519a02263481"]}, "['Q2', '2025']": {"answer": "e5a33282ac40eb9dcf64788857a0a32d --> We are not in the process of raising any equity. In terms of capital adequacy, we are quite comfortable. And certainly, at least for this year, we may not require any tier 1 equity.", "citations": ["e5a33282ac40eb9dcf64788857a0a32d"]}}}, {"topic": "Regulatory changes impact", "data": {"['Q1', '2025']": {"answer": "7518d5f8ac2fd23e0055e7de32694080 --> Govind Singh [The changes what MFIN recommended, it can lead into a decline in disbursement in the short term by, say, around single digit.]", "citations": ["7518d5f8ac2fd23e0055e7de32694080"]}}}]}, {"theme": "Market Positioning and Competition", "topics": [{"topic": "Competitive landscape analysis", "data": {"['Q3', '2024']": {"answer": "068b7f412dbef4aa7f603eb4f4edd60d --> Govind Singh [We think that the rates have peaked out and there will not be any further rate increase from here.]", "citations": ["068b7f412dbef4aa7f603eb4f4edd60d"]}, "['Q1', '2025']": {"answer": "84bfa18d3d23f0f6a0da5445fd6f432d --> Trilok Nath Shukla [We have implemented it as of 1st of August and most of the SFBs and MFIs who are mainly our competitor in our area, they have either implemented or they will be implementing in next 1 or 2 months.]", "citations": ["84bfa18d3d23f0f6a0da5445fd6f432d"]}}}, {"topic": "Market penetration strategies", "data": {"['Q1', '2024']": {"answer": "c61ebd803c6c6337651154f3952c1caf --> Our idea is that next maybe 18 months or so, we should be able to have 2% to 3% of retail market share in some of these markets.", "citations": ["c61ebd803c6c6337651154f3952c1caf"]}}}, {"topic": "Brand differentiation efforts", "data": {}}, {"topic": "International market penetration", "data": {}}, {"topic": "New product launches", "data": {"['Q2', '2025']": {"answer": "444a07529f3db16fd1db499685d8b295 --> We are planning to launch three new products next quarter.", "citations": ["444a07529f3db16fd1db499685d8b295"]}}}]}, {"theme": "Risk Management", "topics": [{"topic": "Credit risk assessment", "data": {"['Q1', '2024']": {"answer": "c63436a39f370aa800707a3829d20a20 --> In the case of NBFC lending, we continue to operate primarily in entities rated A or higher rating category by external rating agencies.\n\n80be31a135b81163d8670f1c381e5a62 --> Absolutely correct.", "citations": ["c63436a39f370aa800707a3829d20a20", "80be31a135b81163d8670f1c381e5a62"]}, "['Q4', '2024']": {"answer": "74c8c4a51d6f92a569dcd317f5f0c7b5 --> [Inferred as CFO][Overall, credit cost for full FY24 at 2.2% was little higher than our guided range of around 2%, but we are confident that we will be able to reduce credit cost to our original guided range of around 2% in FY25.]\n\n73f6e517c5ba56a78e90d5cdccdfb32a --> This year credit cost is at 2.2, but the trending at the Q4 beginning at 1.7 we are hoping to keep that around 2%.", "citations": ["74c8c4a51d6f92a569dcd317f5f0c7b5", "73f6e517c5ba56a78e90d5cdccdfb32a"]}, "['Q3', '2024']": {"answer": "7dd91830e451281582a72e358c4e4eda --> We expect credit cost to come down to closer to 2% in Q4 FY24.\n\n303f040874b68dccced06e547ae6ade5 --> So I think overall you know whatever slippages we have seen in the in quarter 3 as I mentioned we are confident that it will be much better in quarter 4 and quarter 4 should see around 2% or so in terms of overall credit cost for the quarter 4.\n\n028346c6df867f44692ebd99a2c32ffb --> The actual credit cost for micro finance on a stable basis, maybe 1% to 1.5%.", "citations": ["7dd91830e451281582a72e358c4e4eda", "303f040874b68dccced06e547ae6ade5", "028346c6df867f44692ebd99a2c32ffb"]}, "['Q2', '2024']": {"answer": "07a7dea5a8456da80287442cfc7cbb92 --> Puneet Maheshwari [On the credit cost, we had said that including floating provision, we are expecting a credit cost of about 2%. And we would like to have the same guidance for financial year ‘25 as well.]", "citations": ["07a7dea5a8456da80287442cfc7cbb92"]}, "['Q2', '2025']": {"answer": "735c611ae77e760c294087b0b5632504 --> Credit cost of 3.5% to 4.5% against earlier guidance of 2%.\n\n18a5d360a9d538ac16802371666aea50 --> Our guidance as mentioned by Govindji for credit cost is now in range of 3.5% to 4.5% for FY '25.\n\nbbe2305005926eff1f8b93c276c29a68 --> Puneet Maheshwari [Credit cost guidance, we are giving 3.5 to 4.5. So, to that extent, actually, we are expecting a little higher slippages in Quarter 3.]\n\na0526eb481b7577e3e8bf6e7b5a3dcb4 --> Puneet Maheshwari [We have given a guidance of 3.5% to 4.5% on our credit cost for the full Financial Year ‘25.]\n\nc0ddbbdfed332734734efa5c359ad9e9 --> Sarjukumar P. Simaria [We should be on a number basis within the 4.5 upper cap of the stress or credit costs that we have just given guidance to.]", "citations": ["735c611ae77e760c294087b0b5632504", "18a5d360a9d538ac16802371666aea50", "bbe2305005926eff1f8b93c276c29a68", "a0526eb481b7577e3e8bf6e7b5a3dcb4", "c0ddbbdfed332734734efa5c359ad9e9"]}, "['Q1', '2025']": {"answer": "2cc955237c2887e2095eb0ab6a008d44 --> Overall credit cost in the range of 2%, we are very confident of as of now, for the year as a whole.\n\nc228d4f421a889e2bec9be6192b9d83e --> And we do expect that they will start giving -- yielding results from quarter two. I am not saying quarter two will not happen, but it may not be significant improvement or significant jump from quarter one to quarter two itself. It may take some time and we should start seeing better results from the quarter three onwards. That is what we are expecting and that is what we are right now working in the field. So still, we are very confident that overall we should be in the range of 2% or so in terms of overall credit cost.", "citations": ["2cc955237c2887e2095eb0ab6a008d44", "c228d4f421a889e2bec9be6192b9d83e"]}}}, {"topic": "Non-performing assets (NPA) trends", "data": {"['Q1', '2024']": {"answer": "dd37ffada7df708c5fd02ed74b14727f --> Going forward even in Q2 we see a significant reduction in the overall whatever slippages we have seen in the retail loans also.\n\n9f52c1863896e0709b846d5f651f5ed8 --> Govind Singh [It should be below 8%. This is our sense.]", "citations": ["dd37ffada7df708c5fd02ed74b14727f", "9f52c1863896e0709b846d5f651f5ed8"]}, "['Q4', '2024']": {"answer": "5589ab28bc29047268376cc09d2d7d6e --> Focus on maintaining strong asset quality with nil net NPAs and credit costs at around 2%. Credit cost guidance includes an additional floating provision which the Bank will build in FY25.", "citations": ["5589ab28bc29047268376cc09d2d7d6e"]}, "['Q3', '2024']": {"answer": "7dd91830e451281582a72e358c4e4eda --> We expect slippages in retail portfolio to come down in Q4 FY24.", "citations": ["7dd91830e451281582a72e358c4e4eda"]}, "['Q2', '2025']": {"answer": "8d66ce0cd13d28bfcaae91eb0d67d92e --> Operating environment and delinquency trend remain weaker even in month of October '24, and currently, we expect it to peak out towards the end of Quarter 3 FY '25 and reversal to start from quarter 4 FY '25.", "citations": ["8d66ce0cd13d28bfcaae91eb0d67d92e"]}, "['Q1', '2025']": {"answer": "5361e1d8f80c07a39d24e32307332363 --> fresh slippages in MSME and CE/CV segment expected to reduce significantly as well as recoveries, upgradation would pick up in Q2 FY25.\n\nc418331b1085de18f1c9c866a854597a --> We do expect that the type of slippages we have seen during the last three, four months, the same type of slippages we will not see from here onwards. The improvement or the overall improvement takes a little time, that we have seen in the past also. So, that's why the actual impact will start seen from the quarter 3 and quarter 4, mostly in that range.\n\nff48e0c20d16808c7e60e5d9152c4792 --> Our non-performing assets ratio should decrease to below 2% by the end of this year.\n\ne3d8868e61a388195f42b5985a7d98de --> We will certainly see improvement in quarter two. I mean both sides. One is the slippages should be lower as well as recovery upgradation on this piece should be higher.\n\nca9d06564ef28d2a52195797049296ac --> we still think that we should be closer to zero when we close this financial year of FY’25.", "citations": ["5361e1d8f80c07a39d24e32307332363", "c418331b1085de18f1c9c866a854597a", "ff48e0c20d16808c7e60e5d9152c4792", "e3d8868e61a388195f42b5985a7d98de", "ca9d06564ef28d2a52195797049296ac"]}}}, {"topic": "Operational risk controls", "data": {}}, {"topic": "Market risk mitigation strategies", "data": {"['Q4', '2024']": {"answer": "baa35db56bea0a697b3ff1cecf1496bf --> our perspective maybe it can go up at the most maybe 10 to 15 basis points, not more than that and during this financial year if the market remains the same level where it is today, it might go up around 10 to 15 basis points, not beyond that.", "citations": ["baa35db56bea0a697b3ff1cecf1496bf"]}}}, {"topic": "Provision balance tracking", "data": {"['Q1', '2024']": {"answer": "db64815e69745c73fa3a945653139867 --> we expect to do 1.5% of JLG book as on March 2023 which is getting us to about Rs.106 Crores of provision as of June quarter over and above the IRAC provision.", "citations": ["db64815e69745c73fa3a945653139867"]}, "['Q4', '2024']": {"answer": "74c8c4a51d6f92a569dcd317f5f0c7b5 --> [Inferred as CFO][We will continue to build floating provision further in FY25 to strengthen our ability to withstand any unforeseen event impact better.]\n\n5589ab28bc29047268376cc09d2d7d6e --> We will continue to build floating provision further in FY25 to strengthen our ability to withstand any unforeseen event impact better.\n\n73f6e517c5ba56a78e90d5cdccdfb32a --> We intend to continue this provision and inch it up to 2% this year on the closing portfolio of JLG book.\n\nc1b32770472e67b186aa5399ee8cfba3 --> The board has directed us or guided us to make 2% floating provisions on our JLG book.", "citations": ["74c8c4a51d6f92a569dcd317f5f0c7b5", "5589ab28bc29047268376cc09d2d7d6e", "73f6e517c5ba56a78e90d5cdccdfb32a", "c1b32770472e67b186aa5399ee8cfba3"]}, "['Q3', '2024']": {"answer": "bbfc3d1fcd94457edc96fc565f3b34ef --> We continue to build floating provision and we have made a INR14 crores floating provision in the current quarter. This provision is on a straight line basis similarly we have made a INR14 crores provision in Q1, Q2 and Q3 taking the entire floating provision which is over and above the IRAC RBI norms to INR134 crores as at December 23.", "citations": ["bbfc3d1fcd94457edc96fc565f3b34ef"]}, "['Q2', '2024']": {"answer": "0e8ad63e2959136a6b81d66e5aeac644 --> We continue to follow making additional floating provision, and in this quarter, we have made Rs. 14 crores of additional floating provision which was same as in Q1. We are adding Rs. 28 crores of floating provision in the half year results.", "citations": ["0e8ad63e2959136a6b81d66e5aeac644"]}, "['Q2', '2025']": {"answer": "6039ff9dab1e0e34b0fde6f95170e664 --> create additional floating provision for only JLG loan portfolio beginning October 1, 2024, while we will continue to create floating provision which is 20% of the standard provision for the period.\n\n2e8852567afb4a391264f636f2a9d05c --> Alok Pathak [For all unsecured loans, the bank starts with 40% provisioning the moment it crosses 90 days. It starts from 40% and then every quarter it will get added 15% each, so within 12 months, they provide 100%.]\n\n10499c69284cc2b9087a674e50b3d591 --> Sarjukumar P. Simaria [We would want to see all in terms of the provisioning that is likely to happen anywhere between 65% is where we would like to be upwards. That will be the endeavor. This is excluding the floating provision.]", "citations": ["6039ff9dab1e0e34b0fde6f95170e664", "2e8852567afb4a391264f636f2a9d05c", "10499c69284cc2b9087a674e50b3d591"]}, "['Q1', '2025']": {"answer": "6f390eadfea0e32747d2e0fe4e82adc6 --> We will continue to use this as a straight line, building in 20 crores of floating provision for each of the quarters for the coming three quarters too.", "citations": ["6f390eadfea0e32747d2e0fe4e82adc6"]}}}]}, {"theme": "Deposit and Funding Strategy", "topics": [{"topic": "Retail deposit growth", "data": {"['Q1', '2024']": {"answer": "9f52c1863896e0709b846d5f651f5ed8 --> Puneet Maheshwari [On the retail term deposit our broader maturity is at about 20 months to 24 months. So within retail piece about half of the term deposit repricing has happened and the balance half will happen over the next two to three quarters.]", "citations": ["9f52c1863896e0709b846d5f651f5ed8"]}, "['Q4', '2024']": {"answer": "575b86030c3434eef804eefb36111bb8 --> We expect deposit growth to be tad higher than loan book growth for FY25, which would also help us moderating CD ratio further in FY25.", "citations": ["575b86030c3434eef804eefb36111bb8"]}, "['Q3', '2024']": {"answer": "1e9983a0318d58c276fbc7dc7c04906c --> We do expect that our growth for deposits for this year will be in the range of 27%, 28% for sure...\n\n1891d5227a78c8e5122152cee3f820f7 --> So fourth quarter basically you are going to see a huge jump in deposit growth.\n\n1891d5227a78c8e5122152cee3f820f7 --> quarter four will be much, much significantly higher than what we have seen in previous three quarters.\n\nd53f982db1695848f13bad6f1fc80219 --> And as we progress, I think we get to that minimum 1% and over the next two years, 3% over the next two years on total deposits.", "citations": ["1e9983a0318d58c276fbc7dc7c04906c", "1891d5227a78c8e5122152cee3f820f7", "d53f982db1695848f13bad6f1fc80219"]}, "['Q2', '2024']": {"answer": "d027c0c54fdcea1cdae325336e781adf --> We expect 17% to 18% type of yield in those cases.\n\neafaafa975d95d5f89574efb5c74525d --> Govind Singh", "citations": ["d027c0c54fdcea1cdae325336e781adf", "eafaafa975d95d5f89574efb5c74525d"]}}}, {"topic": "CASA ratio improvement", "data": {"['Q1', '2024']": {"answer": "80b8c384684dc11d304fbcc3b4ff47c2 --> efforts around three years time we should inch up the CASA to say 35% and CASA plus RTD to 75% to 80% as we grow our base of advances and deposits.", "citations": ["80b8c384684dc11d304fbcc3b4ff47c2"]}, "['Q4', '2024']": {"answer": "74c8c4a51d6f92a569dcd317f5f0c7b5 --> [Inferred as CFO][We will work to strengthen our CASA deposit growth and CASA percentage significantly over FY25.]", "citations": ["74c8c4a51d6f92a569dcd317f5f0c7b5"]}, "['Q3', '2024']": {"answer": "1e9983a0318d58c276fbc7dc7c04906c --> ...next year we expect our – and the CD ratio for this year end will be in the range of 97% or so...\n\n48609e0aec06d82ac0c5308282b8b506 --> We expect that around 26%-27% should be our CASA ratio at the end of March '25.", "citations": ["1e9983a0318d58c276fbc7dc7c04906c", "48609e0aec06d82ac0c5308282b8b506"]}, "['Q2', '2024']": {"answer": "7e27e179050825575db280c2c3352aa7 --> Govind Singh [Our internal targets are that retail term deposits and CASA should be at least 70%. Currently, it is around 66% or so. It should be at least 70% for this year.]\n\n909e62d2f1e8e07fc3742589abc208bf --> Utkarsh Small Finance Bank [70% is what we are looking at, at the end of March 2024 in terms of CASA and retail term deposits put together.]", "citations": ["7e27e179050825575db280c2c3352aa7", "909e62d2f1e8e07fc3742589abc208bf"]}, "['Q1', '2025']": {"answer": "2137ea18741dbde2c742b6ffcc19876b --> We expect our CD ratio to decline further in FY25.", "citations": ["2137ea18741dbde2c742b6ffcc19876b"]}}}, {"topic": "Liquidity management", "data": {"['Q1', '2024']": {"answer": "c279d5d94996d0744ce7c50ef0b4de8b --> We maintain tight control on institutional deposit as we are having surplus liquidity of more than Rs.2000 Crores as on June 30, 2023.\n\n9f52c1863896e0709b846d5f651f5ed8 --> Puneet Maheshwari [By Q3 you should see the peak of cost of funds.]", "citations": ["c279d5d94996d0744ce7c50ef0b4de8b", "9f52c1863896e0709b846d5f651f5ed8"]}, "['Q4', '2024']": {"answer": "9aa1dd5b35e4e5960b121e7893f75887 --> So, that is what I said roughly, our sense is that on account of this repricing, we would have gained additional 20-25 basis point, and we think probably this will be let us say the decline in yield on account differential rate of interest and broadly, these two would offset each other in financial year 25.", "citations": ["9aa1dd5b35e4e5960b121e7893f75887"]}, "['Q3', '2024']": {"answer": "1e9983a0318d58c276fbc7dc7c04906c --> ...next year we expect around 4% to 5% decline in this ratio when we are talking about March '25. So March '25 may be closer to 90% to 93%...", "citations": ["1e9983a0318d58c276fbc7dc7c04906c"]}, "['Q2', '2024']": {"answer": "fd4c71069634f7a005bb635c5a958a57 --> Puneet Maheshwari [The overall cost of funds may increase by about 20 basis points over the next 2 quarters.]\n\nfd4c71069634f7a005bb635c5a958a57 --> Puneet Maheshwari [On a balance sheet basis, the yield should go up by about 50 basis points from where we are currently.]\n\n909e62d2f1e8e07fc3742589abc208bf --> Govind Singh [We are not going to change our rate of interest significantly from here and the cost of my funds will remain almost the same other than repricing, as Puneet mentioned that that may have an impact of around 20-25 basis points till March because of repricing of FD only, but nothing beyond that.]\n\neafaafa975d95d5f89574efb5c74525d --> Nilesh Jethani", "citations": ["fd4c71069634f7a005bb635c5a958a57", "909e62d2f1e8e07fc3742589abc208bf", "eafaafa975d95d5f89574efb5c74525d"]}, "['Q1', '2025']": {"answer": "2137ea18741dbde2c742b6ffcc19876b --> We expect to consume part of this surplus liquidity over next two quarters as loan book growth picks up and to that extent it will support net interest margins.\n\n436954ed1372640237270611488ebb7e --> Gaurav Kochar [The 20 basis points, I think what Sajju Sir mentioned about the liquidity drag today that would also get normalized in the next two quarters as the liquidity is deployed into more loans.]", "citations": ["2137ea18741dbde2c742b6ffcc19876b", "436954ed1372640237270611488ebb7e"]}}}, {"topic": "Reduction in bulk deposits", "data": {"['Q1', '2024']": {"answer": "c279d5d94996d0744ce7c50ef0b4de8b --> Our concentration to top 20 depositors declined from 28% in March 2022 to 21% as of March 2023.", "citations": ["c279d5d94996d0744ce7c50ef0b4de8b"]}, "['Q2', '2025']": {"answer": "735c611ae77e760c294087b0b5632504 --> We expect our CD ratio to decline further in FY '25.", "citations": ["735c611ae77e760c294087b0b5632504"]}}}, {"topic": "Competitive funding sources", "data": {"['Q2', '2024']": {"answer": "eafaafa975d95d5f89574efb5c74525d --> Puneet Maheshwari", "citations": ["eafaafa975d95d5f89574efb5c74525d"]}, "['Q2', '2025']": {"answer": "b79d9a2f5aff89ced83a8e71692cac5d --> Puneet Maheshwari [From May, we started a differential rate of interest, which is 23%, 24% and 25%.]", "citations": ["b79d9a2f5aff89ced83a8e71692cac5d"]}}}]}, {"theme": "Strategic Growth and Partnerships", "topics": [{"topic": "Long-term growth trajectory", "data": {"['Q1', '2024']": {"answer": "4036c2a8b8a5b44e666af41496493bb6 --> Microfinance remains our core business for us and we think that still it will be more than 50% of our portfolio at the end of FY2026.\n\n4036c2a8b8a5b44e666af41496493bb6 --> Our loan book growth which was 31% for the last one year and deposit growth of 36% year-on-year, we see adequate growth opportunity in our businesses and geographies and to that extent growth may remain in the same trajectory.\n\ndd37ffada7df708c5fd02ed74b14727f --> We expect that in next 18 to 24 months’ time these will be contributing in the bottom line also.\n\n4253b1043d2c3dca93ca3ce83416744f --> We expect our usual growth to be around 20% especially in JLG part. The growth will be in the range of 20%.\n\n4253b1043d2c3dca93ca3ce83416744f --> We are also focusing more on the MBIL which is individual lending product where we are expecting a faster growth. We do expect that this will have more than 150% growth if you look at this financial year.\n\n4253b1043d2c3dca93ca3ce83416744f --> Overall 20% odd growth is what we expect in JLG on a medium-term horizon from our side.\n\nb97c4a48a4002b3b56f4ae2973306006 --> I think 20% growth on our base, we have 26 lakh customer base so our idea this is a reasonable growth...\n\n14150d7efb2b48e185f42260b4fcf7c5 --> Our AUM growth has been in the range of 31%. Even CAGR for last few years if you look at three years’ time it is around 26% to 27% so we are confident 31% will be better only and it will not go below this. At least when you are looking at next two to three years horizon for sure.\n\nbb44050b93e951267ae248375759babb --> Puneet Maheshwari[Overall micro lending piece may grow by 22% to 23%.]\n\n3cb3a853f03cee14461891b6200b8e0a --> Yes, certainly if you look at the medium term horizon i.e. next three to four years time, certainly yes. As I mentioned we are growing. We have grown last year 31% plus and we expect this growth should be higher than that. So if you look at a CAGR for the next maybe three years or so, certainly 25% to 30% is certainly doable and we have created enough machinery for doing that during the last three to four years time.\n\na5095e48459638bf01b6c4a11928c408 --> Not in short term, I mean medium term difficult because even suppose someone decides to go for it, it takes around 15 months time, so it cannot happen in short term, but yes medium term it is difficult to predict right now.\n\n6f95cbc1382c97678898042215653dda --> We expect this to grow, improve at least 0.5% in next two to three months time.", "citations": ["4036c2a8b8a5b44e666af41496493bb6", "dd37ffada7df708c5fd02ed74b14727f", "4253b1043d2c3dca93ca3ce83416744f", "b97c4a48a4002b3b56f4ae2973306006", "14150d7efb2b48e185f42260b4fcf7c5", "bb44050b93e951267ae248375759babb", "3cb3a853f03cee14461891b6200b8e0a", "a5095e48459638bf01b6c4a11928c408", "6f95cbc1382c97678898042215653dda"]}, "['Q4', '2024']": {"answer": "5589ab28bc29047268376cc09d2d7d6e --> Our guidance for some key numbers for FY25 are as follows: We expect gross loan book growth of around 30%, deposit growth to be higher by at least 3% to 5% vs. loan book growth and with the target to reduce CD ratio further in FY25.\n\nf325022e96c833b43e2b645596357c98 --> Puneet Maheshwari [JLG growth of 20% for the full financial year, with an average ticket size increase by 4% between March '23 and March '24.]\n\n0e6f5bc421a54a37a652bf4d3c59f1e3 --> Govind Singh [We expect in terms of timeline it should be in the similar range, maybe around 12 to 15 months from now we should be able to complete the whole process.]\n\nd8111768e64c1b2ce89e0aeb25c5618c --> So, the trajectory will continue. One factor certainly happens that Quarter 4 I think there is a greater activity level that goes up, so around 10% to 15% increase because of that also happens for sure, but overall trajectory for next year will remain in the same range. I am talking growth trajectory will remain the same range what we have seen in FY24.\n\nef8b0aad85e4ee070d77ded3c88adcb2 --> Maybe around 30 to 40 basis points higher yield for FY25. That is what we can give guidance today.\n\n9c812efbf4acdbc14c9effdc1e678698 --> Our idea is to grow by around 40% to 50% in that segment for next year.\n\nc1b32770472e67b186aa5399ee8cfba3 --> We have started paying dividend from this year, so we will become a dividend paying company.\n\nc1b32770472e67b186aa5399ee8cfba3 --> 30% plus growth in the overall assets and overall advances and 3% to 5% higher growth for deposits for this year.", "citations": ["5589ab28bc29047268376cc09d2d7d6e", "f325022e96c833b43e2b645596357c98", "0e6f5bc421a54a37a652bf4d3c59f1e3", "d8111768e64c1b2ce89e0aeb25c5618c", "ef8b0aad85e4ee070d77ded3c88adcb2", "9c812efbf4acdbc14c9effdc1e678698", "c1b32770472e67b186aa5399ee8cfba3"]}, "['Q3', '2024']": {"answer": "0afda12537a66859d977c1643d65d807 --> we are planning to grow at 35%, 30% in FY25.", "citations": ["0afda12537a66859d977c1643d65d807"]}, "['Q2', '2024']": {"answer": "a147fe468636578c308f4c4e8a276c6f --> Overall, we expect loan book growth to remain broadly in the same range of previous year loan book, a growth of 31% plus, and deposit growth to follow the trend in loan book growth.\n\n072ac0f54e904a7620af89835c41dbaf --> As far as growth plans are concerned, as I mentioned, in advances, last year it was 31%, and it will be above that; it won't be lower than that. It should be much better than that in fact. We have seen the traction, as I mentioned, in case of other than microfinance, we have seen a significant growth in H1 also and further the rate of growth and the percentage of growth will go up in case of H2. Overall growth for this year will be above 31% for this year in terms of overall AUM for the bank.\n\n072ac0f54e904a7620af89835c41dbaf --> We have seen, at least in the month of October itself, the microfinance disbursements are around 30% higher than what we have done on monthly average for the Quarter 2. That is a big indication from our side that we will see a significant growth and microfinance around 20 odd percent growth for this year, +20 odd percent plus, and overall, 31% plus growth for the AUM is minimum from our side.\n\n31a2ab404735f17e178e00e9d95c0f6c --> Govind Singh [Our trajectory, as I mentioned, is around 18% to 20%, and we are confident that we will be able to retain or say maintain this irrespective of composition of our asset mix. We are going more secured now and more non-microfinance also and even on a larger balance sheet. So, we stick to our guidance of 18% to 20% for at least the next 3 to 4 years’ horizon. That is how we look at it.]\n\nd995a2472158d0f832559d563344dd9f --> Our expectation or you can say guidance for this year should be around 97% or so when we close the year. It will come down from here and it should be in that range.\n\nd995a2472158d0f832559d563344dd9f --> So, at the end of March 2024, it should be in the range of 97% or so. And that is what as a guidance we can tell today.\n\n3b65fdd459b0dc90f96517d233b27e52 --> Puneet Maheshwari [We are building these businesses – MSME, HL, Wheels as well as the Liability. So, some investments are being done in these businesses and benefits obviously will come as we see more improvement in productivity and so on over the next 1 to 2 years.]\n\n92a662cddf8e97a1cc487d55ab04bf5c --> Sir, what we have basically guided is about 18% to 20% ROE. To that extent, obviously about let’s say 9% to 10% accretion to the current book value from now till March should happen.\n\nd027c0c54fdcea1cdae325336e781adf --> In fact, our staffing is enough for the next 25% to 30% growth. I don't require staffing for the next 30% growth from here.", "citations": ["a147fe468636578c308f4c4e8a276c6f", "072ac0f54e904a7620af89835c41dbaf", "31a2ab404735f17e178e00e9d95c0f6c", "d995a2472158d0f832559d563344dd9f", "3b65fdd459b0dc90f96517d233b27e52", "92a662cddf8e97a1cc487d55ab04bf5c", "d027c0c54fdcea1cdae325336e781adf"]}, "['Q2', '2025']": {"answer": "a98a91b95df69173525911bfea063e02 --> We expect JLG disbursement to normalize from quarter 4 FY '25, and basis which for the full year JLG portfolio could remain flat against FY '24.\n\na98a91b95df69173525911bfea063e02 --> From a medium-term perspective, we expect JLG loan portfolio to normalize for FY '26 and expect it to grow by around 14% to 15% year-on-year and overall loan growth for the Bank in the range of 25% to 30%.\n\n735c611ae77e760c294087b0b5632504 --> Loan book growth of around 18% to 20% for FY '25.\n\n444a07529f3db16fd1db499685d8b295 --> We expect to achieve a revenue growth of 10% by the end of the fiscal year.\n\n4e8ca1beb2ad23bf818ed94b4b82fd52 --> Puneet Maheshwari [In terms of number of customers, it will be about 14%.]\n\n9f5408e9ee7cb7c61b70eb66af27b182 --> We expect to achieve a 20% growth in our loan portfolio by the end of the fiscal year.", "citations": ["a98a91b95df69173525911bfea063e02", "735c611ae77e760c294087b0b5632504", "444a07529f3db16fd1db499685d8b295", "4e8ca1beb2ad23bf818ed94b4b82fd52", "9f5408e9ee7cb7c61b70eb66af27b182"]}, "['Q1', '2025']": {"answer": "5361e1d8f80c07a39d24e32307332363 --> we will continue to expand our new customer acquisition and are confident that we will be able to maintain around 20% loan book growth in micro banking in FY25.\n\ne62f08a704de1b06cac7b1d7b64d2c9d --> Lastly, our guidance for FY '25, loan book growth around 30% and increase in share of secured loans, deposit growth to be higher than credit growth and reduction in CD ratio, credit cost around 2%, cost-income ratio in the range of 54% to 57%, ROA of more than 2% and ROE of more than 18% for the financial year FY '25.\n\ne27db45cf6e0a78e92891a4ff6c33bc9 --> We expect to achieve a growth of around 15% with JLG.\n\ne27db45cf6e0a78e92891a4ff6c33bc9 --> We should be able to achieve 15% plus growth in JLG and overall 20% growth in micro-banking.\n\n8534ee3685663dc9dc53e27f2a02ece8 --> we're expecting around 20% odd growth in the micro-banking and around 50% growth in the non-micro-banking business, especially the MSME and affordable housing space.\n\n8534ee3685663dc9dc53e27f2a02ece8 --> we do expect that we will be able to grow by 50%. The main reason is that the base, the current base is very small for these businesses.\n\n8534ee3685663dc9dc53e27f2a02ece8 --> Within micro-banking, we expect that JLG will grow around, say, 15% or so.\n\n8534ee3685663dc9dc53e27f2a02ece8 --> So, overall, 20% odd from the micro-banking businesses and 50% from non-micro-banking.\n\n27c11fe1ac2a0e87399315dcf2a677c2 --> We expect to achieve a return on assets of 2% by Q4 2024.\n\nff48e0c20d16808c7e60e5d9152c4792 --> We expect to grow our loan book by 20% in the next fiscal year.\n\nca9d06564ef28d2a52195797049296ac --> we are saying we'll grow by 20%, around 20% this year.\n\nca9d06564ef28d2a52195797049296ac --> JLG growth we are also talking about, 15%-odd for this financial year.", "citations": ["5361e1d8f80c07a39d24e32307332363", "e62f08a704de1b06cac7b1d7b64d2c9d", "e27db45cf6e0a78e92891a4ff6c33bc9", "8534ee3685663dc9dc53e27f2a02ece8", "27c11fe1ac2a0e87399315dcf2a677c2", "ff48e0c20d16808c7e60e5d9152c4792", "ca9d06564ef28d2a52195797049296ac"]}}}, {"topic": "Strategic adjustments for FY24", "data": {"['Q1', '2024']": {"answer": "80be31a135b81163d8670f1c381e5a62 --> Correct but just to clarify it will be around close to Rs.135 Crores only for JLG and then there is some special requirement also. So it should be in there is Rs.150 Crores or so, I mean a few Crores here and there at the end of March 2024.\n\nbb44050b93e951267ae248375759babb --> Govind Singh [Inferred as CEO][9.2% margin that we have seen broadly we will maintain for full year FY2024.]", "citations": ["80be31a135b81163d8670f1c381e5a62", "bb44050b93e951267ae248375759babb"]}, "['Q4', '2024']": {"answer": "301b6698d92e180710cda5b8d2a7bfa5 --> our idea is that FY25 should see some good traction in this and maybe some better yields also because of that.\n\n9c812efbf4acdbc14c9effdc1e678698 --> Our idea is not to grow that book wherever we are there may be around 3%, 4%, 5% growth, not more than that.", "citations": ["301b6698d92e180710cda5b8d2a7bfa5", "9c812efbf4acdbc14c9effdc1e678698"]}, "['Q3', '2024']": {"answer": "321b3edeab2115f41736dae19744ffde --> We are on track to achieve our planned growth of 20% to 22% for FY24 for our micro-banking loan portfolio.\n\n9fcae69d3fb39bb644e67ee5bb62d3d5 --> Our loan book has grown by 31% YOY and 10% quarter-on-quarter. And we are on track for our loan book growth plan of around 30% or so for FY24.\n\n6ad96f4a06317eab16b86b1381e52d4a --> In fact, we expect they will have a formal meeting sometime in the month of February. And based on that, we will move ahead with the process. And that is why I am telling you, this quarter four, we will come with a firm complete plan when we intend to go for this process and when we intend to go for various approvals and other things.", "citations": ["321b3edeab2115f41736dae19744ffde", "9fcae69d3fb39bb644e67ee5bb62d3d5", "6ad96f4a06317eab16b86b1381e52d4a"]}, "['Q2', '2025']": {"answer": "a98a91b95df69173525911bfea063e02 --> While non-micro banking portfolio growth expected to remain largely in line with expectation of around 45% to 50% year-on-year growth, overall, on account of our expectation of largely flat JLG portfolio in FY '25, we expect our loan portfolio growth to remain around 18% to 20% for FY '25 against earlier guidance of around 30%.", "citations": ["a98a91b95df69173525911bfea063e02"]}, "['Q1', '2025']": {"answer": "00b49aac0f34862dc46d72b0cb8787be --> In line with our plans, we have also inched up disbursement yields in MSME lending by around 70 basis points in quarter 1 FY25 and by 20 basis point to 30 basis points in housing and CE/CV as well.\n\n03fd2d9cc9a7d4b7439829b76ee4db0d --> For the valuation, for the swap ratio purpose it will be June quarter for both the entities, the bank and the holding company.", "citations": ["00b49aac0f34862dc46d72b0cb8787be", "03fd2d9cc9a7d4b7439829b76ee4db0d"]}}}, {"topic": "Partnership development", "data": {"['Q3', '2024']": {"answer": "77d4f1fec4be758fcf68053d11d108e5 --> It is expected that during this quarter I mean both the entity Utkarsh Core Invest Limited and bank would be able to firm up the plans. So by the end of this quarter for sure we will have firmed up plans and which will share with the all the relevant stakeholders.", "citations": ["77d4f1fec4be758fcf68053d11d108e5"]}, "['Q1', '2025']": {"answer": "3693afa611ad6d603898d3438f936908 --> We are going to use the June result for the valuation swap ratio. In this quarter, we plan to go to the respective boards for approval of the scheme and are also looking at filing the applications to stock exchanges.", "citations": ["3693afa611ad6d603898d3438f936908"]}}}, {"topic": "Geographic expansion plans", "data": {"['Q1', '2024']": {"answer": "35b50c52ebebd549011f6020c9d972dc --> our idea is in places like Prayagraj, Patna, Varanasi or even we are talking about places like Dehradun and Gorakhpur adding to some of these centre we expect that we should be able to reach maybe around 2% to 3% market", "citations": ["35b50c52ebebd549011f6020c9d972dc"]}, "['Q2', '2025']": {"answer": "3ad607eb39055e7c92b041b3d982df4d --> We are hoping to hear from them on a positive note closure may be early next quarter which will enable us to file the NCLT application, say, somewhere in mid of next quarter Q4 which then if I take six months, we are in line with the time frame that we had thought to see within 12 to 15 months by end of Q2 or early Q3 to get this transition consummated as far as the reverse merging of the holding company into the Bank is concerned.\n\n7fcf15b35fb812e9d478ef2204fc14cd --> You mentioned on the reverse merger timeline of Q2, Q3 by next financial year, FY 26, is that correct? Sarjukumar P. Simaria That is right. For the consummation of the entire reverse merger process.", "citations": ["3ad607eb39055e7c92b041b3d982df4d", "7fcf15b35fb812e9d478ef2204fc14cd"]}}}, {"topic": "Strategic alliances", "data": {}}]}, {"theme": "Operational Efficiency and Cost Management", "topics": [{"topic": "Cost-to-income ratio improvements", "data": {"['Q1', '2024']": {"answer": "4036c2a8b8a5b44e666af41496493bb6 --> Cost income ratio we expect that it will remain in the same trajectory what we had seen in the FY2023.\n\n4036c2a8b8a5b44e666af41496493bb6 --> In terms of ROA and ROE we expect that ROA will certainly be above 2% and ROE will be in the range of around 20% for this next one to two years time.\n\n922771a08a1ce38e4137642d8a5d6322 --> We expect that this will improve from here by maybe another 0.5% or so in the Q2.\n\n8b2d3ef394637597dd52036174442514 --> We expect that this will go up and this may be in the range of 9.4% to 9.5% for sure for this full year.\n\n80be31a135b81163d8670f1c381e5a62 --> If you look at the whole year, we expect that costs would be within say 2% or so and that is what we are confident of.\n\n86597cd6edb04821b1038a1414282f1f --> So for FY2024 we are talking about a credit cost of sub 2%...", "citations": ["4036c2a8b8a5b44e666af41496493bb6", "922771a08a1ce38e4137642d8a5d6322", "8b2d3ef394637597dd52036174442514", "80be31a135b81163d8670f1c381e5a62", "86597cd6edb04821b1038a1414282f1f"]}, "['Q4', '2024']": {"answer": "da6d676404e3b35715f44845e66e9eaf --> On profitability – return on assets of more than 2% and return on equity of more than 18% and cost income ratio in the range of 54% to 57%.\n\nda6d676404e3b35715f44845e66e9eaf --> We have been talking about our cost income ratio to be in the range of 54% to 57%.\n\nda6d676404e3b35715f44845e66e9eaf --> RoE as you know, we said that to be 18% with a larger capital base which we raised through IPO.\n\nb5cf85369ab2ccba1ba538b6d2758ee7 --> from an overall outlook perspective you can say from a OpEx cost metric perspective whether it is OpEx by ATA or cost to income ratio, we would be largely in a range in financial year 25 where we have been financial year 24.\n\n7b67c98723ff651b41180ae22f1c231d --> Puneet Maheshwari [We think cost to income would remain in the range of 54% to 57% for us on an incremental basis and quarter-on-quarter, at times expenses are also like basis the activity level.]\n\nab989d19642d18d5a3e35e8a6c1140b4 --> We expect around 3%-3.5% decline in the CD ratio for next 2-3 years’ time till we say 85% and below and that trajectory for FY25 will continue.\n\n9aa1dd5b35e4e5960b121e7893f75887 --> I think margins NIM will always be above 9%. That is what we have given guidance earlier also and that remains today also. Obviously 9.9 will not be sustainable, but if you look at next year, maybe 9.4 or 9.35 type of margins are certainly there and in medium term, it will always be (+9%). Medium when I say 2-3 years time.\n\nc1b32770472e67b186aa5399ee8cfba3 --> Ratios like ROA of 2% plus and RoE of 18% plus and cost income in the range of 54% to 57% and NIM being above 9% in the medium term.", "citations": ["da6d676404e3b35715f44845e66e9eaf", "b5cf85369ab2ccba1ba538b6d2758ee7", "7b67c98723ff651b41180ae22f1c231d", "ab989d19642d18d5a3e35e8a6c1140b4", "9aa1dd5b35e4e5960b121e7893f75887", "c1b32770472e67b186aa5399ee8cfba3"]}, "['Q3', '2024']": {"answer": "1a9b82a6d8d75f17ca7d56cab249f97b --> there may be increase of around 10 odd basis points in quarter four as far as our overall cost is concerned.", "citations": ["1a9b82a6d8d75f17ca7d56cab249f97b"]}, "['Q2', '2024']": {"answer": "a147fe468636578c308f4c4e8a276c6f --> We expect ROA and ROE to remain at 2% plus and 18% to 20% on sustained basis.\n\nb6daf6f1bafa30c092bca09e9d44d0b3 --> In fact, our this thing is that most likely about 15 to 20 basis points improvement we will see over the next 2 quarters.\n\nb6daf6f1bafa30c092bca09e9d44d0b3 --> And for the year as a whole, we expect around 2%, which is currently around 2.3%. It will come to around 2% overall for this year by improvement in H2.\n\n2de9f6a774271e1d90c9837b8f8f04d9 --> We are expecting about 10 to 20 basis points improvement in the cost ratio as well.", "citations": ["a147fe468636578c308f4c4e8a276c6f", "b6daf6f1bafa30c092bca09e9d44d0b3", "2de9f6a774271e1d90c9837b8f8f04d9"]}, "['Q2', '2025']": {"answer": "ff6f66d9428b33f9cc05362fcf09f9b3 --> We plan to improve our net interest margin by 0.5% in the next quarter.\n\n735c611ae77e760c294087b0b5632504 --> ROA of around 1% and ROE of around 7% for FY '25.\n\n444a07529f3db16fd1db499685d8b295 --> Our goal is to reduce operational costs by 5% over the next two years.\n\n9f5408e9ee7cb7c61b70eb66af27b182 --> We plan to reduce our cost-to-income ratio by 5% within the next year.", "citations": ["ff6f66d9428b33f9cc05362fcf09f9b3", "735c611ae77e760c294087b0b5632504", "444a07529f3db16fd1db499685d8b295", "9f5408e9ee7cb7c61b70eb66af27b182"]}, "['Q1', '2025']": {"answer": "ff48e0c20d16808c7e60e5d9152c4792 --> Our cost-to-income ratio is expected to improve by 5% over the next two years.", "citations": ["ff48e0c20d16808c7e60e5d9152c4792"]}}}, {"topic": "Process optimization efforts", "data": {"['Q2', '2024']": {"answer": "55cb5044cc7669cc932b24ad86ca8a22 --> we expect that it will come at the level of like we were last year; it was 97.5% to 97.8%. We will be improving from this month itself, and by the end of this financial year, we will be in the range of 98.5% or something like that.\n\n2060c17a8fbe6acf1da11e9e903c2b91 --> We do expect around 20-25 basis points increase in the overall yield. If you look at the overall portfolio of Wheels, maybe these 6 months from Quarter 2 to quarter 4, we will see around 20 to 25 basis points up as far as the yield on Wheels is concerned.", "citations": ["55cb5044cc7669cc932b24ad86ca8a22", "2060c17a8fbe6acf1da11e9e903c2b91"]}, "['Q2', '2025']": {"answer": "bf667eebf73cef48024e2c246f635dc1 --> The improvement should start from next quarter only. We don't expect much improvement in this quarter.", "citations": ["bf667eebf73cef48024e2c246f635dc1"]}, "['Q1', '2025']": {"answer": "f4299aa58e080913228bdca4f6ab6bda --> So I think this Q2 we will be able to recover from whatever we have means like we have some SMA 1, SMA 2 increased in Q1. But those are very new ODs. So, we will be able to recover those fast.\n\na93166fabf8a2ddb075422ece6e18b33 --> Govind Singh [Inferred as a member of management] expects a reversal in trend this quarter and improvement from next quarter.", "citations": ["f4299aa58e080913228bdca4f6ab6bda", "a93166fabf8a2ddb075422ece6e18b33"]}}}, {"topic": "Technological integration", "data": {}}, {"topic": "Collection efficiency improvements", "data": {"['Q1', '2024']": {"answer": "6085b76cbf0d4cd76db7e7246c4fd439 --> Puneet Maheshwari [We are seeing about 15% to 20% collection eventually coming over a period of two to three years.]", "citations": ["6085b76cbf0d4cd76db7e7246c4fd439"]}, "['Q4', '2024']": {"answer": "62a8e46ec049e50d46f49de100a4039a --> Collection efficiency improved to 97.6% for Quarter 4 FY24, marginally better than our guidance of 97% to 97.5% for Quarter 4 FY24.\n\nbaa35db56bea0a697b3ff1cecf1496bf --> we expect that maybe around Rs. 6 - Rs. 7 crores on a monthly basis, that is the trajectory we are expecting this year. So, overall, maybe in the range of say Rs. 65 to Rs. 80 crores is what we expect overall write off collections will happen.\n\n2a59d6ef8adc0cd1cf8242c4d6ab1cac --> And as we mentioned earlier also, our trajectory for the collections which were in the range of 97.6% or so, we expect that this will remain here or maybe a little better in FY25.", "citations": ["62a8e46ec049e50d46f49de100a4039a", "baa35db56bea0a697b3ff1cecf1496bf", "2a59d6ef8adc0cd1cf8242c4d6ab1cac"]}, "['Q3', '2024']": {"answer": "320a44c6029fa5da75c29290b20ae17d --> We expect collection efficiency to improve to 97 to 97.5% for Q4 FY24.\n\n12ff58b26abb0f119db39db6e4b7fbf0 --> 100-200 additional people in the collections team certainly will happen but not beyond that.", "citations": ["320a44c6029fa5da75c29290b20ae17d", "12ff58b26abb0f119db39db6e4b7fbf0"]}, "['Q2', '2025']": {"answer": "8d66ce0cd13d28bfcaae91eb0d67d92e --> We are constantly working towards improvement in collection efficiency and asset quality. We have deployed senior field staff on critically identified branches. In addition, we have created a task force to handle collections from 30 plus bucket.", "citations": ["8d66ce0cd13d28bfcaae91eb0d67d92e"]}, "['Q1', '2025']": {"answer": "00b49aac0f34862dc46d72b0cb8787be --> We will be strengthening our collections efforts further to keep credit cost at our guided range of around 2%.\n\n2cc955237c2887e2095eb0ab6a008d44 --> But quarter three and quarter four, we expect a significant improvement in overall JLG and microfinance collections.", "citations": ["00b49aac0f34862dc46d72b0cb8787be", "2cc955237c2887e2095eb0ab6a008d44"]}}}, {"topic": "Branch network optimization", "data": {}}]}, {"theme": "Management and Leadership", "topics": [{"topic": "Leadership vision", "data": {}}, {"topic": "Strategic decision-making", "data": {"['Q1', '2025']": {"answer": "6f390eadfea0e32747d2e0fe4e82adc6 --> This year we have already rolled out increment for salary beginning 1st April 2024.", "citations": ["6f390eadfea0e32747d2e0fe4e82adc6"]}}}, {"topic": "Management team roles and responsibilities", "data": {}}, {"topic": "Corporate governance practices", "data": {}}]}]