[{"theme": "Financial Performance and Guidance", "topics": [{"topic": "Revenue growth outlook", "data": {"['Q3', '2024']": {"answer": "562e102035bc9e29f1de25089dba0563 --> We expect revenue growth of 5% to 7% for the full year 2024.\n\nd86d696471ed740590e4d4125897c0b2 --> We now expect OE sales at the RTX level to grow roughly 10% versus prior year towards the low end of our prior expectation.\n\nd86d696471ed740590e4d4125897c0b2 --> Commercial OE is now expected to be flat for the year, and that's down from our prior expectation of mid-single digit growth.\n\nd86d696471ed740590e4d4125897c0b2 --> We're increasing our full year adjusted sales outlook to between $79.25 billion and $79.75 billion, up from our prior range of $78.75 billion to $79.5 billion.\n\nd86d696471ed740590e4d4125897c0b2 --> We continue to expect approximately 8% to 9% organic sales growth for the full year.\n\nbf17c6349a6e4d130df592593407f919 --> We continue to expect Collins sales to grow high-single digits on both an adjusted and organic basis, though likely at the low end of this range.\n\n10b7b00fc8b40f1da642583cc145d656 --> We now expect Raytheon's operating profit to grow between $200 million and $250 million versus 2023, up from our prior range of between $125 million and $200 million and this includes the impact of the cybersecurity divestiture.\n\n0610e3ec0e2bd4fb9e3c4afe855d05b3 --> We continue to expect sales to grow mid-teens on an adjusted and organic basis, most likely towards the higher end of this range, driven by stronger military volume and the favorable mix in large commercial engines that we've seen so far this year.\n\n4ca2ef387cca462bb17a322cadc331ea --> Looking ahead, we continue to expect Raytheon sales to grow mid-single digits organically for the year...\n\n550e682f822061f53254eff2d27adfaf --> In '24, we remain very confident in the $4.7 billion.\n\n420ce86c590a33f9ab44819d362eb99e --> We've seen $110 million year-over-year improvement, like I said, expect that to be close to $200 million.\n\nc1aca4ff0a9ef94f0ffaa93f0e22cba9 --> You had the '25 framework implied that segment margin just below 20% and had the incremental stepping up a lot next year.\n\ne49c81ef536e51c32c9a4b66dfea94f3 --> Well, I would just say that sometime over the next two years, we're going to make the full amount that we've accrued for at this time.\n\n39865f41a654c275f0842319e1718964 --> Christopher Calio [I mean, obviously, Boeing is going to want to ramp in '25 and beyond.]", "citations": ["562e102035bc9e29f1de25089dba0563", "d86d696471ed740590e4d4125897c0b2", "bf17c6349a6e4d130df592593407f919", "10b7b00fc8b40f1da642583cc145d656", "0610e3ec0e2bd4fb9e3c4afe855d05b3", "4ca2ef387cca462bb17a322cadc331ea", "550e682f822061f53254eff2d27adfaf", "420ce86c590a33f9ab44819d362eb99e", "c1aca4ff0a9ef94f0ffaa93f0e22cba9", "e49c81ef536e51c32c9a4b66dfea94f3", "39865f41a654c275f0842319e1718964"]}, "['Q2', '2024']": {"answer": "5d6a72b6df813faf0fe8b694f45153ba --> We are raising our outlook for adjusted sales and EPS.\n\n686c4043c95f1fd586255b7401a5cdc3 --> We expect this ramp to continue in the second half of the year.\n\n8b83b6ed5632816059f97caa96bec94d --> We are increasing our full year adjusted sales outlook to between $78.75 million and $79.5 billion, up from our prior range of $78 million to $79 billion and we now expect 8% to 9% organic sales growth for the year, up from our prior range of 7% to 8%.\n\n72d20c5a16a0a3b6623fac9325290c3c --> We now expect sales to grow mid-teens on an adjusted organic basis, up from our prior range of low double digits driven by stronger military volume and higher commercial OE, and we continue to see adjusted operating profit growth between $400 million and $475 million versus 2023.\n\naaaff36647bf8f762ac5b384486fcbbc --> Collins sales to grow high single digits on both an adjusted and organic basis.\n\nd48addccc04579991b30902b638d02b6 --> Looking ahead, we now expect Raytheon sales to grow by mid-single digits organically, up from the prior range of low to mid-single digits, driven by improved material flow.\n\n6ffe9d7f0283eee385a6659456e28859 --> Neil Mitchill [On the V2500 on a first half basis, we're at about 369 inductions to-date. So, we had talked about 800 on a full year basis, and we expect that. We still expect that to continue.]\n\n1ee7b482b2ec596e7019c026164817e1 --> Neil Mitchill [There's very little that lingers beyond that. I'd say it's in the $50 million a year kind of range following 2024, so it's manageable.]\n\nf32e27de6268e6352e1f5bc62c4181a8 --> We expect that to obviously ramp up.\n\nf32e27de6268e6352e1f5bc62c4181a8 --> We expect that to turn around in the second half, which is typical for our business.\n\n12e568f6f7fd48997a96a0819cdcf5dc --> Neil Mitchill [We now see solid flat, if you will, organically up mid-single digits at Raytheon.]\n\nafaf3c47595ba2da1ff930b197b4af67 --> We took up our sales 750 at the low end, 500 at the high end. So think about the midpoint, obviously, 625.\n\nafaf3c47595ba2da1ff930b197b4af67 --> At Collins, we also took that guide up a little bit, see high single-digit, I think, 7% to 8% higher end of the range that we were at before.\n\n0fc593e53669cd25f05757f90ee2c82f --> We expect to close that in the fourth quarter as it relates to the actuation business at Collins.\n\n83ca9c611734e3e9d81082699f4768eb --> Chris Calio [We'll start to see this ramp up here in the second half of the year, and it's going to continue to accelerate into 2025 and into 2026.]", "citations": ["5d6a72b6df813faf0fe8b694f45153ba", "686c4043c95f1fd586255b7401a5cdc3", "8b83b6ed5632816059f97caa96bec94d", "72d20c5a16a0a3b6623fac9325290c3c", "aaaff36647bf8f762ac5b384486fcbbc", "d48addccc04579991b30902b638d02b6", "6ffe9d7f0283eee385a6659456e28859", "1ee7b482b2ec596e7019c026164817e1", "f32e27de6268e6352e1f5bc62c4181a8", "12e568f6f7fd48997a96a0819cdcf5dc", "afaf3c47595ba2da1ff930b197b4af67", "0fc593e53669cd25f05757f90ee2c82f", "83ca9c611734e3e9d81082699f4768eb"]}, "['Q1', '2024']": {"answer": "10295979db910b081710369810f2e148 --> In the coming year, we expect to achieve a revenue growth of 5% driven by strong demand in our aerospace segment.\n\na0747c0cd63b2f67d27adb1870c79fe5 --> Looking ahead, on a full-year basis, we continue to expect Collins sales to grow mid to high single-digits on both an adjusted and organic basis with operating profit growth between $650 million and $725 million versus 2023.\n\n777319963478d22ff842ecec35608e69 --> With that, based on our first quarter results and strong backlog, we remain on track to deliver our full year outlook, including full year sales of between $78 billion and $79 billion, which translates to between 7% and 8% organic revenue growth.\n\n2f136d515c58a23ee0defb801f50c32b --> Looking ahead, we continue to expect Raytheon sales to grow low to mid-single-digits organically, with operating profit up between $100 million and $200 million versus 2023.\n\nddff5ff762248caf8f1c2810a47836df --> Turning to Pratt's full year outlook, we continue to expect sales to grow low double digits on an adjusted and organic basis and adjusted operating profit to grow between $400 million and $475 million versus 2023, as large commercial engine aftermarket continues to ramp and military volume grows.\n\n0862058d944042b660d8fab8aa7c0ebb --> We still feel confident though that we'll hit 800 shop visit inductions on the V2500 for the full year.\n\n0862058d944042b660d8fab8aa7c0ebb --> So full year, still expect low teens sort of growth in the aftermarket of Pratt and we're confident that we'll see the material flowing to support that.\n\nc5e7bfa15fda6a7f5747d084a2ce844b --> On the aftermarket side, you're right, we're going to see more of the mid-single-digit type of growth in the next three quarters.\n\n307b1ae675952932f03e60dc8869f2c1 --> The guidance for the year implies a step up 16.6% margins versus a 15.7% adjustment in the quarter.\n\n0609cca8afee8b054dd3090cf3f49141 --> We're expecting $200 million year-over-year and continue to expect $200 million year-over-year.\n\n61459aca5ea49d5775e370bf93034ac3 --> Neil Mitchill [We put out a range of $650 million to $725 million for the full year.]\n\nb08e61ac810f63a03a76ff9e5bcb5fd7 --> We essentially assumed no productivity for the year.\n\na5d338bd490a8b4a78cb3e4905e21886 --> Chris Calio [Yeah, it's in that range that we've provided in that 250, 300. Again, a lot of that will continue to be dependent on the mix of work scopes. We're still believing that it's going to be more of a 90% heavy, 10% lighter shop visit. And with that, we'll stay within that range. If we can find a way to come up with medium work scopes and other things that can alleviate the need for new, we'll call it non-powdered metal, material repair development and the like, perhaps we'll be closer to the lower end of that range, but we're in there today, given the shop visit mix that we see and the material flow that we see.]\n\na5d338bd490a8b4a78cb3e4905e21886 --> Neil Mitchill [On the aftermarket, think about that as low to mid-teens for the rest of the year.]\n\nf7e4874a3427f4d93160af9da4a1bdac --> Neil Mitchill [We still expect a book to bill over 1.1 for this year.]", "citations": ["10295979db910b081710369810f2e148", "a0747c0cd63b2f67d27adb1870c79fe5", "777319963478d22ff842ecec35608e69", "2f136d515c58a23ee0defb801f50c32b", "ddff5ff762248caf8f1c2810a47836df", "0862058d944042b660d8fab8aa7c0ebb", "c5e7bfa15fda6a7f5747d084a2ce844b", "307b1ae675952932f03e60dc8869f2c1", "0609cca8afee8b054dd3090cf3f49141", "61459aca5ea49d5775e370bf93034ac3", "b08e61ac810f63a03a76ff9e5bcb5fd7", "a5d338bd490a8b4a78cb3e4905e21886", "f7e4874a3427f4d93160af9da4a1bdac"]}, "['Q4', '2023']": {"answer": "fc3e8cd55d8ddfe394995646890c596a --> In 2024, we expect to see revenue growth in the range of 5% to 7% driven by our defense segment.\n\nc72d3a783fe8331d2e4f58d67fd18c77 --> The strong recovery has helped drive significant aftermarket demand for both wide-body and narrow-body aircraft, with growth expected to continue into 2024.\n\n34ffa17ec1136bf948daa33b8032b240 --> We expect sales to grow low to mid-single-digits versus 2023, as we deliver our backlog and continue to see supply chain improvement.\n\n949b61898ea2dfdaf0470df56b0e92a4 --> First, with respect to the Raytheon cybersecurity business, we have assumed that this transaction will close here in the first quarter. Therefore, on a reported basis, we will see about a $1.3 billion year-over-year reduction in reported sales, and about an $80 million year-over-year headwind to operating profit.\n\n9879a9e70ecd584200a2efb8ebdcf6fd --> Neil Mitchill [CFO] [Specific to the commercial OE side, with increasing commercial production rates, we expect commercial OE revenue will be up between about 10% and 15% in 2024.]\n\n9879a9e70ecd584200a2efb8ebdcf6fd --> Neil Mitchill [CFO] [Now, with respect to commercial aftermarket, we currently expect sales to be up over 10% in ‘24, and that's on top of the 23% growth we saw in ‘23.]\n\n9863658866c8d0b22c02a070c4fc5a3b --> We expect full-year 2024 sales of between $78 billion and $79 billion, which translates to organic growth of between 7% and 8% year-over-year.\n\nf92a3580406e0910853882bed901e337 --> Collins we expect full-year sales to be up mid to high-single-digits on both an adjusted and organic basis.\n\nf92a3580406e0910853882bed901e337 --> Collins adjusted operating profit, we expected to grow between $650 million and $725 million versus last year.\n\nf92a3580406e0910853882bed901e337 --> Pratt & Whitney, we expect full-year sales to be up low-double-digits on an adjusted and organic basis versus prior year.\n\n7d1233b6030865457789606f93984d8b --> We now expect the 2020 to 2025 annual growth rate for adjusted sales to be between 3% and 3.5%.\n\n7d1233b6030865457789606f93984d8b --> We now see Raytheon's 2020 to 2025 annual growth rate to be between 1% and 2.5%.\n\n7d1233b6030865457789606f93984d8b --> We now see the RTX level adjusted sales annual growth rate from 2020 through 2025 to be between 5.5% and 6% on an organic basis.\n\n5c32c21592ee785beec6a4ef0c654286 --> Adjusted operating profit at Raytheon is expected to be up between $100 million and $200 million versus prior year driven by drop through on higher volume and improvement in productivity, which will be partially offset by mix headwinds.\n\n5c32c21592ee785beec6a4ef0c654286 --> Higher intercompany activity will increase sales eliminations by about 10% year-over-year.\n\n5c32c21592ee785beec6a4ef0c654286 --> We continue to expect Collins and Pratt to be within the sales and operating profit 2020 to 2025 growth targets we discussed last year at our Investor Day.\n\ned338e8a31ece267cd020ace327ccaf3 --> As we look from ‘23 of $5.5 billion, that $2 billion increase is going to come principally from, you know, what I would call operational growth, about $4.8 billion, $2.9 billion of which is going to come from the pre-tax segment operating profit, and you pointed out that, that will be lower than our prior guide, and that's around the midpoint.\n\n3bb35f7e7f8a6c2cc1375deebc1fe203 --> We will, got a handful here that we're still going to be powering through in 2024 and see that horizon getting better in the next 12 to 18 months as we go through certain milestones, Peter and satisfy some contractual requirements.\n\n651a9d86bc79964ce257e76e6cb163eb --> Overall sales of Pratt being up in the low-double-digit range, $400 million to $475 million of operating profit.\n\n651a9d86bc79964ce257e76e6cb163eb --> The aftermarket sales are going to be up sort of low-teens.\n\n651a9d86bc79964ce257e76e6cb163eb --> On the OE side, we think the sales are going to be up in the mid-teens range.\n\n651a9d86bc79964ce257e76e6cb163eb --> We'll see about a headwind of maybe $125 million associated with that higher volume.\n\n30ad4194e19ee589f4977a6e038082ce --> But the MRO will be a ramp throughout the year. I think ultimately we'll get to roughly the same place that we had assumed we would had we started in Q2, but it'll be a ramp throughout the year. And all of that's been factored into our outlook.\n\n438f630394a3d6b80d02156844a84e41 --> As we look to ‘24, our assumption is that our absolute value of productivity is zero. So we'll see about a $200 million improvement year-over-year.\n\n438f630394a3d6b80d02156844a84e41 --> We'll see about $100 million at the midpoint from volume and a little bit of headwind as the lower margins roll through the backlog in ‘24.\n\n438f630394a3d6b80d02156844a84e41 --> And as you kind of look into ‘25, our productivity assumption is about $100 million step up.\n\ndd039ce5efb186bde2665cb4bc99da56 --> To your question about Airbus, I think Neil said it before, up about 20% year-over-year here in ‘24.", "citations": ["fc3e8cd55d8ddfe394995646890c596a", "c72d3a783fe8331d2e4f58d67fd18c77", "34ffa17ec1136bf948daa33b8032b240", "949b61898ea2dfdaf0470df56b0e92a4", "9879a9e70ecd584200a2efb8ebdcf6fd", "9863658866c8d0b22c02a070c4fc5a3b", "f92a3580406e0910853882bed901e337", "7d1233b6030865457789606f93984d8b", "5c32c21592ee785beec6a4ef0c654286", "ed338e8a31ece267cd020ace327ccaf3", "3bb35f7e7f8a6c2cc1375deebc1fe203", "651a9d86bc79964ce257e76e6cb163eb", "30ad4194e19ee589f4977a6e038082ce", "438f630394a3d6b80d02156844a84e41", "dd039ce5efb186bde2665cb4bc99da56"]}}}, {"topic": "Earnings per share projections", "data": {"['Q3', '2024']": {"answer": "562e102035bc9e29f1de25089dba0563 --> We anticipate a gross margin improvement of 200 basis points by mid-2025.\n\n853ce6ab573737f285a7693f1051d5b3 --> We are also increasing our adjusted EPS outlook by $0.15 on the low end and $0.13 on the high end, putting the new range at $5.50 to $5.58, up from $5.35 to $5.45.\n\nbf17c6349a6e4d130df592593407f919 --> We are updating the outlook for operating profit to grow between $575 million and $650 million versus 2023 compared to our prior range of between $650 million and $725 million, as we incorporate the impact of the lower OE volume and associated absorption and disruption impacts.\n\n0610e3ec0e2bd4fb9e3c4afe855d05b3 --> We are updating the outlook for adjusted operating profit to grow between $475 million and $525 million versus 2023, up from our prior range of between $400 million and $475 million.\n\nf3b2ea855d66376da8a6175194466232 --> So as we look from Q3 to Q4, we see about 130 basis points at the midpoint of our outlook margin uptick.", "citations": ["562e102035bc9e29f1de25089dba0563", "853ce6ab573737f285a7693f1051d5b3", "bf17c6349a6e4d130df592593407f919", "0610e3ec0e2bd4fb9e3c4afe855d05b3", "f3b2ea855d66376da8a6175194466232"]}, "['Q2', '2024']": {"answer": "8b83b6ed5632816059f97caa96bec94d --> We are also increasing our adjusted EPS outlook by $0.10 on the low end and $0.05 on the high end, putting the new range at $5.35 to $5.45, up from $5.25 to $5.40.\n\naaaff36647bf8f762ac5b384486fcbbc --> Operating profit growth between $650 million and $725 million versus 2023.\n\nd48addccc04579991b30902b638d02b6 --> As a result, we now expect Raytheon's operating profit to grow between $125 million and $200 million versus 2023, up from the prior range of between $100 million and $200 million, and this includes the impact from the cybersecurity divestiture.\n\nf20a7321c78d1ac1c62d2f1dbe2f491b --> there's really just a few changes that we've made to our '24 outlook. The first is about $1 billion related to the legal matters. We sold about a $0.5 billion related to the contract matter that Chris just was talking about. And offsetting that is about a $0.5 billion of improvement that we've seen operationally in our tax payments due to some planning that we've done.\n\nf20a7321c78d1ac1c62d2f1dbe2f491b --> you're going to do about $7.2 billion of net income this year on an adjusted basis, and generate $4.7 billion of cash.", "citations": ["8b83b6ed5632816059f97caa96bec94d", "aaaff36647bf8f762ac5b384486fcbbc", "d48addccc04579991b30902b638d02b6", "f20a7321c78d1ac1c62d2f1dbe2f491b"]}, "['Q1', '2024']": {"answer": "777319963478d22ff842ecec35608e69 --> In addition, we continue to see adjusted earnings per share between $5.25 and $5.40 and free cashflow of approximately $5.7 billion.\n\n2f136d515c58a23ee0defb801f50c32b --> As a reminder, the profit outlook includes an $80 million year-over-year headwind from the sale of the cybersecurity business.", "citations": ["777319963478d22ff842ecec35608e69", "2f136d515c58a23ee0defb801f50c32b"]}, "['Q4', '2023']": {"answer": "34ffa17ec1136bf948daa33b8032b240 --> We expect Pratt's adjusted operating profit to grow between $400 million and $475 million versus last year primarily on commercial aftermarket drop through and military growth, which will be partially offset by higher large commercial OE deliveries.\n\n9863658866c8d0b22c02a070c4fc5a3b --> We expect adjusted EPS of between $5.25 and $5.40, and that's up 4% to 7% year-over-year.\n\n9863658866c8d0b22c02a070c4fc5a3b --> Operating profit growth of about 16% is expected to result in approximately $0.72 of EPS growth at the midpoint of our outlook range.\n\nf92a3580406e0910853882bed901e337 --> Our tax rate in ‘24 is expected to be approximately 19.5% versus the 18.5% in 2023.\n\nf92a3580406e0910853882bed901e337 --> Our outlook range 5.25 to 5.40 per share.\n\n7d1233b6030865457789606f93984d8b --> We now see overall RTX adjusted margin expansion to be between 500 and 550 basis points between 2020 and 2025.\n\ned338e8a31ece267cd020ace327ccaf3 --> And then we'll have about a half of the, I'm sorry, $400 million of CapEx between ‘23 and ‘25, so that'll be a headwind.\n\ned338e8a31ece267cd020ace327ccaf3 --> The first is we've got about $1 billion net of tax lower operating profit baked into this long-term guide. But that's been offset by about $700 million of improvement in taxes, most notably on the back of improvements in our R&D position, as well as a $200 million based on the assumptions we see today with respect to our pension outlays.", "citations": ["34ffa17ec1136bf948daa33b8032b240", "9863658866c8d0b22c02a070c4fc5a3b", "f92a3580406e0910853882bed901e337", "7d1233b6030865457789606f93984d8b", "ed338e8a31ece267cd020ace327ccaf3"]}}}, {"topic": "Shareholder returns", "data": {"['Q3', '2024']": {"answer": "562e102035bc9e29f1de25089dba0563 --> Our dividend payout ratio will remain stable at approximately 40%.\n\n12873326928d0bac1dbe362b16b6ac2a --> We've now returned over $32 billion of capital to shareowners since the merger, putting us well on track to deliver on our commitment of $36 billion to $37 billion by the end of next year.", "citations": ["562e102035bc9e29f1de25089dba0563", "12873326928d0bac1dbe362b16b6ac2a"]}, "['Q2', '2024']": {"answer": "5d6a72b6df813faf0fe8b694f45153ba --> We raised our dividend 7% and remain on track to return $36 billion to $37 billion of capital to share owners from the merger through the end of next year.", "citations": ["5d6a72b6df813faf0fe8b694f45153ba"]}, "['Q1', '2024']": {"answer": "163686c055ce249ec98b2ba8c4f64cb1 --> And as we do this, we remain on track to return $36 billion to $37 billion of capital to shareowners from the date of the merger through next year.", "citations": ["163686c055ce249ec98b2ba8c4f64cb1"]}}}, {"topic": "Cash flow expectations", "data": {"['Q3', '2024']": {"answer": "562e102035bc9e29f1de25089dba0563 --> Capital expenditures are projected to be around $1.5 billion for the next fiscal year.\n\n853ce6ab573737f285a7693f1051d5b3 --> On free cash flow, we remain on track to achieve our outlook of approximately $4.7 billion.\n\n853ce6ab573737f285a7693f1051d5b3 --> For the year, we now expect powder metal outflows to be about $1 billion down $250 million from our prior expectation.\n\n550e682f822061f53254eff2d27adfaf --> We're still counting on some significant working capital benefit this year, about $700 million year-over-year.\n\n550e682f822061f53254eff2d27adfaf --> I see no reason why the business here won't generate 90% to 100% free cash flow conversion against adjusted net income.\n\n03ed253458e396e723810fd8e229ab68 --> I expect the margins to grow at Collins. We expect good operating profit growth next year, and we expect that to convert to free cash flow growth as well.\n\n7a2ae04b8dc60bd50b28c6c8e63e48f7 --> Neil Mitchill [We do expect to make about $1 billion worth of payments this year.]", "citations": ["562e102035bc9e29f1de25089dba0563", "853ce6ab573737f285a7693f1051d5b3", "550e682f822061f53254eff2d27adfaf", "03ed253458e396e723810fd8e229ab68", "7a2ae04b8dc60bd50b28c6c8e63e48f7"]}, "['Q2', '2024']": {"answer": "5d6a72b6df813faf0fe8b694f45153ba --> We've also revised our cash outlook for the year.\n\n5076421faef5476bef2a1a1482a79239 --> We have updated our free cash flow outlook to be approximately $4.7 billion compared to our previous expectation of approximately $5.7 billion.\n\n7c1795776857ad4817341f175af55aab --> We expect to pay about $1 billion related to these matters this year and have incorporated that into our updated free cash flow outlook for the year.\n\nf20a7321c78d1ac1c62d2f1dbe2f491b --> And I would expect that that mostly sits in the fourth quarter of this year. It'll depend on when we get the final resolutions with the government agencies, but that's trending towards certainly late September, or early in the fourth quarter.\n\n8138530f0d650fbfd2a10676a1b7bf85 --> Chris Calio [Still feel like the 2025 cash goal here is achievable based on everything we see today, both within our four walls and the macro environment.]\n\nf32e27de6268e6352e1f5bc62c4181a8 --> I would expect third and fourth quarter kind of be split pretty evenly, with respect to the rest of the payments this year.", "citations": ["5d6a72b6df813faf0fe8b694f45153ba", "5076421faef5476bef2a1a1482a79239", "7c1795776857ad4817341f175af55aab", "f20a7321c78d1ac1c62d2f1dbe2f491b", "8138530f0d650fbfd2a10676a1b7bf85", "f32e27de6268e6352e1f5bc62c4181a8"]}, "['Q1', '2024']": {"answer": "10295979db910b081710369810f2e148 --> We anticipate capital expenditures to be approximately $1 billion for the fiscal year 2024.", "citations": ["10295979db910b081710369810f2e148"]}, "['Q4', '2023']": {"answer": "fc3e8cd55d8ddfe394995646890c596a --> Our capital expenditures for the next fiscal year are projected to be approximately $1.5 billion.\n\n729c5fb6f48f4ed611e86f0369f84da0 --> We're beginning the process of deleveraging this year to ensure we maintain a strong balance sheet, which will be in part supported by the closure of our previously announced divestitures.\n\n9863658866c8d0b22c02a070c4fc5a3b --> We expect to generate free cash flow of about $5.7 billion for the year.\n\n7d1233b6030865457789606f93984d8b --> There is no change to our RTX 2025 free cash flow target of $7.5 billion.\n\n1107f556523a358f246805e39134c532 --> We moved about half of that into 2024, that's the $1.3 billion that you're seeing. Still holding a $1.5 billion in our ‘25 outlook. And then we see the rest spilling into early 2026.\n\ned338e8a31ece267cd020ace327ccaf3 --> Let me start, let me maybe start to frame the answer to that question with a little bit of an updated walk between ‘23 and ‘25 on free cash flow to get to the $7.5 billion.\n\ned338e8a31ece267cd020ace327ccaf3 --> The remaining growth is going to come from working capital improvement, about $2.2 billion, about half of which we will deal with here in ‘24 as we look to hold our inventory flat.\n\n436932efa0d7d8a81d32f4abedc7fa86 --> Neil Mitchill [CFO][And as you think about from ‘23 to ‘24, inventory is going to essentially, our plan is to stay flat, that will be about 80% of what generates that year-over-year working capital benefit in ‘24.]\n\n436932efa0d7d8a81d32f4abedc7fa86 --> Neil Mitchill [CFO][And then as you look to ‘25, you know, we'll see continued improvement in inventory, as well as the benefit of customer advances.]\n\n436932efa0d7d8a81d32f4abedc7fa86 --> Neil Mitchill [CFO][So we've realized a lot of customer advances over the last couple of years. They will burn down. And then as we see these international orders come back in, you'll see that pick up in the year ‘25.]", "citations": ["fc3e8cd55d8ddfe394995646890c596a", "729c5fb6f48f4ed611e86f0369f84da0", "9863658866c8d0b22c02a070c4fc5a3b", "7d1233b6030865457789606f93984d8b", "1107f556523a358f246805e39134c532", "ed338e8a31ece267cd020ace327ccaf3", "436932efa0d7d8a81d32f4abedc7fa86"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "Advanced technology initiatives", "data": {"['Q2', '2024']": {"answer": "d83e6778937fd8558acf38eb1d5baeba --> This year, we are adding an additional 30-plus use cases that generate incremental productivity and cost savings across RTX using advances in artificial intelligence and deep learning.", "citations": ["d83e6778937fd8558acf38eb1d5baeba"]}}}, {"topic": "New product pipeline", "data": {"['Q3', '2024']": {"answer": "562e102035bc9e29f1de25089dba0563 --> We plan to launch three new products by the end of 2025.\n\n74f4d187f6467f2f2dabe722dddcf4a2 --> I would say, you're going to really start to turn the corner on the insertion of powdered metal parts as we head into 2025.", "citations": ["562e102035bc9e29f1de25089dba0563", "74f4d187f6467f2f2dabe722dddcf4a2"]}, "['Q1', '2024']": {"answer": "6600d31879a756a14d038fbcf3d6b86c --> With regard to new engine production, as we said in our last call, all GTF engines being delivered to our customers' final assembly lines have full-life HPC and HPT disks.\n\na7dbb2de2fdd203c0fa9519272fb6600 --> The fixed price development programs that have been a challenge in Raytheon Defense are expected to move out of development in about 12 to 18 months.", "citations": ["6600d31879a756a14d038fbcf3d6b86c", "a7dbb2de2fdd203c0fa9519272fb6600"]}}}, {"topic": "R&D investment focus", "data": {"['Q3', '2024']": {"answer": "562e102035bc9e29f1de25089dba0563 --> We are targeting a 10% increase in our R&D investment over the next two years.", "citations": ["562e102035bc9e29f1de25089dba0563"]}, "['Q2', '2024']": {"answer": "68bd280d5bc6d1371b3216cb4ac18a50 --> This year alone, we will spend over $7.5 billion on company and customer-funded research and development.", "citations": ["68bd280d5bc6d1371b3216cb4ac18a50"]}, "['Q1', '2024']": {"answer": "45541d66882e2fcc8de31c0f5b32de71 --> This year, we will invest about $3 billion in company funded R&D along with $5 billion in customer funded R&D to develop new technologies and products.", "citations": ["45541d66882e2fcc8de31c0f5b32de71"]}}}, {"topic": "Sustainable product solutions", "data": {"['Q4', '2023']": {"answer": "a124fd80df805ad48e4a8846749ecd8b --> Today, all OE GTF engines being delivered to our customers final assembly lines contain disks produced from powdered metal manufactured after Q3 2021 and have full certified lives.", "citations": ["a124fd80df805ad48e4a8846749ecd8b"]}}}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Supply chain resilience", "data": {"['Q3', '2024']": {"answer": "d735c709e8fff0400311f766c4082197 --> suppliers can leverage to reduce lead times and cost, and currently have 45 suppliers utilizing these agreements to plan to add 15 more by year-end.\n\ndc8908ef15a9a7a26cecb86fedc7f453 --> We've got to continue to drive production of key part families. So think isothermal forgings, they continue to ramp up 38% year-over-year.\n\nfd594804b83ae35899fc4f6543bbf860 --> We are on track to connect 40 factories by the end of the year.\n\nebe6189d9c4c44641bfb2efbe17abed9 --> We do expect to resume some shipments later in the quarter.\n\n74f4d187f6467f2f2dabe722dddcf4a2 --> As we continue to ramp up the isothermal forging, as I said, 38% up year-over-year, and we're putting in place continued capacity in all pieces of that value stream to continue to ramp in 2025.\n\n74f4d187f6467f2f2dabe722dddcf4a2 --> We've got to continue to get the material flow going again, try to get to a point in 2025 where that balance has to become less pronounced.", "citations": ["d735c709e8fff0400311f766c4082197", "dc8908ef15a9a7a26cecb86fedc7f453", "fd594804b83ae35899fc4f6543bbf860", "ebe6189d9c4c44641bfb2efbe17abed9", "74f4d187f6467f2f2dabe722dddcf4a2"]}, "['Q2', '2024']": {"answer": "68bd280d5bc6d1371b3216cb4ac18a50 --> Once complete, it will add 70,000 square feet of manufacturing footprint to meet rapidly growing demand for our Collins brake solutions.\n\n68bd280d5bc6d1371b3216cb4ac18a50 --> We remain on track to connect 40 factories by the end of the year.", "citations": ["68bd280d5bc6d1371b3216cb4ac18a50"]}, "['Q1', '2024']": {"answer": "45541d66882e2fcc8de31c0f5b32de71 --> Last year, we connected 20 factories and have another 20 planned to be completed by the end of this year.\n\n9dd666bd23a8927f156c85c17030cfad --> Manufacturing capacity in key areas to meet customer demand, a key priority within our $2.5 billion of capital investment in 2024.\n\n9dd666bd23a8927f156c85c17030cfad --> When complete, the factory's capacity for integrating and delivering several of our critical munitions programs will increase by more than 50%.\n\n811eb368582149650cd1f5212e275b77 --> Chris Calio [Big step up this year in GTF shop visits.]\n\n811eb368582149650cd1f5212e275b77 --> Chris Calio [We've got a big ramp on GTF MRO throughout the year in order to support this fleet.]", "citations": ["45541d66882e2fcc8de31c0f5b32de71", "9dd666bd23a8927f156c85c17030cfad", "811eb368582149650cd1f5212e275b77"]}, "['Q4', '2023']": {"answer": "a124fd80df805ad48e4a8846749ecd8b --> On the GTF MRO front, we have begun installing full life disks during certain shop visits. And the number of engines receiving full life disks in MRO will increase throughout the year as we continue to ramp up production of these parts.\n\n688983542a52e6e134243165adce7545 --> We continue to drive improved supply chain performance and material flow. Overall, our material receipts were up 8% in 2023. And we need to continue on that trajectory here in 2024.", "citations": ["a124fd80df805ad48e4a8846749ecd8b", "688983542a52e6e134243165adce7545"]}}}, {"topic": "Cost-reduction measures", "data": {"['Q3', '2024']": {"answer": "a955af498534c3bb1824402074059883 --> So far this year, we've eliminated over 265 systems to streamline our engineering, supply chain and manufacturing processes.\n\na955af498534c3bb1824402074059883 --> Collins is on track to reduce their engineering systems by 20% this year.\n\n562e102035bc9e29f1de25089dba0563 --> We aim to reduce operational costs by 3% annually.\n\nd735c709e8fff0400311f766c4082197 --> We expect to realize a 10% to 15% cost savings on these alloys utilizing this approach.\n\nd75d8d7d72dafd77c945e60bdcb8f332 --> We've already seen about $110 million of productivity benefit year-over-year. So I think really good traction. We had talked about -- seeing about 200 on a full year basis. And I think, we're largely on track to do that.", "citations": ["a955af498534c3bb1824402074059883", "562e102035bc9e29f1de25089dba0563", "d735c709e8fff0400311f766c4082197", "d75d8d7d72dafd77c945e60bdcb8f332"]}, "['Q1', '2024']": {"answer": "b0a75bf87f3daa5d4f5f5f7f767c8749 --> Collins is in the process of shifting 2.7 million manufacturing hours to best cost locations by the end of 2025.\n\n631c310e7e23b31d263db4866f4e86f1 --> Chris Calio [our productivity plan for the year is effectively no productivity]", "citations": ["b0a75bf87f3daa5d4f5f5f7f767c8749", "631c310e7e23b31d263db4866f4e86f1"]}, "['Q4', '2023']": {"answer": "fc3e8cd55d8ddfe394995646890c596a --> We aim to achieve a 10% reduction in operational costs by the end of 2025.", "citations": ["fc3e8cd55d8ddfe394995646890c596a"]}}}, {"topic": "Process automation", "data": {"['Q1', '2024']": {"answer": "10295979db910b081710369810f2e148 --> We are planning to open two new manufacturing facilities by the end of 2025 to increase our production capacity.\n\n6600d31879a756a14d038fbcf3d6b86c --> And as we previously said, we expect to progressively ramp this effort throughout the year.\n\nf3f3e7749d63b94b1efdab6496724c51 --> strong start to the quarter but we've got a big plan for the year and we're focused on turnaround times and new material.", "citations": ["10295979db910b081710369810f2e148", "6600d31879a756a14d038fbcf3d6b86c", "f3f3e7749d63b94b1efdab6496724c51"]}, "['Q4', '2023']": {"answer": "80857030c6880a7dbb11c62778c31a78 --> On the MRO side, what we said was we were going to start the incorporation in Q2 of this year. We actually started that a little bit earlier.\n\n80857030c6880a7dbb11c62778c31a78 --> We're going to ramp throughout the year where we don't incorporate the full life parts into MRO.", "citations": ["80857030c6880a7dbb11c62778c31a78"]}}}, {"topic": "Lean manufacturing processes", "data": {"['Q1', '2024']": {"answer": "6600d31879a756a14d038fbcf3d6b86c --> With regard to overhauled turnaround time, our average wing-to-wing turnaround time assumptions remain consistent with our prior guidance of roughly 250 to 300 days.", "citations": ["6600d31879a756a14d038fbcf3d6b86c"]}}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "International market penetration", "data": {"['Q1', '2024']": {"answer": "23e46456403a0f8280bb74bd2e3ecbbb --> we're expecting a tailwind from mix as we increase the international backlog. About 60% of Raytheon's Q1 bookings were international, and so that's provided us a nice tailwind, and we expect that to continue.", "citations": ["23e46456403a0f8280bb74bd2e3ecbbb"]}}}, {"topic": "Strategic alliances and partnerships", "data": {"['Q4', '2023']": {"answer": "fc3e8cd55d8ddfe394995646890c596a --> We are planning to expand our workforce by 2,000 employees over the next two years.", "citations": ["fc3e8cd55d8ddfe394995646890c596a"]}}}, {"topic": "Competitive positioning", "data": {}}, {"topic": "Emerging market entry", "data": {}}]}, {"theme": "Customer Engagement", "topics": [{"topic": "Customer satisfaction metrics"}, {"topic": "Service contract renewals"}, {"topic": "Feedback-driven product enhancements"}, {"topic": "Brand loyalty initiatives"}]}, {"theme": "Defense and Aerospace Operations", "topics": [{"topic": "Military contract updates", "data": {"['Q2', '2024']": {"answer": "afaf3c47595ba2da1ff930b197b4af67 --> About $400 million of that, 80% is in the military business.", "citations": ["afaf3c47595ba2da1ff930b197b4af67"]}, "['Q1', '2024']": {"answer": "9dd666bd23a8927f156c85c17030cfad --> We expect both the first domestic LRIP and international FMS contracts this year.\n\n13ca365d54cc64c1941ded1e41f93aca --> So, when we look at our product portfolio against those big buckets, we look at Ukraine and say about two-thirds of that is addressable with RTX products. Think GEM-T, NASAMS, Patriot, AMRAAM, AIM9X, Israel, we kind of handicapped that as about 30% addressable, stockpile replenishment, Iron Dome, David's Sling procurements, and then INDOPACOM, again, roughly that 30% addressable with the RTX product suite, namely SM-6, Tomahawk, AIM9X.", "citations": ["9dd666bd23a8927f156c85c17030cfad", "13ca365d54cc64c1941ded1e41f93aca"]}, "['Q4', '2023']": {"answer": "f92a3580406e0910853882bed901e337 --> Military sales at Collins are expected to be up low to mid-single-digits for the year.\n\nf92a3580406e0910853882bed901e337 --> Military sales at Pratt are expected to be up mid-single-digits driven by higher F-135 sustainment volume as heavy overhauls continue to ramp.\n\n651a9d86bc79964ce257e76e6cb163eb --> Military will be up in the mid-single-digit range, 5% growth on the top line.", "citations": ["f92a3580406e0910853882bed901e337", "651a9d86bc79964ce257e76e6cb163eb"]}}}, {"topic": "Commercial aviation recovery", "data": {"['Q1', '2024']": {"answer": "6600d31879a756a14d038fbcf3d6b86c --> We continue to expect an average of roughly 350 AOGs from 2024 through 2026.", "citations": ["6600d31879a756a14d038fbcf3d6b86c"]}}}, {"topic": "Supply chain challenges", "data": {}}, {"topic": "Production rate adjustments", "data": {"['Q2', '2024']": {"answer": "68bd280d5bc6d1371b3216cb4ac18a50 --> On the defense side, we're investing in test equipment and tooling to more than double production capacity by year-end in our Coyote program.\n\n1225511ec836cd9c1072cd3e5c013b70 --> But suffice it to say, it's going to be a continued ramp back half of this year, '25 and '26 on powdered metal production and insertion and MRO.", "citations": ["68bd280d5bc6d1371b3216cb4ac18a50", "1225511ec836cd9c1072cd3e5c013b70"]}, "['Q4', '2023']": {"answer": "46e07a5177387f30d12994c5e584fa49 --> With respect to the number of AOGs, we continue to expect the roughly 350 on average that we previously guided.", "citations": ["46e07a5177387f30d12994c5e584fa49"]}}}]}, {"theme": "Regulatory and Compliance Matters", "topics": [{"topic": "Compliance updates", "data": {"['Q4', '2023']": {"answer": "729c5fb6f48f4ed611e86f0369f84da0 --> The FAA is in the process of drafting the corresponding airworthiness directives, which we expect to be issued within the next month or so.", "citations": ["729c5fb6f48f4ed611e86f0369f84da0"]}}}, {"topic": "Sustainability initiatives", "data": {}}, {"topic": "Environmental footprint management", "data": {}}, {"topic": "Legal and regulatory matters", "data": {}}]}, {"theme": "Strategic Initiatives and Integration", "topics": [{"topic": "Merger integration progress", "data": {"['Q4', '2023']": {"answer": "9879a9e70ecd584200a2efb8ebdcf6fd --> Neil Mitchill [CFO] [In 2023, we achieved $295 million of incremental RTX merger cost synergies, keeping us on track to achieve our $2 billion in gross cost synergy goal by the end of 2025.]", "citations": ["9879a9e70ecd584200a2efb8ebdcf6fd"]}}}, {"topic": "Portfolio realignment strategies", "data": {"['Q3', '2024']": {"answer": "11f6fb354a3addcecbbfcd9a1ba77217 --> We expect the sale of the Collins hoist and winch business to close here in the fourth quarter and the actuation business mid-next year.\n\na96d32e86aa20fc7330994f61088172a --> We're undergoing a portfolio evaluation across the board, as we always do, to determine what parts of the business while might be strong historically. Aren't necessarily going to be a part of the business going forward, that's ongoing. We do that every year around this time of year and we'll make some of those decisions as we head into 2025.", "citations": ["11f6fb354a3addcecbbfcd9a1ba77217", "a96d32e86aa20fc7330994f61088172a"]}}}, {"topic": "Innovation and R&D focus", "data": {}}, {"topic": "Long-term investment plans", "data": {"['Q2', '2024']": {"answer": "5d6a72b6df813faf0fe8b694f45153ba --> Announced a $200 million investment in our carbon break facility in Spokane, Washington.\n\n768a1456a3583531d18c54bcf309e91e --> Inferred as a senior executive, possibly CEO or CFO", "citations": ["5d6a72b6df813faf0fe8b694f45153ba", "768a1456a3583531d18c54bcf309e91e"]}, "['Q1', '2024']": {"answer": "9dd666bd23a8927f156c85c17030cfad --> Announcing $115 million expansion of our Raytheon Redstone Missile Integration Facility in Huntsville, Alabama.\n\n6d05b19f9d3dbf36a8261288c9d28bc2 --> I told you this was going to be a three-year process.\n\n6d05b19f9d3dbf36a8261288c9d28bc2 --> It was going to be a ramp throughout the year into ‘25 on insertion of those full life parts into MRO.", "citations": ["9dd666bd23a8927f156c85c17030cfad", "6d05b19f9d3dbf36a8261288c9d28bc2"]}, "['Q4', '2023']": {"answer": "7d1233b6030865457789606f93984d8b --> We are continuing to drive structural cost reduction and working capital improvements as we invest in the business and deliver on our commitment to return $36 billion to $37 billion of capital to share owners with the date of the merger through ‘25.", "citations": ["7d1233b6030865457789606f93984d8b"]}}}]}, {"theme": "Risk Management and Compliance", "topics": [{"topic": "Forward-looking statement risks"}, {"topic": "Internal investigation initiatives"}, {"topic": "Cybersecurity measures"}, {"topic": "Geopolitical risk analysis"}]}, {"theme": "Technological Advancements and Innovation", "topics": [{"topic": "Digital technology integration"}, {"topic": "Missile defense advancements"}, {"topic": "Automation in production"}, {"topic": "Hypersonics and propulsion systems"}]}]