[{"theme": "Revenue Growth and Financial Performance", "topics": [{"topic": "Net interest margin trends", "data": {"['Q3', '2024']": {"answer": "a8f581c25af5e61d8941ca3b2871ba28 --> And the deposit repricing that needs to happen in a quarter or so should be done...\n\n21fa088c71eaaab06ff378a4244cbd34 --> We do envisage that the deposit rate of growth should outpace the loan rate of growth.\n\n21fa088c71eaaab06ff378a4244cbd34 --> The deposit rate of growth should be at least 300, 400 basis points higher than the loan growth, only then the economics will work better.", "citations": ["a8f581c25af5e61d8941ca3b2871ba28", "21fa088c71eaaab06ff378a4244cbd34"]}, "['Q1', '2024']": {"answer": "1092c578aef0d7e72bb64e095dc1fb91 --> We're looking at 1.9 to 2.1. That's the range at which we'll oscillate.", "citations": ["1092c578aef0d7e72bb64e095dc1fb91"]}, "['Q2', '2025']": {"answer": "b80727df56b0dc6436a3332067244663 --> closer to the 9%, 10% is the target, as you know. So, we endeavor to close that gap as much as we can organically. The approach has been to do it organically.\n\nfee67a177312bc44d5fc9a6ff7643a3d --> Historically, there has been some level of improvement whether it can be -- we can debate whether it is a 3 or 5 basis points, it has to improve. That is the kind of range that we are talking about here.", "citations": ["b80727df56b0dc6436a3332067244663", "fee67a177312bc44d5fc9a6ff7643a3d"]}, "['Q2', '2024']": {"answer": "6d9da17adbe9e9c38d63bddc9cc7fe73 --> We had said that we will -- the core margins on a total asset basis, on a pure arithmetic should be somewhere between 3.7 to 3.8%.", "citations": ["6d9da17adbe9e9c38d63bddc9cc7fe73"]}}}, {"topic": "Fee-based income contributions", "data": {}}, {"topic": "Profitability analysis", "data": {"['Q3', '2024']": {"answer": "6f56435a445842995d4392c0ea58336a --> For us, faster growth is to go into high teens to 20% type of rate of growth.", "citations": ["6f56435a445842995d4392c0ea58336a"]}, "['Q1', '2024']": {"answer": "9713fd63b898b7fde7fbffc86baeab42 --> Yes, thereabouts, that's what we had indicated that that's the level at which we'd like to operate.\n\nb6c25e5c19dd83256f9df0a27897ac26 --> Yes, Mahruk, yes. See, if you think about any time period, a three-year period or a five-year period typically, which we look at 2.3x, 2.4x it moves up, which indicates about 17%, 18% kind of a growth. And that's over a period of a longer term, five, three, five years' time period.\n\nb6c25e5c19dd83256f9df0a27897ac26 --> But over a shorter time period, yes, somewhere we have done 15%, 16%, somewhere we have done 18%, 19%, but 17%, 18% is the kind of, our capacities are built and that is how we are gaining traction to be at that level from a consistency of growth point of view.\n\ne3e26cdaf1bc7a9f786531c40cc900d9 --> Srinivasan Vaidyanathan [CFO][Yes, that's a fair understanding and normally 18 months, 24 months breakeven to pay back. So if you started this in December ‘21, January ‘22, that's where we started, 18 months' time that you see and by the time the base effect is also in.]", "citations": ["9713fd63b898b7fde7fbffc86baeab42", "b6c25e5c19dd83256f9df0a27897ac26", "e3e26cdaf1bc7a9f786531c40cc900d9"]}, "['Q4', '2023']": {"answer": "f0eb687c3b75aa20b088317f2e69b2ee --> You continue to operate in that 1.9 to 2.1 type of a range on return on asset.", "citations": ["f0eb687c3b75aa20b088317f2e69b2ee"]}, "['Q1', '2025']": {"answer": "4768a74f9ece3ecd7bc0457b48be8752 --> The SMF category target is 10%, and they were close to 9% in the past year. They have tried to close it as of June, and it is a moving number that changes every quarter.", "citations": ["4768a74f9ece3ecd7bc0457b48be8752"]}, "['Q4', '2024']": {"answer": "92a8fd5f2c4b402d88c1ff3a93292115 --> The key focus over the medium to long term, the medium as I define it between 2 and 3 years, is to focus on improving our profitability metrics defined as the ROAs and the earnings per share.\n\n545f088a930da68bfb95b08f06cb75ef --> At an aggregate level the overall PSL for March '24, is published or to be published, we are a little more than 52% achieved at the -- against the target of 40%.\n\n4f9a1ce4709c61db0339b386281a5c75 --> We want to -- as I said we want to anchor our thought process in terms of seeing stability of metrices with a positive bias moving slowly and surely over the next 2 years to 3 years.\n\n818f1430e2874d02360bc00d685f9826 --> we will maintain stability on our profitability metrics more so in the ROAs and the EPS, etcetera, on a core basis, and we will try and ensure that we have a positive bias in the trajectory over the next 2 to 3 years.", "citations": ["92a8fd5f2c4b402d88c1ff3a93292115", "545f088a930da68bfb95b08f06cb75ef", "4f9a1ce4709c61db0339b386281a5c75", "818f1430e2874d02360bc00d685f9826"]}, "['Q2', '2025']": {"answer": "cea67d8fa77122cbe8d336b45b00594e --> we had thought that it would take four, five years to be at that level of what historically we have run, which is the mid-80s.\n\ncea67d8fa77122cbe8d336b45b00594e --> we will do it within two to three years to get to the high 80s, right?\n\n64041aeada0febe580571b917d22e124 --> FY '25, we would probably grow slower than the system.\n\n64041aeada0febe580571b917d22e124 --> FY '26, we may be at or around the system growth rate.\n\n64041aeada0febe580571b917d22e124 --> FY '27, we should be faster than the system growth rate.", "citations": ["cea67d8fa77122cbe8d336b45b00594e", "64041aeada0febe580571b917d22e124"]}, "['Q2', '2024']": {"answer": "9367ac30d299569acd48ecf680b14ef1 --> I'm very confident and sanguine that it will continue to do so quarter-after-quarter even on a larger scale, maintain the profitability in the range of 1.9% to 2.1% as in the past.\n\nca6d93f94f9d11612e9e6f78716315c4 --> Parag Thakkar [1.92% to 2.1% ROA is possible. The growth rate above 15% or 17%, 18% of the merged entity is also possible, right?]\n\nc94592b92e603d37fc412856676c84fb --> Our model shows that, it should be breakeven in two years' time and about 90%-plus, slightly above 90% of the branches have broken even in about 20-21 months. We have another 10% of the branches to breakeven. And when that does, that's the average of, call it, 22 months to 24 months breakeven.", "citations": ["9367ac30d299569acd48ecf680b14ef1", "ca6d93f94f9d11612e9e6f78716315c4", "c94592b92e603d37fc412856676c84fb"]}}}, {"topic": "Asset growth strategies", "data": {"['Q3', '2024']": {"answer": "4219d9a85489c5d101e079ff2e4daa6f --> If you look at our rate of growth, there are sometimes we are slower, sometimes we are faster. But all we have done is that over a period of time, we have always doubled in every four to five years. That's what we have done, right.", "citations": ["4219d9a85489c5d101e079ff2e4daa6f"]}, "['Q1', '2024']": {"answer": "443bc565119cd224795ffb7df8d63d8f --> we're confident that the building blocks that we put in place for such enormous growth remain, and confident of getting that to fruition over the next few quarters.", "citations": ["443bc565119cd224795ffb7df8d63d8f"]}, "['Q4', '2023']": {"answer": "e12d1231691c21b4314b66d3053f19fc --> The teams are geared up to continue to execute the strategy of getting one, the new customer on board at 2.6 million in this quarter, little more than 10.5 million in this year.\n\nd5bcfce0fbf0b610f42ae30a193fd8f3 --> So, if you look at 15 months, in 15 months, we have added 2,000 odd branches we have added. So, another four quarters to five quarters, things should lap itself from a comparison point of view, it should lap. Then after that, it would be almost 18 months to 24 months for the revenues to start coming in to support that cost.\n\n4aff9eb96fdd7a07c0fbf08fc877bea9 --> Srinivasan Vaidyanathan [In ‘23, 10.5 million. So, you need to bring in new customers and that is what we have done to ramp up.]", "citations": ["e12d1231691c21b4314b66d3053f19fc", "d5bcfce0fbf0b610f42ae30a193fd8f3", "4aff9eb96fdd7a07c0fbf08fc877bea9"]}, "['Q1', '2025']": {"answer": "a83a97630948a7aba4157489cee02d52 --> We will be growing slower in our advances as against our deposit growth.\n\nc65d8ea2d9d315279ac7f1a87e377825 --> The monthly inflow that come are in excess of 20% higher than what it was in a similar time period last year.", "citations": ["a83a97630948a7aba4157489cee02d52", "c65d8ea2d9d315279ac7f1a87e377825"]}}}]}, {"theme": "Digital Transformation and Technology", "topics": [{"topic": "Mobile banking enhancements", "data": {"['Q4', '2023']": {"answer": "1f9072fb7f0968eeaafaa5379dba4840 --> On the payment acceptance points, the bank has 3.9 million year-on-year growth of 30% as adoption of Vyapar app builds momentum.", "citations": ["1f9072fb7f0968eeaafaa5379dba4840"]}}}, {"topic": "Cybersecurity advancements", "data": {}}, {"topic": "AI-driven customer solutions", "data": {}}, {"topic": "Technology investment plans", "data": {"['Q4', '2024']": {"answer": "bee8921c735a6112b3cea7d44899fbd5 --> M L [We will continue to invest in distribution, in people and technology.]\n\nbee8921c735a6112b3cea7d44899fbd5 --> M L [Our operating leverage will be harnessed over a period of time to using enhanced tech and digital infrastructure.]", "citations": ["bee8921c735a6112b3cea7d44899fbd5"]}, "['Q2', '2024']": {"answer": "9367ac30d299569acd48ecf680b14ef1 --> But what is going to be exciting is when we launch our digital journeys for bundling products during this quarter.", "citations": ["9367ac30d299569acd48ecf680b14ef1"]}}}]}, {"theme": "Credit and Loan Portfolio Management", "topics": [{"topic": "Retail loan growth", "data": {"['Q3', '2024']": {"answer": "c82f8d00849ec688fd4bef71ed9bd1a7 --> Among the disbursals that we had, in one month, if you take 40,000-plus disbursals, first disbursals because I'm not counting for the disbursals which are on-going, right, second instalment, third instalment, leave that to the side. On the first disbursals that have happened in the month -- in December, roughly half-half is, existing to bank and new to bank, half-half of that. Among that half, which is the new to bank, almost 65% of them we have penetrated with the savings deposit.", "citations": ["c82f8d00849ec688fd4bef71ed9bd1a7"]}}}, {"topic": "Non-performing asset management", "data": {}}, {"topic": "Credit risk assessment", "data": {"['Q2', '2025']": {"answer": "032f8190dbbb8aa7db8aa45dd39b740a --> We are accelerating bringing down the CD ratio or the loan deposit ratio, which is what I mentioned in the beginning of my commentary as to what our glide path of credit growth would be vis-a-vis the system growth rate over the next 3 years, including FY '25, '26 and '27.", "citations": ["032f8190dbbb8aa7db8aa45dd39b740a"]}}}, {"topic": "Asset quality trends", "data": {"['Q1', '2024']": {"answer": "55359be9f3f2b6544e1fc3cc42edb5c9 --> We will evaluate over the next two quarters in terms of what is the stable level before we start to build.", "citations": ["55359be9f3f2b6544e1fc3cc42edb5c9"]}, "['Q4', '2023']": {"answer": "947a69657f91dd4add921a3ca1b8ba16 --> The fixed rate book runs two, three years and that’s called 44% of the book, 45% of the book round number, that is the fixed rate. And it has started and it will continue for some time.", "citations": ["947a69657f91dd4add921a3ca1b8ba16"]}}}]}, {"theme": "Customer Experience and Engagement", "topics": [{"topic": "Customer satisfaction metrics", "data": {"['Q1', '2024']": {"answer": "ced5228e8efce1588c4dba2c0f5db68d --> Seamless integration to aid a sustained and optimal execution is undertaken, involving merging products and processes expertise, creating learning opportunities by focusing on customer engagement and experience, onboarding 4 million customers with over INR6 trillion portfolio, onboarding 4,150 talented professionals bringing in knowledge and culture.", "citations": ["ced5228e8efce1588c4dba2c0f5db68d"]}}}, {"topic": "Personalized banking solutions", "data": {}}, {"topic": "Loyalty program enhancements", "data": {}}, {"topic": "Service delivery improvements", "data": {}}]}, {"theme": "Regulatory Compliance and Risk Management", "topics": [{"topic": "Adherence to regulations", "data": {"['Q2', '2025']": {"answer": "4ecad0cc0a5dd9be939f7601d7946c6f --> The comments are required to be submitted by November 20, our bank, and I'm sure the banking fraternity would be providing similar comments.\n\n724fe2b403a3ff4317615d80b6c69163 --> The circular for the upper tier came that requires HDB to be listed by September '25.", "citations": ["4ecad0cc0a5dd9be939f7601d7946c6f", "724fe2b403a3ff4317615d80b6c69163"]}}}, {"topic": "Risk management frameworks", "data": {}}, {"topic": "Basel norms implementation", "data": {}}, {"topic": "Compliance initiatives", "data": {}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Geographic expansion plans", "data": {"['Q3', '2024']": {"answer": "1eddfe3e1892abbfd25a2d952246ac8d --> India's year-on-year GDP growth for FY'24 is estimated at about 7%.\n\n1eddfe3e1892abbfd25a2d952246ac8d --> For FY'25, GDP growth rate is expected to be around 6.5%.\n\n71aa06706a83bb0264ddfe5b9f04e547 --> And we are targeting somewhere maybe 800 to 1,000 branches or so, right? If we do 1,000 branches, it would be good.\n\n71aa06706a83bb0264ddfe5b9f04e547 --> 1,500 is not something that will happen by March, right? 1,000 is something that is possible.\n\n3e311f7b3538827d9380b18069b9917a --> The branches, you said this year maybe 1,000.\n\n3e311f7b3538827d9380b18069b9917a --> we do want to get to the 13,000, 14,000 type of branches", "citations": ["1eddfe3e1892abbfd25a2d952246ac8d", "71aa06706a83bb0264ddfe5b9f04e547", "3e311f7b3538827d9380b18069b9917a"]}, "['Q1', '2024']": {"answer": "e3b7dc9e46d1e81fc22a0e43e273cd0c --> These factors are estimated to result in India's year-on-year GDP growth rate of 7.7% in Q1 and greater than 6% in the full year ‘24.\n\ne3b7dc9e46d1e81fc22a0e43e273cd0c --> On the CRB side, our SME businesses are present in more than 90% of the district, expanded to 1.7 lakh villages reach and is on track to achieve the objective of over 2 lakh villages.", "citations": ["e3b7dc9e46d1e81fc22a0e43e273cd0c"]}, "['Q4', '2023']": {"answer": "1f9072fb7f0968eeaafaa5379dba4840 --> We estimate India's GDP growth at 6.8% in financial year '23 and expected to be over 6% in financial year '24.\n\n1f9072fb7f0968eeaafaa5379dba4840 --> On the distribution expansion, we added 638 branches during the quarter taking the total branch addition in financial year '23 to 1,479.\n\n1f9072fb7f0968eeaafaa5379dba4840 --> Wealth management is offered in over 923 locations through hub and spoke model. We have expanded by 232 locations in the quarter.\n\n96f42d497c8c3cb591dec4c078587acc --> FY’24 branch addition. At this moment, we expect to continue the speed at which, not necessarily every quarter evenly, but the speed at which we have done over the last 15 months to 18 months, we will continue.\n\ne24ad7d04775b68502cb33af5c1fa8ec --> Srinivasan Vaidyanathan [We think from a timing point of view, itis June, July, possibly July is where we think the time frame as we speak given where we are on various things.]", "citations": ["1f9072fb7f0968eeaafaa5379dba4840", "96f42d497c8c3cb591dec4c078587acc", "e24ad7d04775b68502cb33af5c1fa8ec"]}, "['Q1', '2025']": {"answer": "e5fb758f143c020d6dc8e6bff71b373d --> We are reaching out to 225,000 villages to get that reach to be there.", "citations": ["e5fb758f143c020d6dc8e6bff71b373d"]}, "['Q4', '2024']": {"answer": "367bf5f062a110ee40e7232118876045 --> Srinivasan Vaidyanathan [In order to position ourself, at least in the medium-term to come, we expanded to 225,000 villages now where we operate.]\n\nd9161f9af81eb00a6ea657498947e12c --> We did expand our small and medium enterprise business to 715 districts across the country.\n\nd9161f9af81eb00a6ea657498947e12c --> We also mentioned about the 225,000 villages for certain agriculture and allied product distribution.\n\nb9624127f1a5892e193cd63c74cc0fb9 --> M L [Investments are planned to become significant drivers of deposit mobilization in 5, 10, and 15 years.]\n\nb9624127f1a5892e193cd63c74cc0fb9 --> Srinivasan Vaidyanathan [75 Smart Banking lobbies were added this year as part of distribution expansion.]", "citations": ["367bf5f062a110ee40e7232118876045", "d9161f9af81eb00a6ea657498947e12c", "b9624127f1a5892e193cd63c74cc0fb9"]}, "['Q2', '2024']": {"answer": "a5ebf6dfb0e72f24c435716a417af036 --> Our estimate of the GDP growth for this year FY '24 is 6.3%, which will demonstrate that it's one of the fasting growing economies of the world.\n\ncfad3e26e4abe4409ac9624bb3bb6b57 --> The rural business reach expanded to 1.85 lakh villages, and it's on track to go to the objectives of over 2 lakh villages in the near term.\n\nd36f2f633b67586b4b41ab91b4580c4c --> We have mandated to list HDB Financial Services by FY '25.\n\n477337ca12535e6a477f019e460ec830 --> And this 1s a machine, as you know, that's right, it's opening not 100, 200, it's a machine that needs to run and so when we are opening 500 branches in a quarter, the preparation, and the legwork for that is a pretty long lead into getting there.", "citations": ["a5ebf6dfb0e72f24c435716a417af036", "cfad3e26e4abe4409ac9624bb3bb6b57", "d36f2f633b67586b4b41ab91b4580c4c", "477337ca12535e6a477f019e460ec830"]}}}, {"topic": "Competitive positioning", "data": {"['Q3', '2024']": {"answer": "05f3e7d487b67571c7235043ab40e58d --> Kunal Shah [We do believe that on an incremental basis, 18%, 20% market share, we do garner, right. That's part of the -- whatever is the size that we have got, whatever is the level at which we are growing, we continue to maintain that superior rate of growth to the market, gaining market share on an incremental basis, getting that in the high teens to 20 type of incremental market share.]\n\nf0607f52c062561d61891ad102c92886 --> Srinivasan Vaidyanathan [Our market share is at about 10.5%, and it continues to grow. On an incremental basis, I think I alluded to our assessment is 18% to 20%.]", "citations": ["05f3e7d487b67571c7235043ab40e58d", "f0607f52c062561d61891ad102c92886"]}, "['Q4', '2024']": {"answer": "de26c7bd15cbebc1be45793870cea572 --> So if that is going to be the focus, then I -- here, this outlook, I'm happy to even sort of provide that over the next 10-year period. Will we continue to gain share? Absolutely.", "citations": ["de26c7bd15cbebc1be45793870cea572"]}}}, {"topic": "Strategic partnerships", "data": {}}, {"topic": "International market entry", "data": {}}]}, {"theme": "Operational Efficiency and Cost Management", "topics": [{"topic": "Process automation efforts", "data": {}}, {"topic": "Cost-to-income ratio management", "data": {"['Q3', '2024']": {"answer": "7dd50b9d4970955bbf05e0fd2f5852e4 --> Yes, we do expect normally -- while we don't give a forward-looking outlook, but on the cost to income, we have always said that we want to take it down to the mid-30s. And that we will progressively take it down on not just towards the back end, but there should be an expectation that the cost to income should be improving.", "citations": ["7dd50b9d4970955bbf05e0fd2f5852e4"]}, "['Q4', '2023']": {"answer": "5a45c7c08c09be602fbfb4315425622d --> The cost to income for the full year at 40.4 are currently 42. If you go back in line that is in 19, for example, it was close to 40, the cost to income was 40. And we had mentioned that our cost to income will go past 40, 41 and the quarter can touch 42, we will operate at that level.\n\n483b5d49eb04543d99dd0f1e54933d84 --> But again, I will tell you to look at from a cost-to-income point of view that it moves in that range of 42 something. And then as we progress over four quarters, six quarters, it starts to keep coming down. And I think among various things while we do not talk forward looking in any of those aspects, but from a cost point of view, we have said that over a period of time, you should get back to the mid-30s as the productivity starts to come in.", "citations": ["5a45c7c08c09be602fbfb4315425622d", "483b5d49eb04543d99dd0f1e54933d84"]}}}, {"topic": "Supply chain optimization", "data": {}}, {"topic": "Overhead cost reduction", "data": {}}]}, {"theme": "Liquidity and Capital Management", "topics": [{"topic": "Liquidity coverage ratio trends", "data": {"['Q3', '2024']": {"answer": "7340204fe901f85dc61b0a5445f147d7 --> We do need deposits to be kicking in for the loans to be operating.\n\n53bb80ee01daa909f8a2f34cc01afc21 --> LCR, as we have said before that we'd like to operate between 110% to 120%.\n\n5867662420788e05dc7950830d494ee4 --> So you should expect that the LDR to go down progressively over several quarters to come.\n\nfd2d5f71943db1de9782d19bde8dc27b --> Yes, there are maturities coming, and we envisage to the extent that economics work, we will have a similar replacement. If not, it has to be replaced by deposits. And that is part of how the rate of growth of deposits need to outpace the loan growth.", "citations": ["7340204fe901f85dc61b0a5445f147d7", "53bb80ee01daa909f8a2f34cc01afc21", "5867662420788e05dc7950830d494ee4", "fd2d5f71943db1de9782d19bde8dc27b"]}, "['Q1', '2024']": {"answer": "4427aeea63e23017a2ae3a4e1b0a663f --> The bank standalone LCR is 126% on a combined basis, which was 116% last quarter, 126% now, on a combined basis, Pro-forma combined, a little more than 120% after accounting for what is required for CRR and so on.\n\nbba700de9ca309764cf941d0f5714ff2 --> So it will take three years, four years for that to come down to a level at which the bank has historically operated.", "citations": ["4427aeea63e23017a2ae3a4e1b0a663f", "bba700de9ca309764cf941d0f5714ff2"]}, "['Q4', '2024']": {"answer": "92a8fd5f2c4b402d88c1ff3a93292115 --> To achieve that, what is key is to ensure the most important focus is the sustainability of our deposits franchise, especially the retail deposits franchise.", "citations": ["92a8fd5f2c4b402d88c1ff3a93292115"]}, "['Q2', '2025']": {"answer": "576f445d1707b3733ea5dff51e11cbda --> We have told you that our target that we normally tend to operate is between 110 to 120.", "citations": ["576f445d1707b3733ea5dff51e11cbda"]}, "['Q2', '2024']": {"answer": "9c4870925700a30afb10b311288bea20 --> The LCR was at an average 121% after absorbing the ICRR for most of the quarter.", "citations": ["9c4870925700a30afb10b311288bea20"]}}}, {"topic": "Capital adequacy requirements", "data": {"['Q4', '2023']": {"answer": "f0eb687c3b75aa20b088317f2e69b2ee --> The full quarter, the ESOP and RSE is close to INR400,000, no, INR400 crores or INR300 crores, close to INR300 crores.", "citations": ["f0eb687c3b75aa20b088317f2e69b2ee"]}, "['Q4', '2024']": {"answer": "f8c15aed793f45d9ca2643c7b86e29a3 --> And there is a maturity pattern, which is there for next year. So the first priority is to keep reserves and the balance is to repay some of the bond maturities.", "citations": ["f8c15aed793f45d9ca2643c7b86e29a3"]}}}, {"topic": "Dividend distribution policy", "data": {"['Q4', '2023']": {"answer": "a2ca188570e28d4a30d8ae1b771c905d --> The bank's board has recommended a dividend of INR19 per equity share subject to shareholders approval.", "citations": ["a2ca188570e28d4a30d8ae1b771c905d"]}}}, {"topic": "Borrowings prepayment strategies", "data": {"['Q3', '2024']": {"answer": "313cbffd994df877d79978241a796344 --> Maturity profile is 20,000, 25,000. There is no big maturity at least over the next two to four quarters.", "citations": ["313cbffd994df877d79978241a796344"]}, "['Q4', '2023']": {"answer": "2467c218513cbf0d35947644cbfb4de9 --> We replace it with deposits, we get to a better place, over a period of, call it three to five years.", "citations": ["2467c218513cbf0d35947644cbfb4de9"]}, "['Q1', '2025']": {"answer": "4467cd3024e6036ac3e50c89fd769621 --> There is some maturity profile for the year, which we have published. For the year, I think the maturity profile is about INR650 billion for the year. That is scheduled maturity, INR600 billion for the year, out of which maybe INR250 billion were maturing that got paid in June quarter.", "citations": ["4467cd3024e6036ac3e50c89fd769621"]}, "['Q4', '2024']": {"answer": "f8c15aed793f45d9ca2643c7b86e29a3 --> So willy-nilly, all things remaining same, your LDR or incremental LDR will be a tad lower for a couple of years than what we have seen in the past because we have this obligation of repaying some of the bond maturities.\n\n07e0048619cafdbae88afea4973f4e2e --> Sashidhar Jagdishan [This is the high-cost borrowing maturities, which is what probably you're looking at, will start to happen from FY '25 onwards.]", "citations": ["f8c15aed793f45d9ca2643c7b86e29a3", "07e0048619cafdbae88afea4973f4e2e"]}}}]}, {"theme": "Merger and Integration", "topics": [{"topic": "Post-merger financials", "data": {"['Q1', '2025']": {"answer": "7f468cbdbab8b5761be77e8a1a876fbe --> I remember, Sashi, you giving a target, I know this was pre-target – pre, those days when you used to give target that longer term, you want to take it down to 30%.", "citations": ["7f468cbdbab8b5761be77e8a1a876fbe"]}}}, {"topic": "Integration feedback response", "data": {}}, {"topic": "Customer base merger impact", "data": {}}, {"topic": "Balance sheet audit", "data": {}}]}, {"theme": "Leadership and Workforce Performance", "topics": [{"topic": "CEO insights", "data": {}}, {"topic": "Workforce resilience in macro challenges", "data": {}}, {"topic": "Employee motivation and retention", "data": {"['Q4', '2023']": {"answer": "f0eb687c3b75aa20b088317f2e69b2ee --> Our goal is to get this maturity, both on the branches and the productivity curve up for the people that we have added 31,000 people over the year and 6,600 people in the quarter to get them up the curve and be productive.", "citations": ["f0eb687c3b75aa20b088317f2e69b2ee"]}}}, {"topic": "Strategic leadership", "data": {}}]}]