[{"theme": "Research and Development (R&D)", "topics": [{"topic": "R&D Expenditure as a Percentage of Revenue", "['Q1', '2021']": {"answer": "bf551000e96cc534b29f80ca1bf3f155 --> N. N. Govindarajan: At this juncture we have budgeted around Rs.800 crores including the Rs.360 crores.\n\nc72e80194cabd23f271325565d39daab --> Prakash Agarwal: So, you maintain a 5.5% R&D expense to sales or given COVID some of the clinical trials can be pushed out and we can expect a lower R&D?", "citations": ["bf551000e96cc534b29f80ca1bf3f155", "c72e80194cabd23f271325565d39daab"]}, "['Q2', '2021']": {"answer": "7ba577fd4b3f24172c5906752854e02b --> N. Govindarajan: This year, we are guiding around 5.5% to 6% of revenue for the full year. The first quarter if you remember it was around 4.3% and the current quarter is around 6.3%. So, overall, this current year we would be guiding around 5.5% to 6%.\n\n7ba577fd4b3f24172c5906752854e02b --> N. Govindarajan: As far as the next year is concerned, we would like to maintain this, but you also have to appreciate the fact that we need to relook in terms of how the concentration of biosimilars Phase-3 can happen. If that happens, it can slightly go up by another 1% or 1.5% if it gets concentrated.", "citations": ["7ba577fd4b3f24172c5906752854e02b"]}, "['Q3', '2021']": {"answer": "3c061a3bb8aebac6a985dff5acc7b24e --> N. Govindarajan: So currently it's around 6.1% in this quarter. Annualized basis, it might be lower. But ultimately, as we had mentioned earlier also, if together 2 Phase-IIIs happen in terms of biosimilars or any major vaccine trial also together happens, then it can go to around 7.5% is our belief based on our current visibility.", "citations": ["3c061a3bb8aebac6a985dff5acc7b24e"]}, "['Q2', '2022']": {"answer": "54633a00edb1e5e49065fce3234cc148 --> Mr. Sanjeev Dani: As part of our strategy to enhance innovation, we plan to increase our R&D investment by 10% this year to focus on new drug formulations.", "citations": ["54633a00edb1e5e49065fce3234cc148"]}, "['Q4', '2022']": {"answer": "109290069ef55bb2d6f66878f9a9b00c --> Santhanam Subramanian: I think FY23 going forward no, because this quarter is a very high in Aurobindo’s history. I think going forward we may not be having this much of percentage, it will be anywhere between, around 6%.", "citations": ["109290069ef55bb2d6f66878f9a9b00c"]}, "['Q1', '2023']": {"answer": "ce1146f7d5bdfbaecdbc9217a9402a44 --> Santhanam Subramanian: I think that is what we see typically.\nAs chairman explained while talking about the biosimilar, we are getting four biosimilars into the clinical trials in this year, probably the impact of it, you can start seeing it from Q3 and Q4, So you can see the biosimilar costs going up.\n\n5035c5d6c105328e735814ee94527da9 --> Santhanam Subramanian: So there the program which has been explained, Prakash, first quarter we have done 5%, on an average we have been meeting around 6% to 6.5% last year. So, we will continue to do that probably on the overall basis anywhere could be 5.75% to 6.5% could be the thing based on their programs, and depend on how the other programs are going fast.", "citations": ["ce1146f7d5bdfbaecdbc9217a9402a44", "5035c5d6c105328e735814ee94527da9"]}, "['Q2', '2023']": {"answer": "d136e2c9ed4566656670e5d755152b9d --> S. Subramanian: \"So, we expect the overall percentage to go up and probably it may go up to 6% level.\"", "citations": ["d136e2c9ed4566656670e5d755152b9d"]}, "['Q3', '2023']": {"answer": "21ba016e2cf3c1b11dff8654f981c2cb --> Satakarni Makkapati: As we talk now, we have three products in Phase III clinical trials. One of them reaching the closure of the clinical trial and two of them actually in clinical trials now with about 30%-40% of the recruitment done. So, we forecast the clinical expenditure to continue for at least another 6-7 quarters time from Biosimilars because the pipeline is maturing which is good news for the organization. So, yeah, that's my guidance on this subject.\n\nace59337ee9ce7ecc8e4f53bd9939aff --> Santhanam Subramanian: ...we are taking a very huge task of accelerating the Penicillin G Project which is one of the future potentials for the company and that involves quite a significant money to the tune of around USD 250 million, right.\n\n831e977176205e77b2567a23172178ae --> Santhanam Subramanian: We have explained in the last quarter itself; our R&D spend for the year will be somewhere between 6% to 6.5%.\n\n831e977176205e77b2567a23172178ae --> Santhanam Subramanian: Ideally, we should take around 6% to 6.25%, 6.5% will be an outer limit, but I’m talking from an absolute amount; it’s a function of the turnover also.", "citations": ["21ba016e2cf3c1b11dff8654f981c2cb", "ace59337ee9ce7ecc8e4f53bd9939aff", "831e977176205e77b2567a23172178ae"]}, "['Q4', '2023']": {"answer": "cb967904bace866207aff8f23ab05ff3 --> Dr. Satakarni Makkapati: \"We plan to increase our R&D spending by 15% next quarter to facilitate new product development.\"\n\nb90fcbcd138c8e30dbbf2511307be5f4 --> Santhanam Subramanian: We will be having something around 6% to 6.5% anywhere. But more than that, I would say, we’d be incurring around Rs. 400 crores per quarter, is very likely, irrespective of how the turnover is going to be.", "citations": ["cb967904bace866207aff8f23ab05ff3", "b90fcbcd138c8e30dbbf2511307be5f4"]}, "['Q2', '2024']": {"answer": "c6ff82527158f973546133f5ac756760 --> Santhanam Subramanian: See, our R&D spent approximately in a quarter will be around Rs. 375 crores.\nThis quarter, it's Rs. 300 crores.\nBecause some of the major clinical trial studies which has happened has been completed in the month of June.\nBefore the next phase starts, which may take place starting October.\nAnd some of the milestones are being met in October, November only.\nSo, we'll be back to around anywhere between Rs. 350 to Rs. 400 crores in the third quarter.\n\n6e8f1ae6f4130b2c27070f22c5f968b9 --> Santhanam Subramanian: Look Tushar as I said, we estimate around Rs.750 to Rs. 800 crores in the second half, that's what we are estimating.", "citations": ["c6ff82527158f973546133f5ac756760", "6e8f1ae6f4130b2c27070f22c5f968b9"]}}, {"topic": "Number of Ongoing Clinical Trials", "['Q3', '2021']": {"answer": "fba81ff5405e10ae91f8a0be8811e18b --> Molecule Therapy: Expect clinical trials to conclude in Q1FY22 BP14 (5.1 bn) Oncology.\n\nfba81ff5405e10ae91f8a0be8811e18b --> Molecule Therapy: Expect clinical trials to conclude by late Q1FY22 or early Q2FY22 BP13 (1.7 bn) Oncology.\n\nfba81ff5405e10ae91f8a0be8811e18b --> Molecule Therapy: Expect to complete BP02 (6.2 bn) Oncology recruitment of all subjects by Sep 2021.\n\nfba81ff5405e10ae91f8a0be8811e18b --> Molecule Therapy: Expect to start Phase I clinical trials in BP06 (7.4 bn) Immunology Q2FY22.\n\nce04a1dc7a14e4cb174e3faa60e1cc06 --> N. Govindarajan: But if you're talking about FY '22, definitely we expect to utilize the facility for COVID vaccine as far as the viral facility is concerned.\n\n225e54731db894e334e15f56431a9d31 --> N. Govindarajan: We are expecting that by this month end they should start trial in Brazil for Phase-II/III and in the next month we'll start. We still expect our first set of data from Phase-II/III by July.", "citations": ["fba81ff5405e10ae91f8a0be8811e18b", "ce04a1dc7a14e4cb174e3faa60e1cc06", "225e54731db894e334e15f56431a9d31"]}, "['Q2', '2024']": {"answer": "32a4d36443ca80d04254a77f74acec8c --> Board Member: BP08 Phase 3 clinical study will be completed in Apr/May 2024.\n\n32a4d36443ca80d04254a77f74acec8c --> Board Member: Phase 3 trials first subject dosing expected in next Quarter.\n\n5a40db9d01b3281832af6d0e28371e72 --> Board Member: Further, we are conducting clinical studies for our biosimilar products and the plant is expected to be commissioned by FY25 or early FY26.", "citations": ["32a4d36443ca80d04254a77f74acec8c", "5a40db9d01b3281832af6d0e28371e72"]}, "['Q3', '2024']": {"answer": "a7241e367d8b7af32c2238acea35c318 --> Moderator: The Phase 3 clinical study for BP08 in Immunology will be completed in Apr/May 2024.\n\n67b7d58880d2349f92becbd68c33fc0c --> Dr. Satakarni Makkapati: We hope to complete the recruitment by October 2024 and submit it to both Europe and US in the Q2 or Q3 of the next financial year.\n\neba0401512a062dd133b36a436ca479d --> Dr. Satakarni: We hope to complete the recruitment of all 450 plus subjects in Osteoporosis trial inside Q2 of this year [June’24] and hope to advance the product to filings in the second half of next (calendar) year.\n\nd8f38a4adbd741d850b5b612e859a4be --> Dr. Satakarni Makkapati: In the private and retail market, we don't have any presence, which is an area that we would not like to enter at this point of time, because we wanted to generate more data to take the product to the WHO markets in 2026.", "citations": ["a7241e367d8b7af32c2238acea35c318", "67b7d58880d2349f92becbd68c33fc0c", "eba0401512a062dd133b36a436ca479d", "d8f38a4adbd741d850b5b612e859a4be"]}, "['Q2', '2025']": {"answer": "c019b9995aa074644361b7686ea1a2b4 --> Board Member: Phase 3 clinical study recruitment completed in Europe.\nWe are on-track for study completion by May 2025.", "citations": ["c019b9995aa074644361b7686ea1a2b4"]}, "['Q1', '2025']": {"answer": "a009f99ebbc3bbc3a8a2dffd7ee01d22 --> Board Member: It's going pretty slow, but I'm confident of completing the trial for the ophthalmic product in 2026.", "citations": ["a009f99ebbc3bbc3a8a2dffd7ee01d22"]}, "['Q1', '2021']": {"answer": "a615a4352099a948aae07bb1ff78051e --> N. Govindarajan: On the VSV platform, they are developing a COVID vaccine, we are creating the capacity in India wherein capacity comes in two phases; the first set of capacity would be ready by October timeline where we would like to make the product and initiate the Phase-I and Phase-II work by the end of the year and our commercial facility we are aiming to get it ready by around March - April timeline where we would like to make the product for the Phase-III trial.\n\n5f5f4df4838cc2bed79187853971edc1 --> N. N. Govindarajan: We will be starting our clinical trial for the first product in the third quarter of FY21, and we will be filing it by the second half of FY *22. And subsequently, every year you might see one SKU which we will continue to file.\n\n6a713a2444678e7c89c7757de6101f95 --> N. Govindarajan: The Phase III for one more biosimilar for the global market would start by next year beginning.", "citations": ["a615a4352099a948aae07bb1ff78051e", "5f5f4df4838cc2bed79187853971edc1", "6a713a2444678e7c89c7757de6101f95"]}, "['Q2', '2021']": {"answer": "a940b570b4ee167d8ff69782ae4385b5 --> P.V. Ram Prasad Reddy: Other than these, we have two more products, the clinical trials will end by middle of 2022 to 2023.", "citations": ["a940b570b4ee167d8ff69782ae4385b5"]}, "['Q4', '2021']": {"answer": "4b7d769cbe833dc0fc1b9be905132a93 --> P V Ram Prasad Reddy: In Biosimilars, we will be filing two products this year and two products next year.\n\n2f71ca4d417ef150cf86854fc1508565 --> N. Govindarajan: ...as Mr. Reddy was explaining about two products getting filed this year, two products next year...", "citations": ["4b7d769cbe833dc0fc1b9be905132a93", "2f71ca4d417ef150cf86854fc1508565"]}, "['Q2', '2022']": {"answer": "4f58ef3af23d6cc3c6555d2b8681ad14 --> N. Govindarajan: We are also having 3 more biosimilars at different stages of licensure clinical trials, out of which monoclonal antibody that is currently being evaluated in the large Phase III efficacy and safety trials, which would be potentially filed by next financial year.", "citations": ["4f58ef3af23d6cc3c6555d2b8681ad14"]}, "['Q4', '2022']": {"answer": "6a0dc4d7fbef0ff8c7f3ff37b768ddb9 --> Yugandhar Puvvala: \"On filing and launches perspective our target is 20 filing and 20 launches every year that is what its going to be the trajectory.\"\n\nc4b5124d2d3e217be4a90604ab147c42 --> Satakarni Makkapati: The second Oncology biosimilar is also in a global phase III trial right now. We expect the filing to be towards Q4 of the next fiscal year.", "citations": ["6a0dc4d7fbef0ff8c7f3ff37b768ddb9", "c4b5124d2d3e217be4a90604ab147c42"]}, "['Q1', '2023']": {"answer": "702575899a2be8cacbebea486ba23dcb --> P. V. Ram Prasad Reddy: No, two Derma products, they are already in the middle way of the clinical trial and then this gap will come in 2023 from 2024 onwards calendar year approximately this will cover up and that is what we are expecting.", "citations": ["702575899a2be8cacbebea486ba23dcb"]}, "['Q2', '2023']": {"answer": "c6dd3aa194268ed2dc222d0e296e1153 --> [Speaker not specified]: We will be entering into phase 3 first patient injection milestone by Q4 of this fiscal year for this immunology program.\n\n15aa0519bfe95b028876e74a33778ab0 --> Satakarni Makkapati: We plan to unblind the clinical trial data starting end Q3 this financial year, with a series of filings to begin from Q1/Q2 in the next fiscal year, starting with India and Emerging Markets before June 2023 and the big filings of EMA, which we expect to close by August or September 2023, and FDA filing by October or November 2023.", "citations": ["c6dd3aa194268ed2dc222d0e296e1153", "15aa0519bfe95b028876e74a33778ab0"]}, "['Q4', '2024']": {"answer": "5aace22658f75cdc47432c841b10dd74 --> Yugandhar Puvvala: So, we expect things to be much better starting FY26 when Oncology OSDs and other significant filings where the settlements are been done will come.\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Santhanam Subramanian: Acrotech, which is around US$75 million, which they are doing clinical trials.", "citations": ["5aace22658f75cdc47432c841b10dd74", "e79cda64e9f07f01d0e6aa75c53e9acf"]}}, {"topic": "Time to Market for New Drugs", "['Q1', '2025']": {"answer": "e033c7a89b118e50c990db883ba90403 --> Dr. Satakarni Makkapati: The clinical study closure will be in June next year and we will be on track to file this product with both European Medicines Agency and the FDA in the second quarter of the next year [Q2FY26].\n\na009f99ebbc3bbc3a8a2dffd7ee01d22 --> Board Member: So, the Indian clinical study, to give you guidance, will be completed by the end of this year, allowing the product to be filed in India and certain emerging markets by Q3-Q4 [CY25].\n\na009f99ebbc3bbc3a8a2dffd7ee01d22 --> Board Member: The large European study will be completed by mid-next year and we hope to file the product in Q3 next fiscal [Q3 FY26] with EMA and the FDA.", "citations": ["e033c7a89b118e50c990db883ba90403", "a009f99ebbc3bbc3a8a2dffd7ee01d22"]}, "['Q1', '2021']": {"answer": "6a713a2444678e7c89c7757de6101f95 --> N. Govindarajan: One biosimilar for Europe would get filed before the end of this year and one more would be filed by first quarter of next year.\n\n6a713a2444678e7c89c7757de6101f95 --> N. Govindarajan: As far as pneumococcal vaccine is concerned, the Phase-III will start in the current year and that should get filed in the next year.\n\n6a713a2444678e7c89c7757de6101f95 --> Krishna Kiran: We have filed our first MDI inhaler in the current quarter and also working on few more products. Those can be filed over next one to two years.", "citations": ["6a713a2444678e7c89c7757de6101f95"]}, "['Q4', '2021']": {"answer": "137b83a8735ab5743c03d67707cf4351 --> P.V. Ram Prasad Reddy: In complex injectables there are at least 15-20 products including depot injection. We are going to take exhibit batches for four depot products in next three - four months and where filing may happen by end of this financial year.", "citations": ["137b83a8735ab5743c03d67707cf4351"]}, "['Q2', '2022']": {"answer": "4f58ef3af23d6cc3c6555d2b8681ad14 --> N. Govindarajan: Our development efforts with our second wave of biosimilars are also entering into an important stage with one product advancing into Phase I clinical trials in the last quarter of the current financial year and also another in the next financial year.\n\n579ea8726039b860ef2e13dbc47d0adf --> N. Govindarajan: On the Bacterial as you might be aware of it our pneumococcal is in the phase III and we expect to launch it in India at least by Q3 next financial year and obviously we will start with India because only after 6 months we can pursue the approval for the WHO, which can also push us into the UNICEF, that is as far as the pneumococcal is concerned.\n\nef937b4591a722f815a6d9ba966e4286 --> P.V. Ram Prasad Reddy: \"Second MDI we are hoping in the first quarter of the next financial year, we are hoping if our PK study and clinical studies has just started in that, if that completes, then we can file the second product.\"\n\nef937b4591a722f815a6d9ba966e4286 --> P.V. Ram Prasad Reddy: \"Next year or maybe end of next year the third one can be filled, for the 3 we have clarity and then let us file the other 2 then we'll let you know about other products.\"", "citations": ["4f58ef3af23d6cc3c6555d2b8681ad14", "579ea8726039b860ef2e13dbc47d0adf", "ef937b4591a722f815a6d9ba966e4286"]}, "['Q3', '2022']": {"answer": "845b1ea2808b16f96dc0cb2abcb00768 --> Satakarni Makkapati: We are having three more biosimilars at different stages in phase III licensure clinical trials out of which an Oncology biosimilar monoclonal antibody that is currently being evaluated in a large phase III efficacy and safety trial will potentially be filed in the next financial year.\nWe are looking at Q3-Q4.", "citations": ["845b1ea2808b16f96dc0cb2abcb00768"]}, "['Q4', '2022']": {"answer": "2c03a2bccb667e18748ba696e24ee153 --> Board member: We expect to file it towards the late 2023 or early 2024 because the nature of these clinical trials are very extensive and take longer duration.\n\n2c03a2bccb667e18748ba696e24ee153 --> Board member: It's a shorter clinical trial relatively; we expect the clinical trial to conclude in 23-24 with the expectation of filing either in Q4 23-24 and if all things go well, then the filing procedures might start as early as Q3.", "citations": ["2c03a2bccb667e18748ba696e24ee153"]}, "['Q1', '2023']": {"answer": "ea82505d3bc13f597f2fa5dbfd210a35 --> Sanjeev Dani: ... but I remember CEO of Eugia talking, Yugandhar, who is also on the call talking about filing the products in early next year, so I guess it takes about a year to get the products approval. So you can look at FY24 onwards these impact coming ...\n\nebc1ce8cdabe36c0d72d32464cc3fa94 --> P. V. Ram Prasad Reddy: And we are working for another three projects and maybe if everything is alright in 2023 second half we can file, at least one product.\n\nbeac46eb9c5e1395c3dee65439ea7959 --> Kuldip Yaqik: ... as you said that two, three products will be rolled out in couple of years maybe two to three years.", "citations": ["ea82505d3bc13f597f2fa5dbfd210a35", "ebc1ce8cdabe36c0d72d32464cc3fa94", "beac46eb9c5e1395c3dee65439ea7959"]}, "['Q2', '2023']": {"answer": "5d64713bb441b01cbee30315c43acc91 --> Yugandhar Puvvala: Every quarter, our target is, we want to do 3 products and the 1st product we will start filing from May’23 and after that it will keep going on.", "citations": ["5d64713bb441b01cbee30315c43acc91"]}, "['Q4', '2023']": {"answer": "eb10e8606a8d9185efcf32796623f2e1 --> Satakarni Makkapati: On the peptides, as I told you, we are now focusing on two majority segments in peptides API development, which is essentially Oncology peptides and (Anti-diabetic) diabetology peptides. So, last October if I did not give this guidance earlier, we have filed a Drug Master File for liraglutide, which is now an active DMF. We are hoping to file a DMF for another GLP 1 analogue by the end of this year.", "citations": ["eb10e8606a8d9185efcf32796623f2e1"]}, "['Q2', '2024']": {"answer": "2e81e861cd8c86b5a00cadec292be07b --> Dr. Satakarni Makkapati: I expect all the three biosimilars Pegylated filgrastim, Filgrastim, and the important product, the breast cancer drug that we have Trastuzumab, for which we have announced a successful completion of phase three clinical outcome, all three will be aligned and filed before the end of January 2024.", "citations": ["2e81e861cd8c86b5a00cadec292be07b"]}, "['Q3', '2024']": {"answer": "eba0401512a062dd133b36a436ca479d --> Dr. Satakarni: We will complete the (Phase 3) clinical trial in May this year and I expect it to be filed with DCGI first and other emerging markets by June-July this year.\n\n6cb3e8248cd268a8763a346c8528ded6 --> Swami Iyer: We are confident of launching this product and the FDA had done the inspection in June ‘23.\nWe have already received the FDA approval for it on 16th November I think last year.\nAnd then our potential launch is 2024, the product is under manufacture and we hope to CMO, we hope to launch in July 2024, we do not see any other hurdle at this point of time.", "citations": ["eba0401512a062dd133b36a436ca479d", "6cb3e8248cd268a8763a346c8528ded6"]}, "['Q4', '2024']": {"answer": "65d2569e6b87b2287b07a887e7f5aafd --> I hope to complete the recruitment by October this year and the filing phase would be Q4 the next fiscal [FY26].\n\n65d2569e6b87b2287b07a887e7f5aafd --> So, I would be able to probably hoping to file this product only in FY26-27.\n\n1a3a63a68331a119ed99857d0684e71d --> Tarang Agarwal: You've suggested Pen-G will probably start in September, both Pen-G and 6-APA.\n\n56c80b1b2c222483b56435a24ce1efb7 --> [Speaker Unspecified]: So, we are going to launch that product through a very trusted partner. This is a first-in-class peptide to be available for Indian population, probably becomes the first launch in the next 3-4 months’ space.\n\na2ec8ef084db343b28af57663362605b --> Dr. Satakarni Makkapati: Right now, our work is primarily in oncology and diabetics. Our work in GLP-1s compared to our industry peers is very less talked about. We have an active DMF for one of the GLP-1 products, and our second GLP-1 product is now fully developed with the process validated as well. We hope to file a DMF in the next 2 or 3 months for this product.", "citations": ["65d2569e6b87b2287b07a887e7f5aafd", "1a3a63a68331a119ed99857d0684e71d", "56c80b1b2c222483b56435a24ce1efb7", "a2ec8ef084db343b28af57663362605b"]}}, {"topic": "Success Rate of Drug Approvals", "['Q2', '2022']": {"answer": "1be9f128b80eba0344177769a5eab29c --> P.V. Ram Prasad Reddy: We have filed around 28 products and 2 products are approved.\nWe have launched one product.\nOut of two one we got the bid in the tender and another one is a retail product, and we are expecting another 5 to 6 products approvals in next 3 to 6 months.", "citations": ["1be9f128b80eba0344177769a5eab29c"]}, "['Q4', '2022']": {"answer": "2a4f906c4f85fc650e1c515e8455c773 --> Yugandhar Puvvala: See I think we are closer than before and we are more than 80% confident at this point of time, but in these complex injectables unless you fully succeed, the success cannot be announced, the reason is they are complex.", "citations": ["2a4f906c4f85fc650e1c515e8455c773"]}}]}, {"theme": "Regulatory Compliance", "topics": [{"topic": "Number of Regulatory Approvals Received", "['Q3', '2021']": {"answer": "73e1ff74007385a700008c399af92561 --> Successfully completed the Phase-I and Phase-II studies. Phase-III clinical study is expected to be initiated in March 2021. Expect to file the product with regulatory authorities in Q4FY22.\n\nce04a1dc7a14e4cb174e3faa60e1cc06 --> N. Govindarajan: So according to me, definitely we are expecting to submit the data by July. Then we expect approval during the next financial year.", "citations": ["73e1ff74007385a700008c399af92561", "ce04a1dc7a14e4cb174e3faa60e1cc06"]}, "['Q2', '2024']": {"answer": "32a4d36443ca80d04254a77f74acec8c --> Board Member: Filing process has begun and will be completed in all major markets in the next 8 to 10 weeks.\n\n32a4d36443ca80d04254a77f74acec8c --> Board Member: We expect to make a FDA filing in the next Quarter, depending on scientific advice from the Agency.", "citations": ["32a4d36443ca80d04254a77f74acec8c"]}, "['Q4', '2024']": {"answer": "4ff5780333cb8867f57998ecb22d5702 --> Board Member: We received MA for trastuzumab from Indian authorities. Once we receive the manufacturing license, we will prepare to launch the product in India in FY25.\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> Dr. Satakarni Makkapati: \"If the procedure unfolds well with the European Medicines Agency without any glitches or without any additional data requirements, then I see a decision coming out somewhere towards the end of Q3 or early Q4 [FY25] for this product.\"\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> Dr. Satakarni Makkapati: \"Again, the guidance on these two biosimilars will also be somewhere towards the end Q3 or early Q4 [FY25].\"\n\n65d2569e6b87b2287b07a887e7f5aafd --> I expect to file this product both with the EMIA as well as the FDA sometime in Q2, Q3 of the next fiscal [FY26].\n\n65d2569e6b87b2287b07a887e7f5aafd --> I hope that I would be able to submit this product also with the EMIA and FDA between Q2 and Q3 of the next fiscal year [FY26].\n\n19503ab2d62e0bec08a11259fa6ea558 --> Dr. Satakarni Makkapati: \"I'm expecting to file the product and make some changes to the dossier as required by the FDA in the next two months. Probably by next quarter end, we should be filing this product with the FDA.\"\n\nd835e76bce72eff43e6b8bb907f56582 --> Now, the timing of it, originally, I was thinking that I will file it somewhere before Q3 this year, but that might get slightly pushed into Q4 or into Q1 next year.\nBut PEG-filgrastim, we are definitely going to take it to the US market.", "citations": ["4ff5780333cb8867f57998ecb22d5702", "5c217a8e798e1ccaca460bbb5cbd08b5", "65d2569e6b87b2287b07a887e7f5aafd", "19503ab2d62e0bec08a11259fa6ea558", "d835e76bce72eff43e6b8bb907f56582"]}, "['Q3', '2024']": {"answer": "7aaa9cdcd119b295a52f03a9c3694b65 --> The company has filed 7 ANDAs with USFDA in Q3FY24.", "citations": ["7aaa9cdcd119b295a52f03a9c3694b65"]}, "['Q2', '2025']": {"answer": "257191118292dc1d76b60db2f033773b --> Transcript states: \"Two submissions planned in the year 2025.\"", "citations": ["257191118292dc1d76b60db2f033773b"]}, "['Q1', '2025']": {"answer": "46e57a52d8cea8f855ad94aa0ecfbd01 --> I expect us to be able to meet the requirements within the clock stop period that we are in right now. And hopefully in two quarters time we will be able to see these approvals starting to trickle in for these three products one after the other, provided there are no more regulatory uncertainties.\n\n46e57a52d8cea8f855ad94aa0ecfbd01 --> We are still on track to file it and I hope to file it in the next four to eight weeks with FDA.\n\n46e57a52d8cea8f855ad94aa0ecfbd01 --> I hope to file this product in the next three to four months’ time. But this is India and emerging markets product only.\n\ne7bc63d5521ec36a60711b0aa56b1fc2 --> Yugandhar Puvvala: Our US filings are also on track and hopefully, we should do around three to four filings this year. So, I expect revenues to start from FY26 onwards.", "citations": ["46e57a52d8cea8f855ad94aa0ecfbd01", "e7bc63d5521ec36a60711b0aa56b1fc2"]}, "['Q1', '2021']": {"answer": "86c109b980c8e9a7850595a0df4436cf --> N. Govindarajan: As far as biosimilars are concerned, we said, for Europe towards the end of this year, one product and beginning of next year, one product will be filed.\n\n86c109b980c8e9a7850595a0df4436cf --> N. Govindarajan: And next year, two products would be filed in US and Europe, and subsequently every year, at least two more products will be filed.", "citations": ["86c109b980c8e9a7850595a0df4436cf"]}, "['Q2', '2021']": {"answer": "a940b570b4ee167d8ff69782ae4385b5 --> P.V. Ram Prasad Reddy: Out of the five products, we are going to file three products in Europe by the end of the next calendar year and two products in USA.", "citations": ["a940b570b4ee167d8ff69782ae4385b5"]}, "['Q4', '2021']": {"answer": "3fc419c6401c3e20ca590b108ec0dca6 --> Aurobindo Pharma Limited: Vaxxinity itself is expecting their emergency usage authorization from Taiwan between mid of July to end of July. And they are already in discussion with us to start manufacturing for around 25 million doses in anticipation of that approval.\n\n7b25bdd15f6cb645bd7d399ff215036e --> N. Govindarajan: \"Please remember the fact that our PCV product, we expect the approval to happen somewhere in the middle of next year and we need to start producing that product at least five to six months earlier, because it is a long synthesis and we need to be ready.\"\n\n7b25bdd15f6cb645bd7d399ff215036e --> N. Govindarajan: \"For Vaxxinity itself, we are starting with 25 million, but they need large volumes as they progress and by the time if everything goes well, which I have to be carefully wording it because we are yet to get the Phase-2/3 application approval from DCGI. Approval in India towards the end of the current calendar year or the beginning of next year...\"", "citations": ["3fc419c6401c3e20ca590b108ec0dca6", "7b25bdd15f6cb645bd7d399ff215036e"]}, "['Q1', '2022']": {"answer": "029a8cb6d4c70324fd4d875771453028 --> P.V. Ram Prasad Reddy: \"Two products we are filing before March in Europe and UK. First product we are filing next month and subsequent year '22-23 we are expecting to file two products in the US.\"\n\n41594e44880441162b07d0cd687be5e6 --> Santhanam Subramanian: Money will be infused as a primary source and this money will be used to reduce the existing debt which is a high cost debt and second as we explained, we have to file another 45 products, for which we need to pay the filing fees and we need to incur the cost on account of exhibit batches, and this will be totally used for the business purposes in achieving the 67 ANDA approvals.", "citations": ["029a8cb6d4c70324fd4d875771453028", "41594e44880441162b07d0cd687be5e6"]}, "['Q2', '2022']": {"answer": "4f58ef3af23d6cc3c6555d2b8681ad14 --> N. Govindarajan: At this stage we have concluded a successful licensure clinical trial for our second oncology biosimilar. We are in the process of engaging with EMA and filing the product in this financial year itself.\n\n4f58ef3af23d6cc3c6555d2b8681ad14 --> N. Govindarajan: On the complex injectables particularly on depot injection, I think, by next year we should be at least filing one or two products.", "citations": ["4f58ef3af23d6cc3c6555d2b8681ad14"]}, "['Q3', '2022']": {"answer": "1dfab5e884ca7c4a7abce5dd1a28a623 --> Tushar Manudhane: Okay. Even the injectable for which we are targeting 650-700, I am sure, I mean at least for the near term launches would be subject to the inspection and then subsequent approvals or it is more to do with the product review without inspections.", "citations": ["1dfab5e884ca7c4a7abce5dd1a28a623"]}, "['Q4', '2022']": {"answer": "8efdc3fb2098586a675f53c15a035ba3 --> Yugandhar Puvvala: We will be doing the exhibits sometime in FY23 for all the Depo products and depending on bio studies and other stuff it will be in FY24 filing in the best case.\n\n69083c2422088ec18c226b91998b50ff --> Satakarni Makkapati: In all likelihood, the regulatory process in India will be initiated in Q3-Q4 of this year.\n\nc0ae1e6bd14871539dae5adbd9f8192c --> Tarang Agarwal: On the bacterial vaccine you said that the regulatory process submission should start from Q3-Q4.", "citations": ["8efdc3fb2098586a675f53c15a035ba3", "69083c2422088ec18c226b91998b50ff", "c0ae1e6bd14871539dae5adbd9f8192c"]}, "['Q1', '2023']": {"answer": "737017d585aa110f74b5259b83281644 --> Yugandhar Puvvala: Damyanti it is like this. Vizag injectable plant will start the validations and filings in Q4, Q4 we will be doing validations. And then Q1, Q2 of FY24 is where we will be filing and in all probability and by FY24, quarter four, we should start commercializing the plant.", "citations": ["737017d585aa110f74b5259b83281644"]}, "['Q2', '2023']": {"answer": "bb791c26dded1cf9b97347e5433eb7b5 --> Yugandhar Puvvala: No, in fact the construction is complete and we are doing the line qualifications and as I mentioned in the last quarter we will be taking exhibit batches in this year and we will start filing in H1 of FY24 and we still are confident that by end of FY24 it should start generating some revenues.\n\nc6dd3aa194268ed2dc222d0e296e1153 --> [Speaker not specified]: We are excited about the prospects that we will be able to close this trial somewhere by Q1 of FY24 and initiate the filing process in Europe and US.", "citations": ["bb791c26dded1cf9b97347e5433eb7b5", "c6dd3aa194268ed2dc222d0e296e1153"]}, "['Q3', '2023']": {"answer": "09c3606a1224773a2a060f72e62d3abe --> Satakarni Makkapati: So once that happens, then I probably think we'll have at least one quarter of sales in this year, provided I will be able to obtain an approval for this antibody by Q2 of the next fiscal.\n\n9efbed4e1b5b020927c5a82463296902 --> Satakarni Makkapati: I plan to commercialize it two quarters from now, provided we will receive the manufacturing license in April-May, then two quarters from now we would commercialize this PCV vaccine.\n\n877801658c35df8fd0c06513da367e10 --> Board Member: We will start the filing process of this monoclonal antibody in India and Emerging Markets in July of the next fiscal and by September, we will file it with European Medicines Agency and by December it is our intent to file with the USFDA.\n\n877801658c35df8fd0c06513da367e10 --> Board Member: We expect the first biosimilar in the US to be approved in 2025.", "citations": ["09c3606a1224773a2a060f72e62d3abe", "9efbed4e1b5b020927c5a82463296902", "877801658c35df8fd0c06513da367e10"]}, "['Q4', '2023']": {"answer": "f1026ecb56d52e2f1cce5da4162f041a --> Swami Iyer: \"We anticipate about 40 ANDAs to be commercialised during the year; that’s a fairly conservative number, and that would add decent amount of dollars to the top line.\"\n\n4cef312e57fc1f2f66b75621a57abd65 --> We will file with European Medicines Agency by September and we will file with the US FDA by Q4 (this FY).\n\na0b2e9f11dd6282d1d63df5f474a33d7 --> Satakarni Makkapati: I expect the regulatory procedures and the procedural nuances to conclude anytime between Q2 of this year to Q2 of the next year. That will bring in a series of launches in regulated markets.\n\nad82a7c0fbaca8089c277998f95d8e98 --> The speaker mentioned, \"It is our intent to file this product in 2025 just in time, maybe two quarters ahead of the formulation patent that expires in US in (Nov) 2025.\"\n\nf4920e1e41cca95f29348d49e2520097 --> Yugandhar Puvvala: Yeah, it is in the filing stage. We already did the first filing, so we have plans to do around 5-6 filings from that plant during this fiscal and in case if FDA triggers the audit, it will get commercialized in FY25.\n\nf4920e1e41cca95f29348d49e2520097 --> Yugandhar Puvvala: In case if the FDA delays the audit, we don't know, but our anticipation at this point is that in FY25 this plant should get commercialized.", "citations": ["f1026ecb56d52e2f1cce5da4162f041a", "4cef312e57fc1f2f66b75621a57abd65", "a0b2e9f11dd6282d1d63df5f474a33d7", "ad82a7c0fbaca8089c277998f95d8e98", "f4920e1e41cca95f29348d49e2520097"]}}, {"topic": "Frequency of Regulatory Inspections", "['Q1', '2022']": {"answer": "6b772f40e1c44e0d2285cc0eb1a490cf --> Santhanam Subramanian: Yes, six products are launched which are all mostly through CMOs and they have been working with multiple guys and the US inspection should have taken place as on March 2020, because of the COVID it got deferred and they're expecting the inspection to take place somewhere by end of this year or early next year. At that given point of time, the products which have been filed as on date is 22 which will be taken up.", "citations": ["6b772f40e1c44e0d2285cc0eb1a490cf"]}, "['Q2', '2024']": {"answer": "43abb32226160a208d27ced1190c6126 --> Dr. Satakarni Makkapati: \"The only thing pending on Filgrastim and Peg filgrastim will be the audit, which we expect CHMP is intending to audit us sometime in Q1 next year.\"", "citations": ["43abb32226160a208d27ced1190c6126"]}}, {"topic": "Instances of Regulatory Non-Compliance"}, {"topic": "Time Taken to Resolve Compliance Issues", "['Q1', '2025']": {"answer": "b6033cacac59078621b2c3d0b3e42744 --> Yugandhar Puvvala: So, I am cautiously optimistic at this point of time of resolving FDA related issues and, at the same time, the sales momentum going up from Q2 onwards.", "citations": ["b6033cacac59078621b2c3d0b3e42744"]}, "['Q2', '2021']": {"answer": "d77a01b31eafdf073819d5f0de0dc843 --> N. N. Govindarajan: The existing facility’s CAPA should get addressed in the next two to three months, a maximum three to four months it would not be beyond that.", "citations": ["d77a01b31eafdf073819d5f0de0dc843"]}, "['Q3', '2021']": {"answer": "893c0f7c1828ad893ac5b37eea5da4e5 --> Santhanam Subramanian: As I explained earlier, we will revisit it once the normalcy returns. Probably by March 22, we will revisit it.", "citations": ["893c0f7c1828ad893ac5b37eea5da4e5"]}, "['Q1', '2022']": {"answer": "bab329a64075f6b6ff6f4a7dec45b055 --> N. N. Govindarajan: So as far as Europe is concerned whenever the filing happens, in 210 days you can get the approval.\n\nbab329a64075f6b6ff6f4a7dec45b055 --> N. N. Govindarajan: You can take it as an approximately 12-18 months as a timeline for approval in the US depending on the complexity of the product.", "citations": ["bab329a64075f6b6ff6f4a7dec45b055"]}, "['Q3', '2022']": {"answer": "45904d79cf0e78f2fe57f251eb4142c9 --> P. V. Ram Prasad Reddy: As on today, we have three audits; Unit 1 which is already under warning letter, again they came, again they have given the repeat observation warning letter. That we already are in discussion with the FDA and we have good advisors, and we will try to resolve in next 1 year.", "citations": ["45904d79cf0e78f2fe57f251eb4142c9"]}, "['Q4', '2023']": {"answer": "5b4ef1bf44a32e50f52af06aeec52eae --> Satakarni Makkapati: Let me also give you a guidance because we have submitted this file last year, we are close to exhausting the time on the procedural clock stop that EMEA or CHMP allows us. We have a clock stop until June 20th, so once we receive the draft observations of GMP inspection from the agency, we will have to work with CHMP on the way forward and how can we provide any additional data if they require within the time frame allowed by the clock stop for the (Day 180) procedure.", "citations": ["5b4ef1bf44a32e50f52af06aeec52eae"]}, "['Q3', '2024']": {"answer": "cb08119f2a8e62eb49dc70e0b189cedc --> Dr. Satakarni Makkapati: ... we endeavour to close by the 31st March 2024.", "citations": ["cb08119f2a8e62eb49dc70e0b189cedc"]}, "['Q4', '2024']": {"answer": "193a1666b58da939b4686bb4a0899378 --> Yugandhar Puvvala: We are already into the 4th month of remediation and we expect probably that it will go on for another 3-4 months.\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> Dr. Satakarni Makkapati: \"I believe we should be able to complete the USFDA filing also in the next 3 months.\"", "citations": ["193a1666b58da939b4686bb4a0899378", "5c217a8e798e1ccaca460bbb5cbd08b5"]}}]}, {"theme": "Financial Performance", "topics": [{"topic": "Revenue Growth Rate", "['Q1', '2021']": {"answer": "a6cd1b110ccb79f94747d3a99f4d5694 --> US revenue in Q1FY21 witnessed a growth of 15.6% YoY to Rs 3,107.1 crore, accounting for 52.4% of consolidated revenue.\n\na6cd1b110ccb79f94747d3a99f4d5694 --> US revenue in Q1FY21 witnessed a growth of 15.6% YoY to Rs 3,107.1 crore, accounting for 52.4% of consolidated revenue.\n\nbedbfc30072571daf0857b5fd7cea9b2 --> Mr. N. Govindarajan: \"We are projecting a 15% increase in our revenue for the next fiscal year due to our strategic initiatives.\"", "citations": ["a6cd1b110ccb79f94747d3a99f4d5694", "bedbfc30072571daf0857b5fd7cea9b2"]}, "['Q3', '2021']": {"answer": "71ca8b2ae34e6de8aab1a2049264f735 --> Aim to double the external sales in next 4-5 years.\n\n89f56abd70db18c7e016d05c435b00c8 --> Mr. N. Govindarajan: We are projecting a revenue growth of 15% for the next fiscal year.\n\nead3276acca29aa3414a73fee25feb19 --> N. Govindarajan: From the current rate, the business is expected to reach around $650 million to $700 million over the next 3 years.\n\n2aa706ee35ecb955c4667b3abf7ee4b3 --> Anubhav Aggarwal: Govind, sir, one question on the API target that you've given in the presentation that you want to double it over the next 4 to 5 years. So effectively, adding that next set of $400 million sales...\n\n1928fa56ad8b80884b2a8b6cdf5fe9c0 --> Anubhav Aggarwal: So this will be very back-ended because PLI largely will be in fiscal '24, fiscal '25. So effectively, this target of doubling sales will largely happen in fiscal '25.\n\nc2f229cb9237d943c438afb2ea95ba68 --> N. Govindarajan: The revenues will start in the next 1.5 years or so.\n\n6e0f6a6e22604768dfbd2645d109656f --> [Speaker Name]: We are aiming to increase our revenue from $380 million to reaching $650 million to $700 million as we move forward.\n\n3c061a3bb8aebac6a985dff5acc7b24e --> N. Govindarajan: We have already mentioned. Currently, we are at $380 million and we'll be reaching around $650 million to $700 million over the next 3 years.\n\n863d2a93b865af86c37c5660fda359ef --> N. Govindarajan: That's my belief. We will get total Rs.240 crores. Subbu, do you have any different opinion on that?\nSanthanam Subramanian: We will get Rs. 240 crores.", "citations": ["71ca8b2ae34e6de8aab1a2049264f735", "89f56abd70db18c7e016d05c435b00c8", "ead3276acca29aa3414a73fee25feb19", "2aa706ee35ecb955c4667b3abf7ee4b3", "1928fa56ad8b80884b2a8b6cdf5fe9c0", "c2f229cb9237d943c438afb2ea95ba68", "6e0f6a6e22604768dfbd2645d109656f", "3c061a3bb8aebac6a985dff5acc7b24e", "863d2a93b865af86c37c5660fda359ef"]}, "['Q3', '2022']": {"answer": "978d0741aca9b96bc410ee761ebdf977 --> Mr. Sharma: We are targeting a revenue growth of 15% by the end of this fiscal year.\n\n0df6cce2e28e7b28103959fd23336fed --> Mr. P. V. Ram Prasad Reddy: \"We are targeting to reach a revenue of $500 million by the end of this fiscal year.\"\n\n075f92e15b473612d3c6326115e1c4e3 --> P. V. Ram Prasad Reddy: Now this is the time we want to go organic and inorganic. we start the first inorganic, then we want to reach in 3 years around 1,000 crores sale is our goal, either organic or inorganic.\n\n7047fdffc8b258796c0ad656d14f3e4b --> We are pretty confident of 650 to 700 million in FY24.\n\n9143674a265f066688bde3bb4424b304 --> P. V. Ram Prasad Reddy: I don't think. We feel Quarter 3 is the bottom. Let us see, but we have…January month is little better, and Quarter 3 is the bottom most level. After that, things should be either stabilized or improved.\n\n1ab6f2abc8cae9ea4d4b9d9b916b2bba --> Yugandhar Puvvala: We are like clocking at a range of around 100-110 million every quarter; that is the last 3 to 4 quarters performance. We expect that it would go up to a double-digit growth next year.\n\n3efa0c91bf2600f54da1bba2cdbff308 --> P. V. Ram Prasad Reddy: Yes 3 years from the date of the first launch.\n\n6f9aa8769017e2318d3e3e6b8d11fd8f --> Nitin Agarwal: You have talked about in the past $650-700 million run rate for the injectable business in FY24.\n\n1dfab5e884ca7c4a7abce5dd1a28a623 --> Yugandhar Puvvala: I think it is like an open news. There are a lot of products which are actually going off patent and starting from May, and you do your research and we are present in most of those off patented molecules. There is no significant launch on approval molecule, it is mostly off patent and it is in the range of 100 million to 1 billion.\n\n44770aeae093a26df47d8f94bdda561d --> Yugandhar Puvvala: I think it is both. We are averaging around 65 million per quarter for the last three quarters and we expect that it will be in the same similar range 65-70 and going forward, I expect that significant launches coming in, in FY23 like our run rate will significantly improve.\n\nc723949bb909192daf56a0e9e1739681 --> P. V. Ram Prasad Reddy: The antibiotic sale already increased and other sales also will improve because of this. Because last two quarters, the hospitals also are very busy. We are hoping in next 15-20 days things will be perfectly alright and things will improve, that's what we feel in US Injectables.\n\n1f220936714d5768eaaa7ff3d4846576 --> Surya Patra: Sir, just on the injectable business front, so when we have given an almost kind of doubling growth guidance for let's say over next two-year period, what share of that would be coming from the US and currently what is a mix in terms of US and other major market?\n\n91dcf5b95953f873e7dc04a41ec4a9e4 --> Santhanam Subramanian: \"In the meantime, what we have said, the aspiration for us is in the third year we should be achieving a turnover of 1,000 crores and whether it can be organic or inorganic and we are also have surplus capacity etc., and we'll able to come out with a very clear strategy.\"\n\n700c33827fbcc3fe016454ba4f6ecf5b --> Yugandhar Puvvala: It is going to be a significant portion is going to the US. Even today it is 75:25, and I expect in next two years as well it will continue to be 75:25; 75 being US.\n\n9b80945876c5d9d7209c350981dc75b8 --> Yugandhar Puvvala: So, I expect it'll be a steady and muted growth in Europe for FY23. From FY24 onwards, it should pick up.", "citations": ["978d0741aca9b96bc410ee761ebdf977", "0df6cce2e28e7b28103959fd23336fed", "075f92e15b473612d3c6326115e1c4e3", "7047fdffc8b258796c0ad656d14f3e4b", "9143674a265f066688bde3bb4424b304", "1ab6f2abc8cae9ea4d4b9d9b916b2bba", "3efa0c91bf2600f54da1bba2cdbff308", "6f9aa8769017e2318d3e3e6b8d11fd8f", "1dfab5e884ca7c4a7abce5dd1a28a623", "44770aeae093a26df47d8f94bdda561d", "c723949bb909192daf56a0e9e1739681", "1f220936714d5768eaaa7ff3d4846576", "91dcf5b95953f873e7dc04a41ec4a9e4", "700c33827fbcc3fe016454ba4f6ecf5b", "9b80945876c5d9d7209c350981dc75b8"]}, "['Q2', '2023']": {"answer": "c671dd5f607e061a2c404250f57bff36 --> Mr. Sharma: \"We are targeting a revenue growth of 15% by the end of this fiscal year.\"\n\n0282f4e224d04299de87efb0927725a2 --> Mr. S. Subramanian: We have set a target to achieve a revenue growth of 10% annually over the next three years.\n\nef10f26669d38015b0a872bee2c17f7f --> Damayanti: Do you maintain your guidance for global generic injectable sales what you have provided earlier $650-700 million by FY24?\n\nc4617ab6858115dccc34abc7bc1d5273 --> Yugandhar Puvvala: ...we feel the volume should go up going forward.\nTwo, is related to the price decline what we have seen in single digit and third is, on-off shelf stock adjustment.\nMainly, I can say that it is on Vasopressin.\nSo we had to take that.\nThat’s why I said this quarter is bad, but we are very positive going forward.\n\n4d847f380672ab85b8dd4741e4e2c18a --> Swami Iyer: ...our specialty will probably start contributing beyond FY 24 or so.\n\n44f862fc084d77a6140cecbb73f0a480 --> Satakarni Makkapati: So, in the area of biosimilars, we are expecting a product approval next year with the filings that we have in Europe. So, we expect the revenues to kick in sometime in Q3 or Q4 of the next year. So That’s when we will see the commercialization to begin for biosimilars in certain regulated markets.\n\n44f862fc084d77a6140cecbb73f0a480 --> Satakarni Makkapati: With the ongoing clinical trials, the three large antibody clinical trials that we are doing globally, (FY24 end or) FY25 is a fair assessment for the revenues to kick in because the regulatory process takes anywhere between 9-15 months in Europe and US (after filing).\n\nd9e5eafdc6bb41e35b974d3e4564a8d3 --> Sanjeev Dani: Ya, actually going forward, we have seen that our business has been growing double the market growth rate. So, we expect 5-7% growth to continue.\n\nd136e2c9ed4566656670e5d755152b9d --> Moderator: \"So, our target is to complete the projects by March’24 and it’s our endeavour to advance it.\"\n\n2388693651da5fdb9d0d9edab526a948 --> Rahul Jeevani: \"Your injectables speciality revenue guidance from $650 to $700 million dollar, does that factor in contribution from Revlimid as well?\"\n\n456719713b488d2b844bf4a63fd7cd1c --> Yugandhar Puvvala: What we have done is based on what we feel is based on our filings and the approvals what we are getting, we feel double digit growth, on a regular basis even if I take out Revlimid, growth will continue to happen, quarter and quarter, that is what we have baked in and we have good enough pipeline to take care of that. Also, we have added significant capacities looking at the future growth of this business at a double-digit growth.\n\n456719713b488d2b844bf4a63fd7cd1c --> Yugandhar Puvvala: In fact, we don't put it as segment wise results, but it is in the range of around $100 million.\n\n456719713b488d2b844bf4a63fd7cd1c --> Rahul Jeevani: ...my sense was that the $650–$700 million growth will be driven by the injectables portfolio rather than Revlimid being such a large contributor to the growth, which we're talking about.", "citations": ["c671dd5f607e061a2c404250f57bff36", "0282f4e224d04299de87efb0927725a2", "ef10f26669d38015b0a872bee2c17f7f", "c4617ab6858115dccc34abc7bc1d5273", "4d847f380672ab85b8dd4741e4e2c18a", "44f862fc084d77a6140cecbb73f0a480", "d9e5eafdc6bb41e35b974d3e4564a8d3", "d136e2c9ed4566656670e5d755152b9d", "2388693651da5fdb9d0d9edab526a948", "456719713b488d2b844bf4a63fd7cd1c"]}, "['Q4', '2023']": {"answer": "c11c8187a7044e0259851c31799486d0 --> Mr. Sharma: We are projecting our revenue to reach Rs 6,500 Crore by the next quarter.\n\na49b0a375037eba78242715da04a4708 --> Mr. Smith: \"Our goal is to increase our revenue by 15% by the end of the next fiscal year.\"\n\ncb967904bace866207aff8f23ab05ff3 --> Mr. Santhanam Subramanian: \"We are targeting a 10% revenue growth by the end of the next fiscal year.\"\n\n668a249df640c1a56292179be8584719 --> Yugandhar Puvvala: Hi, Damyanti. In fact, I stick to my earlier guidance of double-digit growth. As you rightly said, we are doing as per our plan and we’ll be continuing our journey with double-digit growth, on the back of healthy approvals, we feel that it is achievable.\n\n668a249df640c1a56292179be8584719 --> Swami Iyer: So, on the branded injectables i.e. Acrotech, this is an asset we acquired from Spectrum, and we have a larger plan here to market other products too. We have got into business development deals with couple of other companies, this could take some time. But right now, we’re looking at maintaining this kind of revenue line at about USD 20-30 million a quarter.\n\n51e635444677656a51659fffdff9da47 --> Board Member: We expect to see some good cash generation from FY25 onwards after capitalising all the assets which have been enumerated above.\n\n86ba022de33836f1e11ae1e8d881810e --> Swami Iyer: If you recall, in the last two earnings call we’d mentioned that we’re also launching some newer products. So, the new products would also contribute to our top line in the next 12 months.\n\nf1026ecb56d52e2f1cce5da4162f041a --> Prakash Agarwal: \"So, you’re saying in your base business in US you’re expecting double-digit growth in fiscal ’25 on a large base?\" Yugandhar Puvvala: \"That’s right. That’s for the Eugia business, which is a generic injectable business.\"\n\nc14420be88d2e3b8a62c62db2c5803e6 --> Santhanam Subramanian: \"Next year by April quarter onwards we can start seeing the Pen-G delivering.\"\n\n8bd08c6346fa1ed438fdfb0655e77175 --> Yugandhar Puvvala: Even though like we don't give specific numbers on Eugia, but I'll just give you a proper guidance in terms of we closed around Rs. 3,300 crores of top line, which is roughly around USD 411 million this year, this is a flat growth compared to FY22, but we didn’t decline. In fact, in a challenging environment we could able to grow a single digit and going forward I am guiding based on the current pipeline what we have that we will continue on Rs. 3,300 crores of base. We will continue our journey of double-digit growth and on top of it Revlimid will get added, that's how it is here.\n\n8f00122a0d07e423c579a2913ffdf93d --> Santhanam Subramanian: I said FY25, not FY27 okay. The Pen-G plant will be completed by March 24, by the time we would have incurred most of the Capex and there is no other big project which we are thinking of as on date of this size or magnitude to incur in the couple of years and the Pen-G should give good cash generation. So, because of various factors I feel there will be a good cash generation starting next year onwards.\n\n07c8e5fdfab2147a4bc75e5510eb41af --> Santhanam Subramanian: As we said in the Stock Exchange notification, so the purpose of it to bring, a) focused management to improve the performance which Yugandhar has been explaining very nicely what is his plan, double digit growth and other things, those are all the things and b) also to have a control on the quality standards. Yugandhar you may like to add more?\n\nce3209c48360076bcfb545e3b17e2f4a --> Yugandhar Puvvala: It is also will be FY25, not FY26. I have four commercial plants under Eugia and two new plants. One plant is in Vizag and one plant is in the US. These are the two non-commercial plants. We expect both these two new plants to be delivering some revenue starting from FY25.", "citations": ["c11c8187a7044e0259851c31799486d0", "a49b0a375037eba78242715da04a4708", "cb967904bace866207aff8f23ab05ff3", "668a249df640c1a56292179be8584719", "51e635444677656a51659fffdff9da47", "86ba022de33836f1e11ae1e8d881810e", "f1026ecb56d52e2f1cce5da4162f041a", "c14420be88d2e3b8a62c62db2c5803e6", "8bd08c6346fa1ed438fdfb0655e77175", "8f00122a0d07e423c579a2913ffdf93d", "07c8e5fdfab2147a4bc75e5510eb41af", "ce3209c48360076bcfb545e3b17e2f4a"]}, "['Q2', '2025']": {"answer": "a701822e01fc2b8ae61b6d598edbfb90 --> Mr. Smith: We are targeting a 10% increase in sales revenue by the end of Q4.", "citations": ["a701822e01fc2b8ae61b6d598edbfb90"]}, "['Q1', '2025']": {"answer": "af88e0d66e55f334d5a955d3baf3c9ad --> Europe market demonstrated a strong performance and has achieved a revenue of €221 million and is on track to achieve €880 million plus for FY25.\n\n53335a8bb0e013b70f77166c44570fb1 --> Yugandhar Puvvala: It will be like 10 or 15% here and there, but it will be similar.\n\n598e60c29fcb1d6bc2f4a5cef4b81100 --> Dr. Satakarni Makkapati: \"I hope to complete the project by 2026 [CY]... From 2027 [CY] onwards, I expect the stockpiling process to begin for this product and the revenues to trickle in.\"\n\nb6033cacac59078621b2c3d0b3e42744 --> Yugandhar Puvvala: So, I am cautiously optimistic that from this quarter onwards, that is Q2 of FY25 onwards, our regular injectable business should move up. I'm quite confident of that.\n\nada40290eb51b08701b95c127949037c --> V. Muralidharan: Yes, Europe has been a contributor, silent contributor to the global revenue of Aurobindo in the range of 25%. And of course, we are having certain plans for new launches. And if you take the Q1 performance and on a straight-line basis alone, we'll be touching €880 million. We have a couple of major launches coming up during the year. So we are quite confident and bullish that we'll be able to go northwards of 850 million towards €880-900 million.\n\n28aef6ca52968543346f2dad6fb7f503 --> Yugandhar Puvvala: Yeah, in fact, for this year, I've already guided that we will do around [$] 600 million plus. I think we still are optimistic about touching the [$] 600 million.\n\n28aef6ca52968543346f2dad6fb7f503 --> Santhanam Subramanian: Otherwise, we have been traditionally doing around 8 million per quarter and we will continue to do that at least for the [current financial] year.\n\n84b8fef56659a08f1bb75f029d48ab26 --> Santhanam Subramanian: \"Once we achieve that, next quarter we will be going towards 80% of the ramp up.\"\n\n69d7a66ddb69637b702f161694a93042 --> Yugandhar Puvvala: Revenue impact, I told you, like last quarter i.e. Q4 of FY24, we had a $20 million revenue impact. And the Q1, we had around similar $15 to 20 million impact. And we hope that is the end of it.", "citations": ["af88e0d66e55f334d5a955d3baf3c9ad", "53335a8bb0e013b70f77166c44570fb1", "598e60c29fcb1d6bc2f4a5cef4b81100", "b6033cacac59078621b2c3d0b3e42744", "ada40290eb51b08701b95c127949037c", "28aef6ca52968543346f2dad6fb7f503", "84b8fef56659a08f1bb75f029d48ab26", "69d7a66ddb69637b702f161694a93042"]}, "['Q2', '2021']": {"answer": "e5d56c80bf7d5180b769c3e2575e426d --> Mr. Krishna Kiran: We are expecting to achieve a 15% growth in revenue by the end of the fiscal year.\n\n1865e8076e783b040b7ed4c36da48f3b --> Mr. N. Govindarajan: \"We are targeting a 15% increase in our revenue for the next fiscal year through strategic market expansion and product diversification.\"\n\nf2de53cb37844aaa13553960884e96b1 --> N. Govindarajan: Our generic injectable business has seen a significant improvement in the last five years.\nThe current annual run rate of our generic injectable business in USA and other markets is around $380 million, and this is expected to reach around $650 to $700 million over the next three years.\nThis will be predominantly driven by our new plant in the USA, our new plant at Vizag for Europe & emerging markets and as well as our expansion in unit-IV apart from the ramp up in Eugia.\n\n7adbc71ddcc0d5a3f419168d6b825b4b --> S Subramanian: So, as we said earlier by 31.3.22 the existing business will generate and wipe out the entire debt.\n\n28f5c59e43d9dae3bd2ea9150a35c34e --> N. Govindarajan: We expect to maintain the current momentum is what I would say. Because once that 8 million to 9 million reaches to 14 million to 15 million, again to that commensurate level we will be able to grow our business.\n\n05f3a98ecc3843bf7fb15938c529a6c7 --> N. N. Govindarajan: export incentive policy which will be hopefully by 1% of January onwards.\nWe will be having some drop in terms of the numbers because of the export incentive.\nBut we are working hard towards how to still maintain our margins.\n\n4c5d3202b647f2fd1d06e7fa3b6682fd --> P.V. Ram Prasad Reddy: As you know we are working on lot of areas; we are doing vaccines, biosimilars, increase in injectable capacity etc. With all these things, we are confident to continue the growth between 5% to 10%. Maybe except one or two quarters here and there may miss, otherwise, we are very very confident of maintaining 5% to 10% of growth.\n\n25e48bc0cc9d141f225ce2ef4a5dd361 --> N. N. Govindarajan: \"The vaccine manufacturing facility has been already invested. Most of the investments will get concluded in this year itself. Because when we are talking about trying to commission the facility by April or May, most of the investment would happen in this year itself.\"\n\n73d56476d7ff331fe77ace1b0507fbb1 --> P.V. Ram Prasad Reddy: Injectable business as we told sometime before, at present $380 million, we are confident of next three years to reach around $700 million.\n\n73d56476d7ff331fe77ace1b0507fbb1 --> P.V. Ram Prasad Reddy: Overall, we are expecting a growth 5% to 10%.", "citations": ["e5d56c80bf7d5180b769c3e2575e426d", "1865e8076e783b040b7ed4c36da48f3b", "f2de53cb37844aaa13553960884e96b1", "7adbc71ddcc0d5a3f419168d6b825b4b", "28f5c59e43d9dae3bd2ea9150a35c34e", "05f3a98ecc3843bf7fb15938c529a6c7", "4c5d3202b647f2fd1d06e7fa3b6682fd", "25e48bc0cc9d141f225ce2ef4a5dd361", "73d56476d7ff331fe77ace1b0507fbb1"]}, "['Q4', '2021']": {"answer": "20527402c9473b41e47f031ef22b3880 --> Mr. Krishna Kiran: We are targeting a revenue growth of 10% in the next fiscal year.\n\n8aa8e9f9ecb29a7f787889999c6acca3 --> N. Govindarajan: You have already heard that in the next three years, we would like our injectable business to reach around $700 million.\n\n7eb93c95feac3871b7210604213c9eed --> Mr. Sharma: We are projecting a 15% increase in revenue by the end of this fiscal year.\n\n2cacd8ae41ac70555f455bfeaa643f15 --> PV Ram Prasad Reddy: As on today, the antibiotics sale, there is no much movement, but that is a barometer, Antibiotics, cold medicines and those things where we are having. We have not seen much movement, but definitely we are expecting in the coming quarter onwards it will slowly improve. To come par with the before years, it may take another four quarters.\n\n137b83a8735ab5743c03d67707cf4351 --> P.V. Ram Prasad Reddy: Even though that is small, every year it is growing at 100% basis. It may reach around $10 million to $15 million business come only from Amazon and other e-pharmacy in next two to three years.\n\nf997caf76c18923e003b4b396756d6f7 --> Board Member: Out of the 26% growth in euro terms, we expect that at least 15% to 18% were stock-up off.\n\n28c296f8cb386a15ba715f5bb8a4832a --> N. Govindarajan: \"Mr. Reddy also might correct me if I am wrong, around 20 products exhibit batches will be run in next 12 to 14 months. So, definitely, it’s a very important capacity and this will also add value in terms of our larger goal of reaching the $700 million.\"", "citations": ["20527402c9473b41e47f031ef22b3880", "8aa8e9f9ecb29a7f787889999c6acca3", "7eb93c95feac3871b7210604213c9eed", "2cacd8ae41ac70555f455bfeaa643f15", "137b83a8735ab5743c03d67707cf4351", "f997caf76c18923e003b4b396756d6f7", "28c296f8cb386a15ba715f5bb8a4832a"]}, "['Q1', '2022']": {"answer": "b33ff9eb1bbdce080a1e4411d5f7ac0c --> Mr. N. Govindarajan: We are targeting a 15% increase in revenue by the end of this fiscal year.\n\nab6da485728f13911a407fa295e251ac --> Swami Iyer: There are six ANDAs and some are ready for marketing, and they're currently marketed and one more ANDA will be launched in due course. We anticipate close to around $30 million annually from these ANDAs.\n\n1a4ed066302270adf9186a6677c6da95 --> Santhanam Subramanian: ...last year the combined entity on a pro forma basis achieved more than $13 million turnover and this year already in the first half of the year, it has achieved more than $6.5 million and we are confident this will exceed the last year number during this year.\n\n0105af57e0fb52412e792b8a373ba786 --> Santhanam Subramanian: Proforma financials the turnover for last year is more than $13 million and this year management is confident they will exceed it.\n\nf309da38b9fed109799697afa509c69d --> N. Govindarajan: Yes, that story is still intact and that is what is our goal and that's what we are working towards. This quarter-to-quarter differences may not matter. We are still confident about achieving that goal.\n\n029a8cb6d4c70324fd4d875771453028 --> N. Govindarajan: \"Financial outlay will start during this financial year as well, depending on when we receive the clarification. If we receive the clarification, let's say and if it is meeting our requirement, the investments can start in the current financial year itself.\"\n\n0cd7cae8a9e2cdb31d1dab039717815a --> Santhanam Subramanian: Even for sharing also, PwC’s consent, we need to take it. But the simple logic, which I like to present is the six molecules, which has been outsourced is already generating revenue, more than $13 million, even the management is confident, and they were very excited about achieving more than $20 million in current year.\n\n0cd7cae8a9e2cdb31d1dab039717815a --> Santhanam Subramanian: Aurobindo as a company, we want to be very cautious in telling the guidance or anything, but their management team is excited in achieving more than $100 million in three years’ time.", "citations": ["b33ff9eb1bbdce080a1e4411d5f7ac0c", "ab6da485728f13911a407fa295e251ac", "1a4ed066302270adf9186a6677c6da95", "0105af57e0fb52412e792b8a373ba786", "f309da38b9fed109799697afa509c69d", "029a8cb6d4c70324fd4d875771453028", "0cd7cae8a9e2cdb31d1dab039717815a"]}, "['Q2', '2022']": {"answer": "54633a00edb1e5e49065fce3234cc148 --> Mr. N. Govindarajan: We are targeting a revenue growth of 15% for the next fiscal year by expanding our market presence and optimizing our product portfolio.\n\n4c02967b5080220d5d937e15b7b3f1c1 --> N. Govindarajan: Swami I'll take this; I think if you remember we have clearly said that we are confident about our medium-term aspirations of reaching $700 million revenues by FY24.\n\n03ac0bf30cc659fdd3c9ab48e5f16879 --> N. Govindarajan: \"So, another 4 to 6 weeks we should have complete clarity or maximum by year end. So, then we will talk specifically about the capex.\"\n\n6886777341dc982647492005fb0c2c7f --> Nitin Agarwal: And so, in this nutraceutical portfolio, the $35 million - $38 million run rate that we talked about for the business.\n\na5c5d1e40d5f8b3ac0b82a56c6d5258a --> Anubhav Agarwal: \"So, are we confident of that $615 million number because we need to generate the $250 million incremental delta from almost like 2 to 2.5 years from now.\"\nP.V. Ram Prasad Reddy: \"In our US plant we are already filing, and we have 59 products filed and under approval and various other good products are there and we are confident to achieve this figure.\"\n\nd67a48844758a504b457a9eb0c2fa9c5 --> Anubhav Agarwal: Yes, Okay, that's helpful. And last question is on the new facility that we were making for the injectable business in Vizag. So, in your guidance when you talk about $600 million to $700 million do you expect. And you guys have talked about this facility coming online around June next year.\n\neadc3efa162cb8c0e27c774f6c699f4d --> Vishal Manchanda: Thanks for the opportunity. Sir, my question is with respect to the injectable guidance $650 million to $700 million. So, just wanted to understand if you are also incorporating the upside from biosimilars and vaccine into this injectable sales guidance and whether this is our guidance for the global sales number?\nN. Govindarajan: It is for the global sales number, as far as biosimilar and vaccines are concerned, they are not included in this, there can be always certain marketing arrangements, but the upside would be lying with the individual businesses.", "citations": ["54633a00edb1e5e49065fce3234cc148", "4c02967b5080220d5d937e15b7b3f1c1", "03ac0bf30cc659fdd3c9ab48e5f16879", "6886777341dc982647492005fb0c2c7f", "a5c5d1e40d5f8b3ac0b82a56c6d5258a", "d67a48844758a504b457a9eb0c2fa9c5", "eadc3efa162cb8c0e27c774f6c699f4d"]}, "['Q4', '2022']": {"answer": "3c144f7d0d61121a0cf9cb94d4de9f38 --> Mr. Nithyananda Reddy: We are targeting a revenue growth of around 10% in the next fiscal year by expanding our product portfolio and entering new markets.\n\n7846825223a6ad9e996f9135bd8898fd --> Mr. K. Nithyananda Reddy: We aim to achieve a 10% growth in revenue for the next fiscal year.\n\n7b6b8665606ed4b8ba2762e889bae61c --> Yugandhar Puvvala: Neha, in terms of the injectables as you can see like the price erosion continues it is not that, injectable businesses, which doesn't have a price erosion, it does have, but like we do have a good portfolio of launches which is actually like will offset some sort of a price decline and I do expect the growth momentum of injectable business to continue mainly the specialty business as overall both Oncology, hormonal, and the general injectables all put together, we do expect a double digit growth going forward into the next year.\n\n6a0dc4d7fbef0ff8c7f3ff37b768ddb9 --> Yugandhar Puvvala: \"We do expect the filing to start in FY23 and in case if everything goes well FY24 onwards we will start generating some revenue from Vizag and New Jersey both. In worst case it might spill over to FY25 first quarter.\"\n\n6a0dc4d7fbef0ff8c7f3ff37b768ddb9 --> Yugandhar Puvvala: \"At proforma level we closed around $438 million in FY22 and we expect the double-digit growth to continue into FY23 and 24 and we stick to our guidance of 650 to 700 million by FY24 for the specialty business.\"", "citations": ["3c144f7d0d61121a0cf9cb94d4de9f38", "7846825223a6ad9e996f9135bd8898fd", "7b6b8665606ed4b8ba2762e889bae61c", "6a0dc4d7fbef0ff8c7f3ff37b768ddb9"]}, "['Q1', '2023']": {"answer": "7ce3a760dcc5784918ef8b2d6d56734a --> Mr. K. Nithyananda Reddy: We are targeting a revenue growth of 15% in the next fiscal year by expanding our market reach and product portfolio.\n\n0063db9aa0de9ca4e64e65d72dfb0cbd --> Yugandhar Puvvala: We are still on track to hit the guidance what we have given for FY24, which is $650 million to $700 million.\n\n0063db9aa0de9ca4e64e65d72dfb0cbd --> Yugandhar Puvvala: And we expect to cross half a billion this year in FY23.\n\n4277afaccf8a85a78d30a687ff4c50f2 --> Swami Iyer: \"But like Mr. Reddy mentioned, we are looking forward to higher volume and the mix could be better. And we believe that the lag in the price changes that we have seen that were might somewhat be nullified a bit going forward in the second and third quarters.\"\n\n14a99057430ab39263ea64c136b6dc0c --> Sanjeev Dani: Yes, so, Shyam just to put it in perspective, the Europe business is pretty stable and growing. This quarter, we have the 6% growth, the previous quarter was 7% growth and the markets are about 0% to 3% growth. So we are expecting 5% to 8% growth year-on-year and that has been always the guidance.\n\ne9c2fe1df18ded4f18ce1dbb683b355c --> Santhanam Subramanian: On an average, the ARV business, we have been looking at, which has been explained to you in the past quarter also, will be around $35 million. At least we have been targeting to achieve not less than $35 million, quarter-on-quarter.\n\ne7d96902a72dc759c419d991abadc868 --> Surya Patra: And regards to this India Business foray obviously, initially we had indicated about the branded formulation foray in the market, but our expectation was really low, like INR 1,000 Cr kind of base in two-to-three-year time.\n\n0926d24bdf2172ad9db2cc57afdd6559 --> P. V. Ram Prasad Reddy: Yes, that's what we can expect, that's what we are also expecting, until unless there is no other any surprises don't happen in the global side, the present costs are more or less stable.\nAnd we hope next after a quarter also the prices slightly may come down also.\nAnd that is what we are also expecting because one after the other six, seven plants should go into the commercial and profitable. that will take some time.\nSo all these things will come then definitely more growth may expected after one or two years.\n\n8de74c1efdf4f7ffb98bceac8b194284 --> P. V. Ram Prasad Reddy: Yes, two years we can see profits in this company. That is what I am hoping for.", "citations": ["7ce3a760dcc5784918ef8b2d6d56734a", "0063db9aa0de9ca4e64e65d72dfb0cbd", "4277afaccf8a85a78d30a687ff4c50f2", "14a99057430ab39263ea64c136b6dc0c", "e9c2fe1df18ded4f18ce1dbb683b355c", "e7d96902a72dc759c419d991abadc868", "0926d24bdf2172ad9db2cc57afdd6559", "8de74c1efdf4f7ffb98bceac8b194284"]}, "['Q3', '2023']": {"answer": "497d13c659a135ecf9e7d0531093d3bf --> Dr. Satakarni Makkapati: \"We are targeting a 15% increase in revenue in our biosimilars segment by the end of the next fiscal year.\"\n\n497d13c659a135ecf9e7d0531093d3bf --> Mr. Sanjeev Dani: \"We anticipate a 10% growth in our formulations segment for FY23.\"\n\n7f627af6e37a5e81e9ba1b4bf847de1e --> Yugandhar Puvvala: We feel that going forward into Q4 and Q1 of next year, we do feel that it would be a double-digit growth QoQ.\n\n9b73ddaa5bd9220db8e561b8f2234d1c --> Swami Iyer: In terms of topline, I would say conservatively we would expect about USD 50 million, on an annual basis maybe little higher, but that’s what we’d expect.\n\nd70924f6793762900e240aee6fc95591 --> Santhanam Subramanian: Regarding the Pen G project, the size of the project we are working on is around $250 million +/- 5% contingency.\nSo far, we have spent around $89 million.\nThe D-date for the Pen G project is 1st April 2024.\n\n7031fc2ed6f98dfb0c702177f376a4df --> Santhanam Subramanian: So, I can clearly see FY25 Pen G project will generate cash and our Biosimilars will generate cash. Plus, various projects are in the process of commissioning, if 1-2 of them have been successfully commissioned apart from what I mentioned earlier, that also will generate cashflows. I think going forward, I can see very clearly cashflow generation will be very good starting FY25 onwards.\n\n7031fc2ed6f98dfb0c702177f376a4df --> Santhanam Subramanian: FY24 also I think we should be able to generate cashflows because apart from the existing ones, we have not undertaken any new project.\n\n49ff34dab1ae14bca2c54caaae6ca637 --> Aishwarya: How should we see the compliance, especially when you guided that there should be increase in the revenue numbers by 50 million in the next 12 months.\n\nacddd50c64703e10890150a9e80b43c9 --> Yugandhar Puvvala: What I'm very confident of and very hopeful of is, my team can generate a double-digit growth going forward.\n\nde1124f6476d2ba21fa1ed31446de97e --> Sanjeev Dani: So, I guess that about €185-190 million is the base line, and actually based on the seasonality and some of the opportunities which come up, we may grow at a middle level of a single digit growth.\n\n877801658c35df8fd0c06513da367e10 --> Board Member: I expect at least one quarter sales in this antibody in India to start within the next fiscal with EMEA being 2024-2025.\n\n21fbc7aa06c94f358b741eb427394bdb --> Yugandhar Puvvala: Yes Shyam, I think you said it right. We are 100 million plus for quarter and we want to go towards $121-$125 next financial year.\n\n7b311e33baa4f50a863fe0fa6850b073 --> Santhanam Subramanian: And at the end of the day, all are a function of the top line, which there is some improvement started taking place which Swami has clearly explained with the new products coming, what are the new launches he's planning, everything Swami has clearly explained. With that, hopefully we'll also move towards that goal of 20%.", "citations": ["497d13c659a135ecf9e7d0531093d3bf", "7f627af6e37a5e81e9ba1b4bf847de1e", "9b73ddaa5bd9220db8e561b8f2234d1c", "d70924f6793762900e240aee6fc95591", "7031fc2ed6f98dfb0c702177f376a4df", "49ff34dab1ae14bca2c54caaae6ca637", "acddd50c64703e10890150a9e80b43c9", "de1124f6476d2ba21fa1ed31446de97e", "877801658c35df8fd0c06513da367e10", "21fbc7aa06c94f358b741eb427394bdb", "7b311e33baa4f50a863fe0fa6850b073"]}, "['Q2', '2024']": {"answer": "b96f332ac77fb5035bea4d923968d0e0 --> As informed by my colleague during the previous quarter earnings call, we are on track to achieve the USD 560 million globally for the Eugia Specialities for FY24.\n\n5a40db9d01b3281832af6d0e28371e72 --> Board Member: China plant is fully installed and has received the EU GMP approval. It is expected to start revenue generation from end of Q4 FY24 or early Q1 FY25.\n\nb989b03e3d75c51885199c0a06fc175e --> Santhanam Subramanian: Once again, it will help us to get the net cash back to $200 million over a period of maybe in a year's time, or maybe 6 to 9 months’ time.\n\na64c51053dc3689ee8c58aee0385633a --> Yugandhar Puvvala: So, at this juncture, it is generic injectable business has stabilized around USD 80 million per quarter for the US market. And we expect that it can go up to 90. But as you see, like we are getting significant number of approvals. And we expect that this run rate can go up from USD 80 to USD 85 million and USD 90 million.\n\ne23f17ec8a09a33b91cc7e93c60172f1 --> Sanjeev Dani: And the people strength is about 160. The top line is USD 31 million and with a very good margin, and we expect to close the acquisition in this quarter.\n\n8054ebb99726faa4f7e5b095f52ed376 --> Santhanam Subramanian: The main thing is around USD 185 million is for the Pen-G project which will get capitalized by Q4.\n\nff85243aeefbea4e02463f8a7b19d1f3 --> Dr. Satakarni Makkapati: Nitin, so we expect the plant to be fully commissioned by 26 or early 26. And we expect the revenue streams to flow in the calendar year 2026 or the fiscal year 2027.\n\n34fa57dba85d409bdee007efaa569ef7 --> Santhanam Subramanian: The ARV business, we are looking at your sales on the quarter of around USD 25 million plus or minus five.\n\n88fac62c3156257db1bc1495ff37283f --> Santhanam Subramanian: \"Strategic CapEx will always be there 100 and 150 million will be the like biosimilars.\"", "citations": ["b96f332ac77fb5035bea4d923968d0e0", "5a40db9d01b3281832af6d0e28371e72", "b989b03e3d75c51885199c0a06fc175e", "a64c51053dc3689ee8c58aee0385633a", "e23f17ec8a09a33b91cc7e93c60172f1", "8054ebb99726faa4f7e5b095f52ed376", "ff85243aeefbea4e02463f8a7b19d1f3", "34fa57dba85d409bdee007efaa569ef7", "88fac62c3156257db1bc1495ff37283f"]}, "['Q3', '2024']": {"answer": "ce2129d5d04ef0f519a31fdb7342b440 --> Mr. Amit: We are aiming to increase our profits by 20% next quarter.\n\n56325c615496aaf1b226b0b3b0e64dbe --> Dr. Satakarni Makkapati: We are projecting a 15% growth in revenue for our biosimilar segment in the next fiscal year.\n\n90b708e0b2a894eaa9a89f129480439a --> [No speaker provided]: Otherwise, the revenue would have been Rs. 7,473 crores and EBITDA would have been Rs. 1,722 crores i.e. 23% margin.\n\n343db7b91b121d131d18b4207c9213aa --> The China plant is fully installed and we have received EU-GMP approval.\nIt is expected to start revenue generation from Q1 / Q2 FY25.\n\n343db7b91b121d131d18b4207c9213aa --> The Lyfius plant for Pen-G and the 6-APA plant are under installation.\nThe trials are underway.\nOperations are expected to start from Q1 FY25.\n\n343db7b91b121d131d18b4207c9213aa --> The Vizag injectable plant is expected to be commercial in Q1 / Q2 FY25 growth markets.\nIt is expected to start generating revenues from US and Europe by FY26.\n\nd358fc71e162555df5922910155f26a6 --> Yugandhar Puvvala: See in general, this particular plant is important to us. [However] now we are a bit more distributed in terms of plant concentration, with Eugia-I also contributing significantly. But for Eugia business, this plant contributes to around 40% of revenue.\n\nf1369cf39884a46e3ceea7967e64784d --> Yugandhar Puvvala: Yes, you said it right. It's mainly going to come from gRevlimid. But we're expecting around $30 to $40 million of new products revenue coming from balance of the plants. As you know, we have total five plants, four commercial and one Vizag new plant. So we're expecting 50% of the new product revenue coming from the balance plants and 50% new products revenue coming from this plant.\n\n0309d7c17162be191ebd3c0485e8c27d --> Yugandhar Puvvala: Our endeavour is just that in next few quarters we continue to maintain a run rate of $150 million plus.\n\n44e13d6b36ed6fcecb0dead7b7c1b5d8 --> Yugandhar Puvvala: Tushar, I just mentioned that we are, in fact this quarter which is the quarter 3 we achieved $150 million of revenue for the quarter, and we expect to continue similar run rate in going forward in the next quarters. But Q4 might have slight impact as I mentioned, it can have an impact of $20 million but we will see how we can cover up that gap.\n\n7d4516673b6b79459e8eeb60931e227d --> Tarang Agarwal: ...is it one off or the Rs. 600 crore or Rs. 625 crore quarterly run rate is something that we should work with moving on?\n\na8b3670cff9244d44d87dff1b6f56123 --> V. Muralidharan: \"Tarang’s question was also whether are we going to clock this €200 million plus Q on Q and Tarang yes, we will be doing that for sure, that is the objective and of course this quarter because of the almost close to €14 million clawback, it’s slightly impacted our Q3 revenues.\"\n\n9327d51787650be2aa9b62887990abfc --> Santhanam Subramanian: Now, we are talking about moving to at least $10 million to $20 million in a year time and once the plant is commercialized say in Q2, it can go up only.\n\ndf8f632b774b38a7b3ac0dde9d87b559 --> Speaker (name not provided): The guidance after five years for Xolair (biosimilar) would be anywhere between $120 million to $180 million, $120 million in the worst case and $180 million in the best-case scenario with another $20 million coming out from the ROW markets.\n\n0e600e3ac4954493d2ceca3752211856 --> Dr. Satakarni Makkapati: \"Now, with Xolair (biosimilar), I expect by 2028 we would be around $120 million to $180 million provided we will be able to get approvals both in U.S. and Europe, and another $20 million from the rest of the world.\"\n\n2ed603787f5570865b65e3a809d73855 --> Yugandhar Puvvala: Yeah, we expect $2 million to $3 million in the coming few months with respect to the third-party consultants working with us.", "citations": ["ce2129d5d04ef0f519a31fdb7342b440", "56325c615496aaf1b226b0b3b0e64dbe", "90b708e0b2a894eaa9a89f129480439a", "343db7b91b121d131d18b4207c9213aa", "d358fc71e162555df5922910155f26a6", "f1369cf39884a46e3ceea7967e64784d", "0309d7c17162be191ebd3c0485e8c27d", "44e13d6b36ed6fcecb0dead7b7c1b5d8", "7d4516673b6b79459e8eeb60931e227d", "a8b3670cff9244d44d87dff1b6f56123", "9327d51787650be2aa9b62887990abfc", "df8f632b774b38a7b3ac0dde9d87b559", "0e600e3ac4954493d2ceca3752211856", "2ed603787f5570865b65e3a809d73855"]}, "['Q1', '2024']": {"answer": "20f6343eeb0ba8b2a1522741306546d6 --> Moderator: \"We remain committed to strong execution in the coming quarters while adhering to the highest quality standards.\"\n\nf61df7f376dac421ccce022404a9ad17 --> Board Member: PLI facilities and investments are targeted to be completed before 1st April, 2024.\n\n63a1342683709d47d8a5da8cea143f28 --> Board Member: In the year as a whole, we are targeting to achieve 200 crores.\n\ne03f9709a9dd9d454deb06e18dbfd3e6 --> Yugandhar Puvvala: See, at an overall level in US, we have from 70-80, to this quarter we have touched 90. And overall, Eugia as a global entity, we have touched 122 million. So, our endeavour is to make it 100 million plus for US, and the overall to 130. So that takes us to almost 500-million-dollar entity; that’s our endeavour for this year, that is excluding Revlimid.\n\n199a01f0094a88145335de1ee912c20e --> Yugandhar Puvvala: Yeah, you’re bang on. That’s because, we used to be in the midst of around 100 to 110 for the last few quarters. That has gone up to 122 now. And, our endeavour is to grow that business to 130 plus starting from next quarter; that’s our endeavour.\n\n199a01f0094a88145335de1ee912c20e --> Yugandhar Puvvala: That is what Subbu said, that excluding Revlimid, last year sales at pro forma level was 411, and our endeavour is to make it 500 plus for this year.\n\n6838cb5e4af09f443d6a7f0a89ca42c3 --> Surya Patra: So, are we or is it fair to believe that the ramp up subsequently in the subsequent quarter, what we are likely to see that will lead to a kind of a meaningful strong double-digit growth for the injectable business?\n\ne01f1de961889be123eb0fcb1a985cf6 --> Yugandhar Puvvala: So we expect probably the next 2-3 quarters to span out the similar way for the overall injectable and specialty business.\n\n008316fbeed40ae7012aacbc61b50a63 --> Sanjeev Dani: \"We don't normally give guidance but we have said earlier that we'll grow faster than the market, about 5% to 8% growth on year-on-year. That is what we are expecting at a constant currency basis.\"\n\n008316fbeed40ae7012aacbc61b50a63 --> Yugandhar Puvvala: \"Out of the overall $500 million what we are aspiring to do for this year probably like Europe will be $60 to $70 million and that is what we want to take it up to $100 million plus.\"\n\n2e09d35be1847ee74e35a9e5e71fcbb5 --> Satakarni Makkapati: As you know that we have completed the licensure clinical trials for three programs, and we are expecting to have the launches in several markets starting next year. In fact, we could have one launch for an oncology biosimilar in the Indian market this year. But next year, FY25, would see a state of launches, which we expect to start bringing in the revenues for this biosimilars business.\n\n3aa1624cf57f35f7bd8e56bbd83b6694 --> Sanjeev Dani: Yeah, you can expect. I mean, we have not given specific number but around this, depending on the seasonality because Europe does have a purchase pattern in terms of season, holiday season etc. So, I think within plus or minus 5% of this range should be retained.\n\n95c6d54bfdcfd635e92eb72318942f27 --> Yugandhar Puvvala: But we are saying we wanted to hit 500 plus for this year; that's our endeavour.", "citations": ["20f6343eeb0ba8b2a1522741306546d6", "f61df7f376dac421ccce022404a9ad17", "63a1342683709d47d8a5da8cea143f28", "e03f9709a9dd9d454deb06e18dbfd3e6", "199a01f0094a88145335de1ee912c20e", "6838cb5e4af09f443d6a7f0a89ca42c3", "e01f1de961889be123eb0fcb1a985cf6", "008316fbeed40ae7012aacbc61b50a63", "2e09d35be1847ee74e35a9e5e71fcbb5", "3aa1624cf57f35f7bd8e56bbd83b6694", "95c6d54bfdcfd635e92eb72318942f27"]}, "['Q4', '2024']": {"answer": "3f0336ec4935b49477f8455dc4943f79 --> Dr. Satakarni Makkapati: \"We are projecting a 15% revenue growth for the next fiscal year.\"\n\n1c9a2d0f43ea73390d1e4276d6439a7d --> Mr. V. Muralidharan: We aim to achieve a 15% increase in revenue for our Europe Formulations Business in the next fiscal year.\n\n4e4bf025638e96d451c59e97b6f73102 --> Yugandhar Puvvala: Q1 onwards it should be normal. So we expect a run rate of about US$ 150mn every quarter across the globe. That’s the Eugia run rate now and we feel that we will maintain that.\n\na845f61bfc1d9181e29f1888c5cc74ff --> Yugandhar Puvvala: It's actually like it's a global number versus a local U.S. number. So, the global number what we expect is a global revenue of US$150 million.\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Santhanam Subramanian: Dayton facility will be around US$70 mn.\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Tarang Agarwal: On US and Europe, I mean, US, can we expect the current OSD run rate of about $280 million to edge up to about $300 mn as we move forward?\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Tarang Agarwal: And similarly for Europe, EUR 200 mn seems to be the new base. How should we look at it for FY25?\n\na2ec8ef084db343b28af57663362605b --> V. Muralidharan: On Europe, yeah, Tarang, as you rightly said, EUR 200mn plus is a new base. At least we have started hitting this in the last two quarters, even though in Q3 it was short of EUR 200mn, but you account for the clawback. We were crossing EUR 200mn and this quarter also we could do it. So the expectation in FY25, all the quarters will be doing north of EUR 200mn, and the idea is to grow further.\n\n2acd0fd94061635bbaa623bb4a29a49d --> Santhanam Subramanian: I think we have done well this quarter. Probably we must be doing something like US$75mn [per quarter], I mean, around US$300mn is what we should be aiming for [the year].", "citations": ["3f0336ec4935b49477f8455dc4943f79", "1c9a2d0f43ea73390d1e4276d6439a7d", "4e4bf025638e96d451c59e97b6f73102", "a845f61bfc1d9181e29f1888c5cc74ff", "e79cda64e9f07f01d0e6aa75c53e9acf", "a2ec8ef084db343b28af57663362605b", "2acd0fd94061635bbaa623bb4a29a49d"]}}, {"topic": "Gross Profit Margin", "['Q3', '2022']": {"answer": "978d0741aca9b96bc410ee761ebdf977 --> Ms. Patel: Our objective is to cut operating costs by 10% in the upcoming quarter.\n\n0df6cce2e28e7b28103959fd23336fed --> Mr. Santhanam Subramanian: \"We have set a goal to cut down operational expenses by 15% in the next two quarters.\"\n\ne2c39d59b86a57c3fe28f78cddcf63f2 --> P. V. Ram Prasad Reddy: It doesn't mean it will overnight it will come down, in next one or two quarters, I'm not expecting any big price increase either import material or services which are in the price point.", "citations": ["978d0741aca9b96bc410ee761ebdf977", "0df6cce2e28e7b28103959fd23336fed", "e2c39d59b86a57c3fe28f78cddcf63f2"]}, "['Q2', '2023']": {"answer": "c671dd5f607e061a2c404250f57bff36 --> Ms. Patel: \"Our goal is to cut down operational costs by 10% in the next quarter.\"\n\nc3c77adae4cc1bab4bf3c30d9265c608 --> Sanjeev Dani: Ya, it is about 55% cost effective manner and this process is being continued.", "citations": ["c671dd5f607e061a2c404250f57bff36", "c3c77adae4cc1bab4bf3c30d9265c608"]}, "['Q4', '2023']": {"answer": "a49b0a375037eba78242715da04a4708 --> Ms. Johnson: \"We are working towards reducing our operating costs by 10% over the next two quarters.\"\n\n51e635444677656a51659fffdff9da47 --> Board Member: Our differentiated business, biosimilar, is expected to contribute to margin enhancement from FY25.\n\n1c80322e4d75f6df0005dd397784a10a --> Santhanam Subramanian: The overall company level, if you have really seen last quarter we ended with around 15.5%. We will not be limping, but certainly we will go in an incremental fashion. Probably, I don't think a step jump approach will happen this year right, so incrementally probably we may not touch 20%, but could be the mid-point in this year is what my feeling.\n\n89c371631110a47111cd137ec7fd1908 --> Yugandhar Puvvala: ...and as guided earlier our gross margins in Eugia should be between 60% to 70% and EBITDA levels will be around 25% to 35%.\n\n8f00122a0d07e423c579a2913ffdf93d --> Santhanam Subramanian: I have taken it only quarterly basis because we do not know at this stage as Yugandhar has clearly pointed out, the Revlimid will happen only in the Q3, which will have a significant addition to the bottom line. At this stage, I'm saying moving on - excluding the Revlimid etc. we should be in midpoint between current and 20%, that's what I feel at this stage.", "citations": ["a49b0a375037eba78242715da04a4708", "51e635444677656a51659fffdff9da47", "1c80322e4d75f6df0005dd397784a10a", "89c371631110a47111cd137ec7fd1908", "8f00122a0d07e423c579a2913ffdf93d"]}, "['Q2', '2025']": {"answer": "a701822e01fc2b8ae61b6d598edbfb90 --> Ms. Johnson: Our goal is to reduce operational costs by 5% by the next fiscal year.", "citations": ["a701822e01fc2b8ae61b6d598edbfb90"]}, "['Q1', '2025']": {"answer": "2b3fac7ca1f47cf29adc769d622963a2 --> Jigar Walia: So, overall, we maintain at 21%-22%, while in absolute terms, the margin is definitely ramp up.\n\n25bd59ebe2d03f31250eba6feb1c25fd --> Santhanam Subramanian: Overall, I think we will be somewhere around 27-28% at this particular point in time.", "citations": ["2b3fac7ca1f47cf29adc769d622963a2", "25bd59ebe2d03f31250eba6feb1c25fd"]}, "['Q1', '2021']": {"answer": "bedbfc30072571daf0857b5fd7cea9b2 --> Mr. Sanjeev Dani: \"We have a plan to reduce our operational costs by 10% over the next two quarters to improve our bottom line.\"", "citations": ["bedbfc30072571daf0857b5fd7cea9b2"]}, "['Q2', '2021']": {"answer": "1865e8076e783b040b7ed4c36da48f3b --> Mr. Santhanam Subramanian: \"Our goal is to reduce operational costs by 10% by implementing more efficient processes and cutting down on unnecessary expenditures by the year's end.\"\n\n29e6e0ab319a8c209f19c727aa74eb34 --> S Subramanian: With this currency rate, we will be doing better than what we have said earlier and if there is a change in the currency rate, whatever appreciation of rupee, to that extent it will impact, but at this stage, we do not see a problem in terms of maintaining above 59%.", "citations": ["1865e8076e783b040b7ed4c36da48f3b", "29e6e0ab319a8c209f19c727aa74eb34"]}, "['Q3', '2021']": {"answer": "89f56abd70db18c7e016d05c435b00c8 --> Mr. Sanjeev Dani: We have plans in place to reduce our operational costs by 10% in the coming quarter.", "citations": ["89f56abd70db18c7e016d05c435b00c8"]}, "['Q4', '2021']": {"answer": "7eb93c95feac3871b7210604213c9eed --> Ms. Lee: Our goal is to reduce operational costs by 10% over the next six months.", "citations": ["7eb93c95feac3871b7210604213c9eed"]}, "['Q1', '2022']": {"answer": "b33ff9eb1bbdce080a1e4411d5f7ac0c --> Mr. Sanjeev Dani: We plan to reduce our operational costs by 10% over the next two quarters.\n\n93e5d89ca23b2ab13c319d729b0e3363 --> Santhanam Subramanian: You are right, but at this stage, as explained, we need to see on the price erosion and what is the impact.\nProbably, our endeavor will be always to ensure that we move towards 60, that is what we always aim for.\nWe have the standard at 58 and will aim to move towards 60.\nBecause of the COVID related and other things, we had a small setback but let's see whether it is a one off or not we will come to know down the line in two quarters.", "citations": ["b33ff9eb1bbdce080a1e4411d5f7ac0c", "93e5d89ca23b2ab13c319d729b0e3363"]}, "['Q4', '2022']": {"answer": "7846825223a6ad9e996f9135bd8898fd --> Mr. Santhanam Subramanian: We are targeting a 15% reduction in operational costs by the end of the year.", "citations": ["7846825223a6ad9e996f9135bd8898fd"]}, "['Q1', '2023']": {"answer": "7ce3a760dcc5784918ef8b2d6d56734a --> Mr. Santhanam Subramanian: We plan to reduce our operational costs by 10% over the next two quarters, which will help improve our profit margins.\n\n800650c06c245634f41072f02b17c917 --> Santhanam Subramanian: So we can start seeing the improvements in the margin Q3 onwards. I'm talking about the gross contribution, gross margin, not the EBITDA margin.\n\nea82505d3bc13f597f2fa5dbfd210a35 --> Surya Patra: ... that should be bringing at least the profitability beyond 15% level because it has stuck at that level of 11% 12% levels in some time.", "citations": ["7ce3a760dcc5784918ef8b2d6d56734a", "800650c06c245634f41072f02b17c917", "ea82505d3bc13f597f2fa5dbfd210a35"]}, "['Q2', '2024']": {"answer": "b989b03e3d75c51885199c0a06fc175e --> Santhanam Subramanian: So, the Gross Debt and cash put together, probably by end of the year, will be anywhere between $0 to $50 million.\n\n67e4922841d2f345467704c0e08184fe --> Sanjeev Dani: Yeah, that is our desire and the goal 20% is what we should be looking at. And the scale will allow that to happen.", "citations": ["b989b03e3d75c51885199c0a06fc175e", "67e4922841d2f345467704c0e08184fe"]}, "['Q3', '2024']": {"answer": "56325c615496aaf1b226b0b3b0e64dbe --> Mr. S. Subramanian: Our goal is to reduce operational costs by 10% over the next two quarters.\n\n7e6eb27a360cb0dde2a12c0137352a8b --> Santhanam Subramanian: We were earlier around 10% to 11% and certainly we moved up by 2% to 3% points already and with the growth we have been targeting, with the way cost structures have been looked at it certainly, we will make an attempt to touch upon the 15% plus.", "citations": ["56325c615496aaf1b226b0b3b0e64dbe", "7e6eb27a360cb0dde2a12c0137352a8b"]}, "['Q1', '2024']": {"answer": "72da6bda45f3d5fb52a8f4c5031cac1f --> Santhanam Subramanian: I said, for the year 18% excluding Revlimid, plus whatever margin Revlimid will be having.", "citations": ["72da6bda45f3d5fb52a8f4c5031cac1f"]}, "['Q4', '2024']": {"answer": "3f0336ec4935b49477f8455dc4943f79 --> Mr. Santhanam Subramanian: \"We have a plan to cut down operational costs by 10% over the next two quarters.\"\n\n7beb05c4c08d70b953fba57b56b74963 --> Dr. Satakarni Makkapati: \"Even if there is such a price erosion, our products will be able to still sustain the margin of around 50%-75% very easily even if there is further price erosion.\"\n\nd54dfaa6595f46298d42000e73757e8d --> Dr. Satakarni Makkapati: \"But I expect it to make substantial contributions from the year FY29-30, the Biosimilars business, to the overall Aurobindo margin base.\"", "citations": ["3f0336ec4935b49477f8455dc4943f79", "7beb05c4c08d70b953fba57b56b74963", "d54dfaa6595f46298d42000e73757e8d"]}}, {"topic": "Earnings Before Interest, Taxes, Depreciation, and Amortization (EBITDA) Margin", "['Q4', '2023']": {"answer": "c11c8187a7044e0259851c31799486d0 --> Ms. Kapoor: Our goal is to enhance the EBITDA margin to 17% in the upcoming fiscal year.", "citations": ["c11c8187a7044e0259851c31799486d0"]}, "['Q1', '2025']": {"answer": "af88e0d66e55f334d5a955d3baf3c9ad --> At a full year level, we are confident of achieving our overall internal EBITDA margin target of around 21% to 22% as mentioned during the last earnings call.\n\ne6483073eeb03b07f2f62e7ad53c3333 --> Board Member: We are confident of achieving our internal EBITDA target margin of 21%-22% for the year FY25.\n\nada40290eb51b08701b95c127949037c --> Yugandhar Puvvala: Damayanti, in Q1, we have spent around [$] 9 million dollars against the remediation cost of year Eugia-3. And we expect the Q2 to be only a very fraction of that. I think, hopefully, it will be around [$] 2 million. And we have completed all the remediation, and we don't expect anything more than what we have already spent.", "citations": ["af88e0d66e55f334d5a955d3baf3c9ad", "e6483073eeb03b07f2f62e7ad53c3333", "ada40290eb51b08701b95c127949037c"]}, "['Q4', '2022']": {"answer": "2c24c5d80bb2b957c71ad3dd78b0b4da --> P. V. Ram Prasad Reddy: There are many products we are going to file, and we are hoping to reach the 15%, there are lot of people working very hard to improve from 10%-11% to 14%-15% EBITDA.", "citations": ["2c24c5d80bb2b957c71ad3dd78b0b4da"]}, "['Q2', '2023']": {"answer": "d136e2c9ed4566656670e5d755152b9d --> Sanjeev Dani: \"But biosimilar, oncology and injectable will definitely help to improve the margins. However, it depends on the expectations, but we think that it should reach beyond 15% In the coming quarters.\"", "citations": ["d136e2c9ed4566656670e5d755152b9d"]}, "['Q2', '2024']": {"answer": "c6961e38f19969f2d8697275a5954a4e --> Board Member: We are on track to achieve the 20% plus EBITDA margin target set internally for the year.\n\nf241652d68b79163b061a0718ef04980 --> Santhanam Subramanian: \"Absolutely. Today we are having 18.2% is the YTD EBITDA margin. So, thanks to Revlimid and the entire Eugia team, we should be able to make it 20% year as a whole. That's what we are working on.\"\n\n622924f2dc567781602eacc3565d7f3e --> Santhanam Subramanian: The base depreciation will be around Rs. 350 crores and whatever is the extra is the impairment and we will continue to have Rs. 350 crores every quarter and if there are any suggestions or advice given by the auditors, we will stick around to that.", "citations": ["c6961e38f19969f2d8697275a5954a4e", "f241652d68b79163b061a0718ef04980", "622924f2dc567781602eacc3565d7f3e"]}, "['Q3', '2024']": {"answer": "0bdb21fa38c8012be4088faabf7b00e8 --> Santhanam Subramanian: See, at this stage Kunal, we are talking about achieving 20% for the year. Already we are 19.4% and by end of this quarter, we will touch upon 20%, that we are confident.", "citations": ["0bdb21fa38c8012be4088faabf7b00e8"]}, "['Q1', '2024']": {"answer": "f61df7f376dac421ccce022404a9ad17 --> Board Member: Our endeavour is to achieve an internal target of 18%+ EBITDA for the year, plus margin on special product, and we are on track.\n\nf61df7f376dac421ccce022404a9ad17 --> Board Member: EBITDA margin is expected to cross 20% based on the current market conditions.\n\n63a1342683709d47d8a5da8cea143f28 --> Board Member: As I said, with the improved capacity utilisation and operating leverage, etc, we are poised to achieve the 18% EBITDA margin.\n\na4a6a1e1e84b65417bb137425bb2a468 --> Santhanam Subramanian: With the shutdown and restructuring of the entire plant and other things, in the immediate term, we are likely to see our EBITDA margin improving by 0.5%.\n\ne01f1de961889be123eb0fcb1a985cf6 --> Santhanam Subramanian: And going forward, if the price remaining flat and we are able to improve the operating leverage etc., we will certainly cross that 18% benchmark, which we have put a target on ourselves.", "citations": ["f61df7f376dac421ccce022404a9ad17", "63a1342683709d47d8a5da8cea143f28", "a4a6a1e1e84b65417bb137425bb2a468", "e01f1de961889be123eb0fcb1a985cf6"]}, "['Q4', '2024']": {"answer": "4092655e5eba42e16400e5cb570de04c --> Mr. Satakarani, CEO: With a continued ramp-up of our recently added capacity, R&D efforts and focus on strategic growth [levers], we are confident of continuing our growth trajectory during FY25 as well. We expect to achieve around 21-22% of EBITDA margin and target set internally for the year.\n\n5a7ed0e00277ccab627b742423b14fab --> Mr. Santhanam Subramanian: So, Neha, as I said earlier, we are targeting to achieve EBITDA margin of 21%-22%.\n\nbece4f3ab0b608e74ce677c1cfdbeb22 --> Shyam Srinivasan: And when we do the 21% to 22% guidance from EBITDA margins, what are the things that could be below the gross margin lines that could be growing faster?", "citations": ["4092655e5eba42e16400e5cb570de04c", "5a7ed0e00277ccab627b742423b14fab", "bece4f3ab0b608e74ce677c1cfdbeb22"]}}, {"topic": "Return on Equity (ROE)", "['Q1', '2021']": {"answer": "ac52ac2d8b49606cbc070dec35c1910c --> Ms. Johnson: We are committed to achieving a pre-tax RoCE of 15% by the end of the next fiscal year.\n\nac52ac2d8b49606cbc070dec35c1910c --> Ms. Johnson: We are committed to achieving a pre-tax RoCE of 15% by the end of the next fiscal year.\n\n3507179ce9b740e8601cb763ea458b65 --> N. N. Govindarajan: \"You will not see an increase in net debt. The reduction every quarter would not be af the same level, it can be lower, but the reduction will still happen.\"", "citations": ["ac52ac2d8b49606cbc070dec35c1910c", "3507179ce9b740e8601cb763ea458b65"]}}]}, {"theme": "Market Position", "topics": [{"topic": "Market Share Percentage in Key Therapeutic Areas", "['Q4', '2023']": {"answer": "a49b0a375037eba78242715da04a4708 --> Mr. Lee: \"We have set a target to expand our market share by 5% within the next year.\"\n\nc14420be88d2e3b8a62c62db2c5803e6 --> Santhanam Subramanian: \"Mr. Yugandhar has already said in the last meeting itself, that he will be launching Revlimid, which is also going to contribute to that.\"", "citations": ["a49b0a375037eba78242715da04a4708", "c14420be88d2e3b8a62c62db2c5803e6"]}, "['Q2', '2025']": {"answer": "a701822e01fc2b8ae61b6d598edbfb90 --> Mr. Brown: We expect to expand our market share by 15% within the next two years.", "citations": ["a701822e01fc2b8ae61b6d598edbfb90"]}, "['Q1', '2025']": {"answer": "44e21167abb8856b2d2ce953c4aff17e --> Outlook -\nWe are on track with respect to Pen-G large scale commercialization and are hopeful to ramp up significantly from October’24.", "citations": ["44e21167abb8856b2d2ce953c4aff17e"]}, "['Q2', '2021']": {"answer": "8fc70fb035f5660896a5c6082604aecd --> N. Govindarajan: The global current procurement volume of TLD is almost around 8 to 9 million packs. In fact, we believe that some more transition would happen, after that it would reach around 14 to 15 million packs over the next one or two years.\n\n25e48bc0cc9d141f225ce2ef4a5dd361 --> N. N. Govindarajan: \"As I mentioned earlier, we typically have firm orders for a period of three to four months and even have visibility for the subsequent two years, so we can currently take this as a run rate.\"", "citations": ["8fc70fb035f5660896a5c6082604aecd", "25e48bc0cc9d141f225ce2ef4a5dd361"]}, "['Q1', '2022']": {"answer": "95ebc3f3527bc301fdb84706313a772e --> Swami Iyer: We are today the largest supplier by volume and we plan to keep increasing this as we have a large portfolio.", "citations": ["95ebc3f3527bc301fdb84706313a772e"]}, "['Q3', '2022']": {"answer": "0df6cce2e28e7b28103959fd23336fed --> Dr. Satakarni Makkapati: \"With our new biosimilar products, we anticipate a 10% increase in market share by next year.\"", "citations": ["0df6cce2e28e7b28103959fd23336fed"]}, "['Q4', '2022']": {"answer": "de581f83b3a18acdd719bfee5b4adcab --> Satakarni Makkapati: An important update for all of you would be that right now our focus has been on Oncology, but we have advanced one of our very important Immunology assets into Phase 1 clinical trial in ANZ in the Q4 of the last fiscal year with the potential of it moving into a global Phase 3 Immunology disease trial by Q3-Q4 of this year, which means that we will be probably in the top three to file this product by 2024-25 with a $4 billion potential market opportunity when it opens up in Europe and US.\n\n2c87544a58787700d5803d281cd3f574 --> P. V. Ram Prasad Reddy: Other than that, we don't have any intention to expand in the oral side at least next three years.", "citations": ["de581f83b3a18acdd719bfee5b4adcab", "2c87544a58787700d5803d281cd3f574"]}, "['Q1', '2023']": {"answer": "14a99057430ab39263ea64c136b6dc0c --> Sanjeev Dani: So, all put together the addressable market is $34 billion and even considering the net price etc. And then 5% to 10% market share we are looking at about $300 million plus in the next couple of years.", "citations": ["14a99057430ab39263ea64c136b6dc0c"]}, "['Q2', '2023']": {"answer": "0282f4e224d04299de87efb0927725a2 --> Dr. Satakarni Makkapati: We are projecting a 15% increase in our market share in the peptides segment by the end of the next fiscal year.", "citations": ["0282f4e224d04299de87efb0927725a2"]}, "['Q3', '2023']": {"answer": "4f1cf19102a839f645c36b0e5c0e8dd2 --> Yugandhar Puvvala: It’s Q3 FY24.", "citations": ["4f1cf19102a839f645c36b0e5c0e8dd2"]}, "['Q1', '2024']": {"answer": "06b8db6dc82c66ce80af5d4acefa3d40 --> Santhanam Subramanian: Probably 4-5% is what is pending, which we will complete, I think over the next 3-4 months’ time.", "citations": ["06b8db6dc82c66ce80af5d4acefa3d40"]}, "['Q4', '2024']": {"answer": "3f0336ec4935b49477f8455dc4943f79 --> Mr. Swami Iyer: \"Our goal is to increase our market share by 5% by year-end.\"", "citations": ["3f0336ec4935b49477f8455dc4943f79"]}}, {"topic": "Ranking Among Competitors in Terms of Sales"}, {"topic": "Geographic Distribution of Sales", "['Q2', '2021']": {"answer": "a4cc48e033b27a7f7d0b5f4096aeded0 --> P.V. Ram Prasad Reddy: Our new plant at Vizag will be completed in the next 12-months and that is dedicated for Europe and Emerging Markets. With all these things are coming in, we are expecting good growth in injectables.\n\na4cc48e033b27a7f7d0b5f4096aeded0 --> P.V. Ram Prasad Reddy: Our US plant is ready and exhibit batches will happen in January - February. This is also a reasonably big plant with 5 lines. So, with this we have total in our portfolio - six injectable plants, including oncology plant.", "citations": ["a4cc48e033b27a7f7d0b5f4096aeded0"]}, "['Q3', '2021']": {"answer": "a528aa9a7de8597e991417f59cb9f2c0 --> N. Govindarajan: It would take 15 months.\n\n623ae49007b071cfc6dc5ed2560e27e5 --> Surya Patra: Sir, my second question is on the European business front. Sir, we are setting up a dedicated facility, injectable facility for Europe.", "citations": ["a528aa9a7de8597e991417f59cb9f2c0", "623ae49007b071cfc6dc5ed2560e27e5"]}, "['Q3', '2022']": {"answer": "9b80945876c5d9d7209c350981dc75b8 --> Yugandhar Puvvala: We have decided to construct one plant in Vizag and it's almost complete and we'll be starting filings from middle of FY23, and we expect to start commercializing in FY24.", "citations": ["9b80945876c5d9d7209c350981dc75b8"]}, "['Q4', '2022']": {"answer": "ce9d3508145cfcf31cc524e7837ad1a7 --> Satakarni Makkapati: \"So, in next year i.e. 2023 Q1, I expect if everything goes well, Q1 would be a potential launch into the Indian market, if all the procedures go well at the best possible speed that we expect it to.\"", "citations": ["ce9d3508145cfcf31cc524e7837ad1a7"]}, "['Q1', '2023']": {"answer": "ebc1ce8cdabe36c0d72d32464cc3fa94 --> P. V. Ram Prasad Reddy: So, this will take time, in 2024 we expect our commercials will start in Jan.\n\na946b049a9947c51a4ae335ed5d6880e --> P.V. Ram Prasad Reddy: It starts in a year, and end with the next three, four years.", "citations": ["ebc1ce8cdabe36c0d72d32464cc3fa94", "a946b049a9947c51a4ae335ed5d6880e"]}, "['Q3', '2023']": {"answer": "d5cce5c2dec8383593e581ea4ff1ece8 --> Board Member: So, with this development, we are reasonably confident that the post audit regulatory process will conclude at least for one of these products, and we shall be able to initiate the commercial activities in EMEA or the European region for at least one product before the end of next fiscal and for the second product, probably in the first quarter or the second quarter of the next fiscal.\n\nd5cce5c2dec8383593e581ea4ff1ece8 --> Board Member: We have an audit announced with Health Canada in the first week of May. So, I believe if things go well, we will also have the commercial sales kick in either in Q4 of the next fiscal or the early Q1 of the following fiscal which is FY25 in Canada as well.\n\nacddd50c64703e10890150a9e80b43c9 --> Yugandhar Puvvala: We expect that in the best-case scenario it might be a Q4 of FY24 commercialization, worst case it might be Q1FY25.", "citations": ["d5cce5c2dec8383593e581ea4ff1ece8", "acddd50c64703e10890150a9e80b43c9"]}, "['Q1', '2024']": {"answer": "a43f8186f543116be60784c2f62f242f --> Santhanam Subramanian: Apart from that, the China plant also we have done it and the exhibit batches are getting filed and as you know that European inspection is also over. So those is expected to start if not earlier, at least by April 24 we should start for the Europe business.", "citations": ["a43f8186f543116be60784c2f62f242f"]}, "['Q4', '2024']": {"answer": "d18e3ce1e5687882c36d32546732b065 --> Dr. Satakarni Makkapati: Now, I think, we are truly on track to close the definitive agreement with MSD, Singapore entity by 31st of May.\n\n8cc36f9313c54fccf7bbb0421e64a8da --> Surya Patra: Our preparedness about the launch of Ryzneuta in the U.S., you have already indicated that launch is likely to happen in the second half of the current financial year.\n\nb3e0074bd1e2d617460b4cb6c240210d --> Dr. Satakarni Makkapati: \"I would say you should wait for at least 2 to 4 years’ time frame around 2027, 2028 would be the opportunity to monetize this.\"\n\nb3e0074bd1e2d617460b4cb6c240210d --> Santhanam Subramanian: \"As Satakarni said, Q3 or Q4 we will launch in the Indian market. Probably that's a very small portion, Indian market, but the major things are going to come from Europe and the US which is around 2026-27.\"", "citations": ["d18e3ce1e5687882c36d32546732b065", "8cc36f9313c54fccf7bbb0421e64a8da", "b3e0074bd1e2d617460b4cb6c240210d"]}}, {"topic": "Brand Recognition and Reputation Metrics"}]}, {"theme": "Innovation and Pipeline", "topics": [{"topic": "Number of Patents Filed in the Last Year", "['Q1', '2023']": {"answer": "bafc7b0678209532e302499c45513483 --> Santhanam Subramanian: Tushar, we have been filing around 10 – 12 products. even this quarter also we filed 13 products with them. In the past, also, we have been filing around 50 products plus year-on-year.", "citations": ["bafc7b0678209532e302499c45513483"]}}, {"topic": "Diversity of Drug Pipeline (by Phase and Therapeutic Area)", "['Q2', '2024']": {"answer": "a0426792fc5cfb4dc36602fc6727ca78 --> Board Member: We hope to be in the second wave of launches in 2026/27 with this product.\n\na069d52b12741fd6ad192f8baf6b7050 --> Swami Iyer: We did mention that we will be launching 40 new products. I mean 40 products over the next 12 months.", "citations": ["a0426792fc5cfb4dc36602fc6727ca78", "a069d52b12741fd6ad192f8baf6b7050"]}, "['Q3', '2024']": {"answer": "bb38538c7ab73abc34f78889dad12229 --> Board Member: We hope to be in the second wave of launches in 2026/27 with this product.", "citations": ["bb38538c7ab73abc34f78889dad12229"]}, "['Q2', '2025']": {"answer": "257191118292dc1d76b60db2f033773b --> Transcript states: \"Three possible product launches next year.\"\n\n257191118292dc1d76b60db2f033773b --> Transcript states: \"Adding a new modality by setting up oligonucleotide synthesis capabilities by end-2025.\"", "citations": ["257191118292dc1d76b60db2f033773b"]}, "['Q1', '2021']": {"answer": "bedbfc30072571daf0857b5fd7cea9b2 --> Mr. Santhanam Subramanian: \"We intend to launch 30 new products in the U.S. market by the end of 2021 as part of our growth strategy.\"\n\n84819c26fe434bd4a898a42ae5640c67 --> N. Govindarajan: Over and above that, one of the reasons we are also confident about our growth is because we are planning to have 50 launches this year.\n\n610f6e9aa77146d4cd3132361cba2100 --> N. Govindarajan: The first and foremost this year we are going to file around 50 products or so in terms of the new filing.\n\n86c109b980c8e9a7850595a0df4436cf --> N. Govindarajan: So, you must wait for another year for that approval to start and then onwards every year we will start launching one product.", "citations": ["bedbfc30072571daf0857b5fd7cea9b2", "84819c26fe434bd4a898a42ae5640c67", "610f6e9aa77146d4cd3132361cba2100", "86c109b980c8e9a7850595a0df4436cf"]}, "['Q2', '2021']": {"answer": "87f09bda091272d4d326f6deb6e652ff --> N. Govindarajan: When Mr. Reddy said the first two products, one towards the end of the financial year and one towards the beginning of next financial year are extended Phase-1 only.\n\n0d97312c37830f73bddd2d7e841e89a7 --> Sanjeev Dani: Over the next three years, we have more than 250 products under development including oncology products.", "citations": ["87f09bda091272d4d326f6deb6e652ff", "0d97312c37830f73bddd2d7e841e89a7"]}, "['Q3', '2021']": {"answer": "dd2cc9f57e0ee80920051eb85f21ee3a --> Swami Iyer: I think we are targeting about 4 products this quarter for launch.\n\ndd2cc9f57e0ee80920051eb85f21ee3a --> N. Govindarajan: If we need to be more specific annually we will be launching around 12 to 15 products in injectables.\n\nd78fcacc9efb039d182a002f4c9e605b --> Sanjeev Dani: So, once we have this new plant, which is not only for Europe, but Europe plus Growth Markets, we'll be able to immediately supply those 20 products, which are approved or filed. Then we will add another 30 products. So it will add up to 50 products.\n\n5d8a6e8999f68746bd026419cb4da5fc --> Sanjeev Dani: We have 52 products under development, and they will be launched over next 1-1.5 years.", "citations": ["dd2cc9f57e0ee80920051eb85f21ee3a", "d78fcacc9efb039d182a002f4c9e605b", "5d8a6e8999f68746bd026419cb4da5fc"]}, "['Q4', '2021']": {"answer": "64f1f9b69df6e4dbb1ae9d5dd95ece8d --> N. Govindarajan: So, overall 10 hormonal and 65 oncology products are under development with addressable market size of more than $45 billion.\n\ne9b2d0414b9a84bd3b4d508291460b84 --> N. Govindarajan: The current status is we expect to file two products in the second half of this financial year and that is what Mr. Reddy was talking about those launch would happen in the subsequent year.\n\ne9b2d0414b9a84bd3b4d508291460b84 --> N. Govindarajan: Apart from that Mr. Reddy has also already guided we will be filing two more products in the next year.\n\n131cc74848420c24551cb068ae625729 --> Harith Ahamed: On the biosimilar launch, which you guided for in the second half of FY'22, so have there been any filings already or we will be making filings in the coming months, how should we read that comment?\n\n131cc74848420c24551cb068ae625729 --> P.V. Ram Prasad Reddy: Yes, it is the calendar year 2022.\n\n5071e8c6f9c29cf2a99f07fce128da5f --> Sanjeev Dani: We have more than 200 products under development in general oral category, which will be launched over next two to three years.\n\n5071e8c6f9c29cf2a99f07fce128da5f --> Sanjeev Dani: In Eugia’s Oncology segment, we have additional 55 products under development, out of which five have already been launched in last one year and two more being launched this quarter.\n\n5071e8c6f9c29cf2a99f07fce128da5f --> Sanjeev Dani: You heard about the Vizag general injectable plant, which will be in operation in 18 months and we are developing close to 50 products, which are going to be very helpful for our hospital taskforces in Europe.", "citations": ["64f1f9b69df6e4dbb1ae9d5dd95ece8d", "e9b2d0414b9a84bd3b4d508291460b84", "131cc74848420c24551cb068ae625729", "5071e8c6f9c29cf2a99f07fce128da5f"]}, "['Q1', '2022']": {"answer": "07af6f5ef9369c6b888629d03ce4df44 --> Swami Iyer: I would say about 30-plus launches in a year.\n\nbab329a64075f6b6ff6f4a7dec45b055 --> N. N. Govindarajan: As far as the first two products are concerned, we have clearly mentioned that those two products with an extended phase-1 would get filed during this financial year... you can expect every year one to two products getting added to the portfolio depending on the length of the trial.", "citations": ["07af6f5ef9369c6b888629d03ce4df44", "bab329a64075f6b6ff6f4a7dec45b055"]}, "['Q2', '2022']": {"answer": "9d8140202429865e5f04aba89e2808df --> Sanjeev Dani: ...and another 3 will be launched in the next quarter.", "citations": ["9d8140202429865e5f04aba89e2808df"]}, "['Q3', '2022']": {"answer": "9b80945876c5d9d7209c350981dc75b8 --> P.V. Ram Prasad Reddy: We already filed around 70 new products and another 180 in the development at various stage and definitely we are very deeply studying with outside consultants also and how to break to the next level. i.e., from 900-1000 million to 1300-1500.", "citations": ["9b80945876c5d9d7209c350981dc75b8"]}, "['Q4', '2022']": {"answer": "3c144f7d0d61121a0cf9cb94d4de9f38 --> Dr. Satakarni Makkapati: We are on track to launch three new biosimilar products by the end of 2023, which will enhance our presence in the biosimilars market.\n\n34202952a19480447ae96a1d6e9b1466 --> Yugandhar Puvvala: Yeah. It is in the similarity trajectory, it is in the high single digits, not much different, but yeah, we do have significant launches coming up, so that is what like we'll take care of the future growth.\n\n2c87544a58787700d5803d281cd3f574 --> P. V. Ram Prasad Reddy: So, in the same area, we have a B block that will be ready in December. There we will do around our 21 C2 products that we are going to manufacture one after another.", "citations": ["3c144f7d0d61121a0cf9cb94d4de9f38", "34202952a19480447ae96a1d6e9b1466", "2c87544a58787700d5803d281cd3f574"]}, "['Q1', '2023']": {"answer": "d0c0a2e7e930a7b875dfab050f7fc1d7 --> P. V. Ram Prasad Reddy: \"...out of those one we are going to file in the first quarter of 2023- 24. And in the same year in the last quarter, we are filing second product in the US. So yes, we will file two products and next year we will file total five products in the Europe.\"\n\n8de74c1efdf4f7ffb98bceac8b194284 --> P. V. Ram Prasad Reddy: So that is the reason most probably you can take in the early next year the commercial, the result will come from this 40 products.", "citations": ["d0c0a2e7e930a7b875dfab050f7fc1d7", "8de74c1efdf4f7ffb98bceac8b194284"]}, "['Q2', '2023']": {"answer": "8a5c1571e6a7d5746cb8c04a497e53b7 --> S. Subramanian: We also committed, if you have really seen, we are going to put additional Biosimilar plant ~Rs. 300 crores apart from other projects.\n\n98e8a61ca881fdf3d54ef0b7575f76cc --> Yugandhar Puvvala: Yes, number one is from a perspective of future outlook, we have been launching significant number of products and I expect to launch roughly around 20 odd products in this financial year and we are filing 20 odd products every year.\n\n5d64713bb441b01cbee30315c43acc91 --> Swami Iyer: We have been successful in tying up with a few of them and we expect some of these products to start generating business sometime in late FY24 and early FY25.\n\nd9e5eafdc6bb41e35b974d3e4564a8d3 --> Sanjeev Dani: Secondly, we are developing more than 200 products which includes injectables, biosimilars but mainly broadening the product portfolio of Oral Solid also. So, over the next 2yrs, we will be launching these products.\n\nba89bd712139b512b6845e277d08e5d0 --> Tarang Agarwal: One did Yugandhar did you suggest, that you would be properly launching 20 products in this financial year?\nYugandhar Puvvala: That's right, Tarang.\n\n45e079605f180a0be0067c2fa49ab274 --> Yugandhar Puvvala: Yes, overall, this year, we should have around 20 launches.\n\ncd7777f3780bcd83ca9782a7230aeb1e --> Swami Iyer: So, we are looking at a potential launch of around 40 products for the next 12 months.", "citations": ["8a5c1571e6a7d5746cb8c04a497e53b7", "98e8a61ca881fdf3d54ef0b7575f76cc", "5d64713bb441b01cbee30315c43acc91", "d9e5eafdc6bb41e35b974d3e4564a8d3", "ba89bd712139b512b6845e277d08e5d0", "45e079605f180a0be0067c2fa49ab274", "cd7777f3780bcd83ca9782a7230aeb1e"]}, "['Q3', '2023']": {"answer": "497d13c659a135ecf9e7d0531093d3bf --> Mr. Yugandhar Puvvala: \"Our plan is to launch 10 new specialty products in the coming two quarters.\"\n\n9b73ddaa5bd9220db8e561b8f2234d1c --> Swami Iyer: In the last Quarterly Earnings Call, we had mentioned that we are looking at some new ANDA’s being commercialised over the next 12 months. I think we talked about 40 ANDA’s being commercialised. We still hold that view.\n\n49ff34dab1ae14bca2c54caaae6ca637 --> Swami Iyer: With regard to what guidance, we are saying is about 40 products are likely to come in the next 12 months.\n\n877801658c35df8fd0c06513da367e10 --> Board Member: We are also planning to bring an immunology biosimilar by 2025-2026 in the US.", "citations": ["497d13c659a135ecf9e7d0531093d3bf", "9b73ddaa5bd9220db8e561b8f2234d1c", "49ff34dab1ae14bca2c54caaae6ca637", "877801658c35df8fd0c06513da367e10"]}, "['Q4', '2023']": {"answer": "f1026ecb56d52e2f1cce5da4162f041a --> Yugandhar Puvvala: \"We just wanted to do 20 launches a year going forward every year and that should provide us that double-digit growth.\"\n\nc14420be88d2e3b8a62c62db2c5803e6 --> Santhanam Subramanian: \"We will start to see some more biosimilar impact coming. I mean, the full year impact will start coming rather than some one-quarter impact of this year.\"\n\n4cef312e57fc1f2f66b75621a57abd65 --> We are prioritising the filing of this very important life-saving biosimilar in India, with an aspiration to launch it in our country this year.\n\na0b2e9f11dd6282d1d63df5f474a33d7 --> Satakarni Makkapati: So, we are fairly confident that towards the end of this year, we will have at least one product in the market. Next year, we see at least 2 to 3 products in the European market with our first filing happening in the US market (in this period).", "citations": ["f1026ecb56d52e2f1cce5da4162f041a", "c14420be88d2e3b8a62c62db2c5803e6", "4cef312e57fc1f2f66b75621a57abd65", "a0b2e9f11dd6282d1d63df5f474a33d7"]}, "['Q1', '2024']": {"answer": "72da6bda45f3d5fb52a8f4c5031cac1f --> Santhanam Subramanian: Now we are planning to re-start the process. How will it takes shape, we’ll come to know maybe in the next 1-2 months. That decision has only been taken on the 12th of August, so we’ll come to know of it clearly in the next 2-3 months.\n\n6340b6a629d6835f697d891e88f9553a --> Satakarni Makkapati: We expect by 2028 we would have at least four oncology products in Europe and at least two oncology products launched in the US. So we expect an overall product portfolio of around six to seven products in the regulated markets and exactly the same number, or maybe one or two more in the immunology segment in the ROW markets.\n\n95c6d54bfdcfd635e92eb72318942f27 --> Yugandhar Puvvala: And we wanted to maintain the 20 plus launches track record for Eugia business.", "citations": ["72da6bda45f3d5fb52a8f4c5031cac1f", "6340b6a629d6835f697d891e88f9553a", "95c6d54bfdcfd635e92eb72318942f27"]}, "['Q4', '2024']": {"answer": "1c9a2d0f43ea73390d1e4276d6439a7d --> Dr. Satakarni Makkapati: We are on track to launch three new biosimilar products in the US market by the end of FY25.\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Santhanam Subramanian: We have four projects commissioned in the last quarter, one is the Pen-G and the second is the 6-APA. That meaningful contribution will start coming from Q3 onwards.\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Santhanam Subramanian: In terms of the Auroactive, it will also start moving up by August-September.", "citations": ["1c9a2d0f43ea73390d1e4276d6439a7d", "e79cda64e9f07f01d0e6aa75c53e9acf"]}}, {"topic": "Partnerships with Research Institutions or Universities"}, {"topic": "Introduction of New Drug Delivery Technologies", "['Q2', '2025']": {"answer": "257191118292dc1d76b60db2f033773b --> Transcript states: \"Soft launch of Trastuzumab planned in Q3.\"\n\n257191118292dc1d76b60db2f033773b --> Transcript states: \"First-in-class linaclotide filed in India seeking MA. Launch expected in Q4.\"", "citations": ["257191118292dc1d76b60db2f033773b"]}, "['Q1', '2021']": {"answer": "04b2cfd063e7effd2a74f2810d0f85d3 --> P V Ram Prasad Reddy: Our plant in US will be ready for production early next calendar year.\nThe new injectable plant for the Europe and other emerging markets would come in next 15-months.", "citations": ["04b2cfd063e7effd2a74f2810d0f85d3"]}, "['Q2', '2021']": {"answer": "f79a39fd873b203881771d67f12326b4 --> N. Govindarajan: We are setting up an Injectable facility for Europe and Emerging Markets in Vizag.", "citations": ["f79a39fd873b203881771d67f12326b4"]}, "['Q4', '2021']": {"answer": "b57a9f7948b8fcbe7a311fc011c39743 --> N. N. Govindarajan: On your COVID-19 facility question, our viral vaccine facility equipment’s would all be installed and all the qualification for the equipment’s will be completed by June end.", "citations": ["b57a9f7948b8fcbe7a311fc011c39743"]}, "['Q1', '2022']": {"answer": "0beceb933e385bf6a87dcb5b799a47f2 --> P.V. Ram Prasad Reddy: Out of the six, mainly two products they would launch in the next month onwards and with the third-party units.", "citations": ["0beceb933e385bf6a87dcb5b799a47f2"]}, "['Q3', '2022']": {"answer": "91dcf5b95953f873e7dc04a41ec4a9e4 --> Yugandhar Puvvala: \"We do have a settlement and we are expected to launch the product in FY24 and beyond that because it is confidential settlement matters, we cannot say more than that, but yes, we will be launching in FY24.\"", "citations": ["91dcf5b95953f873e7dc04a41ec4a9e4"]}, "['Q4', '2022']": {"answer": "10fda7a41691d41e43663cfeb84e1102 --> P. V. Ram Prasad Reddy: US we have in Dayton and New Jersey, U block, B block is the overall plant that is going to start production at the end of this year; Dermatology and MDIs and patches is the plant which we are starting. We already started filing in the few products and some more products we are filing before 31st March.", "citations": ["10fda7a41691d41e43663cfeb84e1102"]}, "['Q1', '2023']": {"answer": "df04a0756ed463f778ce9f28d16cdbdc --> Santhanam Subramanian: Surya, just to address the status of the PLI project the project has already started and will be expected to install the entire thing by about maybe Q2 and then do the pilot batches etc. Hopefully, we'll be completing by Q4 2024. And we are expected to commission the project as on first of April 2024. That is what we think, while our endeavour is to complete it earlier, but this is the target which we have been working on.", "citations": ["df04a0756ed463f778ce9f28d16cdbdc"]}, "['Q3', '2023']": {"answer": "326296bcc76533c40d2745d4e44315f9 --> Santhanam Subramanian: As I said, these are all expected to start commissioning by 31.03.2024 onwards.", "citations": ["326296bcc76533c40d2745d4e44315f9"]}, "['Q3', '2024']": {"answer": "fb638ea057b0e6f0170797bfd7d5f84c --> Swami Iyer: As far as the BFS is concerned, Subbu mentioned in his starting remarks saying that one of our joint ventures is going to start manufacturing. So, we hope to have some news in the early part of fiscal 2025 on the manufacturing and commercial sale of some of the BFS products.", "citations": ["fb638ea057b0e6f0170797bfd7d5f84c"]}, "['Q4', '2024']": {"answer": "6be08a8492eabb34418b6fc7bd1ef6d8 --> Dr. Satakarni Makkapati: It has already been 5 months since we have started the civil work and by 2026, the capacities will be aligned and commissioned to start the water and engineering runs in the facility at Theranym.", "citations": ["6be08a8492eabb34418b6fc7bd1ef6d8"]}}]}, {"theme": "Supply Chain Management", "topics": [{"topic": "Inventory Turnover Ratio", "['Q3', '2021']": {"answer": "73e1ff74007385a700008c399af92561 --> Doubling our capacity from current 220 million doses in multi-dose presentation to a capacity of 480 million doses by June 2021.", "citations": ["73e1ff74007385a700008c399af92561"]}, "['Q2', '2025']": {"answer": "257191118292dc1d76b60db2f033773b --> Transcript states: \"We plan to expand the current footprint of 2x15 KL bioreactors by addition of two more 15 KL bioreactor lines.\"", "citations": ["257191118292dc1d76b60db2f033773b"]}, "['Q1', '2021']": {"answer": "5f5f4df4838cc2bed79187853971edc1 --> N. N. Govindarajan: In fact, the CAPEX was increased only yesterday to get ready for around 300 - 350 million doses per year. That is what I would say in terms of the viral vaccine facility. As far as the bacterial vaccine facility is concerned, we are starting with a capacity of 50 million doses, but we have the capability to ramp it up quickly.", "citations": ["5f5f4df4838cc2bed79187853971edc1"]}, "['Q2', '2021']": {"answer": "f985d0cb9c05d9e00d6b9a95edb5fa08 --> Moderator: The facility we created will be having a capacity on a multi-dose level, of around 450 million doses.", "citations": ["f985d0cb9c05d9e00d6b9a95edb5fa08"]}, "['Q2', '2022']": {"answer": "c8b076d01323f4832acde4bb4a6f4b5a --> N. Govindarajan: But we have used this opportunity to relook at our end-to-end inventory and as Subbu as mentioned in the opening call itself we already improved to the extent of $62 mn, and we would like to continue our effort for another quarter or two minimum like to ensure that we are able to further improve.", "citations": ["c8b076d01323f4832acde4bb4a6f4b5a"]}, "['Q4', '2022']": {"answer": "2c24c5d80bb2b957c71ad3dd78b0b4da --> P. V. Ram Prasad Reddy: Then the Vizag plant also now Vizag plant we are doing around 325 million tablets or capsules per month, and we will reach next year to another 100 million.", "citations": ["2c24c5d80bb2b957c71ad3dd78b0b4da"]}, "['Q2', '2023']": {"answer": "d136e2c9ed4566656670e5d755152b9d --> S. Subramanian: \"The production capacity will be around 15,000 Metric Tonnes.\"", "citations": ["d136e2c9ed4566656670e5d755152b9d"]}, "['Q4', '2024']": {"answer": "3f0336ec4935b49477f8455dc4943f79 --> Mr. V. Muralidharan: \"We are targeting a 7% boost in production capacity in the next six months.\"", "citations": ["3f0336ec4935b49477f8455dc4943f79"]}}, {"topic": "Average Lead Time for Raw Material Procurement", "['Q2', '2025']": {"answer": "257191118292dc1d76b60db2f033773b --> Transcript states: \"First supplies expected in 2028.\"", "citations": ["257191118292dc1d76b60db2f033773b"]}, "['Q1', '2025']": {"answer": "0884694f79ebe2e2715f3c1fa6033503 --> Santhanam Subramanian: \"So, we are expected to do around approximately around 20 batches this month followed by another 30 batches in the next month. If these two go well, I think, we will be more or less able to ramp up in a significant manner starting October.\"\n\ne7bc63d5521ec36a60711b0aa56b1fc2 --> Santhanam Subramanian: Yeah. So, in terms of China, we are planning to start small volume in the month of November-December and expect to ramp it up in the period between January to March quarter of next year [Q4FY25]. And the full-fledged volumes will start going only the next fiscal year [FY26].", "citations": ["0884694f79ebe2e2715f3c1fa6033503", "e7bc63d5521ec36a60711b0aa56b1fc2"]}, "['Q1', '2021']": {"answer": "c35974a5f7eac124358505243ee8ebf1 --> N. Govindarajan: Even for 53-products, we are talking of two to three years.", "citations": ["c35974a5f7eac124358505243ee8ebf1"]}, "['Q4', '2021']": {"answer": "7c109f757850d4dd2082d3fe680af08e --> N. Govindarajan: So that would be ready in the next 12 to 14 months.", "citations": ["7c109f757850d4dd2082d3fe680af08e"]}, "['Q2', '2022']": {"answer": "d9e88e8038c383ca66f5395c75b5902d --> N. Govindarajan: It might take another 6 months for us to finalise, and the procurement will start 9 months from now or so.", "citations": ["d9e88e8038c383ca66f5395c75b5902d"]}, "['Q3', '2022']": {"answer": "e2c39d59b86a57c3fe28f78cddcf63f2 --> P. V. Ram Prasad Reddy: We hope it will come very fast from next month onwards, there is less related with the planned inspections.\n\n6b8c90380a611615f171bc88484fe546 --> Nithyananda Reddy: Yes, that is expected FY 24 end, we are going to start the production sir.", "citations": ["e2c39d59b86a57c3fe28f78cddcf63f2", "6b8c90380a611615f171bc88484fe546"]}, "['Q3', '2023']": {"answer": "4f48731d31e2e18a43ab0e249c1bf770 --> Santhanam Subramanian: So, all these projects will have a gestation time in terms of completing the work and then installation and the payments will be on successful implementation, or on successful dispatch of the material. So, most of the material will start coming between April to June and it will get installed between July to September.", "citations": ["4f48731d31e2e18a43ab0e249c1bf770"]}, "['Q2', '2024']": {"answer": "5a40db9d01b3281832af6d0e28371e72 --> Board Member: The Pen-G plant and the 6-APA plant are under installation and are expected to be operational from Q4 FY24 or Q1 FY25.\n\nff85243aeefbea4e02463f8a7b19d1f3 --> Dr. Satakarni Makkapati: I expect these to begin to the potential partner from 2027 onwards.", "citations": ["5a40db9d01b3281832af6d0e28371e72", "ff85243aeefbea4e02463f8a7b19d1f3"]}, "['Q3', '2024']": {"answer": "f2307ad256c544b75579d5a60f1bc19a --> Yugandhar Puvvala: Our assessment at this point in time is, this is going to take 1-2 months, and we will be back in full flow from April.", "citations": ["f2307ad256c544b75579d5a60f1bc19a"]}}, {"topic": "Supplier Dependency Ratio"}, {"topic": "Instances of Supply Chain Disruptions", "['Q2', '2025']": {"answer": "257191118292dc1d76b60db2f033773b --> Transcript states: \"We aim to commission the facility in the year 2026 for qualification activities and engineering runs.\"\n\n257191118292dc1d76b60db2f033773b --> Transcript states: \"New manufacturing facility to be commissioned by end-2025.\"", "citations": ["257191118292dc1d76b60db2f033773b"]}, "['Q1', '2021']": {"answer": "61993e36e885aa7d3ab82b1624fd3621 --> N. Govindarajan: Apart from the PLI Scheme, we are also investing in at least two to three large volume API modules to ensure that we are freeing up our existing capacities as we are seeing the surge in demand.\n\na76c2473e4e4a6d430867c00407a0481 --> P V Ram Prasad Reddy: We have at least 80-to-90 products in various stages of the development for US and our new plant will be ready by first quarter of next calendar year.\n\na76c2473e4e4a6d430867c00407a0481 --> P V Ram Prasad Reddy: Other than this, we are setting up a dedicated injectable facility for Europe & other markets, and that facility is coming up near Vizag.", "citations": ["61993e36e885aa7d3ab82b1624fd3621", "a76c2473e4e4a6d430867c00407a0481"]}, "['Q2', '2021']": {"answer": "f985d0cb9c05d9e00d6b9a95edb5fa08 --> Moderator: We are still targeting to complete it by March - April timeline and start the qualification by April.\n\n4eb57d29fb9edfe5f650a017c8057283 --> N. Govindarajan: I said the manufacturing facility would be ready by April or May timeline for commercialization.", "citations": ["f985d0cb9c05d9e00d6b9a95edb5fa08", "4eb57d29fb9edfe5f650a017c8057283"]}, "['Q3', '2021']": {"answer": "568d544cd82cd8f0a150d7120fcdd84e --> N. Govindarajan: \"To give an example, in Vizag we already have created shell for some large volume products where we need to fill in the equipment and do the capacity expansion. This would happen in the next 1 year to 1.5 years’ time.\"", "citations": ["568d544cd82cd8f0a150d7120fcdd84e"]}, "['Q2', '2022']": {"answer": "a5c5d1e40d5f8b3ac0b82a56c6d5258a --> P.V. Ram Prasad Reddy: \"But what we plan for is that in future all products approve in the US facility, then we may not allocate the space for the Europe and Emerging Markets. At present, we are using the existing Unit-IV which is our bigger facility. But this is the plan from FY23.\"\n\n9d8140202429865e5f04aba89e2808df --> Sanjeev Dani: Then we also talked about Vizag facility, which will be ready with civil work by June next year and then after that will go for approval by year-end.", "citations": ["a5c5d1e40d5f8b3ac0b82a56c6d5258a", "9d8140202429865e5f04aba89e2808df"]}, "['Q3', '2022']": {"answer": "8fbd7a7e7a000a5bb452e34e97127df0 --> Nithyananda Reddy: Yeah. This PLI scheme that we are going ahead of the project for 15,000 tons of Penicillin G at Kakinada. Good thing is, we got extension up to 24 by one more year because of the COVID issues related to government that is happening.", "citations": ["8fbd7a7e7a000a5bb452e34e97127df0"]}, "['Q4', '2022']": {"answer": "8974c0bf224d5951f7b81e73ff31a1dc --> Santhanam Subramanian: Out of the 3,000 crores which you are seeing Tarang, at least 1,500 crores is pertaining to both injectable as well as the oral plant and derma plant in US and overall the oral plant is likely to be commissioned before FY23 end.\n\n8974c0bf224d5951f7b81e73ff31a1dc --> Santhanam Subramanian: Out of the 3,000 crores which you are seeing Tarang, at least 1,500 crores is pertaining to both injectable as well as the oral plant and derma plant in US and overall the oral plant is likely to be commissioned before FY23 end and injectable probably may spill over to next year.", "citations": ["8974c0bf224d5951f7b81e73ff31a1dc"]}, "['Q1', '2023']": {"answer": "5ba63bf5bbfe3bdd563829afd4fd5b93 --> Yugandhar Puvvala: Absolutely. In fact, whatever we feel is with these four plants can take care of demand up to FY26.", "citations": ["5ba63bf5bbfe3bdd563829afd4fd5b93"]}, "['Q2', '2023']": {"answer": "3907652bc9e5628a0b561c9d083684fb --> Satakarni Makkapati: We look at this plant becoming operational and ready for commercial supplies in FY25-26.\n\nc3c77adae4cc1bab4bf3c30d9265c608 --> S. Subramanian: For Consolidated operations, quite a significant manufacturing has been started in India if you recollect in the last 3-4yrs, they have really taken around, if I am right Sanjeev can confirm, we have already moved around 50% of the products to India.", "citations": ["3907652bc9e5628a0b561c9d083684fb", "c3c77adae4cc1bab4bf3c30d9265c608"]}, "['Q4', '2023']": {"answer": "ae9d6caa4638aab0d7d9bb5cfd585f09 --> We have three plans, including one Eugia plan under commissioning in US. Of these, a part of the US Raleigh facility was commissioned in March 2023. The balance is expected to get commissioned by FY23 or during FY25.\nThe China plant is fully installed and is expected to be commissioned in Q1 FY25.\n\nae9d6caa4638aab0d7d9bb5cfd585f09 --> The Lyfius plant which will produce Pen-G, is expected to be commissioned by ’23, however it is our endeavour to complete ahead of schedule.\n\nae9d6caa4638aab0d7d9bb5cfd585f09 --> We are conducting clinical research study phase 3 for biosimilar product, and the biosimilar plant is expected to commission by FY23.", "citations": ["ae9d6caa4638aab0d7d9bb5cfd585f09"]}, "['Q3', '2024']": {"answer": "0bdb21fa38c8012be4088faabf7b00e8 --> Yugandhar Puvvala: Yes, your understanding is right. In fact, the non-aseptic lines will start off sometime in the next few weeks, and aseptic lines will take a month or two. And we expect that entire production to get streamlined by end of this financial year. We expect this stoppage can have an impact of around $20 million in Q4 of this financial year.", "citations": ["0bdb21fa38c8012be4088faabf7b00e8"]}, "['Q1', '2024']": {"answer": "a43f8186f543116be60784c2f62f242f --> Santhanam Subramanian: No, apart from the PLI, we are putting some forward derivative plants linking to the Pen G plant, right? Those all may not be a very significant, maybe around 150-200 crores like that two, three plants we are putting it so that we will also be able to effectively utilize the Pen G.", "citations": ["a43f8186f543116be60784c2f62f242f"]}}]}, {"theme": "Sustainability and Corporate Social Responsibility (CSR)", "topics": [{"topic": "Carbon Footprint Reduction Initiatives"}, {"topic": "Percentage of Revenue Invested in Community Health Programs"}, {"topic": "Waste Management and Recycling Metrics"}, {"topic": "Employee Diversity and Inclusion Statistics"}]}, {"theme": "Risks and Challenges", "topics": [{"topic": "Litigation Cases and Associated Costs", "['Q2', '2022']": {"answer": "9d8140202429865e5f04aba89e2808df --> P.V. Ram Prasad Reddy: We have already settled the litigation and launching from 2023 onwards, some percentage of market share.", "citations": ["9d8140202429865e5f04aba89e2808df"]}}, {"topic": "Vulnerability to Drug Price Regulations"}, {"topic": "Impact of Generic Competition on Revenue"}, {"topic": "Potential for Drug Recalls and Associated Costs"}]}, {"theme": "Human Capital", "topics": [{"topic": "Employee Turnover Rate"}, {"topic": "Average Employee Tenure"}, {"topic": "Investment in Employee Training and Development"}, {"topic": "Ratio of R&D Staff to Total Employees"}]}]