[{"theme": "Revenue Growth and Financials", "topics": [{"topic": "Revenue diversification strategies", "data": {"['Q1', '2025']": {"answer": "24336a5714cdedb21a30e4ff36ac7abe --> The CEO stated that the company plans to achieve a 12% increase in US formulation revenue driven by volume gains and new product launches.\n\naf88e0d66e55f334d5a955d3baf3c9ad --> The Europe market is on track to achieve €880 million plus for FY25.\n\n44e21167abb8856b2d2ce953c4aff17e --> The management expects to continue their growth trajectory backed by volume gains, new product launches, and stable pricing.\n\nb6033cacac59078621b2c3d0b3e42744 --> Yugandhar Puvvala stated that the regular injectable business is expected to move up from Q2 of FY25 onwards.\n\nada40290eb51b08701b95c127949037c --> V. Muralidharan stated that the company's revenue in Europe is expected to be between €880-900 million for the full year.\n\n28aef6ca52968543346f2dad6fb7f503 --> Yugandhar Puvvala confirmed maintaining guidance for global speciality sales, specifically stating they expect to achieve $600 million in sales this year.\n\n28aef6ca52968543346f2dad6fb7f503 --> Santhanam Subramanian indicated that the company will continue to achieve around $8 million per quarter in Indonesia operations for the current financial year.\n\ne7bc63d5521ec36a60711b0aa56b1fc2 --> Yugandhar Puvvala mentioned plans for US filings and expected revenue to start from FY26 onwards.\n\n53335a8bb0e013b70f77166c44570fb1 --> Yugandhar Puvvala indicated that the run rate for Revlimid sales is expected to continue in a similar way, with pricing remaining constant.\n\n53335a8bb0e013b70f77166c44570fb1 --> Yugandhar Puvvala mentioned that sales this year should be similar to last year, with a potential variation of 10 or 15%.\n\n07d18411544929c7920a4cc26bef838d --> Swami responded that the OSD business could reach a US$ 300 million quarterly run rate soon, contingent on market approvals and capacity expansion.\n\n69d7a66ddb69637b702f161694a93042 --> Yugandhar Puvvala stated that the impact on revenue from Eugia-3 is expected to conclude after Q1.", "citations": ["24336a5714cdedb21a30e4ff36ac7abe", "af88e0d66e55f334d5a955d3baf3c9ad", "44e21167abb8856b2d2ce953c4aff17e", "b6033cacac59078621b2c3d0b3e42744", "ada40290eb51b08701b95c127949037c", "28aef6ca52968543346f2dad6fb7f503", "e7bc63d5521ec36a60711b0aa56b1fc2", "53335a8bb0e013b70f77166c44570fb1", "07d18411544929c7920a4cc26bef838d", "69d7a66ddb69637b702f161694a93042"]}, "['Q1', '2023']": {"answer": "0063db9aa0de9ca4e64e65d72dfb0cbd --> We are still on track to hit the guidance we have given for FY24, which is $650 million to $700 million.\n\n14a99057430ab39263ea64c136b6dc0c --> Sanjeev Dani stated that the Europe business is expected to grow by 5% to 8% year-on-year.\n\ne9c2fe1df18ded4f18ce1dbb683b355c --> The CFO mentioned targeting at least $35 million in the ARV business quarter-on-quarter.\n\n9b072971053e013ef5dba660d6df9bc4 --> The API business is expected to continue its growth trajectory in the upcoming quarters.\n\n0926d24bdf2172ad9db2cc57afdd6559 --> P. V. Ram Prasad Reddy indicated an expected growth rate of 6% to 7% over the next two to four years, contingent on stable global conditions and the commercial and profitable operation of six to seven plants.", "citations": ["0063db9aa0de9ca4e64e65d72dfb0cbd", "14a99057430ab39263ea64c136b6dc0c", "e9c2fe1df18ded4f18ce1dbb683b355c", "9b072971053e013ef5dba660d6df9bc4", "0926d24bdf2172ad9db2cc57afdd6559"]}, "['Q3', '2023']": {"answer": "15671aa190ea0708577162b7d49a7e9d --> Swami Iyer anticipates that the present trend would continue into the next quarter and next fiscal year.\n\n7f627af6e37a5e81e9ba1b4bf847de1e --> Yugandhar Puvvala stated that the injectable business is expected to achieve double-digit growth quarter-over-quarter (QoQ) in Q4 and Q1 of next year.\n\n49ff34dab1ae14bca2c54caaae6ca637 --> Aishwarya mentioned that there should be an increase in the revenue numbers by 50 million in the next 12 months.\n\n9b73ddaa5bd9220db8e561b8f2234d1c --> Swami Iyer mentioned the commercialization of new ANDAs and expected revenue from these launches over the next 12 months.\n\n09c3606a1224773a2a060f72e62d3abe --> Satakarni Makkapati inferred that there may be at least one quarter of sales for the antibody in the current year, provided the approval is obtained by Q2 of the next fiscal year.\n\nacddd50c64703e10890150a9e80b43c9 --> Yugandhar Puvvala is confident of achieving double-digit growth in the US market.\n\n877801658c35df8fd0c06513da367e10 --> There is an expectation for at least one quarter of sales for the monoclonal antibody in India to start within the next fiscal year, with sales in EMEA expected in 2024-2025.\n\nde1124f6476d2ba21fa1ed31446de97e --> Sanjeev Dani indicated that the company expects to maintain a baseline of €185-190 million in Europe, with potential middle single-digit growth based on seasonality and opportunities.\n\n21fbc7aa06c94f358b741eb427394bdb --> Yugandhar Puvvala mentioned the goal to reach $121-$125 million in global injectable sales next financial year and reiterated the target numbers by FY25.", "citations": ["15671aa190ea0708577162b7d49a7e9d", "7f627af6e37a5e81e9ba1b4bf847de1e", "49ff34dab1ae14bca2c54caaae6ca637", "9b73ddaa5bd9220db8e561b8f2234d1c", "09c3606a1224773a2a060f72e62d3abe", "acddd50c64703e10890150a9e80b43c9", "877801658c35df8fd0c06513da367e10", "de1124f6476d2ba21fa1ed31446de97e", "21fbc7aa06c94f358b741eb427394bdb"]}, "['Q2', '2023']": {"answer": "ef10f26669d38015b0a872bee2c17f7f --> The management maintains their guidance for global generic injectable sales of $650-700 million by FY24.\n\n0282f4e224d04299de87efb0927725a2 --> The CFO projected a revenue growth of 12% for the next fiscal year.\n\nc4617ab6858115dccc34abc7bc1d5273 --> Yugandhar Puvvala mentioned that the volume for the US Business should go up going forward as business returns to normal in all hospitals.\n\nbb791c26dded1cf9b97347e5433eb7b5 --> The Vizag Plant is expected to start generating revenues by the end of FY24.\n\nd9e5eafdc6bb41e35b974d3e4564a8d3 --> Sanjeev Dani expects a growth rate of 5-7% to continue in the upcoming period.\n\n456719713b488d2b844bf4a63fd7cd1c --> Yugandhar Puvvala indicated that Revlimid's opportunity will start from FY24 and will remain until FY26 or FY27.\n\n456719713b488d2b844bf4a63fd7cd1c --> Yugandhar Puvvala mentioned a double-digit growth expectation for the injectables business on a regular basis, excluding Revlimid.\n\n2388693651da5fdb9d0d9edab526a948 --> The guidance for injectables specialty revenue is between $650 to $700 million.", "citations": ["ef10f26669d38015b0a872bee2c17f7f", "0282f4e224d04299de87efb0927725a2", "c4617ab6858115dccc34abc7bc1d5273", "bb791c26dded1cf9b97347e5433eb7b5", "d9e5eafdc6bb41e35b974d3e4564a8d3", "456719713b488d2b844bf4a63fd7cd1c", "2388693651da5fdb9d0d9edab526a948"]}, "['Q4', '2023']": {"answer": "6287796b62943ca8a6689b575849f64e --> Mr. S. Subramanian (CFO) projected a 10% increase in overall revenue for the fiscal year 2024.\n\nbfab39809aedf09cc113cb26f2bed418 --> Aurobindo Pharma aims to continue growing revenue despite challenging macro environments.\n\n668a249df640c1a56292179be8584719 --> The CEO stated that they are sticking to their earlier guidance of double-digit growth for the generic injectables.\n\n86ba022de33836f1e11ae1e8d881810e --> Swami Iyer indicated that the bulk of the benefit of the incremental volumes awarded will be seen in the second quarter.\n\n8bd08c6346fa1ed438fdfb0655e77175 --> Yugandhar Puvvala stated that they will continue their journey of double-digit growth on a base of Rs. 3,300 crores, with Revlimid getting added on top.\n\n2e97306ea3cd83bc9ba1e18bcd846187 --> Yugandhar Puvvala stated that the pricing of the generic Revlimid is expected to be stable up to January 2026.\n\nce3209c48360076bcfb545e3b17e2f4a --> Yugandhar Puvvala stated that the company expects two new plants to start delivering revenue starting from FY25.\n\n07c8e5fdfab2147a4bc75e5510eb41af --> Santhanam Subramanian stated that revenue generation from the project is expected to start from Q1FY25, which is April 2024.", "citations": ["6287796b62943ca8a6689b575849f64e", "bfab39809aedf09cc113cb26f2bed418", "668a249df640c1a56292179be8584719", "86ba022de33836f1e11ae1e8d881810e", "8bd08c6346fa1ed438fdfb0655e77175", "2e97306ea3cd83bc9ba1e18bcd846187", "ce3209c48360076bcfb545e3b17e2f4a", "07c8e5fdfab2147a4bc75e5510eb41af"]}, "['Q2', '2024']": {"answer": "5a40db9d01b3281832af6d0e28371e72 --> The company expects the China plant to start revenue generation from the end of Q4 FY24 or early Q1 FY25.\n\nb96f332ac77fb5035bea4d923968d0e0 --> The company is on track to achieve USD 560 million globally for the Eugia Specialities for FY24.\n\n3d62b668c72926c7b0385b288e36fd62 --> The CFO stated that the company has started to receive contributions from gRevlimid during Q3 FY24.\n\na64c51053dc3689ee8c58aee0385633a --> Yugandhar Puvvala stated that the generic injectable business has stabilized around USD 80 million per quarter for the US market and it is expected to increase to USD 85 million and USD 90 million.\n\nc7a16b3169c7fd34f55b016574ebf5bf --> The CEO provided an outlook for the European business, indicating double-digit growth driven by injectable launches.\n\nff85243aeefbea4e02463f8a7b19d1f3 --> Dr. Satakarni Makkapati stated that the plant is expected to be fully commissioned by late 2026 or early 2026, with revenue streams flowing in the calendar year 2026 or the fiscal year 2027. Steady state commercial supplies are expected to begin from 2027 onwards.\n\n34fa57dba85d409bdee007efaa569ef7 --> Santhanam Subramanian stated that the ARV business is expected to have sales around USD 25 million, with a variation of plus or minus USD 5 million per quarter.", "citations": ["5a40db9d01b3281832af6d0e28371e72", "b96f332ac77fb5035bea4d923968d0e0", "3d62b668c72926c7b0385b288e36fd62", "a64c51053dc3689ee8c58aee0385633a", "c7a16b3169c7fd34f55b016574ebf5bf", "ff85243aeefbea4e02463f8a7b19d1f3", "34fa57dba85d409bdee007efaa569ef7"]}, "['Q3', '2024']": {"answer": "ce2129d5d04ef0f519a31fdb7342b440 --> Santhanam Subramanian stated that the sales growth was seen across multiple markets and businesses and was further augmented by the highest ever EBITDA for Q3 FY24.\n\n343db7b91b121d131d18b4207c9213aa --> The China plant is expected to start revenue generation from Q1 / Q2 FY25.\n\n1022f4f60cdd7642d39bf55c6e55d502 --> The management expects to sustain an additional $75 million generated as part of the normal process after the creditor payments.\n\nd358fc71e162555df5922910155f26a6 --> Yugandhar Puvvala indicated that the Eugia Unit III contributes to around 40% of revenue for the Eugia business, and there is a focus on how fast they can resolve issues and restart manufacturing.\n\nf1369cf39884a46e3ceea7967e64784d --> Yugandhar Puvvala indicated that for FY25-26, the company expects around $30 to $40 million of new products revenue from the balance of the plants.\n\n0309d7c17162be191ebd3c0485e8c27d --> The management plans to maintain a quarterly revenue run rate of $150 million plus in the next few quarters.\n\n44e13d6b36ed6fcecb0dead7b7c1b5d8 --> Yugandhar Puvvala stated that the company achieved $150 million of revenue for quarter 3 and expects to continue a similar run rate in the next quarters, with a potential impact of $20 million in Q4.\n\n2ed603787f5570865b65e3a809d73855 --> Yugandhar Puvvala expects $2 million to $3 million in the coming few months with respect to third-party consultants.\n\na8b3670cff9244d44d87dff1b6f56123 --> V. Muralidharan confirmed that they aim to maintain a revenue of €200 million plus quarter on quarter.\n\n9327d51787650be2aa9b62887990abfc --> Kunal Damesha mentioned a projected $20 million impact on revenue related to Eugia 3 for the next year.\n\n0e600e3ac4954493d2ceca3752211856 --> Dr. Satakarni Makkapati projects that by 2028, the Xolair biosimilar could generate $120 million to $180 million in revenue, provided approvals are obtained in the U.S. and Europe, with an additional $20 million from the rest of the world.\n\n7d4516673b6b79459e8eeb60931e227d --> The management team indicated a quarterly run rate of Rs. 600 crore to Rs. 625 crore for the ROW markets.", "citations": ["ce2129d5d04ef0f519a31fdb7342b440", "343db7b91b121d131d18b4207c9213aa", "1022f4f60cdd7642d39bf55c6e55d502", "d358fc71e162555df5922910155f26a6", "f1369cf39884a46e3ceea7967e64784d", "0309d7c17162be191ebd3c0485e8c27d", "44e13d6b36ed6fcecb0dead7b7c1b5d8", "2ed603787f5570865b65e3a809d73855", "a8b3670cff9244d44d87dff1b6f56123", "9327d51787650be2aa9b62887990abfc", "0e600e3ac4954493d2ceca3752211856", "7d4516673b6b79459e8eeb60931e227d"]}, "['Q1', '2024']": {"answer": "63a1342683709d47d8a5da8cea143f28 --> The management is targeting to achieve 200 crores in export benefits for the year.\n\nc3166d5f87f3074d0aec8fc67b0d4b6e --> Santhanam Subramanian [Inferred as CFO] stated that the company aims for a revenue increase of 9.9% year-on-year for the first quarter of fiscal year FY24.\n\n40ad9dc55e6dfa052776f4daeadbf3b4 --> Mr. S. Subramanian (CFO) stated that the company aims to achieve a 20% increase in its biosimilars revenue by the end of the fiscal year.\n\ne03f9709a9dd9d454deb06e18dbfd3e6 --> Yugandhar Puvvala stated their endeavour is to make US revenue 100 million plus and overall revenue 130 million, aiming for nearly a 500-million-dollar entity for this year, excluding Revlimid.\n\n199a01f0094a88145335de1ee912c20e --> Yugandhar Puvvala stated that the company's endeavour is to grow the non-US global Eugia business to 130 million plus starting from the next quarter.\n\n199a01f0094a88145335de1ee912c20e --> Yugandhar Puvvala mentioned that the goal is to make the Eugia business achieve 500 million plus for this year, excluding Revlimid.\n\n008316fbeed40ae7012aacbc61b50a63 --> The management expects to grow faster than the market, with a projected growth rate of 5% to 8% year-on-year on a constant currency basis.\n\n008316fbeed40ae7012aacbc61b50a63 --> Europe is expected to contribute $60 to $70 million this year with aspirations to increase it to over $100 million.\n\n3aa1624cf57f35f7bd8e56bbd83b6694 --> Sanjeev Dani indicated that European revenue should remain within a plus or minus 5% range of EUR 200 million, considering seasonal purchase patterns.\n\n95c6d54bfdcfd635e92eb72318942f27 --> Yugandhar Puvvala stated the company's goal to hit 500 plus in terms of volume for the year.", "citations": ["63a1342683709d47d8a5da8cea143f28", "c3166d5f87f3074d0aec8fc67b0d4b6e", "40ad9dc55e6dfa052776f4daeadbf3b4", "e03f9709a9dd9d454deb06e18dbfd3e6", "199a01f0094a88145335de1ee912c20e", "008316fbeed40ae7012aacbc61b50a63", "3aa1624cf57f35f7bd8e56bbd83b6694", "95c6d54bfdcfd635e92eb72318942f27"]}, "['Q4', '2024']": {"answer": "1c9a2d0f43ea73390d1e4276d6439a7d --> The CFO mentioned plans for the company's financial growth in the upcoming year.\n\n7cbbb4f19c9f6ad949127ec2b9e3c5a5 --> The management expects the operation of newly commercialized plants to ramp up and start contributing to the top and bottom line meaningfully in the next few quarters.\n\n4e4bf025638e96d451c59e97b6f73102 --> Yugandhar Puvvala stated that they expect a run rate of about US$ 150 million every quarter across the globe starting from Q1.\n\n5aace22658f75cdc47432c841b10dd74 --> FY25 is expected to be a year of muted growth for the injectable business, with an anticipated improvement starting FY26.\n\na2ec8ef084db343b28af57663362605b --> V. Muralidharan expects all quarters in FY25 to achieve revenue north of EUR 200 million in Europe.\n\na845f61bfc1d9181e29f1888c5cc74ff --> Yugandhar Puvvala expects a global revenue of US$150 million.\n\na845f61bfc1d9181e29f1888c5cc74ff --> Yugandhar Puvvala indicates that the U.S. will continue to be in the range of US$100-110 million.\n\n2acd0fd94061635bbaa623bb4a29a49d --> Santhanam Subramanian indicated that the company aims for around US$300 million in revenue from other growth markets for the year.", "citations": ["1c9a2d0f43ea73390d1e4276d6439a7d", "7cbbb4f19c9f6ad949127ec2b9e3c5a5", "4e4bf025638e96d451c59e97b6f73102", "5aace22658f75cdc47432c841b10dd74", "a2ec8ef084db343b28af57663362605b", "a845f61bfc1d9181e29f1888c5cc74ff", "2acd0fd94061635bbaa623bb4a29a49d"]}}}, {"topic": "Profit margin analysis", "data": {"['Q1', '2025']": {"answer": "e6483073eeb03b07f2f62e7ad53c3333 --> The company is confident of achieving an internal EBITDA target margin of 21%-22% for the year FY25.\n\naf88e0d66e55f334d5a955d3baf3c9ad --> The company is confident of achieving an overall internal EBITDA margin target of around 21% to 22% for the full year.", "citations": ["e6483073eeb03b07f2f62e7ad53c3333", "af88e0d66e55f334d5a955d3baf3c9ad"]}, "['Q1', '2023']": {"answer": "7ce3a760dcc5784918ef8b2d6d56734a --> The Chief Financial Officer (CFO) mentioned a target for improving EBITDA margins in the coming quarters.\n\n800650c06c245634f41072f02b17c917 --> Santhanam Subramanian indicated that improvements in gross margin are expected from Q3 onwards.", "citations": ["7ce3a760dcc5784918ef8b2d6d56734a", "800650c06c245634f41072f02b17c917"]}, "['Q3', '2023']": {"answer": "7ee66e55daaee504f0abc1ed1210d103 --> The CFO projected a 12% increase in EBITDA margin by the end of the next fiscal year.", "citations": ["7ee66e55daaee504f0abc1ed1210d103"]}, "['Q2', '2023']": {"answer": "24b40c2e8e29952c24df32090ca5a440 --> The CFO provided guidance on maintaining gross margins around 60% for the upcoming year.\n\nd136e2c9ed4566656670e5d755152b9d --> Sanjeev Dani expects the EBITDA margin in Europe to reach beyond 15% in the coming quarters.", "citations": ["24b40c2e8e29952c24df32090ca5a440", "d136e2c9ed4566656670e5d755152b9d"]}, "['Q4', '2023']": {"answer": "cb967904bace866207aff8f23ab05ff3 --> The CFO stated that the company aims to achieve a 12% increase in EBITDA margin by the end of the fiscal year.\n\n89c371631110a47111cd137ec7fd1908 --> The gross margins in Eugia are expected to be between 60% to 70% and EBITDA levels will be around 25% to 35%.", "citations": ["cb967904bace866207aff8f23ab05ff3", "89c371631110a47111cd137ec7fd1908"]}, "['Q2', '2024']": {"answer": "c548d7eba466a46a69aff5be9a66c421 --> The CFO stated that the company expects to achieve an EBITDA margin of 19.4% for the quarter.\n\nc6961e38f19969f2d8697275a5954a4e --> The company is on track to achieve the 20% plus EBITDA margin target set internally for the year.\n\nf241652d68b79163b061a0718ef04980 --> Santhanam Subramanian mentioned that the company aims to achieve a 20% EBITDA margin for the year.\n\n67e4922841d2f345467704c0e08184fe --> Sanjeev Dani stated that the goal for the European business is to achieve a 20% EBITDA margin.", "citations": ["c548d7eba466a46a69aff5be9a66c421", "c6961e38f19969f2d8697275a5954a4e", "f241652d68b79163b061a0718ef04980", "67e4922841d2f345467704c0e08184fe"]}, "['Q3', '2024']": {"answer": "62df2ca2bef1f99033f774c8b1e3b3eb --> The management team is confident of achieving a 20% EBITDA margin target set internally for the year.\n\n0bdb21fa38c8012be4088faabf7b00e8 --> Santhanam Subramanian mentioned achieving an EBITDA margin of 20% for the year, with confidence to reach this target by the end of the current quarter.\n\n7e6eb27a360cb0dde2a12c0137352a8b --> Santhanam Subramanian mentioned that the company aims to achieve a margin of 15% or more.\n\n2486e11d4bc6fa9b3c5e5e96b9ae049a --> The speaker stated that they will achieve an 80% to 85% gross margin by entering formed markets.", "citations": ["62df2ca2bef1f99033f774c8b1e3b3eb", "0bdb21fa38c8012be4088faabf7b00e8", "7e6eb27a360cb0dde2a12c0137352a8b", "2486e11d4bc6fa9b3c5e5e96b9ae049a"]}, "['Q1', '2024']": {"answer": "f61df7f376dac421ccce022404a9ad17 --> The management expects EBITDA margin to cross 20% based on current market conditions.\n\n63a1342683709d47d8a5da8cea143f28 --> The management is poised to achieve an 18% EBITDA margin.\n\n72da6bda45f3d5fb52a8f4c5031cac1f --> Santhanam Subramanian (CFO) indicated that they are targeting around an 18% margin for the year excluding Revlimid.\n\n231b7752b8b265c1188819a54484a9be --> Subbu provided separate margin guidance.\n\na4a6a1e1e84b65417bb137425bb2a468 --> Santhanam Subramanian stated that with the shutdown and restructuring of the Puerto Rico plant, the company is likely to see its EBITDA margin improving by 0.5% in the immediate term.\n\ne01f1de961889be123eb0fcb1a985cf6 --> Santhanam Subramanian stated that the adjusted EBITDA is expected to cross 18% if prices remain flat and operating leverage improves.", "citations": ["f61df7f376dac421ccce022404a9ad17", "63a1342683709d47d8a5da8cea143f28", "72da6bda45f3d5fb52a8f4c5031cac1f", "231b7752b8b265c1188819a54484a9be", "a4a6a1e1e84b65417bb137425bb2a468", "e01f1de961889be123eb0fcb1a985cf6"]}, "['Q4', '2024']": {"answer": "efad4ad6a18709b6e28f9a37c00e85da --> The CFO expects an increase in the operating margin to 20% by the end of 2024.\n\n3f0336ec4935b49477f8455dc4943f79 --> Mr. Santhanam Subramanian (Chief Financial Officer, Aurobindo Pharma Limited) provided guidance on achieving a 20% increase in EBITDA margin over the next two years.\n\n4092655e5eba42e16400e5cb570de04c --> The company expects to achieve around 21-22% of EBITDA margin for FY25.\n\nf022eab2b5e656fe5b3526ecf8be0373 --> The CFO stated that the company achieved an EBITDA margin of 20.1% for FY24, slightly exceeding their guidance of 20%.\n\n7beb05c4c08d70b953fba57b56b74963 --> Dr. Satakarni Makkapati mentioned that the company aims to sustain a margin of around 50%-75% even with potential price erosion in the chronic segment.\n\n410d2833859ab69c61614fa6f20c32bd --> The speaker mentioned that the additional gross margin improvement from Pen-G will be disclosed in the November earnings call.\n\nbece4f3ab0b608e74ce677c1cfdbeb22 --> The company plans to achieve EBITDA margins of 21% to 22%.\n\n5a7ed0e00277ccab627b742423b14fab --> Mr. Santhanam Subramanian stated that they are targeting to achieve an EBITDA margin of 21%-22% and plan to complete the ramping up of the Pen-G by September.", "citations": ["efad4ad6a18709b6e28f9a37c00e85da", "3f0336ec4935b49477f8455dc4943f79", "4092655e5eba42e16400e5cb570de04c", "f022eab2b5e656fe5b3526ecf8be0373", "7beb05c4c08d70b953fba57b56b74963", "410d2833859ab69c61614fa6f20c32bd", "bece4f3ab0b608e74ce677c1cfdbeb22", "5a7ed0e00277ccab627b742423b14fab"]}}}, {"topic": "Currency impact assessment", "data": {}}, {"topic": "Cost management initiatives", "data": {"['Q3', '2024']": {"answer": "0bdb21fa38c8012be4088faabf7b00e8 --> Yugandhar Puvvala indicated that the stoppage can have an impact of around $20 million in Q4 of this financial year.\n\n27757d8861825d1b7200084c771c53de --> The company expects the injectable part of the business to see a reduction of 20 million in Quarter four.", "citations": ["0bdb21fa38c8012be4088faabf7b00e8", "27757d8861825d1b7200084c771c53de"]}, "['Q1', '2024']": {"answer": "8134e43c9e4ff6cb0e8a925604d28d86 --> Yugandhar Puvvala expects the pricing to be stable till the end of 2025.", "citations": ["8134e43c9e4ff6cb0e8a925604d28d86"]}}}]}, {"theme": "Product Development and Innovation", "topics": [{"topic": "New product launches", "data": {"['Q1', '2025']": {"answer": "c45761bf69733561e65706db60884c32 --> Dr. Satakarni Makkapati stated that the company plans to launch five new biosimilars in the European market by the end of the fiscal year.\n\ne033c7a89b118e50c990db883ba90403 --> Dr. Satakarni Makkapati stated that the clinical study closure for the Denosumab trial will be in June next year, and the product filing with both the European Medicines Agency and the FDA will occur in the second quarter of the next fiscal year (Q2FY26).\n\na009f99ebbc3bbc3a8a2dffd7ee01d22 --> The trial for the ophthalmic product is expected to be completed in 2026.\n\n44e21167abb8856b2d2ce953c4aff17e --> The management is on track with respect to Pen-G large scale commercialization and is hopeful to ramp up significantly from October'24.\n\n84b8fef56659a08f1bb75f029d48ab26 --> Bino inquired about the lifitegrast ophthalmic solution, and Swamy Iyer indicated it is a product expected in the next 12 to 18 months.\n\n86a8f72f377eea6abceb9d3732eaa338 --> Swami Iyer stated that the launch of Ryzneuta is expected to occur in the last quarter of the current fiscal year.\n\ne3caf79d38d546b9d6f0b33be722dc29 --> Swami Iyer mentioned the expectation for a good amount of new product launches similar to the previous year.", "citations": ["c45761bf69733561e65706db60884c32", "e033c7a89b118e50c990db883ba90403", "a009f99ebbc3bbc3a8a2dffd7ee01d22", "44e21167abb8856b2d2ce953c4aff17e", "84b8fef56659a08f1bb75f029d48ab26", "86a8f72f377eea6abceb9d3732eaa338", "e3caf79d38d546b9d6f0b33be722dc29"]}, "['Q1', '2023']": {"answer": "14a99057430ab39263ea64c136b6dc0c --> Sanjeev Dani mentioned that the new injectable plant is expected to start filing early next year.\n\nd0c0a2e7e930a7b875dfab050f7fc1d7 --> The company plans to file two products in the US in the fiscal year 2023-24, with one in the first quarter and the second in the last quarter. Additionally, the company plans to file a total of five products in Europe next year.\n\nea82505d3bc13f597f2fa5dbfd210a35 --> Sanjeev Dani mentioned that the company is planning to file injectable products in early next year, with the expectation of seeing impacts from FY24 onwards.\n\n0926d24bdf2172ad9db2cc57afdd6559 --> Yugandhar Puvvala confirmed that the generic Revlimid is scheduled for a FY24 launch in the US.\n\nbafc7b0678209532e302499c45513483 --> Santhanam Subramanian mentioned the company plans to maintain the current ANDA filing pace of around 50 products per year.\n\n8de74c1efdf4f7ffb98bceac8b194284 --> P. V. Ram Prasad Reddy indicated that the commercial results from the acquisition of 40 ANDAs are expected to start materializing from early next year.\n\n702575899a2be8cacbebea486ba23dcb --> P. V. Ram Prasad Reddy indicated that two Derma products are expected to cover the gap starting from the calendar year 2024.\n\nebc1ce8cdabe36c0d72d32464cc3fa94 --> The company plans to file at least one inhaler product in the US in the second half of 2023, assuming everything goes as planned.\n\n737017d585aa110f74b5259b83281644 --> The Vizag injectable plant is expected to start commercializing by Q4 of FY24.", "citations": ["14a99057430ab39263ea64c136b6dc0c", "d0c0a2e7e930a7b875dfab050f7fc1d7", "ea82505d3bc13f597f2fa5dbfd210a35", "0926d24bdf2172ad9db2cc57afdd6559", "bafc7b0678209532e302499c45513483", "8de74c1efdf4f7ffb98bceac8b194284", "702575899a2be8cacbebea486ba23dcb", "ebc1ce8cdabe36c0d72d32464cc3fa94", "737017d585aa110f74b5259b83281644"]}, "['Q3', '2023']": {"answer": "36e1a82d6399a4795f0bcc6b6e2cd05d --> Santhanam Subramanian mentioned that the company has filed 11 ANDAs, including six injectables, during the quarter.\n\nb84a8fc505397602db8d2b6c463d1583 --> The CFO stated that the company expects to launch ten new products in the US market by the end of the next fiscal year.\n\n49ff34dab1ae14bca2c54caaae6ca637 --> Swami Iyer stated about 40 products are likely to come in the next 12 months.\n\nd70924f6793762900e240aee6fc95591 --> Santhanam Subramanian provided guidance on the Pen G project timeline and budget.\n\n4f1cf19102a839f645c36b0e5c0e8dd2 --> The launch of generic Revlimid is scheduled for Q3 FY24.\n\n9efbed4e1b5b020927c5a82463296902 --> Satakarni Makkapati plans to commercialize the PCV 15 vaccine two quarters from now, provided they receive the manufacturing license in April-May.\n\nacddd50c64703e10890150a9e80b43c9 --> Yugandhar Puvvala mentioned the expected commercialization timeline for the Vizag plant.", "citations": ["36e1a82d6399a4795f0bcc6b6e2cd05d", "b84a8fc505397602db8d2b6c463d1583", "49ff34dab1ae14bca2c54caaae6ca637", "d70924f6793762900e240aee6fc95591", "4f1cf19102a839f645c36b0e5c0e8dd2", "9efbed4e1b5b020927c5a82463296902", "acddd50c64703e10890150a9e80b43c9"]}, "['Q2', '2023']": {"answer": "24b40c2e8e29952c24df32090ca5a440 --> The CEO stated that they expect to launch 10 new products in the next fiscal year.\n\n0282f4e224d04299de87efb0927725a2 --> The COO announced the launch of three new products by Q4 of this fiscal year.\n\ndb8d2277058bcde8ccee8c5b0025dd6e --> The CEO indicated plans to launch three new products in the European market by Q3 of the upcoming year.\n\n98e8a61ca881fdf3d54ef0b7575f76cc --> Yugandhar Puvvala stated that they expect to launch roughly around 20 products in this financial year.\n\nb29c9dced56b46eb7549b63adadec405 --> The company has filed 14 ANDAs, including two injectables, during the quarter.\n\n5d64713bb441b01cbee30315c43acc91 --> Yugandhar Puvvala stated that the company expects to start filing from Q1 of the next financial year for the US plant.\n\n5d64713bb441b01cbee30315c43acc91 --> Yugandhar Puvvala mentioned a target to file 3 products every quarter, starting with the first product filing from May 2023.\n\nd9e5eafdc6bb41e35b974d3e4564a8d3 --> Sanjeev Dani plans to launch more than 200 products, including injectables, biosimilars, and oral solids over the next 2 years.\n\nba89bd712139b512b6845e277d08e5d0 --> Yugandhar Puvvala confirmed the launch of 20 products in the current financial year.\n\n45e079605f180a0be0067c2fa49ab274 --> Yugandhar Puvvala stated that they expect to launch around 20 products this year.\n\n45e079605f180a0be0067c2fa49ab274 --> Yugandhar Puvvala mentioned that they expect the filings for two products to happen from FY24 onwards.\n\ncd7777f3780bcd83ca9782a7230aeb1e --> Swami Iyer mentioned a potential launch of around 40 products for the next 12 months.", "citations": ["24b40c2e8e29952c24df32090ca5a440", "0282f4e224d04299de87efb0927725a2", "db8d2277058bcde8ccee8c5b0025dd6e", "98e8a61ca881fdf3d54ef0b7575f76cc", "b29c9dced56b46eb7549b63adadec405", "5d64713bb441b01cbee30315c43acc91", "d9e5eafdc6bb41e35b974d3e4564a8d3", "ba89bd712139b512b6845e277d08e5d0", "45e079605f180a0be0067c2fa49ab274", "cd7777f3780bcd83ca9782a7230aeb1e"]}, "['Q4', '2023']": {"answer": "cb967904bace866207aff8f23ab05ff3 --> The CEO of Aurobindo Pharma USA mentioned that they plan to launch three new products in the US market in Q3 of the next fiscal year.\n\n58a276680fee7644c4235a29a6cfd7c6 --> The CEO confirmed that the company plans to launch three new products by the end of the fiscal year.\n\nb90fcbcd138c8e30dbbf2511307be5f4 --> The first filing from the Vizag plant is expected to be in September 2023.\n\n86ba022de33836f1e11ae1e8d881810e --> Swami Iyer mentioned that new product launches would contribute to the top line in the next 12 months.\n\nf1026ecb56d52e2f1cce5da4162f041a --> Yugandhar Puvvala stated that the company plans to launch 20 products a year going forward, aiming for double-digit growth in their base business.\n\nf1026ecb56d52e2f1cce5da4162f041a --> Swami Iyer mentioned the anticipation of approximately 40 ANDAs to be commercialised during the current fiscal year.\n\n6d456105b56db9725360b643b69f5528 --> Santhanam Subramanian mentioned that product launches will impact the overall margin profile improving in the coming years.\n\neb10e8606a8d9185efcf32796623f2e1 --> We are hoping to file a DMF for another GLP 1 analogue by the end of this year.", "citations": ["cb967904bace866207aff8f23ab05ff3", "58a276680fee7644c4235a29a6cfd7c6", "b90fcbcd138c8e30dbbf2511307be5f4", "86ba022de33836f1e11ae1e8d881810e", "f1026ecb56d52e2f1cce5da4162f041a", "6d456105b56db9725360b643b69f5528", "eb10e8606a8d9185efcf32796623f2e1"]}, "['Q2', '2024']": {"answer": "a069d52b12741fd6ad192f8baf6b7050 --> Swami Iyer stated that the company will be launching 40 new products over the next 12 months.\n\n0367e7704983d0bc2aeffa32153762eb --> The project is expected to be completed and commercialized on 1st April as planned.", "citations": ["a069d52b12741fd6ad192f8baf6b7050", "0367e7704983d0bc2aeffa32153762eb"]}, "['Q3', '2024']": {"answer": "90b708e0b2a894eaa9a89f129480439a --> The CFO indicated that the company expects to launch 30 new products in the next fiscal year.\n\na4f56576cb9acb82406d4abc985efe71 --> Swami Iyer indicated that the product Ryzneuta is likely to be launched in the second quarter of the coming fiscal year or the second half of the current calendar year.\n\na71316b79d7c65cf40b27754014e733c --> The company plans to file two more products from the US facility.\n\n6cb3e8248cd268a8763a346c8528ded6 --> Swami Iyer stated that they hope to launch the product in July 2024 after receiving FDA approval and completing manufacturing.\n\nfb638ea057b0e6f0170797bfd7d5f84c --> Swami Iyer mentioned plans for manufacturing and commercial sale of BFS products in early fiscal 2025.\n\n2486e11d4bc6fa9b3c5e5e96b9ae049a --> The speaker mentioned that with Denosumab, they will be in the 1st and 2nd wave of launches.", "citations": ["90b708e0b2a894eaa9a89f129480439a", "a4f56576cb9acb82406d4abc985efe71", "a71316b79d7c65cf40b27754014e733c", "6cb3e8248cd268a8763a346c8528ded6", "fb638ea057b0e6f0170797bfd7d5f84c", "2486e11d4bc6fa9b3c5e5e96b9ae049a"]}, "['Q1', '2024']": {"answer": "e03f9709a9dd9d454deb06e18dbfd3e6 --> Yugandhar Puvvala confirmed that Revlimid will be launched from the 1st of October as per the settlement date.\n\n6102e4376a64b325cef12be7cb3474b8 --> The CEO indicated a focus on launching new products and expanding ANDA filings to drive future growth.\n\n2e09d35be1847ee74e35a9e5e71fcbb5 --> The company expects to have launches in several markets starting next year, with one launch for an oncology biosimilar in the Indian market this year, and FY25 would see a state of launches.\n\n95c6d54bfdcfd635e92eb72318942f27 --> Yugandhar Puvvala mentioned maintaining a track record of 20 plus product launches for the Eugia business.\n\n05ec08620c20c3d3be50c27b8186bdfd --> Swami Iyer stated that the launch of generic Opsumit is not expected in the 2024-2025 financial year and could be sometime later.\n\n6340b6a629d6835f697d891e88f9553a --> Satakarni Makkapati stated expectations for the oncology product portfolio by 2028.", "citations": ["e03f9709a9dd9d454deb06e18dbfd3e6", "6102e4376a64b325cef12be7cb3474b8", "2e09d35be1847ee74e35a9e5e71fcbb5", "95c6d54bfdcfd635e92eb72318942f27", "05ec08620c20c3d3be50c27b8186bdfd", "6340b6a629d6835f697d891e88f9553a"]}, "['Q4', '2024']": {"answer": "efad4ad6a18709b6e28f9a37c00e85da --> The CEO announced plans to launch three new product lines by Q3 2024.\n\ncef4eaa82bcc9b448596eb2e00f3d587 --> Yugandhar Puvvala mentioned plans to start filing more products from the Vizag plant as part of a de-risking strategy for Eugia-3.\n\n1c9a2d0f43ea73390d1e4276d6439a7d --> The CEO of Aurobindo Biosimilars, Vaccines and Peptide businesses stated an objective related to product development.\n\n3f0336ec4935b49477f8455dc4943f79 --> Dr. Satakarni Makkapati (CEO of Aurobindo Biosimilars & Director of Aurobindo Pharma Limited) mentioned plans to launch three new biosimilar products by the end of the next fiscal year.\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> The plan is to manufacture the batches and launch the trastuzumab product in the second half of this year [FY25] into the domestic market.\n\n65d2569e6b87b2287b07a887e7f5aafd --> The CEO aims to complete recruitment for the Oncology product by October this year and file in Q4 of the next fiscal year (FY26).\n\n65d2569e6b87b2287b07a887e7f5aafd --> The CEO anticipates filing the Ophthalmic product in FY26-27 due to slow recruitment rates across Europe.\n\n530d801f9b4f856f293b5a7fb3d939bb --> Mr. Swami Iyer stated that the product is expected to launch in the second half of the current calendar year, sometime in July.\n\n1a3a63a68331a119ed99857d0684e71d --> Tarang Agarwal mentioned that Pen-G and 6-APA projects are expected to start in September.\n\ne79cda64e9f07f01d0e6aa75c53e9acf --> Santhanam Subramanian mentioned that the meaningful contribution from the Pen-G and 6-APA projects will start coming from Q3 onwards, and the Auroactive project will start moving up by August-September.\n\na2ec8ef084db343b28af57663362605b --> Dr. Satakarni Makkapati plans to file a DMF for a second GLP-1 product in the next 2 or 3 months.\n\n56c80b1b2c222483b56435a24ce1efb7 --> The speaker mentioned the launch of Linaclotide in the Indian market within the next 3-4 months.\n\n8cc36f9313c54fccf7bbb0421e64a8da --> The launch of Ryzneuta in the U.S. is likely to happen in the second half of the current financial year.", "citations": ["efad4ad6a18709b6e28f9a37c00e85da", "cef4eaa82bcc9b448596eb2e00f3d587", "1c9a2d0f43ea73390d1e4276d6439a7d", "3f0336ec4935b49477f8455dc4943f79", "5c217a8e798e1ccaca460bbb5cbd08b5", "65d2569e6b87b2287b07a887e7f5aafd", "530d801f9b4f856f293b5a7fb3d939bb", "1a3a63a68331a119ed99857d0684e71d", "e79cda64e9f07f01d0e6aa75c53e9acf", "a2ec8ef084db343b28af57663362605b", "56c80b1b2c222483b56435a24ce1efb7", "8cc36f9313c54fccf7bbb0421e64a8da"]}}}, {"topic": "R&D investment focus", "data": {"['Q1', '2025']": {"answer": "c45761bf69733561e65706db60884c32 --> Mr. Santhanam Subramanian projected a 20% increase in R&D expenditure for the next year to support new product development.", "citations": ["c45761bf69733561e65706db60884c32"]}, "['Q1', '2023']": {"answer": "7ce3a760dcc5784918ef8b2d6d56734a --> The Vice Chairman and Managing Director discussed a planned increase in R&D investment.\n\n5035c5d6c105328e735814ee94527da9 --> Santhanam Subramanian mentioned that R&D expenditure is expected to be between 5.75% to 6.5% for the current year.", "citations": ["7ce3a760dcc5784918ef8b2d6d56734a", "5035c5d6c105328e735814ee94527da9"]}, "['Q3', '2023']": {"answer": "b84a8fc505397602db8d2b6c463d1583 --> The CEO of Aurobindo Biosimilars, Vaccines and Peptide business indicated a 20% increase in R&D investment in the upcoming year.\n\n7ee66e55daaee504f0abc1ed1210d103 --> The CEO announced plans to increase R&D investment by 20% in the coming fiscal year to support new product development.\n\n831e977176205e77b2567a23172178ae --> The R&D spend for the year is projected to be between 6% to 6.5% of the turnover.", "citations": ["b84a8fc505397602db8d2b6c463d1583", "7ee66e55daaee504f0abc1ed1210d103", "831e977176205e77b2567a23172178ae"]}, "['Q2', '2023']": {"answer": "c5ef1402ac9997f5caca28b0a7b31e98 --> Mr. S Subramanian (CFO) mentioned that the company's R&D expenditure is expected to be around 5.5% to 6% of sales for the fiscal year.\n\nc6dd3aa194268ed2dc222d0e296e1153 --> The company plans to enter into the phase 3 first patient injection milestone by Q4 of this fiscal year for its immunology program.\n\nd136e2c9ed4566656670e5d755152b9d --> S. Subramanian expects the R&D expense to increase to 6% of revenue in the coming quarters.", "citations": ["c5ef1402ac9997f5caca28b0a7b31e98", "c6dd3aa194268ed2dc222d0e296e1153", "d136e2c9ed4566656670e5d755152b9d"]}, "['Q4', '2023']": {"answer": "b90fcbcd138c8e30dbbf2511307be5f4 --> The R&D spend is expected to be around Rs. 400 crores per quarter.\n\n9f36bf4139a878b9b6d559a6d448ec50 --> Satakarni Makkapati stated that they would not invest in any interchangeability clinical trials for the time being.", "citations": ["b90fcbcd138c8e30dbbf2511307be5f4", "9f36bf4139a878b9b6d559a6d448ec50"]}, "['Q2', '2024']": {"answer": "c6ff82527158f973546133f5ac756760 --> Santhanam Subramanian stated that R&D spending will be around Rs. 350 to Rs. 400 crores in the third quarter.\n\n0367e7704983d0bc2aeffa32153762eb --> Trial runs for the fermentation process are expected to be completed successfully in January and February.\n\n6e8f1ae6f4130b2c27070f22c5f968b9 --> Santhanam Subramanian mentioned an estimated R&D spend of Rs. 750 to Rs. 800 crores in the second half of FY24.", "citations": ["c6ff82527158f973546133f5ac756760", "0367e7704983d0bc2aeffa32153762eb", "6e8f1ae6f4130b2c27070f22c5f968b9"]}, "['Q3', '2024']": {"answer": "eba0401512a062dd133b36a436ca479d --> The speaker stated that the recruitment of all 450 plus subjects in the Osteoporosis trial is expected to be completed inside Q2 of this year [June 2024], and the product is hoped to advance to filings in the second half of next calendar year.\n\neba0401512a062dd133b36a436ca479d --> The speaker mentioned completing the Phase 3 clinical trial for another immunology product by May this year, with an expectation to file with DCGI and other emerging markets by June-July this year.", "citations": ["eba0401512a062dd133b36a436ca479d"]}, "['Q4', '2024']": {"answer": "e79cda64e9f07f01d0e6aa75c53e9acf --> Santhanam Subramanian indicated that the intangible asset under development, specifically Acrotech products under WIP, will go by FY26.", "citations": ["e79cda64e9f07f01d0e6aa75c53e9acf"]}}}, {"topic": "Biosimilars development", "data": {"['Q1', '2025']": {"answer": "46e57a52d8cea8f855ad94aa0ecfbd01 --> The company plans to file the Tocilizumab biosimilar for India and emerging markets in the next three to four months.\n\na009f99ebbc3bbc3a8a2dffd7ee01d22 --> The Indian clinical study for the biosimilar to Omalizumab will be completed by the end of this year, allowing the product to be filed in India and certain emerging markets by Q3-Q4 [CY25].\n\na009f99ebbc3bbc3a8a2dffd7ee01d22 --> The large European study for the biosimilar to Omalizumab will be completed by mid-next year, and the product is expected to be filed in Q3 next fiscal [Q3 FY26] with EMA and the FDA.", "citations": ["46e57a52d8cea8f855ad94aa0ecfbd01", "a009f99ebbc3bbc3a8a2dffd7ee01d22"]}, "['Q1', '2023']": {"answer": "ce1146f7d5bdfbaecdbc9217a9402a44 --> Santhanam Subramanian indicated that four biosimilars are expected to enter clinical trials this year, with the financial impact observable from Q3 and Q4.", "citations": ["ce1146f7d5bdfbaecdbc9217a9402a44"]}, "['Q3', '2023']": {"answer": "21ba016e2cf3c1b11dff8654f981c2cb --> Satakarni Makkapati forecasted the clinical expenditure to continue for at least another 6-7 quarters due to the advancing Phase III portfolio.\n\n877801658c35df8fd0c06513da367e10 --> The company expects the first biosimilar in the US to be approved in 2025 and plans to leverage the field force of Acrotech Biopharma to market this product.\n\n877801658c35df8fd0c06513da367e10 --> The company is planning to bring an immunology biosimilar used in dermatology indication to the US by 2025-2026.", "citations": ["21ba016e2cf3c1b11dff8654f981c2cb", "877801658c35df8fd0c06513da367e10"]}, "['Q2', '2023']": {"answer": "15aa0519bfe95b028876e74a33778ab0 --> The company plans to unblind the clinical trial data of their phase 3 efficacy trial for a biosimilar starting at the end of Q3 this financial year, with a series of filings to begin from Q1/Q2 in the next fiscal year.\n\n44f862fc084d77a6140cecbb73f0a480 --> Satakarni Makkapati stated that a product approval in the area of biosimilars is expected next year, with commercialization revenues anticipated to begin in Q3 or Q4 of the next year.", "citations": ["15aa0519bfe95b028876e74a33778ab0", "44f862fc084d77a6140cecbb73f0a480"]}, "['Q4', '2023']": {"answer": "6287796b62943ca8a6689b575849f64e --> Dr. Satakarni Makkapati (CEO of Aurobindo’s Biosimilars, Vaccines and Peptides Businesses) indicated a significant expansion in biosimilars production capacity by the end of 2024.\n\nc14420be88d2e3b8a62c62db2c5803e6 --> Mr. Santhanam Subramanian indicated that Revlimid will be launched and contribute to sales growth. Additionally, there is an expectation of launching some biosimilar products by Q4, with full-year impacts seen in the next fiscal year starting from the April quarter, alongside contributions from Pen-G.\n\nae9d6caa4638aab0d7d9bb5cfd585f09 --> The biosimilar plant is expected to be commissioned by FY23.\n\n1c80322e4d75f6df0005dd397784a10a --> The management plans to initiate a phase III trial by Q3 of this year for a biosimilar aimed at treating osteoporosis.\n\n4cef312e57fc1f2f66b75621a57abd65 --> The filing process for the biosimilar of Herceptin in Emerging Markets will begin in June-July, with the first filing in India, followed by filing with the European Medicines Agency by September, and with the US FDA by Q4 of this fiscal year.\n\na0b2e9f11dd6282d1d63df5f474a33d7 --> Satakarni Makkapati expects to have at least one biosimilar product in the market by the end of this year and 2 to 3 products in the European market next year, with the first filing in the US market during this period. The inflection point for biosimilars is anticipated to start from FY 2025-26.\n\nad82a7c0fbaca8089c277998f95d8e98 --> The speaker inferred as a member of the management team stated the intent to file the biosimilar product in 2025, potentially two quarters ahead of the formulation patent expiration in the US.", "citations": ["6287796b62943ca8a6689b575849f64e", "c14420be88d2e3b8a62c62db2c5803e6", "ae9d6caa4638aab0d7d9bb5cfd585f09", "1c80322e4d75f6df0005dd397784a10a", "4cef312e57fc1f2f66b75621a57abd65", "a0b2e9f11dd6282d1d63df5f474a33d7", "ad82a7c0fbaca8089c277998f95d8e98"]}, "['Q2', '2024']": {"answer": "742df7dbb697722b27736d080fd07b00 --> The speaker mentioned that the ideation is to have a large mammalian cell culture drug substance manufacturing facility with a series of 15KL bioreactors and complete fill and finish capabilities.\n\n5a40db9d01b3281832af6d0e28371e72 --> The biosimilar products plant is expected to be commissioned by FY25 or early FY26.\n\n2e81e861cd8c86b5a00cadec292be07b --> Dr. Satakarni Makkapati expects the filing of three biosimilars, Pegylated filgrastim, Filgrastim, and Trastuzumab, to be completed before the end of January 2024.", "citations": ["742df7dbb697722b27736d080fd07b00", "5a40db9d01b3281832af6d0e28371e72", "2e81e861cd8c86b5a00cadec292be07b"]}, "['Q3', '2024']": {"answer": "343db7b91b121d131d18b4207c9213aa --> The biosimilar products plant is expected to be commissioned by FY25 or early FY26.\n\n56325c615496aaf1b226b0b3b0e64dbe --> The CEO of Aurobindo Biosimilars, Vaccines and Peptide Businesses mentioned a target to launch three new biosimilar products by the end of 2025.\n\n67b7d58880d2349f92becbd68c33fc0c --> Dr. Satakarni Makkapati stated that they hope to complete the recruitment for the Omalizumab biosimilar Phase 3 clinical trials by October 2024 and submit it to both Europe and the US in Q2 or Q3 of the next financial year.\n\n0e600e3ac4954493d2ceca3752211856 --> Dr. Satakarni Makkapati stated that Trastuzumab is expected to be commercialized in the Indian market in the next quarter or two, with regulatory approvals in Europe, Canada, and MHRA expected towards the end of next fiscal year, leading to commercialization in the next four to five quarters.\n\n0e600e3ac4954493d2ceca3752211856 --> Dr. Satakarni Makkapati expects the Xolair biosimilar and the Prolia biosimilar Denosumab to be filed in 2025 in Europe and other regulated markets, including the U.S., with commercialization opportunity in 2026.", "citations": ["343db7b91b121d131d18b4207c9213aa", "56325c615496aaf1b226b0b3b0e64dbe", "67b7d58880d2349f92becbd68c33fc0c", "0e600e3ac4954493d2ceca3752211856"]}, "['Q4', '2024']": {"answer": "65d2569e6b87b2287b07a887e7f5aafd --> The CEO expects to file the biosimilar to Xolair with both the EMIA and the FDA sometime in Q2, Q3 of the next fiscal year (FY26).\n\n65d2569e6b87b2287b07a887e7f5aafd --> The CEO plans to submit the Denosumab biosimilar with the EMIA and FDA between Q2 and Q3 of the next fiscal year (FY26).", "citations": ["65d2569e6b87b2287b07a887e7f5aafd"]}}}, {"topic": "Vaccine production advancements", "data": {"['Q1', '2023']": {"answer": "beac46eb9c5e1395c3dee65439ea7959 --> The company plans to roll out two to three vaccine products in the next two to three years.\n\n5ba63bf5bbfe3bdd563829afd4fd5b93 --> P. V. Ram Prasad Reddy mentioned the potential launch of a vaccine product in the next one to two months, pending clinical trial outcomes.\n\nc1e232f6fbab8df538ab94326bd5fd41 --> Santhanam Subramanian mentioned the timeline for the outcome of the PCV vaccine results.", "citations": ["beac46eb9c5e1395c3dee65439ea7959", "5ba63bf5bbfe3bdd563829afd4fd5b93", "c1e232f6fbab8df538ab94326bd5fd41"]}, "['Q3', '2024']": {"answer": "d8f38a4adbd741d850b5b612e859a4be --> Dr. Satakarni Makkapati mentioned a plan to generate more data to take the pneumococcal vaccine product to WHO markets in 2026.", "citations": ["d8f38a4adbd741d850b5b612e859a4be"]}}}]}, {"theme": "Operational Efficiency", "topics": [{"topic": "Supply chain optimization", "data": {"['Q3', '2023']": {"answer": "4f48731d31e2e18a43ab0e249c1bf770 --> Santhanam Subramanian described the timeline for project material installation and payment.", "citations": ["4f48731d31e2e18a43ab0e249c1bf770"]}, "['Q2', '2024']": {"answer": "6921a587c1cdd9c89348e15df3e5edec --> Sanjeev Dani stated that the stock situation in oral solid should improve in the next 2-4 months.", "citations": ["6921a587c1cdd9c89348e15df3e5edec"]}}}, {"topic": "Cost reduction strategies", "data": {"['Q1', '2025']": {"answer": "2b3fac7ca1f47cf29adc769d622963a2 --> Santhanam Subramanian mentioned that the remediation cost is expected to come down to US$2 million this quarter.", "citations": ["2b3fac7ca1f47cf29adc769d622963a2"]}, "['Q1', '2023']": {"answer": "dc6c4c208963a36272bda3c80987db22 --> Santhanam Subramanian mentioned that the full impact of the reduction in logistics costs might be seen in the next quarter, Q3.", "citations": ["dc6c4c208963a36272bda3c80987db22"]}, "['Q3', '2023']": {"answer": "497d13c659a135ecf9e7d0531093d3bf --> Mr. S. Subramanian (CFO) stated that the company expects to achieve a 10% reduction in operating expenses by the end of the fiscal year.\n\n618f9eafbb36ac83a0c04c5f848707df --> The Pen-G Project will start on 1st April 2024, which is expected to add to the top line and reduce some costs.", "citations": ["497d13c659a135ecf9e7d0531093d3bf", "618f9eafbb36ac83a0c04c5f848707df"]}, "['Q2', '2023']": {"answer": "c73e7aedeac72b7e5e57223ee2d2c36e --> Yugandhar Puvvala mentioned that the issues faced in Q2 are considered to be one-off and not a trend going forward.", "citations": ["c73e7aedeac72b7e5e57223ee2d2c36e"]}, "['Q3', '2024']": {"answer": "90b708e0b2a894eaa9a89f129480439a --> The CEO stated that the company plans to achieve a 10% reduction in operational costs by the end of FY25.", "citations": ["90b708e0b2a894eaa9a89f129480439a"]}, "['Q4', '2024']": {"answer": "1c9a2d0f43ea73390d1e4276d6439a7d --> The President of Europe Formulations Business discussed an efficiency target.", "citations": ["1c9a2d0f43ea73390d1e4276d6439a7d"]}}}, {"topic": "Manufacturing process improvements", "data": {"['Q1', '2025']": {"answer": "e6483073eeb03b07f2f62e7ad53c3333 --> The China plant is expected to be commercialized from Q3 FY25 with a ramp-up expected from Q4 FY25.\n\n0884694f79ebe2e2715f3c1fa6033503 --> Santhanam Subramanian mentioned the plan to produce 20 batches in the current month and 30 batches in the next month, with significant ramp-up starting in October.", "citations": ["e6483073eeb03b07f2f62e7ad53c3333", "0884694f79ebe2e2715f3c1fa6033503"]}, "['Q1', '2023']": {"answer": "df04a0756ed463f778ce9f28d16cdbdc --> The PLI project is expected to be commissioned by April 1, 2024, with completion aimed by Q4 2024.\n\n5ba63bf5bbfe3bdd563829afd4fd5b93 --> Yugandhar Puvvala stated that the existing four commercial plants, with expanded capacity, can meet demand up to FY26.", "citations": ["df04a0756ed463f778ce9f28d16cdbdc", "5ba63bf5bbfe3bdd563829afd4fd5b93"]}, "['Q2', '2023']": {"answer": "0282f4e224d04299de87efb0927725a2 --> The CEO of Eugia Pharma Specialties Limited stated an operational goal to increase production capacity by 20% by mid-next year.\n\ndb8d2277058bcde8ccee8c5b0025dd6e --> The CFO mentioned that the company is targeting a 20% increase in production capacity by the end of the next fiscal year.\n\nc3c77adae4cc1bab4bf3c30d9265c608 --> S. Subramanian mentioned that 50% of the products have been moved to India in the last 3-4 years, and this process is being continued.\n\nd136e2c9ed4566656670e5d755152b9d --> S. Subramanian stated that the production capacity will be around 15,000 Metric Tonnes.\n\n3907652bc9e5628a0b561c9d083684fb --> Satakarni Makkapati mentioned that the 15KL manufacturing bioreactor capacity is expected to become operational and ready for commercial supplies in FY25-26.", "citations": ["0282f4e224d04299de87efb0927725a2", "db8d2277058bcde8ccee8c5b0025dd6e", "c3c77adae4cc1bab4bf3c30d9265c608", "d136e2c9ed4566656670e5d755152b9d", "3907652bc9e5628a0b561c9d083684fb"]}, "['Q4', '2023']": {"answer": "ae9d6caa4638aab0d7d9bb5cfd585f09 --> The company plans to commission the balance of the US Raleigh facility by FY23 or during FY25.\n\nae9d6caa4638aab0d7d9bb5cfd585f09 --> The China plant is expected to be commissioned in Q1 FY25.\n\nae9d6caa4638aab0d7d9bb5cfd585f09 --> The Lyfius plant is expected to be commissioned by 2023, with an endeavour to complete ahead of schedule.", "citations": ["ae9d6caa4638aab0d7d9bb5cfd585f09"]}, "['Q2', '2024']": {"answer": "5a40db9d01b3281832af6d0e28371e72 --> The Pen-G plant and the 6-APA plant are expected to be operational from Q4 FY24 or Q1 FY25.", "citations": ["5a40db9d01b3281832af6d0e28371e72"]}, "['Q3', '2024']": {"answer": "62df2ca2bef1f99033f774c8b1e3b3eb --> The management team anticipates resuming production on non-aseptic lines around the end of the month, with a phased return to service on aseptic lines, and progressive release of tested stocks starting from the second fortnight of February 2024.\n\n343db7b91b121d131d18b4207c9213aa --> The Lyfius plant for Pen-G and the 6-APA plant operations are expected to start from Q1 FY25.\n\nf2307ad256c544b75579d5a60f1bc19a --> Yugandhar Puvvala stated that the company expects to resume full production flow in 1-2 months and be back in full flow from April.\n\n0bdb21fa38c8012be4088faabf7b00e8 --> Yugandhar Puvvala stated that the entire production is expected to get streamlined by the end of FY24.\n\n6148328dae34be0733c0a9c59d67ea87 --> The Chinese plant is expected to be commissioned by Q2.", "citations": ["62df2ca2bef1f99033f774c8b1e3b3eb", "343db7b91b121d131d18b4207c9213aa", "f2307ad256c544b75579d5a60f1bc19a", "0bdb21fa38c8012be4088faabf7b00e8", "6148328dae34be0733c0a9c59d67ea87"]}, "['Q1', '2024']": {"answer": "3162e7cd37735d8413e23f277c401b41 --> Swami Iyer mentioned plans to quickly redo the facility in Puerto Rico and get back into business.\n\nf61df7f376dac421ccce022404a9ad17 --> The management indicated that PLI facilities and investments are targeted to be completed before 1st April, 2024.\n\n6838cb5e4af09f443d6a7f0a89ca42c3 --> Mr. Santhanam Subramanian mentioned that the capacity ramp-up is expected to be completed by October-November next year, with clarity expected by February.", "citations": ["3162e7cd37735d8413e23f277c401b41", "f61df7f376dac421ccce022404a9ad17", "6838cb5e4af09f443d6a7f0a89ca42c3"]}, "['Q4', '2024']": {"answer": "6be08a8492eabb34418b6fc7bd1ef6d8 --> Dr. Satakarni Makkapati mentioned that by 2026, the capacities will be aligned and commissioned to start the water and engineering runs in the facility at Theranym.", "citations": ["6be08a8492eabb34418b6fc7bd1ef6d8"]}}}, {"topic": "Efficiency measures", "data": {"['Q1', '2025']": {"answer": "84b8fef56659a08f1bb75f029d48ab26 --> Santhanam Subramanian mentioned a plan to achieve 80% of the ramp-up by next quarter.", "citations": ["84b8fef56659a08f1bb75f029d48ab26"]}, "['Q3', '2023']": {"answer": "325f50cae22f7361590f930ae46b03c0 --> Santhanam Subramanian stated that the API business is being carved out to improve operating efficiency and capacity utilization, with the process expected to take effect from 1st April.", "citations": ["325f50cae22f7361590f930ae46b03c0"]}, "['Q1', '2024']": {"answer": "20f6343eeb0ba8b2a1522741306546d6 --> The company plans to continue strong execution in the coming quarters while adhering to the highest quality standards.", "citations": ["20f6343eeb0ba8b2a1522741306546d6"]}}}]}, {"theme": "Market Strategy and Expansion", "topics": [{"topic": "Geographic expansion plans", "data": {"['Q1', '2025']": {"answer": "d08396667e0eabe20b3d1212addbc76c --> The expansion of Unit 15 in India is expected to contribute to improved time-to-market for European business by leveraging increased production and dispatch capabilities.\n\ne7bc63d5521ec36a60711b0aa56b1fc2 --> Santhanam Subramanian provided guidance on the China market, expecting small volume in November-December and full-fledged volumes in FY26.", "citations": ["d08396667e0eabe20b3d1212addbc76c", "e7bc63d5521ec36a60711b0aa56b1fc2"]}, "['Q1', '2023']": {"answer": "a946b049a9947c51a4ae335ed5d6880e --> The commercialization of the seven plants is expected to start in a year and end within the next three to four years.\n\nebc1ce8cdabe36c0d72d32464cc3fa94 --> The company expects commercial production to start in January 2024 for their China business.", "citations": ["a946b049a9947c51a4ae335ed5d6880e", "ebc1ce8cdabe36c0d72d32464cc3fa94"]}, "['Q3', '2023']": {"answer": "d5cce5c2dec8383593e581ea4ff1ece8 --> The management expects to initiate commercial activities in the EMEA region for at least one product before the end of the next fiscal year, and for the second product in the first or second quarter of the following fiscal year.\n\nd5cce5c2dec8383593e581ea4ff1ece8 --> The management anticipates commercial sales in Canada to begin in either the fourth quarter of the next fiscal year or the early first quarter of the following fiscal year (FY25).", "citations": ["d5cce5c2dec8383593e581ea4ff1ece8"]}, "['Q4', '2023']": {"answer": "1c80322e4d75f6df0005dd397784a10a --> The company plans to file a third immunology biosimilar product in the next fiscal year in India and Emerging Markets.\n\nd9cad7b073553fcafbef00babdbc06b0 --> The company plans to start European manufacturing from the China plant in the first quarter of FY25 and expects to begin manufacturing for the Chinese market by the third or fourth quarter of FY25.", "citations": ["1c80322e4d75f6df0005dd397784a10a", "d9cad7b073553fcafbef00babdbc06b0"]}, "['Q3', '2024']": {"answer": "343db7b91b121d131d18b4207c9213aa --> The Vizag injectable plant is expected to be commercial in Q1 / Q2 FY25 and generate revenues from the US and Europe by FY26.\n\n56325c615496aaf1b226b0b3b0e64dbe --> The President of Europe Formulations Business provided a goal to increase market share in Europe by 5% within two years.\n\n9327d51787650be2aa9b62887990abfc --> Santhanam Subramanian stated that growth in the ROW market, particularly in China, is expected to reach at least $10 million to $20 million in a year once the plant is commercialized by Q2.", "citations": ["343db7b91b121d131d18b4207c9213aa", "56325c615496aaf1b226b0b3b0e64dbe", "9327d51787650be2aa9b62887990abfc"]}, "['Q1', '2024']": {"answer": "f61df7f376dac421ccce022404a9ad17 --> The management stated that commercialisation of some of their other new projects in China and India is expected by Q1 FY25.\n\n06b8db6dc82c66ce80af5d4acefa3d40 --> Santhanam Subramanian mentioned completing the integration of the remaining small markets into the Eugia entity over the next 3-4 months.\n\n6102e4376a64b325cef12be7cb3474b8 --> The CEO mentioned the continued expansion of the US market, with plans to increase product offerings and maintain growth momentum.\n\na43f8186f543116be60784c2f62f242f --> Santhanam Subramanian stated that the China plant is expected to start for the Europe business by April 2024.", "citations": ["f61df7f376dac421ccce022404a9ad17", "06b8db6dc82c66ce80af5d4acefa3d40", "6102e4376a64b325cef12be7cb3474b8", "a43f8186f543116be60784c2f62f242f"]}, "['Q4', '2024']": {"answer": "b4b7b4f763e4e66d4cf9f6fbaf741883 --> The sales volume in the US is expected to pick up during the quarter [Q1FY25].\n\n3f0336ec4935b49477f8455dc4943f79 --> Mr. V. Muralidharan (President, Europe Formulations Business) stated the intention to expand the company's footprint in Europe by opening five new offices by the end of 2025.", "citations": ["b4b7b4f763e4e66d4cf9f6fbaf741883", "3f0336ec4935b49477f8455dc4943f79"]}}}, {"topic": "Strategic partnerships", "data": {"['Q1', '2023']": {"answer": "14a99057430ab39263ea64c136b6dc0c --> Sanjeev Dani indicated that they are looking at about $300 million plus in the next couple of years from a 5% to 10% market share.", "citations": ["14a99057430ab39263ea64c136b6dc0c"]}, "['Q4', '2023']": {"answer": "58a276680fee7644c4235a29a6cfd7c6 --> The CFO stated that the company expects to increase its market share by 3% over the next two quarters.", "citations": ["58a276680fee7644c4235a29a6cfd7c6"]}, "['Q2', '2024']": {"answer": "e23f17ec8a09a33b91cc7e93c60172f1 --> Sanjeev Dani indicated that the acquisition of branded products of Pfizer is expected to close in this quarter.", "citations": ["e23f17ec8a09a33b91cc7e93c60172f1"]}}}, {"topic": "Competitive positioning", "data": {"['Q2', '2023']": {"answer": "0282f4e224d04299de87efb0927725a2 --> The CEO of Aurobindo USA confirmed a target to achieve 15% market share in the US generic market by the end of next year.", "citations": ["0282f4e224d04299de87efb0927725a2"]}, "['Q4', '2024']": {"answer": "3f0336ec4935b49477f8455dc4943f79 --> Mr. Swami Iyer (CEO, Aurobindo Pharma, USA) confirmed the target of achieving a 12% market share in the US generics market by the end of next year.", "citations": ["3f0336ec4935b49477f8455dc4943f79"]}}}, {"topic": "Emerging market penetration", "data": {"['Q1', '2023']": {"answer": "e7d96902a72dc759c419d991abadc868 --> Surya Patra mentioned an expectation of building a branded formulation base in the Indian market of approximately INR 1,000 Cr in two-to-three years.", "citations": ["e7d96902a72dc759c419d991abadc868"]}, "['Q2', '2024']": {"answer": "5d23baf9e94729401627e47096a427d2 --> Dr. Satakarni Makkapati stated that the biologics contract manufacturing industry is poised to grow to about 30 to 40 billion US dollars by 2030.", "citations": ["5d23baf9e94729401627e47096a427d2"]}}}]}, {"theme": "Customer Engagement", "topics": [{"topic": "Customer satisfaction initiatives"}, {"topic": "Loyalty program enhancements"}, {"topic": "Digital engagement channels"}, {"topic": "Feedback-driven improvements"}]}, {"theme": "Regulatory and Compliance", "topics": [{"topic": "FDA approval status", "data": {"['Q1', '2025']": {"answer": "46e57a52d8cea8f855ad94aa0ecfbd01 --> The management expects to see approvals for three products from the EMA starting to trickle in within two quarters, provided there are no more regulatory uncertainties.\n\n46e57a52d8cea8f855ad94aa0ecfbd01 --> The Trastuzumab US filing is expected to be submitted to the FDA in the next four to eight weeks.\n\n24336a5714cdedb21a30e4ff36ac7abe --> The executive mentioned plans for further ANDA filings and approvals, with 54 pending final approval as of June 30, 2024.\n\nb6033cacac59078621b2c3d0b3e42744 --> Yugandhar Puvvala expressed confidence that issues with the Bhiwadi plant will be resolved in the next 1-2 months.", "citations": ["46e57a52d8cea8f855ad94aa0ecfbd01", "24336a5714cdedb21a30e4ff36ac7abe", "b6033cacac59078621b2c3d0b3e42744"]}, "['Q3', '2023']": {"answer": "877801658c35df8fd0c06513da367e10 --> The company plans to start the filing process of a monoclonal antibody in India and Emerging Markets in July of the next fiscal year, with filings to the European Medicines Agency by September and to the USFDA by December, aiming for approval with EMEA and FDA by FY25.", "citations": ["877801658c35df8fd0c06513da367e10"]}, "['Q2', '2023']": {"answer": "b29c9dced56b46eb7549b63adadec405 --> The company as of 30th September 2022, has filed 756 ANDAs, with 527 having final approval and 36 having tentative approval.\n\nc6dd3aa194268ed2dc222d0e296e1153 --> The company expects to close the trial by Q1 of FY24 and initiate the filing process in Europe and the US.\n\n44f862fc084d77a6140cecbb73f0a480 --> Satakarni Makkapati indicated that revenues from three large antibody clinical trials are expected to kick in by FY24 end or FY25, due to the regulatory process taking 9-15 months in Europe and the US after filing.\n\n557ab345679d60d64b475d9a518cb3dd --> The speaker expects the regulatory process for approval of the PCV-15 vaccine to unfold in the next 2-4 months.", "citations": ["b29c9dced56b46eb7549b63adadec405", "c6dd3aa194268ed2dc222d0e296e1153", "44f862fc084d77a6140cecbb73f0a480", "557ab345679d60d64b475d9a518cb3dd"]}, "['Q4', '2023']": {"answer": "a0b2e9f11dd6282d1d63df5f474a33d7 --> Satakarni Makkapati expects the regulatory procedures for biosimilar filings to conclude anytime between Q2 of this year to Q2 of the next year, leading to a series of launches in regulated markets.\n\nf4920e1e41cca95f29348d49e2520097 --> Plans are in place to do around 5-6 filings from the US plant during this fiscal, and it should get commercialized in FY25 if the FDA audit is triggered on time.", "citations": ["a0b2e9f11dd6282d1d63df5f474a33d7", "f4920e1e41cca95f29348d49e2520097"]}, "['Q3', '2024']": {"answer": "0678e018015e59fcf60b05b224a61968 --> The company plans to submit a comprehensive written response to the FDA's observations by February 26th, 2024.\n\n875c6d0ff4e2f302a302af5953e6730d --> Yugandhar Puvvala indicated that the Vizag plant is being prepared as a backup to Eugia III and expects an inspection for the products filed to the US from Vizag to happen in the next few quarters.\n\nb681e3bfa4d05db959161bd68bcbe8fa --> Santhanam Subramanian stated that the approval from Chinese regulators may come around Q2 or Q3 of the next fiscal year.", "citations": ["0678e018015e59fcf60b05b224a61968", "875c6d0ff4e2f302a302af5953e6730d", "b681e3bfa4d05db959161bd68bcbe8fa"]}, "['Q1', '2024']": {"answer": "20f6343eeb0ba8b2a1522741306546d6 --> The management stated that out of 18 US FDA regulated units, 17 units have a classification of VAI, and only 1 unit is under a warning letter.\n\n6340b6a629d6835f697d891e88f9553a --> Satakarni Makkapati provided a timeline for obtaining a manufacturing license for the pneumococcal conjugate vaccine.", "citations": ["20f6343eeb0ba8b2a1522741306546d6", "6340b6a629d6835f697d891e88f9553a"]}, "['Q4', '2024']": {"answer": "193a1666b58da939b4686bb4a0899378 --> Yugandhar Puvvala mentioned that the remediation activities are expected to continue for another 3-4 months.\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> We should be able to complete the USFDA filing for trastuzumab in the next 3 months.\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> A decision from the European Medicines Agency for trastuzumab is expected towards the end of Q3 or early Q4 [FY25].\n\n5c217a8e798e1ccaca460bbb5cbd08b5 --> Approval for the two additional biosimilars in the Oncology space is expected in Q3 or Q4 [FY25].\n\n19503ab2d62e0bec08a11259fa6ea558 --> Dr. Satakarni Makkapati expects to file Trastuzumab with the US FDA by the end of the next quarter.\n\nd835e76bce72eff43e6b8bb907f56582 --> The speaker indicated a timeline for filing PEG-filgrastim with the US FDA, stating it might be filed in Q4 of this year or Q1 of next year.", "citations": ["193a1666b58da939b4686bb4a0899378", "5c217a8e798e1ccaca460bbb5cbd08b5", "19503ab2d62e0bec08a11259fa6ea558", "d835e76bce72eff43e6b8bb907f56582"]}}}, {"topic": "Compliance with international standards", "data": {"['Q1', '2023']": {"answer": "c1e232f6fbab8df538ab94326bd5fd41 --> P. V. Ram Prasad Reddy provided a timeline for taking the vaccine project to the WHO.", "citations": ["c1e232f6fbab8df538ab94326bd5fd41"]}, "['Q2', '2023']": {"answer": "557ab345679d60d64b475d9a518cb3dd --> The speaker indicates a plan to have a WHO filing for the PCV-15 vaccine in 2024.", "citations": ["557ab345679d60d64b475d9a518cb3dd"]}}}, {"topic": "Quality assurance measures", "data": {}}, {"topic": "Regulatory challenges", "data": {"['Q2', '2023']": {"answer": "85615c41b6fbce850ac316ea8ecba220 --> Satakarni Makkapati indicated that the EMA clock stop for two oncology programs will be until June 2023, unless inspectors become available sooner.\n\n13cacdd696843a3bf773f032a7579dcd --> Satakarni Makkapati indicated that the inspection in Europe is expected to happen in June 2023, with the possibility of it occurring anytime between January to June.", "citations": ["85615c41b6fbce850ac316ea8ecba220", "13cacdd696843a3bf773f032a7579dcd"]}, "['Q4', '2023']": {"answer": "f6fd8a88763fb748ae81e5fc06a34dc3 --> The speaker from Aurobindo and CuraTeQ mentioned that interchangeability as a requirement for an additional clinical trial will no longer be necessary towards the end of this decade.", "citations": ["f6fd8a88763fb748ae81e5fc06a34dc3"]}, "['Q2', '2024']": {"answer": "43abb32226160a208d27ced1190c6126 --> Dr. Satakarni Makkapati stated that the CHMP intends to audit the company for Filgrastim and Peg filgrastim sometime in Q1 next year.", "citations": ["43abb32226160a208d27ced1190c6126"]}}}]}, {"theme": "Leadership and Management", "topics": [{"topic": "Executive team roles", "data": {}}, {"topic": "Strategic leadership initiatives", "data": {"['Q3', '2024']": {"answer": "64262423f03ca1dfa065d3bb1668a837 --> No explicit guidance with clear metrics, timelines, or actionable plans was identified in the provided earnings transcript.", "citations": ["64262423f03ca1dfa065d3bb1668a837"]}}}, {"topic": "Corporate governance practices", "data": {}}, {"topic": "Succession planning", "data": {"['Q1', '2023']": {"answer": "fa9ac6fb15b4c6a234f8b7367d80e330 --> P. V. Ram Prasad Reddy mentioned a future plan to appoint someone in the next two to three years.", "citations": ["fa9ac6fb15b4c6a234f8b7367d80e330"]}}}]}, {"theme": "Capital Expenditure and Financial Management", "topics": [{"topic": "Capex planning and allocation", "data": {"['Q1', '2025']": {"answer": "1e4fdcecdcc41e83ae7990922573b39d --> Aurobindo Pharma will be completing their first ever buyback of Rs. 750 crores in August 2024 at a price of Rs. 1,460.", "citations": ["1e4fdcecdcc41e83ae7990922573b39d"]}, "['Q3', '2023']": {"answer": "292800153225282b370128952d92407d --> The company plans to achieve a cumulative Penicillin G capital expenditure of USD 250 million.\n\nace59337ee9ce7ecc8e4f53bd9939aff --> The company will address the potential share buyback in the May Board meeting while considering the investment in the Penicillin G Project.\n\n326296bcc76533c40d2745d4e44315f9 --> Santhanam Subramanian indicated that some of the capital work in progress projects are expected to start commissioning by 31.03.2024 onwards.\n\n326296bcc76533c40d2745d4e44315f9 --> Santhanam Subramanian stated that at least some of the capital work in progress will get capitalised on or before 31st March 2024.", "citations": ["292800153225282b370128952d92407d", "ace59337ee9ce7ecc8e4f53bd9939aff", "326296bcc76533c40d2745d4e44315f9"]}, "['Q2', '2023']": {"answer": "d0f39d65e73a8664aed4a971a82b78d3 --> S. Subramanian mentioned that Rs. 1,500 crores will be spent on the Pen-G plant in the coming year.\n\nd0f39d65e73a8664aed4a971a82b78d3 --> S. Subramanian indicated that they will be doing a CapEx of around $125 to $150 million every year.", "citations": ["d0f39d65e73a8664aed4a971a82b78d3"]}, "['Q4', '2023']": {"answer": "51e635444677656a51659fffdff9da47 --> The management stated that PLI implementation will be completed by March 2024, with major capex concluding post-implementation.\n\n73901c34437d5ac1d4cdeadcaaff2d16 --> The CFO stated that the maintenance capex for existing plants will be around USD 120 to 130 million for FY24.\n\n73901c34437d5ac1d4cdeadcaaff2d16 --> The CFO mentioned potential new capex for new products and markets could be between USD 75 to 100 million, depending on decisions by the end of the year.\n\nd9cad7b073553fcafbef00babdbc06b0 --> The company plans to spend an additional USD 130 to 140 million on the Pen-G project by the end of FY24, bringing the total estimated cost to USD 250 to 265 million.", "citations": ["51e635444677656a51659fffdff9da47", "73901c34437d5ac1d4cdeadcaaff2d16", "d9cad7b073553fcafbef00babdbc06b0"]}, "['Q2', '2024']": {"answer": "717ed857a147a7d9e8ccd9cb7dd72823 --> The speaker mentioned concluding negotiations by March 31, 2024, to have a clear idea of the investments in the plant.\n\n97ac23b0c7244653e4808a2737ee0b3a --> The company plans to shut down the operation in Puerto Rico and invest in restructuring and modifying the plant, with CapEx planned in a couple of years' time.\n\n8054ebb99726faa4f7e5b095f52ed376 --> The Pen G project, amounting to approximately USD 185 million, will be capitalized by the March quarter.\n\n622924f2dc567781602eacc3565d7f3e --> Santhanam Subramanian stated that the base depreciation will be around Rs. 350 crores every quarter.\n\n2b137f0851cae7453334889534b1dbdc --> Santhanam Subramanian mentioned that the existing plant CapEx is expected to be around USD 125 to 150 million.\n\n88fac62c3156257db1bc1495ff37283f --> Santhanam Subramanian mentioned a strategic CapEx plan involving biosimilars and CMO, with an investment of 100 to 150 million.", "citations": ["717ed857a147a7d9e8ccd9cb7dd72823", "97ac23b0c7244653e4808a2737ee0b3a", "8054ebb99726faa4f7e5b095f52ed376", "622924f2dc567781602eacc3565d7f3e", "2b137f0851cae7453334889534b1dbdc", "88fac62c3156257db1bc1495ff37283f"]}, "['Q3', '2024']": {"answer": "56325c615496aaf1b226b0b3b0e64dbe --> The CFO stated that capital expenditure for the next fiscal year will be approximately $150 million.", "citations": ["56325c615496aaf1b226b0b3b0e64dbe"]}}}, {"topic": "Debt management and reduction", "data": {"['Q2', '2024']": {"answer": "b989b03e3d75c51885199c0a06fc175e --> Santhanam Subramanian stated that the Gross Debt and cash put together by the end of the year will be between $0 to $50 million, and the net cash is expected to return to $200 million over a period of 6 to 9 months after the commissioning of the PLI project.", "citations": ["b989b03e3d75c51885199c0a06fc175e"]}}}, {"topic": "Cash flow projections", "data": {"['Q1', '2025']": {"answer": "25bd59ebe2d03f31250eba6feb1c25fd --> Santhanam Subramanian indicated that the effective tax rate is expected to be around 27-28% for the fiscal year.", "citations": ["25bd59ebe2d03f31250eba6feb1c25fd"]}, "['Q4', '2023']": {"answer": "51e635444677656a51659fffdff9da47 --> The management anticipates good cash generation from FY25 onwards after capitalizing all assets.\n\n8f00122a0d07e423c579a2913ffdf93d --> Santhanam Subramanian stated that the free cash generation for the business is expected to begin from FY25.", "citations": ["51e635444677656a51659fffdff9da47", "8f00122a0d07e423c579a2913ffdf93d"]}}}, {"topic": "Margin improvement strategies", "data": {"['Q3', '2024']": {"answer": "343db7b91b121d131d18b4207c9213aa --> EBITDA margins are expected to improve with Pen-G plant commercialization and stabilization of the manufacturing process, excluding margins from biosimilars.", "citations": ["343db7b91b121d131d18b4207c9213aa"]}}}]}, {"theme": "Strategic Business Initiatives", "topics": [{"topic": "Biosimilars and vaccine pipeline", "data": {"['Q3', '2023']": {"answer": "7031fc2ed6f98dfb0c702177f376a4df --> Cashflows are expected to be generated starting FY25 onwards from the Pen G project and Biosimilars.", "citations": ["7031fc2ed6f98dfb0c702177f376a4df"]}, "['Q2', '2023']": {"answer": "8a5c1571e6a7d5746cb8c04a497e53b7 --> The company plans to put an additional Biosimilar plant with a capital outlay of approximately Rs. 300 crores.", "citations": ["8a5c1571e6a7d5746cb8c04a497e53b7"]}, "['Q4', '2023']": {"answer": "51e635444677656a51659fffdff9da47 --> The management expects biosimilar business to enhance margins from FY25.", "citations": ["51e635444677656a51659fffdff9da47"]}, "['Q2', '2024']": {"answer": "8054ebb99726faa4f7e5b095f52ed376 --> Other projects such as Vizag will be completed by the end of FY25 or FY26, with biosimilar, Aurolife, and Eugia manufacturing in the US also planned for completion in FY26.", "citations": ["8054ebb99726faa4f7e5b095f52ed376"]}, "['Q3', '2024']": {"answer": "df8f632b774b38a7b3ac0dde9d87b559 --> The guidance after five years for Xolair (biosimilar) would be anywhere between $120 million to $180 million, with an additional $20 million coming from the ROW markets.", "citations": ["df8f632b774b38a7b3ac0dde9d87b559"]}, "['Q1', '2024']": {"answer": "f61df7f376dac421ccce022404a9ad17 --> The management plans to start the progression of their Biosimilar Pipeline and other commercialisation efforts starting from FY25 onwards.", "citations": ["f61df7f376dac421ccce022404a9ad17"]}, "['Q4', '2024']": {"answer": "d54dfaa6595f46298d42000e73757e8d --> Dr. Satakarni Makkapati expects substantial contributions from the Biosimilars business to the overall Aurobindo margin base starting from the year FY29-30.\n\nb3e0074bd1e2d617460b4cb6c240210d --> Dr. Satakarni Makkapati indicated that the company plans to start monetizing the biosimilar opportunity from Q3 or Q4 of this year, with significant opportunities expected around 2027-2028.\n\nb3e0074bd1e2d617460b4cb6c240210d --> Santhanam Subramanian confirmed the launch of biosimilars in the Indian market by Q3 or Q4 of this year, with major opportunities in Europe and the US around 2026-27.", "citations": ["d54dfaa6595f46298d42000e73757e8d", "b3e0074bd1e2d617460b4cb6c240210d"]}}}, {"topic": "Specialty business development", "data": {"['Q1', '2023']": {"answer": "7ce3a760dcc5784918ef8b2d6d56734a --> The CEO of Eugia Pharma Specialties Limited specified a timeline for product launches.", "citations": ["7ce3a760dcc5784918ef8b2d6d56734a"]}, "['Q2', '2023']": {"answer": "fee268b5aef6ea5f70e611137b7e5a4d --> The Injectable specialty guidance has been delayed by a year.\n\n4d847f380672ab85b8dd4741e4e2c18a --> Surya Patra inquired about the future of the branded oncology business, specifically asking if the drag will continue until the specialty products start contributing beyond FY 24.\n\nf0f6bcb3c00520415ae2d89f2623a720 --> The contribution from specialty products in advanced markets is expected in FY26 or FY27.", "citations": ["fee268b5aef6ea5f70e611137b7e5a4d", "4d847f380672ab85b8dd4741e4e2c18a", "f0f6bcb3c00520415ae2d89f2623a720"]}, "['Q1', '2024']": {"answer": "72da6bda45f3d5fb52a8f4c5031cac1f --> Santhanam Subramanian (CFO) mentioned they are planning to restart the restructuring process of the Eugia vertical, with clarity on its shape expected in the next 2-3 months.", "citations": ["72da6bda45f3d5fb52a8f4c5031cac1f"]}}}, {"topic": "Strategic partnerships", "data": {"['Q3', '2024']": {"answer": "cb08119f2a8e62eb49dc70e0b189cedc --> Dr. Satakarni Makkapati stated that Theranym Biologics hopes to start supplying from 2027-28 and aims to close the definitive agreement by the 31st March 2024.", "citations": ["cb08119f2a8e62eb49dc70e0b189cedc"]}, "['Q4', '2024']": {"answer": "d18e3ce1e5687882c36d32546732b065 --> Dr. Satakarni Makkapati stated that the definitive agreement with MSD is on track to be closed by 31st of May.", "citations": ["d18e3ce1e5687882c36d32546732b065"]}}}, {"topic": "Market expansion strategy", "data": {"['Q1', '2025']": {"answer": "598e60c29fcb1d6bc2f4a5cef4b81100 --> Dr. Satakarni Makkapati stated the project is expected to be completed by 2026, with engineering batches or water runs to be conducted, and stockpiling and revenue generation to begin from 2027.", "citations": ["598e60c29fcb1d6bc2f4a5cef4b81100"]}, "['Q2', '2023']": {"answer": "98e8a61ca881fdf3d54ef0b7575f76cc --> Yugandhar Puvvala indicated that the guidance might be delayed by a year due to certain upsides not panning out as expected.", "citations": ["98e8a61ca881fdf3d54ef0b7575f76cc"]}, "['Q2', '2024']": {"answer": "6921a587c1cdd9c89348e15df3e5edec --> Yugandhar indicated that the Vizag facility will contribute meaningfully to the business by FY26.", "citations": ["6921a587c1cdd9c89348e15df3e5edec"]}}}]}]